#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : WWeapons
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function WWeapons.wAirStrikeProj.wLoadOut
// Flags: [ FUNC_Simulated ]
struct AwAirStrikeProj_execwLoadOut_Parms
{
	int                                                iID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwWeaponManager*                             wMani;                                            		// 0x0004 ( 0x0004
};

// Function WWeapons.wAirStrikeProj.IncreaseBombCnt
// Flags: 
struct AwAirStrikeProj_execIncreaseBombCnt_Parms
{
};

// Function WWeapons.wAirStrikeProj.ForceBegin
// Flags: 
struct AwAirStrikeProj_execForceBegin_Parms
{
};

// Function WWeapons.wAirStrikeProj.SpawnProjectile
// Flags: 
struct AwAirStrikeProj_execSpawnProjectile_Parms
{
	struct FVector                                     Start;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    Dir;                                              		// 0x000C ( 0x000C[ CPF_Parm ]
	class AwProjectile*                                ReturnValue;                                      		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwProjectile*                                P;                                                		// 0x001C ( 0x0004
};

// Function WWeapons.wAirStrikeProj.SpawnBomb
// Flags: 
struct AwAirStrikeProj_execSpawnBomb_Parms
{
	float                                              fSpawnRadius;                                     		// 0x0000 ( 0x0004
	int                                                iSpawnTheta;                                      		// 0x0004 ( 0x0004
	struct FRotator                                    rTemp;                                            		// 0x0008 ( 0x000C
	struct FVector                                     vBombDestPos;                                     		// 0x0014 ( 0x000C
	struct FVector                                     vBombSpawnPos;                                    		// 0x0020 ( 0x000C
};

// Function WWeapons.wAirStrikeProj.Destroyed
// Flags: [ FUNC_Event ]
struct AwAirStrikeProj_eventDestroyed_Parms
{
};

// Function WWeapons.wWeapon_Turret_FNM240.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct AwWeapon_Turret_FNM240_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WWeapons.wWeapon_Turret_FNM240.RenderOverlays
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwWeapon_Turret_FNM240_eventRenderOverlays_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wWeapon_Turret_FNM240.Timer
// Flags: [ FUNC_Event ]
struct AwWeapon_Turret_FNM240_eventTimer_Parms
{
};

// Function WWeapons.wWeapon_Turret_FNM240.OverHeatDown
// Flags: 
struct AwWeapon_Turret_FNM240_execOverHeatDown_Parms
{
	float                                              fAddTime;                                         		// 0x0000 ( 0x0004
	float                                              fTemp;                                            		// 0x0004 ( 0x0004
};

// Function WWeapons.wWeapon_Turret_FNM240.OverHeatUp
// Flags: 
struct AwWeapon_Turret_FNM240_execOverHeatUp_Parms
{
};

// Function WWeapons.wWeapon_Turret_FNM240.BringUp
// Flags: [ FUNC_Simulated ]
struct AwWeapon_Turret_FNM240_execBringUp_Parms
{
	class AwWeapon*                                    PrevWeapon;                                       		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              fFOV;                                             		// 0x0004 ( 0x0004
};

// Function WWeapons.wWeapon_Turret_FNM240.HasAmmo
// Flags: [ FUNC_Simulated ]
struct AwWeapon_Turret_FNM240_execHasAmmo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wWeapon_Turret_FNM240.BestMode
// Flags: 
struct AwWeapon_Turret_FNM240_execBestMode_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wWeapon_Turret_FNM240.PawnUnpossessed
// Flags: [ FUNC_Simulated ]
struct AwWeapon_Turret_FNM240_execPawnUnpossessed_Parms
{
};

// Function WWeapons.wWeapon_Turret_FNM240.AttachToPawn
// Flags: 
struct AwWeapon_Turret_FNM240_execAttachToPawn_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0004 ( 0x0004
};

// Function WWeapons.wWeapon_Turret_FNM240.wLoadOut
// Flags: [ FUNC_Simulated ]
struct AwWeapon_Turret_FNM240_execwLoadOut_Parms
{
	int                                                iID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iAddPartsID;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwWeaponManager*                             wMani;                                            		// 0x0008 ( 0x0004
	class UwWeaponBaseParams*                          wBase;                                            		// 0x000C ( 0x0004
	class UClass*                                      wRes;                                             		// 0x0010 ( 0x0004
	int                                                M;                                                		// 0x0014 ( 0x0004
};

// Function WWeapons.wWeapon_Turret_FNM240.SetResParams
// Flags: [ FUNC_Simulated ]
struct AwWeapon_Turret_FNM240_execSetResParams_Parms
{
	class UClass*                                      wRes;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wWeapon_Turret_FNM240.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwWeapon_Turret_FNM240_eventPostNetBeginPlay_Parms
{
};

// Function WWeapons.wWeapon_Turret_FNM240.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwWeapon_Turret_FNM240_execPostBeginPlay_Parms
{
	int                                                M;                                                		// 0x0000 ( 0x0004
};

// Function WWeapons.wRocketLauncher.IsCanUseWeapon
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execIsCanUseWeapon_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wRocketLauncher.IsATR
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execIsATR_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wRocketLauncher.IsRPG
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execIsRPG_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wRocketLauncher.AnimEnd
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execAnimEnd_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       Anim;                                             		// 0x0004 ( 0x0004
	float                                              frame;                                            		// 0x0008 ( 0x0004
	float                                              Rate;                                             		// 0x000C ( 0x0004
};

// Function WWeapons.wRocketLauncher.ServerDoFire
// Flags: 
struct AwRocketLauncher_execServerDoFire_Parms
{
};

// Function WWeapons.wRocketLauncher.ServerDestroy
// Flags: 
struct AwRocketLauncher_execServerDestroy_Parms
{
};

// Function WWeapons.wRocketLauncher.StopFire
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwRocketLauncher_eventStopFire_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wRocketLauncher.WeaponTick
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwRocketLauncher_eventWeaponTick_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       szAnim;                                           		// 0x0004 ( 0x0004
	float                                              fFrame;                                           		// 0x0008 ( 0x0004
	float                                              fRate;                                            		// 0x000C ( 0x0004
	class AwWeapon*                                    wPending;                                         		// 0x0010 ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x0014 ( 0x0004
};

// Function WWeapons.wRocketLauncher.HasAmmoRocket
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execHasAmmoRocket_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wRocketLauncher.Destroyed
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execDestroyed_Parms
{
};

// Function WWeapons.wRocketLauncher.PutDown
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execPutDown_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wRocketLauncher.Reload
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execReload_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      bReload:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function WWeapons.wRocketLauncher.FireOne
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execFireOne_Parms
{
	int                                                iFireMode;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wRocketLauncher.AttWarhead
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execAttWarhead_Parms
{
	unsigned long                                      bAttOrDtt:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WWeapons.wRocketLauncher.LoadWarhead
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execLoadWarhead_Parms
{
	class UStaticMesh*                                 stProj;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wRocketLauncher.FillToInitialAmmo
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execFillToInitialAmmo_Parms
{
};

// Function WWeapons.wRocketLauncher.SetResParams
// Flags: [ FUNC_Simulated ]
struct AwRocketLauncher_execSetResParams_Parms
{
	class UClass*                                      wRes;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wTurret_FNM240_Fire.StopFiring
// Flags: 
struct UwTurret_FNM240_Fire_execStopFiring_Parms
{
};

// Function WWeapons.wTurret_FNM240_Fire.StartFiring
// Flags: 
struct UwTurret_FNM240_Fire_execStartFiring_Parms
{
};

// Function WWeapons.wTurret_FNM240_Fire.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct UwTurret_FNM240_Fire_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WWeapons.wTurret_FNM240_Fire.ModeTick
// Flags: [ FUNC_Event ]
struct UwTurret_FNM240_Fire_eventModeTick_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wTurret_FNM240_Fire.StartMuzzleSmoke
// Flags: 
struct UwTurret_FNM240_Fire_execStartMuzzleSmoke_Parms
{
	class AwWeapon_Turret_FNM240*                      G;                                                		// 0x0000 ( 0x0004
};

// Function WWeapons.wTurret_FNM240_Fire.UpdateEmitter
// Flags: [ FUNC_Simulated ]
struct UwTurret_FNM240_Fire_execUpdateEmitter_Parms
{
	struct FRotator                                    R;                                                		// 0x0000 ( 0x000C
	struct FCoords                                     C;                                                		// 0x000C ( 0x0030
};

// Function WWeapons.wTurret_FNM240_Fire.FlashMuzzleFlash
// Flags: 
struct UwTurret_FNM240_Fire_execFlashMuzzleFlash_Parms
{
};

// Function WWeapons.wTurret_FNM240_Fire.DrawMuzzleFlash
// Flags: 
struct UwTurret_FNM240_Fire_execDrawMuzzleFlash_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FCoords                                     C;                                                		// 0x0004 ( 0x0030
};

// Function WWeapons.wTurret_FNM240_Fire.InitEffects
// Flags: [ FUNC_Simulated ]
struct UwTurret_FNM240_Fire_execInitEffects_Parms
{
};

// Function WWeapons.wTurret_FNM240_Fire.AllowFire
// Flags: [ FUNC_Simulated ]
struct UwTurret_FNM240_Fire_execAllowFire_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                iCodeID;                                          		// 0x0004 ( 0x0004
};

// Function WWeapons.wTurret_FNM240_Fire.PlayFiring
// Flags: 
struct UwTurret_FNM240_Fire_execPlayFiring_Parms
{
	struct FName                                       locFireAnim;                                      		// 0x0000 ( 0x0004
	struct FName                                       locFireLoopAnim;                                  		// 0x0004 ( 0x0004
	float                                              locFireAnimRate;                                  		// 0x0008 ( 0x0004
	float                                              locFireLoopAnimRate;                              		// 0x000C ( 0x0004
	class AwWeapon_Turret_FNM240*                      G;                                                		// 0x0010 ( 0x0004
	unsigned long                                      bSkipAnim:1;                                      		// 0x0014 ( 0x0004 [0x00000001]
	float                                              fFireSoundRad;                                    		// 0x0018 ( 0x0004
};

// Function WWeapons.wTurret_FNM240_Fire.Timer
// Flags: [ FUNC_Event ]
struct UwTurret_FNM240_Fire_eventTimer_Parms
{
};

// Function WWeapons.wTurret_FNM240_Fire.DoFireEffectForClient
// Flags: 
struct UwTurret_FNM240_Fire_execDoFireEffectForClient_Parms
{
	struct FVector                                     StartTrace;                                       		// 0x0000 ( 0x000C
	struct FVector                                     HL;                                               		// 0x000C ( 0x000C
	struct FVector                                     HN;                                               		// 0x0018 ( 0x000C
	struct FRotator                                    R;                                                		// 0x0024 ( 0x000C
	struct FRotator                                    Aim;                                              		// 0x0030 ( 0x000C
	class AActor*                                      HitActor;                                         		// 0x003C ( 0x0004
};

// Function WWeapons.wTurret_FNM240_Fire.DoFireEffect
// Flags: 
struct UwTurret_FNM240_Fire_execDoFireEffect_Parms
{
	struct FVector                                     StartTrace;                                       		// 0x0000 ( 0x000C
	struct FVector                                     HL;                                               		// 0x000C ( 0x000C
	struct FVector                                     HN;                                               		// 0x0018 ( 0x000C
	struct FRotator                                    R;                                                		// 0x0024 ( 0x000C
	struct FRotator                                    Aim;                                              		// 0x0030 ( 0x000C
	class AActor*                                      HitActor;                                         		// 0x003C ( 0x0004
};

// Function WWeapons.wTurret_FNM240_Fire.ModeDoFire
// Flags: [ FUNC_Event ]
struct UwTurret_FNM240_Fire_eventModeDoFire_Parms
{
	int                                                iCodeID;                                          		// 0x0000 ( 0x0004
};

// Function WWeapons.wTurretAttachmet.MakeSmoke
// Flags: [ FUNC_Simulated ]
struct AwTurretAttachmet_execMakeSmoke_Parms
{
	struct FRotator                                    R;                                                		// 0x0000 ( 0x000C
};

// Function WWeapons.wTurretAttachmet.MakeMuzzleFlash
// Flags: [ FUNC_Simulated ]
struct AwTurretAttachmet_execMakeMuzzleFlash_Parms
{
	struct FRotator                                    R;                                                		// 0x0000 ( 0x000C
};

// Function WWeapons.wTurretAttachmet.GetTipLocation
// Flags: [ FUNC_Simulated ]
struct AwTurretAttachmet_execGetTipLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FCoords                                     C;                                                		// 0x000C ( 0x0030
};

// Function WWeapons.wGunAttachment.ClearParts
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execClearParts_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function WWeapons.wGunAttachment.AddParts
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execAddParts_Parms
{
	int                                                iWeaponID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iAddPartsID;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwItemResourceParam*                         ItemResParam;                                     		// 0x0008 ( 0x0004
	class UwWeaponCustomInfoParam*                     wcip;                                             		// 0x000C ( 0x0004
	class UwWeaponCustomPartsParam*                    wcpp;                                             		// 0x0010 ( 0x0004
	int                                                iSightPartID;                                     		// 0x0014 ( 0x0004
	int                                                iSilencerPartID;                                  		// 0x0018 ( 0x0004
	int                                                iBarrelPartID;                                    		// 0x001C ( 0x0004
	int                                                iGunstockPartID;                                  		// 0x0020 ( 0x0004
	int                                                iSubSightPartItemID;                              		// 0x0024 ( 0x0004
};

// Function WWeapons.wGunAttachment.wLoadOut
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwGunAttachment_eventwLoadOut_Parms
{
	int                                                iID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iAddPartsID;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function WWeapons.wGunAttachment.ThirdPersonEffects
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwGunAttachment_eventThirdPersonEffects_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
	struct FVector                                     invlookvec;                                       		// 0x0004 ( 0x000C
	struct FVector                                     StartLocation;                                    		// 0x0010 ( 0x000C
	float                                              dotv;                                             		// 0x001C ( 0x0004
	float                                              Alpha;                                            		// 0x0020 ( 0x0004
	int                                                i;                                                		// 0x0024 ( 0x0004
	int                                                Max;                                              		// 0x0028 ( 0x0004
	int                                                nIndex;                                           		// 0x002C ( 0x0004
	int                                                nOffset;                                          		// 0x0030 ( 0x0004
};

// Function WWeapons.wGunAttachment.FakeThirdPersonEffects
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execFakeThirdPersonEffects_Parms
{
	class AActor*                                      HitActor;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitNormal;                                        		// 0x0010 ( 0x000C[ CPF_Parm ]
	class UMaterial*                                   HitMaterial;                                      		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FVector                                     invlookvec;                                       		// 0x0020 ( 0x000C
	struct FVector                                     StartLocation;                                    		// 0x002C ( 0x000C
	float                                              dotv;                                             		// 0x0038 ( 0x0004
	float                                              Alpha;                                            		// 0x003C ( 0x0004
};

// Function WWeapons.wGunAttachment.FakeUpdateTracer
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execFakeUpdateTracer_Parms
{
	struct FVector                                     LastHitLocation;                                  		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     SpawnLoc;                                         		// 0x000C ( 0x000C
	struct FVector                                     SpawnDir;                                         		// 0x0018 ( 0x000C
	struct FVector                                     spawnVel;                                         		// 0x0024 ( 0x000C
	float                                              hitDist;                                          		// 0x0030 ( 0x0004
	struct FRotator                                    LookDir;                                          		// 0x0034 ( 0x000C
	struct FVector                                     lookVect;                                         		// 0x0040 ( 0x000C
	struct FVector                                     vInverseWeaponByOwner;                            		// 0x004C ( 0x000C
	struct FVector                                     vWeaponByOwner;                                   		// 0x0058 ( 0x000C
	struct FVector                                     vOriginSpawnLoc;                                  		// 0x0064 ( 0x000C
};

// Function WWeapons.wGunAttachment.MakeSmoke
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execMakeSmoke_Parms
{
	struct FRotator                                    R;                                                		// 0x0000 ( 0x000C
};

// Function WWeapons.wGunAttachment.GetBoneNameSilencer
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execGetBoneNameSilencer_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wGunAttachment.GetBoneNameRotation
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execGetBoneNameRotation_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wGunAttachment.GetBoneNameTip
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execGetBoneNameTip_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wGunAttachment.MakeSpawnShell
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execMakeSpawnShell_Parms
{
	unsigned long                                      bRechamber:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WWeapons.wGunAttachment.MakeMuzzleFlash
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execMakeMuzzleFlash_Parms
{
};

// Function WWeapons.wGunAttachment.SpawnEmitter
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execSpawnEmitter_Parms
{
	class UClass*                                      EmitterClass;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wGunAttachment.UpdateHit
// Flags: 
struct AwGunAttachment_execUpdateHit_Parms
{
	class AActor*                                      HitActor;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitNormal;                                        		// 0x0010 ( 0x000C[ CPF_Parm ]
	class UMaterial*                                   HitMaterial;                                      		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FVector                                     tmpHitLocation[ 0x06 ];                           		// 0x0020 ( 0x0048
	class AActor*                                      tmpHitActor[ 0x06 ];                              		// 0x0068 ( 0x0018
	struct FVector                                     tmpHitNormal[ 0x06 ];                             		// 0x0080 ( 0x0048
	class UMaterial*                                   tmpHitMaterial[ 0x06 ];                           		// 0x00C8 ( 0x0018
};

// Function WWeapons.wGunAttachment.UpdatePenetrateHit
// Flags: 
struct AwGunAttachment_execUpdatePenetrateHit_Parms
{
	class AActor*                                      mHitActor[ 0x06 ];                                		// 0x0000 ( 0x0018[ CPF_Parm ]
	struct FVector                                     mHitLocation[ 0x06 ];                             		// 0x0018 ( 0x0048[ CPF_Parm ]
	struct FVector                                     mHitNormal[ 0x06 ];                               		// 0x0060 ( 0x0048[ CPF_Parm ]
	class UMaterial*                                   mHitMaterial[ 0x06 ];                             		// 0x00A8 ( 0x0018[ CPF_Parm ]
	int                                                mLastHitIdx;                                      		// 0x00C0 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x00C4 ( 0x0004
	int                                                Max;                                              		// 0x00C8 ( 0x0004
	struct FstMultiBulletPerFire                       stTemp;                                           		// 0x00CC ( 0x00CC
};

// Function WWeapons.wGunAttachment.UpdateTracer
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execUpdateTracer_Parms
{
	struct FVector                                     SpawnLoc;                                         		// 0x0000 ( 0x000C
	struct FVector                                     SpawnDir;                                         		// 0x000C ( 0x000C
	struct FVector                                     spawnVel;                                         		// 0x0018 ( 0x000C
	float                                              hitDist;                                          		// 0x0024 ( 0x0004
	int                                                i;                                                		// 0x0028 ( 0x0004
	struct FRotator                                    LookDir;                                          		// 0x002C ( 0x000C
	struct FVector                                     lookVect;                                         		// 0x0038 ( 0x000C
	struct FVector                                     vInverseWeaponByOwner;                            		// 0x0044 ( 0x000C
	struct FVector                                     vWeaponByOwner;                                   		// 0x0050 ( 0x000C
	struct FVector                                     vOriginSpawnLoc;                                  		// 0x005C ( 0x000C
	class APlayerController*                           PC;                                               		// 0x0068 ( 0x0004
};

// Function WWeapons.wGunAttachment.GetTracerStart
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execGetTracerStart_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       P;                                                		// 0x000C ( 0x0004
};

// Function WWeapons.wGunAttachment.Destroyed
// Flags: [ FUNC_Simulated ]
struct AwGunAttachment_execDestroyed_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function WWeapons.wRocketFire.StartFiring
// Flags: 
struct UwRocketFire_execStartFiring_Parms
{
};

// Function WWeapons.wRocketFire.PlayFiring
// Flags: 
struct UwRocketFire_execPlayFiring_Parms
{
	struct FName                                       locFireAnim;                                      		// 0x0000 ( 0x0004
	struct FName                                       locFireLoopAnim;                                  		// 0x0004 ( 0x0004
	float                                              locFireAnimRate;                                  		// 0x0008 ( 0x0004
	float                                              locFireLoopAnimRate;                              		// 0x000C ( 0x0004
	class AwRocketLauncher*                            G;                                                		// 0x0010 ( 0x0004
	unsigned long                                      bSkipAnim:1;                                      		// 0x0014 ( 0x0004 [0x00000001]
};

// Function WWeapons.wRocketFire.ResetInputFire
// Flags: [ FUNC_Simulated ]
struct UwRocketFire_execResetInputFire_Parms
{
};

// Function WWeapons.wRocketFire.IsInputFire
// Flags: [ FUNC_Simulated ]
struct UwRocketFire_execIsInputFire_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wRocketFire.CheckRPGAimMode
// Flags: [ FUNC_Simulated ]
struct UwRocketFire_execCheckRPGAimMode_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwRocketLauncher*                            wRocket;                                          		// 0x0004 ( 0x0004
};

// Function WWeapons.wRocketFire.ServerDoFire
// Flags: [ FUNC_Event ]
struct UwRocketFire_eventServerDoFire_Parms
{
};

// Function WWeapons.wRocketFire.StartMuzzleSmoke
// Flags: 
struct UwRocketFire_execStartMuzzleSmoke_Parms
{
	struct FVector                                     vOrigin;                                          		// 0x0000 ( 0x000C
	struct FCoords                                     cR;                                               		// 0x000C ( 0x0030
};

// Function WWeapons.wRocketFire.FlashMuzzleFlash
// Flags: 
struct UwRocketFire_execFlashMuzzleFlash_Parms
{
	class AActor*                                      ac;                                               		// 0x0000 ( 0x0004
	struct FVector                                     vOrigin;                                          		// 0x0004 ( 0x000C
	struct FCoords                                     cR;                                               		// 0x0010 ( 0x0030
};

// Function WWeapons.wRocketFire.NewActiveStartFire
// Flags: [ FUNC_Simulated ]
struct UwRocketFire_execNewActiveStartFire_Parms
{
	struct FVector                                     V;                                                		// 0x0000 ( 0x000C
	struct FCoords                                     cR;                                               		// 0x000C ( 0x0030
};

// Function WWeapons.wRocketFire.ModeDoFire
// Flags: [ FUNC_Event ]
struct UwRocketFire_eventModeDoFire_Parms
{
};

// Function WWeapons.wAirStrikeBomb.Explode
// Flags: [ FUNC_Simulated ]
struct AwAirStrikeBomb_execExplode_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0018 ( 0x0004
};

// Function WWeapons.wAirStrikeBomb.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwAirStrikeBomb_execPostBeginPlay_Parms
{
};

// Function WWeapons.wThrowingWeapon.IsCanUseWeapon
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execIsCanUseWeapon_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              fCurAmmoCount;                                    		// 0x0004 ( 0x0004
//	float                                              fMaxAmmoCount;                                    		// 0x0008 ( 0x0004
};

// Function WWeapons.wThrowingWeapon.FillToInitialAmmo
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execFillToInitialAmmo_Parms
{
	class AwWeapon*                                    TempWeapon;                                       		// 0x0000 ( 0x0004
	int                                                NumWeapon;                                        		// 0x0004 ( 0x0004
};

// Function WWeapons.wThrowingWeapon.GetAmmoCount
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execGetAmmoCount_Parms
{
	float                                              MaxAmmoPrimary;                                   		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              CurAmmoPrimary;                                   		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	class AwWeapon*                                    TempWeapon;                                       		// 0x0008 ( 0x0004
	int                                                NumWeapon;                                        		// 0x000C ( 0x0004
};

// Function WWeapons.wThrowingWeapon.ServerThrowingWeapon
// Flags: 
struct AwThrowingWeapon_execServerThrowingWeapon_Parms
{
};

// Function WWeapons.wThrowingWeapon.ClientThrowingWeapon
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execClientThrowingWeapon_Parms
{
};

// Function WWeapons.wThrowingWeapon.SeverConsumeAmmo
// Flags: 
struct AwThrowingWeapon_execSeverConsumeAmmo_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Load;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bAmountNeededIsMax:1;                             		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                AmountNeeded;                                     		// 0x0010 ( 0x0004
};

// Function WWeapons.wThrowingWeapon.CancelFire
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execCancelFire_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wThrowingWeapon.ServerCancelFire
// Flags: 
struct AwThrowingWeapon_execServerCancelFire_Parms
{
	unsigned char                                      Mode;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function WWeapons.wThrowingWeapon.ClientCancelFire
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execClientCancelFire_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wThrowingWeapon.StartFire
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execStartFire_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wThrowingWeapon.BringUp
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execBringUp_Parms
{
	class AwWeapon*                                    PrevWeapon;                                       		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WWeapons.wThrowingWeapon.PutDown
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execPutDown_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wThrowingWeapon.IsFiring
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execIsFiring_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FName                                       szAnim;                                           		// 0x0004 ( 0x0004
//	float                                              fFrame;                                           		// 0x0008 ( 0x0004
//	float                                              fRate;                                            		// 0x000C ( 0x0004
//	unsigned long                                      bTmFiring:1;                                      		// 0x0010 ( 0x0004 [0x00000001]
};

// Function WWeapons.wThrowingWeapon.PlayIdle
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execPlayIdle_Parms
{
};

// Function WWeapons.wThrowingWeapon.AnimEnd
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execAnimEnd_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       Anim;                                             		// 0x0004 ( 0x0004
	float                                              frame;                                            		// 0x0008 ( 0x0004
	float                                              Rate;                                             		// 0x000C ( 0x0004
};

// Function WWeapons.wThrowingWeapon.ServerDestroy
// Flags: 
struct AwThrowingWeapon_execServerDestroy_Parms
{
};

// Function WWeapons.wThrowingWeapon.SetSprint
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execSetSprint_Parms
{
	unsigned long                                      bValue:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WWeapons.wThrowingWeapon.WeaponTick
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwThrowingWeapon_eventWeaponTick_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       szAnim;                                           		// 0x0004 ( 0x0004
	float                                              fFrame;                                           		// 0x0008 ( 0x0004
	float                                              fRate;                                            		// 0x000C ( 0x0004
	class AwWeapon*                                    wPending;                                         		// 0x0010 ( 0x0004
};

// Function WWeapons.wThrowingWeapon.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     t;                                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WWeapons.wThrowingWeapon.AciveFireDelay
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execAciveFireDelay_Parms
{
	struct FName                                       szAnim;                                           		// 0x0000 ( 0x0004
	float                                              fFrame;                                           		// 0x0004 ( 0x0004
	float                                              fRate;                                            		// 0x0008 ( 0x0004
};

// Function WWeapons.wThrowingWeapon.wLoadOut
// Flags: [ FUNC_Simulated ]
struct AwThrowingWeapon_execwLoadOut_Parms
{
	int                                                iID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iAddPartsID;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wThrowingFire.AllowFire
// Flags: [ FUNC_Simulated ]
struct UwThrowingFire_execAllowFire_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wThrowingFire.PlayPreFire
// Flags: 
struct UwThrowingFire_execPlayPreFire_Parms
{
};

// Function WWeapons.wThrowingFire.ModeDoFire
// Flags: [ FUNC_Event ]
struct UwThrowingFire_eventModeDoFire_Parms
{
};

// Function WWeapons.wGrenade.SufferEffect
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execSufferEffect_Parms
{
	class APawn*                                       Victim;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              fDist;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              fReduceRate;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              fRangeMiddle;                                     		// 0x000C ( 0x0004
	float                                              fRangeLerp;                                       		// 0x0010 ( 0x0004
	float                                              fEffDistLerp;                                     		// 0x0014 ( 0x0004
	float                                              fExpRadious_Outer;                                		// 0x0018 ( 0x0004
	float                                              fExpRadious_Inner;                                		// 0x001C ( 0x0004
};

// Function WWeapons.wGrenade.wLoadOut
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execwLoadOut_Parms
{
	int                                                iID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WWeapons.wGrenade.LoadEmitters
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execLoadEmitters_Parms
{
};

// Function WWeapons.wGrenade.TakeDamage
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       instigatedBy;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0008 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0014 ( 0x000C[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                WeaponType;                                       		// 0x0028 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bWallShot:1;                                      		// 0x002C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WWeapons.wGrenade.ExplodeSelf
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execExplodeSelf_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm ]
};

// Function WWeapons.wGrenade.SplashGrenades
// Flags: 
struct AwGrenade_execSplashGrenades_Parms
{
	int                                                G;                                                		// 0x0000 ( 0x0004
	class AwGrenade*                                   NewGr;                                            		// 0x0004 ( 0x0004
	struct FVector                                     RandV;                                            		// 0x0008 ( 0x000C
	struct FRotator                                    RandR;                                            		// 0x0014 ( 0x000C
};

// Function WWeapons.wGrenade.Explode
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execExplode_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm ]
};

// Function WWeapons.wGrenade.SpawnEmitter
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execSpawnEmitter_Parms
{
	float                                              timeFactor;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AEmitter*                                    ExplodeEmitter;                                   		// 0x0004 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0008 ( 0x0004
};

// Function WWeapons.wGrenade.HitWall
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AActor*                                      Wall;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	class UMaterial*                                   HitMaterial;                                      		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FVector                                     VNorm;                                            		// 0x0014 ( 0x000C
	class APlayerController*                           PC;                                               		// 0x0020 ( 0x0004
};

// Function WWeapons.wGrenade.ProcessTouch
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execProcessTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
};

// Function WWeapons.wGrenade.Landed
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function WWeapons.wGrenade.Timer
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execTimer_Parms
{
};

// Function WWeapons.wGrenade.SetSpeed
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execSetSpeed_Parms
{
	float                                              fSpeed;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    rThrow;                                           		// 0x0004 ( 0x000C
	float                                              fAddSpeed;                                        		// 0x0010 ( 0x0004
	float                                              fDot;                                             		// 0x0014 ( 0x0004
};

// Function WWeapons.wGrenade.AimUp
// Flags: 
struct AwGrenade_execAimUp_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WWeapons.wGrenade.RecoverFromHostChange
// Flags: 
struct AwGrenade_execRecoverFromHostChange_Parms
{
};

// Function WWeapons.wGrenade.PostNetBeginPlay
// Flags: [ FUNC_Event ]
struct AwGrenade_eventPostNetBeginPlay_Parms
{
};

// Function WWeapons.wGrenade.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execPostBeginPlay_Parms
{
	struct FRotator                                    R;                                                		// 0x0000 ( 0x000C
	int                                                diff;                                             		// 0x000C ( 0x0004
};

// Function WWeapons.wGrenade.Destroyed
// Flags: [ FUNC_Simulated ]
struct AwGrenade_execDestroyed_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

#ifdef _MSC_VER
#pragma pack ( pop )
#endif

