#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : GUIWarfareControls
# >    File : Classes.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Constants
# ======================================================================================== #
*/

#define CONST_CSelect                                            5
#define CONST_CDisable                                           4
#define CONST_CClick                                             3
#define CONST_CFocused                                           2
#define CONST_CMouseOn                                           1
#define CONST_CNormal                                            0
#define CONST_BtnCount                                           8
#define CONST_C_DefaultfontSize                                  10
#define CONST_C_MaxRowCount                                      100
#define CONST_PAINTING_BTN_COUNT                                 5
#define CONST_BTN_COUNT_SUB                                      5
#define CONST_BTN_COUNT_MAIN                                     5

// Enum GUIWarfareControls.BTTPMessengerHK.E_TAB_MENU_TYPE
enum E_TAB_MENU_TYPE
{
	TAB_MENU_CONNECTED                                 = 0,
	TAB_MENU_FRIEND                                    = 1,
	TAB_MENU_CLAN                                      = 2,
	TAB_MENU_PCBANG                                    = 3,
	TAB_MENU_MAX_COUNT                                 = 4
};

// Enum GUIWarfareControls.BTROItemBoxHK.EInvenState
enum EInvenState
{
	E_IB_INVEN                                         = 0,
	E_IB_INVEN_BIG                                     = 1,
	E_IB_REPAIR                                        = 2,
	E_IB_WAREHOUSE                                     = 3,
	E_IB_WAREHOUSE_CASH                                = 4,
	E_IB_WAREHOUSE_SKILL                               = 5,
	E_IB_SHOP                                          = 6,
	E_IB_SHOP_BIG                                      = 7,
	E_IB_AUCTION                                       = 8,
	E_IB_AUCTION_BIG                                   = 9,
	E_IB_MAIL                                          = 10,
	E_IB_POINTBOX                                      = 11,
	E_IB_ITEMBOX                                       = 12,
	E_IB_PROMOTION                                     = 13,
	E_IB_DURABILITY_WARNING                            = 14,
	E_IB_EXPIRED_WARNING                               = 15,
	E_IB_SHOP_CASH                                     = 16,
	E_IB_SHOP_BIG_CASH                                 = 17,
	E_IB_SHOP_BUY_TERM                                 = 18,
	E_IB_EQUIP_ITEM                                    = 19,
	E_IB_REMODEL_SHOP                                  = 20,
	E_IB_REMODEL_INVEN                                 = 21
};

// Enum GUIWarfareControls.BTCheckBoxHK.CheckBoxStyle
enum CheckBoxStyle
{
	E_CB_Left                                          = 0,
	E_CB_Right                                         = 1
};

// Enum GUIWarfareControls.BTItemListMenuBtn.MenuType
enum MenuType
{
	MT_REPAIR                                          = 0,
	MT_MODIFY                                          = 1,
	MT_SELL                                            = 2,
	MT_GIFT                                            = 3,
	MT_PURCHASE                                        = 4,
	MT_COAST                                           = 5,
	MT_EXTEND                                          = 6,
	MT_PCOIN                                           = 7,
	MT_CCOIN                                           = 8,
	MT_POINT                                           = 9,
	MT_NONE                                            = 10
};

// Enum GUIWarfareControls.BTIconButtonHK.IconHorzOrder
enum IconHorzOrder
{
	E_ICON_LEFT                                        = 0,
	E_ICON_RIGHT                                       = 1
};


/*
# ======================================================================================== #
# > Classes
# ======================================================================================== #
*/

// Class GUIWarfareControls.BTWindowHK
class DLL_IMPORT UBTWindowHK : public UFloatingWindow
{
public:
	float                                              TimeOut;                                          		// 0x03F4 ( 0x0004 ) 
	unsigned long                                      bSetTimeOut:1;                                    		// 0x03F8 ( 0x0004 )  [0x00000001]
	class UBTOwnerDrawImageHK*                         BackgroundImage;                                  		// 0x03FC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         TopLine;                                          		// 0x0400 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         BottomLine;                                       		// 0x0404 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         BottomLine2;                                      		// 0x0408 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonOK;                                         		// 0x040C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonCancel;                                     		// 0x0410 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbBackgroundImage;                                		// 0x0414 ( 0x0010 ) 
	struct FFloatBox                                   fbTopLine;                                        		// 0x0424 ( 0x0010 ) 
	struct FFloatBox                                   fbBottomLine;                                     		// 0x0434 ( 0x0010 ) 
	struct FFloatBox                                   fbButtonOK;                                       		// 0x0444 ( 0x0010 ) 
	struct FFloatBox                                   fbButtonCancel;                                   		// 0x0454 ( 0x0010 ) 
	struct FString                                     strTitle;                                         		// 0x0464 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strOK;                                            		// 0x0470 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strCancel;                                        		// 0x047C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bHandleEsc:1;                                     		// 0x0488 ( 0x0004 )  [0x00000001]
	struct FScriptDelegate                             __OnOK__Delegate;                                 		// 0x048C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnCancel__Delegate;                             		// 0x0494 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnTimeTick__Delegate;                           		// 0x049C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnTimeOut__Delegate;                            		// 0x04A4 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      CloseWindowAllByName ( class UGUIController* Controller, class UClass* WindowName );		//  GUIWarfareControls.BTWindowHK.CloseWindowAllByName
	 bool                      TimeOutPreDraw ( class UCanvas* C );              		//  GUIWarfareControls.BTWindowHK.TimeOutPreDraw
	 void                      StopTimeOut ( float SetTime );                    		//  GUIWarfareControls.BTWindowHK.StopTimeOut
	 void                      StartTimeOut ( float SetTime );                   		//  GUIWarfareControls.BTWindowHK.StartTimeOut
	 void                      DefaultCloseWindow_OnTimeOut ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowHK.DefaultCloseWindow_OnTimeOut
	 void                      OnTimeOut ( class UGUIComponent* Sender );        		//  GUIWarfareControls.BTWindowHK.OnTimeOut
	 void                      OnTimeTick ( float leftime );                     		//  GUIWarfareControls.BTWindowHK.OnTimeTick
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  GUIWarfareControls.BTWindowHK.InternalOnKeyEvent
	 class UBTOwnerDrawCaptionButtonHK* NewButtonComponent ( struct FFloatBox fbNewCompo, float RenderWeight );		//  GUIWarfareControls.BTWindowHK.NewButtonComponent
	 class UBTOwnerDrawImageHK* NewLabelComponent ( struct FFloatBox fbNewCompo, struct FImage bgImg, float RenderWeight );		//  GUIWarfareControls.BTWindowHK.NewLabelComponent
	 bool                      ButtonCancel_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowHK.ButtonCancel_OnClick
	 bool                      ButtonOK_OnClick ( class UGUIComponent* Sender ); 		//  GUIWarfareControls.BTWindowHK.ButtonOK_OnClick
	 void                      Closed ( class UGUIComponent* Sender, bool bCancelled );		//  GUIWarfareControls.BTWindowHK.Closed
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUIWarfareControls.BTWindowHK.Opened
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowHK.InitComponent
	 void                      SetTitleCaption ( struct FString S );             		//  GUIWarfareControls.BTWindowHK.SetTitleCaption
	 void                      SetContentOffset ( int nOffsetX, int nOffsetY );  		//  GUIWarfareControls.BTWindowHK.SetContentOffset
	 void                      UpdateDefaultWindow (  );                         		//  GUIWarfareControls.BTWindowHK.UpdateDefaultWindow
	 bool                      DefaultCloseWindow_OnOK ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowHK.DefaultCloseWindow_OnOK
	 bool                      OnCancel ( class UGUIComponent* Sender );         		//  GUIWarfareControls.BTWindowHK.OnCancel
	 bool                      OnOK ( class UGUIComponent* Sender );             		//  GUIWarfareControls.BTWindowHK.OnOK
}; // Size: 0x00B8

// Class GUIWarfareControls.BTWindowAutoResizeHK
class DLL_IMPORT UBTWindowAutoResizeHK : public UBTWindowHK
{
public:
	struct FBtrDouble                                  ExtraData_btrdouble;                              		// 0x04AC ( 0x0008 ) 
	struct FString                                     ExtraData_string;                                 		// 0x04B4 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                ExtraData_int;                                    		// 0x04C0 ( 0x0004 ) 
	int                                                ExtraData_int2;                                   		// 0x04C4 ( 0x0004 ) 
	int                                                ExtraData_int3;                                   		// 0x04C8 ( 0x0004 ) 
	unsigned long                                      bStableText:1;                                    		// 0x04CC ( 0x0004 )  [0x00000001]
	struct FString                                     Caption;                                          		// 0x04D0 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     Warning;                                          		// 0x04DC ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                FontSize;                                         		// 0x04E8 ( 0x0004 ) 
	int                                                LabelSpace;                                       		// 0x04EC ( 0x0004 ) 
	int                                                LabelSpaceWarning;                                		// 0x04F0 ( 0x0004 ) 
	int                                                LabelSpaceDivider;                                		// 0x04F4 ( 0x0004 ) 
	int                                                LabelSpaceEdit;                                   		// 0x04F8 ( 0x0004 ) 
	int                                                LabelSpaceMultiLineEditMsg;                       		// 0x04FC ( 0x0004 ) 
	int                                                VisibleLabelCount;                                		// 0x0500 ( 0x0004 ) 
	struct FFloatBox                                   fbLabelInfo;                                      		// 0x0504 ( 0x0010 ) 
	struct FFloatBox                                   fbLabelWarning;                                   		// 0x0514 ( 0x0010 ) 
	struct FFloatBox                                   fbLabelDivider;                                   		// 0x0524 ( 0x0010 ) 
	struct FFloatBox                                   fbEditName;                                       		// 0x0534 ( 0x0010 ) 
	struct FFloatBox                                   fbMultiLineEditMsg;                               		// 0x0544 ( 0x0010 ) 
	struct FFloatBox                                   fbMultiLineEditMsg2;                              		// 0x0554 ( 0x0010 ) 
	struct FFloatBox                                   fbButtonOK2;                                      		// 0x0564 ( 0x0010 ) 
	struct FFloatBox                                   fbButtonCancel2;                                  		// 0x0574 ( 0x0010 ) 
	class UBTOwnerDrawImageHK*                         LabelInfo[ 0x0A ];                                		// 0x0584 ( 0x0028 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTEditBoxHK*                                EditName;                                         		// 0x05AC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       MultiLineEditMsg;                                 		// 0x05B0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       MultiLineEditMsg2;                                		// 0x05B4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         LabelWarning;                                     		// 0x05B8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         LabelDivider;                                     		// 0x05BC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 void                      ResizeWidth ( int W );                            		//  GUIWarfareControls.BTWindowAutoResizeHK.ResizeWidth
	 bool                      ShowWindow ( class UGUIController* con, struct FString Title, struct FString Msg, struct FString Warn, struct FString btnOk, struct FString btnCancel );		//  GUIWarfareControls.BTWindowAutoResizeHK.ShowWindow
	 void                      RemoveSizeY ( int halfsize, int halfy );          		//  GUIWarfareControls.BTWindowAutoResizeHK.RemoveSizeY
	 void                      InsertSizeY ( int halfsize, int halfy );          		//  GUIWarfareControls.BTWindowAutoResizeHK.InsertSizeY
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfareControls.BTWindowAutoResizeHK.Internal_OnPreDraw
	 void                      SetButtonCaption ( struct FString strOK, struct FString strCancel );		//  GUIWarfareControls.BTWindowAutoResizeHK.SetButtonCaption
	 void                      SetData ( struct FString Title, struct FString Caption, struct FString Warning );		//  GUIWarfareControls.BTWindowAutoResizeHK.SetData
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowAutoResizeHK.InitComponent
}; // Size: 0x0114

// Class GUIWarfareControls.BTWindowDefineARHK
class DLL_IMPORT UBTWindowDefineARHK : public UBTWindowAutoResizeHK
{
public:
	struct FString                                     strClientDefaultTitle;                            		// 0x05C0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClientTitle[ 0x50 ];                           		// 0x05CC ( 0x03C0 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClientDefine[ 0x50 ];                          		// 0x098C ( 0x03C0 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      CloseWindowAll ( class UGUIController* Controller );		//  GUIWarfareControls.BTWindowDefineARHK.CloseWindowAll
	 bool                      ShowInfo ( class UGUIController* con, int Code, struct FString arg0, struct FString arg1, struct FString arg2, struct FString arg3 );		//  GUIWarfareControls.BTWindowDefineARHK.ShowInfo
	 bool                      SetContentText ( class UGUIController* con, int Code, struct FString arg0, struct FString arg1, struct FString arg2, struct FString arg3 );		//  GUIWarfareControls.BTWindowDefineARHK.SetContentText
	 bool                      SetContentText_Instance ( int Code, struct FString arg0, struct FString arg1, struct FString arg2, struct FString arg3 );		//  GUIWarfareControls.BTWindowDefineARHK.SetContentText_Instance
}; // Size: 0x078C

// Class GUIWarfareControls.BTWindowInfoHK
class DLL_IMPORT UBTWindowInfoHK : public UBTWindowHK
{
public:
	unsigned long                                      bChangeText:1;                                    		// 0x04AC ( 0x0004 )  [0x00000001]
	struct FFloatBox                                   fbLabelInfo;                                      		// 0x04B0 ( 0x0010 ) 
	class UBTOwnerDrawImageHK*                         LabelInfo;                                        		// 0x04C0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 bool                      Internal_OnKeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfareControls.BTWindowInfoHK.Internal_OnKeyEvent
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfareControls.BTWindowInfoHK.Internal_OnPreDraw
	 bool                      ShowWindow ( class UGUIController* con, struct FString Title, struct FString Msg, struct FString btnOk );		//  GUIWarfareControls.BTWindowInfoHK.ShowWindow
	 void                      SetData ( struct FString Title, int titlepadding, struct FString Msg, struct FString btnOk );		//  GUIWarfareControls.BTWindowInfoHK.SetData
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowInfoHK.InitComponent
}; // Size: 0x0018

// Class GUIWarfareControls.BTWindowDefineInfoHK
class DLL_IMPORT UBTWindowDefineInfoHK : public UBTWindowInfoHK
{
public:
	struct FString                                     strClientDefaultTitle;                            		// 0x04C4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClientDefine[ 0x12C ];                         		// 0x04D0 ( 0x0E10 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClientTitle[ 0x12C ];                          		// 0x12E0 ( 0x0E10 ) [ CPF_Localized | CPF_NeedCtorLink ]
	int                                                DefineCode;                                       		// 0x20F0 ( 0x0004 ) 

	// UScript Functions
	 bool                      ShowInfo ( class UGUIController* con, int Code, struct FString arg0, struct FString arg1, struct FString arg2 );		//  GUIWarfareControls.BTWindowDefineInfoHK.ShowInfo
	 struct FString            GetClientString ( int Code );                     		//  GUIWarfareControls.BTWindowDefineInfoHK.GetClientString
	 struct FString            GetFormatString ( int Code, struct FString arg0, struct FString arg1, struct FString arg2, struct FString arg3, struct FString arg4, struct FString arg5, struct FString arg6, struct FString arg7, struct FString arg8 );		//  GUIWarfareControls.BTWindowDefineInfoHK.GetFormatString
	 void                      SetContentText_Instance ( int Code, struct FString arg0, struct FString arg1, struct FString arg2, struct FString arg3 );		//  GUIWarfareControls.BTWindowDefineInfoHK.SetContentText_Instance
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowDefineInfoHK.InitComponent
}; // Size: 0x1C30

// Class GUIWarfareControls.BTEditBoxHK
class DLL_IMPORT UBTEditBoxHK : public UGUIEditBox
{
public:
	unsigned long                                      bHudMode:1;                                       		// 0x0368 ( 0x0004 )  [0x00000001]
	unsigned long                                      bLimitDrawSize:1;                                 		// 0x0368 ( 0x0004 )  [0x00000002]
	float                                              LimitDrawWidth;                                   		// 0x036C ( 0x0004 ) 
	int                                                LimitDrawTextSize;                                		// 0x0370 ( 0x0004 ) 
	int                                                FontSize[ 0x05 ];                                 		// 0x0374 ( 0x0014 ) 
	class FColor                                       FontColor[ 0x05 ];                                		// 0x0388 ( 0x0014 ) 
	class FColor                                       FontShadowColor[ 0x05 ];                          		// 0x039C ( 0x0014 ) 
	struct FImage                                      bgImg;                                            		// 0x03B0 ( 0x0020 ) 
	int                                                ButtonID;                                         		// 0x03D0 ( 0x0004 ) 
	unsigned long                                      bActiveCursor:1;                                  		// 0x03D4 ( 0x0004 )  [0x00000001]
	class UCanvas*                                     saveC;                                            		// 0x03D8 ( 0x0004 ) 
	class FColor                                       SelectionColor;                                   		// 0x03DC ( 0x0004 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       CursorColor;                                      		// 0x03E0 ( 0x0004 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FImage                                      selectionImg;                                     		// 0x03E4 ( 0x0020 ) 
	struct FImage                                      cursorImg;                                        		// 0x0404 ( 0x0020 ) 
	class TArray< float >                              CacheTextWidth;                                   		// 0x0424 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              CacheTextHeight;                                  		// 0x0430 ( 0x0004 ) 
	struct FString                                     textStrVis;                                       		// 0x0434 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     BackupTextStr;                                    		// 0x0440 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                EndVis;                                           		// 0x044C ( 0x0004 ) 
	unsigned long                                      bClickAllSelect:1;                                		// 0x0450 ( 0x0004 )  [0x00000001]
	unsigned long                                      bSelectionMode:1;                                 		// 0x0450 ( 0x0004 )  [0x00000002]
	unsigned long                                      bMouseFirstPress:1;                               		// 0x0450 ( 0x0004 )  [0x00000004]
	unsigned long                                      bMousePressed:1;                                  		// 0x0450 ( 0x0004 )  [0x00000008]
	unsigned long                                      bCursorBlink:1;                                   		// 0x0450 ( 0x0004 )  [0x00000010]
	float                                              BlinkTimer;                                       		// 0x0454 ( 0x0004 ) 
	float                                              OldBlinkTimer;                                    		// 0x0458 ( 0x0004 ) 
	unsigned long                                      useCaps:1;                                        		// 0x045C ( 0x0004 )  [0x00000001]
	struct FSelectionArea                              SelArea;                                          		// 0x0460 ( 0x0008 ) 
	struct FScriptDelegate                             __OnChat__Delegate;                               		// 0x0468 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnInputTab__Delegate;                           		// 0x0470 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnInputSpace__Delegate;                         		// 0x0478 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnFunctionKey__Delegate;                        		// 0x0480 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnMaxTextStrNum__Delegate;                      		// 0x0488 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InternalDeactivate (  );                          		//  GUIWarfareControls.BTEditBoxHK.InternalDeactivate
	 void                      InternalActivate (  );                            		//  GUIWarfareControls.BTEditBoxHK.InternalActivate
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  GUIWarfareControls.BTEditBoxHK.InternalOnKeyEvent
	 bool                      InternalOnKeyType ( struct FString Unicode, unsigned char* key );		//  GUIWarfareControls.BTEditBoxHK.InternalOnKeyType
	 bool                      CheckPastedTextCondition ( struct FString Text ); 		//  GUIWarfareControls.BTEditBoxHK.CheckPastedTextCondition
	 bool                      CheckKeyInputCondition ( struct FString st );     		//  GUIWarfareControls.BTEditBoxHK.CheckKeyInputCondition
	 struct FString            ConvertIllegal ( struct FString inputstr );       		//  GUIWarfareControls.BTEditBoxHK.ConvertIllegal
	 int                       CaretBinarySearch ( int lCursor, int rCursor, float mx, int Parent );		//  GUIWarfareControls.BTEditBoxHK.CaretBinarySearch
	 int                       MousePosToCaretPos ( float mx, float my );        		//  GUIWarfareControls.BTEditBoxHK.MousePosToCaretPos
	 void                      OnMousePressed ( class UGUIComponent* Sender, bool bRepeat );		//  GUIWarfareControls.BTEditBoxHK.OnMousePressed
	 void                      OnMouseRelease ( class UGUIComponent* Sender );   		//  GUIWarfareControls.BTEditBoxHK.OnMouseRelease
	 void                      Internal_OnChange ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTEditBoxHK.Internal_OnChange
	 void                      ResetCache (  );                                  		//  GUIWarfareControls.BTEditBoxHK.ResetCache
	 void                      CaculateVisibleText ( bool bHoldFirst, int pos ); 		//  GUIWarfareControls.BTEditBoxHK.CaculateVisibleText
	 void                      SetFontColorAll ( class FColor Col );             		//  GUIWarfareControls.BTEditBoxHK.SetFontColorAll
	 void                      DrawIMEInfo ( class UCanvas* C, float CursorWidth );		//  GUIWarfareControls.BTEditBoxHK.DrawIMEInfo
	 bool                      OwnerDraw ( class UCanvas* C );                   		//  GUIWarfareControls.BTEditBoxHK.OwnerDraw
	 void                      Clear (  );                                       		//  GUIWarfareControls.BTEditBoxHK.Clear
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTEditBoxHK.InitComponent
	 void                      SetTextSelect ( struct FString Text, bool bAllSelect );		//  GUIWarfareControls.BTEditBoxHK.SetTextSelect
	 void                      SetText ( struct FString Text );                  		//  GUIWarfareControls.BTEditBoxHK.SetText
	 void                      InputSelectionPos ( int pos );                    		//  GUIWarfareControls.BTEditBoxHK.InputSelectionPos
	 void                      ResetSelectionPos ( int pos );                    		//  GUIWarfareControls.BTEditBoxHK.ResetSelectionPos
	 struct FString            GetSelectionText (  );                            		//  GUIWarfareControls.BTEditBoxHK.GetSelectionText
	 void                      RemoveSelectionText (  );                         		//  GUIWarfareControls.BTEditBoxHK.RemoveSelectionText
	 void                      SetFontSizeAll ( int Size );                      		//  GUIWarfareControls.BTEditBoxHK.SetFontSizeAll
	 void                      SetDefaultFontColor (  );                         		//  GUIWarfareControls.BTEditBoxHK.SetDefaultFontColor
	 void                      OnMaxTextStrNum ( class UGUIComponent* Sender );  		//  GUIWarfareControls.BTEditBoxHK.OnMaxTextStrNum
	 bool                      OnFunctionKey ( class UGUIComponent* Sender, unsigned char FunctionKey, struct FString Text );		//  GUIWarfareControls.BTEditBoxHK.OnFunctionKey
	 void                      OnInputSpace ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfareControls.BTEditBoxHK.OnInputSpace
	 void                      OnInputTab ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfareControls.BTEditBoxHK.OnInputTab
	 bool                      OnChat ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfareControls.BTEditBoxHK.OnChat
}; // Size: 0x0128

// Class GUIWarfareControls.BTUIColorPoolHK
class DLL_IMPORT UBTUIColorPoolHK : public UObject
{
public:

	// UScript Functions
	 class FColor              FriendlyUserNameDisable (  );                     		//  GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameDisable
	 class FColor              FriendlyUserNameSelected (  );                    		//  GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameSelected
	 class FColor              FriendlyUserNamePressed (  );                     		//  GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNamePressed
	 class FColor              FriendlyUserNameOn (  );                          		//  GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameOn
	 class FColor              FriendlyUserNameN (  );                           		//  GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameN
	 class FColor              NewQuest_Reward (  );                             		//  GUIWarfareControls.BTUIColorPoolHK.NewQuest_Reward
	 class FColor              NewQuest_Content (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.NewQuest_Content
	 class FColor              NewQuest_Title (  );                              		//  GUIWarfareControls.BTUIColorPoolHK.NewQuest_Title
	 class FColor              CompletedQuest_Reward (  );                       		//  GUIWarfareControls.BTUIColorPoolHK.CompletedQuest_Reward
	 class FColor              CompletedQuest_Content (  );                      		//  GUIWarfareControls.BTUIColorPoolHK.CompletedQuest_Content
	 class FColor              CompletedQuest_Title (  );                        		//  GUIWarfareControls.BTUIColorPoolHK.CompletedQuest_Title
	 class FColor              ListItem_Disable (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.ListItem_Disable
	 class FColor              ListItem_Select (  );                             		//  GUIWarfareControls.BTUIColorPoolHK.ListItem_Select
	 class FColor              ListItem_On (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.ListItem_On
	 class FColor              ListItem_Normal (  );                             		//  GUIWarfareControls.BTUIColorPoolHK.ListItem_Normal
	 class FColor              ItemUIStatus_Minus (  );                          		//  GUIWarfareControls.BTUIColorPoolHK.ItemUIStatus_Minus
	 class FColor              ItemUIStatus_Plus (  );                           		//  GUIWarfareControls.BTUIColorPoolHK.ItemUIStatus_Plus
	 class FColor              ItemUIStatus_Normal (  );                         		//  GUIWarfareControls.BTUIColorPoolHK.ItemUIStatus_Normal
	 class FColor              DefaultRed (  );                                  		//  GUIWarfareControls.BTUIColorPoolHK.DefaultRed
	 class FColor              DefaultGray (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.DefaultGray
	 class FColor              DefaultShadow (  );                               		//  GUIWarfareControls.BTUIColorPoolHK.DefaultShadow
	 class FColor              DefaultWhite (  );                                		//  GUIWarfareControls.BTUIColorPoolHK.DefaultWhite
	 class FColor              InverseLabelWarning (  );                         		//  GUIWarfareControls.BTUIColorPoolHK.InverseLabelWarning
	 class FColor              LabelWarning (  );                                		//  GUIWarfareControls.BTUIColorPoolHK.LabelWarning
	 class FColor              Damage4 (  );                                     		//  GUIWarfareControls.BTUIColorPoolHK.Damage4
	 class FColor              Damage3 (  );                                     		//  GUIWarfareControls.BTUIColorPoolHK.Damage3
	 class FColor              Damage2 (  );                                     		//  GUIWarfareControls.BTUIColorPoolHK.Damage2
	 class FColor              Damage1 (  );                                     		//  GUIWarfareControls.BTUIColorPoolHK.Damage1
	 class FColor              Damage0 (  );                                     		//  GUIWarfareControls.BTUIColorPoolHK.Damage0
	 class FColor              SmallPerc (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.SmallPerc
	 class FColor              Point (  );                                       		//  GUIWarfareControls.BTUIColorPoolHK.Point
	 class FColor              Cash (  );                                        		//  GUIWarfareControls.BTUIColorPoolHK.Cash
	 class FColor              QuestReward (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.QuestReward
	 class FColor              ListTopButtonDisable (  );                        		//  GUIWarfareControls.BTUIColorPoolHK.ListTopButtonDisable
	 class FColor              ListTopButtonPressed (  );                        		//  GUIWarfareControls.BTUIColorPoolHK.ListTopButtonPressed
	 class FColor              ListTopButtonWatched (  );                        		//  GUIWarfareControls.BTUIColorPoolHK.ListTopButtonWatched
	 class FColor              ListTopButtonOn (  );                             		//  GUIWarfareControls.BTUIColorPoolHK.ListTopButtonOn
	 class FColor              ListTopButtonN (  );                              		//  GUIWarfareControls.BTUIColorPoolHK.ListTopButtonN
	 class FColor              SubTabButtonDisable (  );                         		//  GUIWarfareControls.BTUIColorPoolHK.SubTabButtonDisable
	 class FColor              SubTabButtonPressed (  );                         		//  GUIWarfareControls.BTUIColorPoolHK.SubTabButtonPressed
	 class FColor              SubTabButtonWatched (  );                         		//  GUIWarfareControls.BTUIColorPoolHK.SubTabButtonWatched
	 class FColor              SubTabButtonOn (  );                              		//  GUIWarfareControls.BTUIColorPoolHK.SubTabButtonOn
	 class FColor              SubTabButtonN (  );                               		//  GUIWarfareControls.BTUIColorPoolHK.SubTabButtonN
	 class FColor              TabButtonDisable_PaidItem (  );                   		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonDisable_PaidItem
	 class FColor              TabButtonPressed_PaidItem (  );                   		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonPressed_PaidItem
	 class FColor              TabButtonWatched_PaidItem (  );                   		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonWatched_PaidItem
	 class FColor              TabButtonOn_PaidItem (  );                        		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonOn_PaidItem
	 class FColor              TabButtonN_PaidItem (  );                         		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonN_PaidItem
	 class FColor              TabButtonDisable (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonDisable
	 class FColor              TabButtonPressed (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonPressed
	 class FColor              TabButtonWatched (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonWatched
	 class FColor              TabButtonOn (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonOn
	 class FColor              TabButtonN (  );                                  		//  GUIWarfareControls.BTUIColorPoolHK.TabButtonN
	 class FColor              ButtonPageListDisable (  );                       		//  GUIWarfareControls.BTUIColorPoolHK.ButtonPageListDisable
	 class FColor              ButtonPageListPressed (  );                       		//  GUIWarfareControls.BTUIColorPoolHK.ButtonPageListPressed
	 class FColor              ButtonPageListWatched (  );                       		//  GUIWarfareControls.BTUIColorPoolHK.ButtonPageListWatched
	 class FColor              ButtonPageListOn (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.ButtonPageListOn
	 class FColor              ButtonPageListN (  );                             		//  GUIWarfareControls.BTUIColorPoolHK.ButtonPageListN
	 class FColor              RadioButtonSelect (  );                           		//  GUIWarfareControls.BTUIColorPoolHK.RadioButtonSelect
	 class FColor              RadioButtonDisable (  );                          		//  GUIWarfareControls.BTUIColorPoolHK.RadioButtonDisable
	 class FColor              RadioButtonPressed (  );                          		//  GUIWarfareControls.BTUIColorPoolHK.RadioButtonPressed
	 class FColor              RadioButtonWatched (  );                          		//  GUIWarfareControls.BTUIColorPoolHK.RadioButtonWatched
	 class FColor              RadioButtonOn (  );                               		//  GUIWarfareControls.BTUIColorPoolHK.RadioButtonOn
	 class FColor              RadioButtonNBold (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.RadioButtonNBold
	 class FColor              RadioButtonN (  );                                		//  GUIWarfareControls.BTUIColorPoolHK.RadioButtonN
	 class FColor              BigButtonPressedShadow (  );                      		//  GUIWarfareControls.BTUIColorPoolHK.BigButtonPressedShadow
	 class FColor              BigButtonOnShadow (  );                           		//  GUIWarfareControls.BTUIColorPoolHK.BigButtonOnShadow
	 class FColor              BigButtonDisable (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.BigButtonDisable
	 class FColor              BigButtonPressed (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.BigButtonPressed
	 class FColor              BigButtonWatched (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.BigButtonWatched
	 class FColor              BigButtonOn (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.BigButtonOn
	 class FColor              BigButtonN (  );                                  		//  GUIWarfareControls.BTUIColorPoolHK.BigButtonN
	 class FColor              ButtonPressedShadow (  );                         		//  GUIWarfareControls.BTUIColorPoolHK.ButtonPressedShadow
	 class FColor              ButtonOnShadow (  );                              		//  GUIWarfareControls.BTUIColorPoolHK.ButtonOnShadow
	 class FColor              newButtonDisable (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.newButtonDisable
	 class FColor              newButtonPressed (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.newButtonPressed
	 class FColor              newButtonWatched (  );                            		//  GUIWarfareControls.BTUIColorPoolHK.newButtonWatched
	 class FColor              newButtonOn (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.newButtonOn
	 class FColor              newButtonN (  );                                  		//  GUIWarfareControls.BTUIColorPoolHK.newButtonN
	 class FColor              ButtonDisable (  );                               		//  GUIWarfareControls.BTUIColorPoolHK.ButtonDisable
	 class FColor              ButtonPressed (  );                               		//  GUIWarfareControls.BTUIColorPoolHK.ButtonPressed
	 class FColor              ButtonWatched (  );                               		//  GUIWarfareControls.BTUIColorPoolHK.ButtonWatched
	 class FColor              ButtonOn (  );                                    		//  GUIWarfareControls.BTUIColorPoolHK.ButtonOn
	 class FColor              ButtonN (  );                                     		//  GUIWarfareControls.BTUIColorPoolHK.ButtonN
	 class FColor              AASLevel7 (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.AASLevel7
	 class FColor              AASLevel3 (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.AASLevel3
	 class FColor              ChatTeam (  );                                    		//  GUIWarfareControls.BTUIColorPoolHK.ChatTeam
	 class FColor              ChatTeamGhost (  );                               		//  GUIWarfareControls.BTUIColorPoolHK.ChatTeamGhost
	 class FColor              ChatGhost (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.ChatGhost
	 class FColor              ChatBroadCastItem (  );                           		//  GUIWarfareControls.BTUIColorPoolHK.ChatBroadCastItem
	 class FColor              ChatSystem (  );                                  		//  GUIWarfareControls.BTUIColorPoolHK.ChatSystem
	 class FColor              ChatClan (  );                                    		//  GUIWarfareControls.BTUIColorPoolHK.ChatClan
	 class FColor              ChatWhisper (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.ChatWhisper
	 class FColor              ChatSelf (  );                                    		//  GUIWarfareControls.BTUIColorPoolHK.ChatSelf
	 class FColor              ChatNormal (  );                                  		//  GUIWarfareControls.BTUIColorPoolHK.ChatNormal
	 class FColor              GradePCBang (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.GradePCBang
	 class FColor              GradeLegend (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.GradeLegend
	 class FColor              GradeRare (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.GradeRare
	 class FColor              GradeHigh (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.GradeHigh
	 class FColor              GradeNormal (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.GradeNormal
	 class FColor              GradeCommon (  );                                 		//  GUIWarfareControls.BTUIColorPoolHK.GradeCommon
	 class FColor              GradeShop (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.GradeShop
	 class FColor              GradeShop_DurabilityX (  );                       		//  GUIWarfareControls.BTUIColorPoolHK.GradeShop_DurabilityX
	 class FColor              GradeBase (  );                                   		//  GUIWarfareControls.BTUIColorPoolHK.GradeBase
	 class FColor              myName (  );                                      		//  GUIWarfareControls.BTUIColorPoolHK.myName
	 class FColor              ClanName (  );                                    		//  GUIWarfareControls.BTUIColorPoolHK.ClanName
}; // Size: 0x0000

// Class GUIWarfareControls.BTUIResourcePoolHK
class DLL_IMPORT UBTUIResourcePoolHK : public UObject
{
public:
	class FColor                                       DefaultDrawColor;                                 		// 0x002C ( 0x0004 ) 
	class FColor                                       DefaultShadowColor;                               		// 0x0030 ( 0x0004 ) 
	struct FImage                                      ex_clanmark;                                      		// 0x0034 ( 0x0020 ) 
	struct FImage                                      cm_00;                                            		// 0x0054 ( 0x0020 ) 
	struct FImage                                      item_item_CF_blank_n;                             		// 0x0074 ( 0x0020 ) 
	struct FImage                                      img_panel_small;                                  		// 0x0094 ( 0x0020 ) 
	struct FImage                                      img_panel_small_stretch;                          		// 0x00B4 ( 0x0020 ) 
	struct FImage                                      icon_knife;                                       		// 0x00D4 ( 0x0020 ) 
	struct FImage                                      icon_pisgun;                                      		// 0x00F4 ( 0x0020 ) 
	struct FImage                                      icon_snipr;                                       		// 0x0114 ( 0x0020 ) 
	struct FImage                                      icon_roket;                                       		// 0x0134 ( 0x0020 ) 
	struct FImage                                      icon_password;                                    		// 0x0154 ( 0x0020 ) 
	struct FImage                                      icon_snipr_non;                                   		// 0x0174 ( 0x0020 ) 
	struct FImage                                      help_page;                                        		// 0x0194 ( 0x0020 ) 
	struct FImage                                      hud_back_3;                                       		// 0x01B4 ( 0x0020 ) 
	struct FImage                                      img_HUD_back_1;                                   		// 0x01D4 ( 0x0020 ) 
	struct FImage                                      img_slot_hlmt;                                    		// 0x01F4 ( 0x0020 ) 
	struct FImage                                      img_slot_grnd;                                    		// 0x0214 ( 0x0020 ) 
	struct FImage                                      img_slot_gogl;                                    		// 0x0234 ( 0x0020 ) 
	struct FImage                                      img_slot_face;                                    		// 0x0254 ( 0x0020 ) 
	struct FImage                                      img_slot_clth;                                    		// 0x0274 ( 0x0020 ) 
	struct FImage                                      img_slot_class;                                   		// 0x0294 ( 0x0020 ) 
	struct FImage                                      img_logo_CI;                                      		// 0x02B4 ( 0x0020 ) 
	struct FImage                                      img_logo_BTRtga;                                  		// 0x02D4 ( 0x0020 ) 
	struct FImage                                      img_15;                                           		// 0x02F4 ( 0x0020 ) 
	struct FImage                                      img_18;                                           		// 0x0314 ( 0x0020 ) 
	struct FImage                                      img_login_test;                                   		// 0x0334 ( 0x0020 ) 
	struct FImage                                      slider_back;                                      		// 0x0354 ( 0x0020 ) 
	struct FImage                                      slider_grip_n;                                    		// 0x0374 ( 0x0020 ) 
	struct FImage                                      slider_grip_on;                                   		// 0x0394 ( 0x0020 ) 
	struct FImage                                      img_result_indimat_ma;                            		// 0x03B4 ( 0x0020 ) 
	struct FImage                                      img_trophy;                                       		// 0x03D4 ( 0x0020 ) 
	struct FImage                                      img_trophy_scale;                                 		// 0x03F4 ( 0x0020 ) 
	struct FImage                                      img_promot;                                       		// 0x0414 ( 0x0020 ) 
	struct FImage                                      img_HUD_back_3;                                   		// 0x0434 ( 0x0020 ) 
	struct FImage                                      icon_LVup;                                        		// 0x0454 ( 0x0020 ) 
	struct FImage                                      icon_MVP;                                         		// 0x0474 ( 0x0020 ) 
	struct FImage                                      img_bonus;                                        		// 0x0494 ( 0x0020 ) 
	struct FImage                                      img_result_AF;                                    		// 0x04B4 ( 0x0020 ) 
	struct FImage                                      img_result_RSA;                                   		// 0x04D4 ( 0x0020 ) 
	struct FImage                                      img_win_1;                                        		// 0x04F4 ( 0x0020 ) 
	struct FImage                                      img_lose_1;                                       		// 0x0514 ( 0x0020 ) 
	struct FImage                                      img_win_2;                                        		// 0x0534 ( 0x0020 ) 
	struct FImage                                      img_lose_2;                                       		// 0x0554 ( 0x0020 ) 
	struct FImage                                      img_win_3;                                        		// 0x0574 ( 0x0020 ) 
	struct FImage                                      img_lose_3;                                       		// 0x0594 ( 0x0020 ) 
	struct FImage                                      img_result_AF_ma;                                 		// 0x05B4 ( 0x0020 ) 
	struct FImage                                      img_result_RSA_ma;                                		// 0x05D4 ( 0x0020 ) 
	struct FImage                                      sgau_weap_back;                                   		// 0x05F4 ( 0x0020 ) 
	struct FImage                                      sgau_weap_gauge;                                  		// 0x0614 ( 0x0020 ) 
	struct FImage                                      sgau_weap_incre;                                  		// 0x0634 ( 0x0020 ) 
	struct FImage                                      sgau_weap_decre;                                  		// 0x0654 ( 0x0020 ) 
	struct FImage                                      img_chat;                                         		// 0x0674 ( 0x0020 ) 
	struct FImage                                      gau_exp_back;                                     		// 0x0694 ( 0x0020 ) 
	struct FImage                                      gau_exp_gauge;                                    		// 0x06B4 ( 0x0020 ) 
	struct FImage                                      sgau_ping_1;                                      		// 0x06D4 ( 0x0020 ) 
	struct FImage                                      sgau_ping_2;                                      		// 0x06F4 ( 0x0020 ) 
	struct FImage                                      sgau_ping_3;                                      		// 0x0714 ( 0x0020 ) 
	struct FImage                                      sgau_ping_4;                                      		// 0x0734 ( 0x0020 ) 
	struct FImage                                      sgau_ping_back;                                   		// 0x0754 ( 0x0020 ) 
	struct FImage                                      img_pup_sau;                                      		// 0x0774 ( 0x0020 ) 
	struct FImage                                      img_ptitl_back;                                   		// 0x0794 ( 0x0020 ) 
	struct FImage                                      butt_left_n;                                      		// 0x07B4 ( 0x0020 ) 
	struct FImage                                      butt_left_on;                                     		// 0x07D4 ( 0x0020 ) 
	struct FImage                                      butt_left_cli;                                    		// 0x07F4 ( 0x0020 ) 
	struct FImage                                      butt_left_dis;                                    		// 0x0814 ( 0x0020 ) 
	struct FImage                                      butt_right_n;                                     		// 0x0834 ( 0x0020 ) 
	struct FImage                                      butt_right_on;                                    		// 0x0854 ( 0x0020 ) 
	struct FImage                                      butt_right_cli;                                   		// 0x0874 ( 0x0020 ) 
	struct FImage                                      butt_right_dis;                                   		// 0x0894 ( 0x0020 ) 
	struct FImage                                      empty;                                            		// 0x08B4 ( 0x0020 ) 
	struct FImage                                      img_ser_listop;                                   		// 0x08D4 ( 0x0020 ) 
	struct FImage                                      img_ser_listop_STRETCHED_ALL;                     		// 0x08F4 ( 0x0020 ) 
	struct FImage                                      radi_dis;                                         		// 0x0914 ( 0x0020 ) 
	struct FImage                                      radi_back;                                        		// 0x0934 ( 0x0020 ) 
	struct FImage                                      radi_ok;                                          		// 0x0954 ( 0x0020 ) 
	struct FImage                                      chek_dis;                                         		// 0x0974 ( 0x0020 ) 
	struct FImage                                      chek_back;                                        		// 0x0994 ( 0x0020 ) 
	struct FImage                                      chek_ok;                                          		// 0x09B4 ( 0x0020 ) 
	struct FImage                                      list_commu_n;                                     		// 0x09D4 ( 0x0020 ) 
	struct FImage                                      tap_n;                                            		// 0x09F4 ( 0x0020 ) 
	struct FImage                                      tap_on;                                           		// 0x0A14 ( 0x0020 ) 
	struct FImage                                      tap_foc;                                          		// 0x0A34 ( 0x0020 ) 
	struct FImage                                      tap_cli;                                          		// 0x0A54 ( 0x0020 ) 
	struct FImage                                      tap_dis;                                          		// 0x0A74 ( 0x0020 ) 
	struct FImage                                      tap_n_tro;                                        		// 0x0A94 ( 0x0020 ) 
	struct FImage                                      tap_on_tro;                                       		// 0x0AB4 ( 0x0020 ) 
	struct FImage                                      tap_foc_tro;                                      		// 0x0AD4 ( 0x0020 ) 
	struct FImage                                      tap_cli_tro;                                      		// 0x0AF4 ( 0x0020 ) 
	struct FImage                                      tap_dis_tro;                                      		// 0x0B14 ( 0x0020 ) 
	struct FImage                                      tap_n_default;                                    		// 0x0B34 ( 0x0020 ) 
	struct FImage                                      tap_on_default;                                   		// 0x0B54 ( 0x0020 ) 
	struct FImage                                      tap_cli_default;                                  		// 0x0B74 ( 0x0020 ) 
	struct FImage                                      tap_dis_default;                                  		// 0x0B94 ( 0x0020 ) 
	struct FImage                                      butt_big_n;                                       		// 0x0BB4 ( 0x0020 ) 
	struct FImage                                      butt_big_on;                                      		// 0x0BD4 ( 0x0020 ) 
	struct FImage                                      butt_big_cli;                                     		// 0x0BF4 ( 0x0020 ) 
	struct FImage                                      butt_big_dis;                                     		// 0x0C14 ( 0x0020 ) 
	struct FImage                                      list_item_n;                                      		// 0x0C34 ( 0x0020 ) 
	struct FImage                                      list_item_new;                                    		// 0x0C54 ( 0x0020 ) 
	struct FImage                                      list_item_on;                                     		// 0x0C74 ( 0x0020 ) 
	struct FImage                                      img_item_info;                                    		// 0x0C94 ( 0x0020 ) 
	struct FImage                                      list_item_non;                                    		// 0x0CB4 ( 0x0020 ) 
	struct FImage                                      icon_rem_cmor;                                    		// 0x0CD4 ( 0x0020 ) 
	struct FImage                                      icon_rem_cobr;                                    		// 0x0CF4 ( 0x0020 ) 
	struct FImage                                      icon_rem_dotd;                                    		// 0x0D14 ( 0x0020 ) 
	struct FImage                                      icon_rem_eotc;                                    		// 0x0D34 ( 0x0020 ) 
	struct FImage                                      icon_rem_mrds;                                    		// 0x0D54 ( 0x0020 ) 
	struct FImage                                      icon_rem_sco3;                                    		// 0x0D74 ( 0x0020 ) 
	struct FImage                                      icon_rem_sco5;                                    		// 0x0D94 ( 0x0020 ) 
	struct FImage                                      icon_rem_sco7;                                    		// 0x0DB4 ( 0x0020 ) 
	struct FImage                                      icon_rem_siln;                                    		// 0x0DD4 ( 0x0020 ) 
	struct FImage                                      icon_rem_skil;                                    		// 0x0DF4 ( 0x0020 ) 
	struct FImage                                      img_divid_line;                                   		// 0x0E14 ( 0x0020 ) 
	struct FImage                                      img_divid_line_c;                                 		// 0x0E34 ( 0x0020 ) 
	struct FImage                                      img_edge_line;                                    		// 0x0E54 ( 0x0020 ) 
	struct FImage                                      img_AF_cha;                                       		// 0x0E74 ( 0x0020 ) 
	struct FImage                                      img_RSA_cha;                                      		// 0x0E94 ( 0x0020 ) 
	struct FImage                                      butt_m_n;                                         		// 0x0EB4 ( 0x0020 ) 
	struct FImage                                      butt_m_on;                                        		// 0x0ED4 ( 0x0020 ) 
	struct FImage                                      butt_m_cli;                                       		// 0x0EF4 ( 0x0020 ) 
	struct FImage                                      butt_m_dis;                                       		// 0x0F14 ( 0x0020 ) 
	struct FImage                                      butt_n;                                           		// 0x0F34 ( 0x0020 ) 
	struct FImage                                      butt_on;                                          		// 0x0F54 ( 0x0020 ) 
	struct FImage                                      butt_cli;                                         		// 0x0F74 ( 0x0020 ) 
	struct FImage                                      butt_dis;                                         		// 0x0F94 ( 0x0020 ) 
	struct FImage                                      img_cash_non;                                     		// 0x0FB4 ( 0x0020 ) 
	struct FImage                                      img_point_b;                                      		// 0x0FD4 ( 0x0020 ) 
	struct FImage                                      img_point_non;                                    		// 0x0FF4 ( 0x0020 ) 
	struct FImage                                      img_cash;                                         		// 0x1014 ( 0x0020 ) 
	struct FImage                                      img_point;                                        		// 0x1034 ( 0x0020 ) 
	struct FImage                                      img_point_LC;                                     		// 0x1054 ( 0x0020 ) 
	struct FImage                                      img_repair_non;                                   		// 0x1074 ( 0x0020 ) 
	struct FImage                                      img_class_non;                                    		// 0x1094 ( 0x0020 ) 
	struct FImage                                      panel_1;                                          		// 0x10B4 ( 0x0020 ) 
	struct FImage                                      panel_1_half_alpha;                               		// 0x10D4 ( 0x0020 ) 
	struct FImage                                      panel_1_1;                                        		// 0x10F4 ( 0x0020 ) 
	struct FImage                                      panel_2;                                          		// 0x1114 ( 0x0020 ) 
	struct FImage                                      panel_3;                                          		// 0x1134 ( 0x0020 ) 
	struct FImage                                      panel_4;                                          		// 0x1154 ( 0x0020 ) 
	struct FImage                                      panel_5;                                          		// 0x1174 ( 0x0020 ) 
	struct FImage                                      panel_6;                                          		// 0x1194 ( 0x0020 ) 
	struct FImage                                      panel_7;                                          		// 0x11B4 ( 0x0020 ) 
	struct FImage                                      img_hold;                                         		// 0x11D4 ( 0x0020 ) 
	struct FImage                                      img_new;                                          		// 0x11F4 ( 0x0020 ) 
	struct FImage                                      img_popul;                                        		// 0x1214 ( 0x0020 ) 
	struct FImage                                      img_recom;                                        		// 0x1234 ( 0x0020 ) 
	struct FImage                                      list_lobby_on;                                    		// 0x1254 ( 0x0020 ) 
	struct FImage                                      list_lobby_cli;                                   		// 0x1274 ( 0x0020 ) 
	struct FImage                                      list_lobby_n;                                     		// 0x1294 ( 0x0020 ) 
	struct FImage                                      butt_list_n;                                      		// 0x12B4 ( 0x0020 ) 
	struct FImage                                      butt_list_on;                                     		// 0x12D4 ( 0x0020 ) 
	struct FImage                                      butt_list_cli;                                    		// 0x12F4 ( 0x0020 ) 
	struct FImage                                      butt_list_dis;                                    		// 0x1314 ( 0x0020 ) 
	struct FImage                                      img_list_divid;                                   		// 0x1334 ( 0x0020 ) 
	struct FImage                                      img_bak_aro;                                      		// 0x1354 ( 0x0020 ) 
	struct FImage                                      img_fir_aro;                                      		// 0x1374 ( 0x0020 ) 
	struct FImage                                      img_nex_aro;                                      		// 0x1394 ( 0x0020 ) 
	struct FImage                                      img_back1;                                        		// 0x13B4 ( 0x0020 ) 
	struct FImage                                      img_upper;                                        		// 0x13D4 ( 0x0020 ) 
	struct FImage                                      butt_af_n;                                        		// 0x13F4 ( 0x0020 ) 
	struct FImage                                      butt_af_on;                                       		// 0x1414 ( 0x0020 ) 
	struct FImage                                      butt_af_cli;                                      		// 0x1434 ( 0x0020 ) 
	struct FImage                                      butt_rsa_n;                                       		// 0x1454 ( 0x0020 ) 
	struct FImage                                      butt_rsa_on;                                      		// 0x1474 ( 0x0020 ) 
	struct FImage                                      butt_rsa_cli;                                     		// 0x1494 ( 0x0020 ) 
	struct FImage                                      img_input_x;                                      		// 0x14B4 ( 0x0020 ) 
	struct FImage                                      img_input_s;                                      		// 0x14D4 ( 0x0020 ) 
	struct FImage                                      icon_mstr;                                        		// 0x14F4 ( 0x0020 ) 
	struct FImage                                      img_top_default;                                  		// 0x1514 ( 0x0020 ) 
	struct FImage                                      img_page_thema;                                   		// 0x1534 ( 0x0020 ) 
	struct FImage                                      img_page_thema_trophy;                            		// 0x1554 ( 0x0020 ) 
	struct FImage                                      butt_quik_n;                                      		// 0x1574 ( 0x0020 ) 
	struct FImage                                      butt_quik_on;                                     		// 0x1594 ( 0x0020 ) 
	struct FImage                                      butt_quik_click;                                  		// 0x15B4 ( 0x0020 ) 
	struct FImage                                      butt_quik_empty;                                  		// 0x15D4 ( 0x0020 ) 
	struct FImage                                      butt_quik_input;                                  		// 0x15F4 ( 0x0020 ) 
	struct FImage                                      butt_quik_chang;                                  		// 0x1614 ( 0x0020 ) 
	struct FImage                                      gauge_loading;                                    		// 0x1634 ( 0x0020 ) 
	struct FImage                                      gauge_loading_back;                               		// 0x1654 ( 0x0020 ) 
	struct FImage                                      radi_on;                                          		// 0x1674 ( 0x0020 ) 
	struct FImage                                      img_promot_Scale;                                 		// 0x1694 ( 0x0020 ) 
	struct FImage                                      Item_Item_WP_ETC_RifleBox;                        		// 0x16B4 ( 0x0020 ) 
	struct FImage                                      img_up1;                                          		// 0x16D4 ( 0x0020 ) 
	struct FImage                                      img_up2;                                          		// 0x16F4 ( 0x0020 ) 
	struct FImage                                      img_up3;                                          		// 0x1714 ( 0x0020 ) 
	struct FImage                                      img_down1;                                        		// 0x1734 ( 0x0020 ) 
	struct FImage                                      img_down2;                                        		// 0x1754 ( 0x0020 ) 
	struct FImage                                      img_staff_back;                                   		// 0x1774 ( 0x0020 ) 
	struct FImage                                      img_staff_text;                                   		// 0x1794 ( 0x0020 ) 
	struct FImage                                      img_3ditem_back_0;                                		// 0x17B4 ( 0x0020 ) 
	struct FImage                                      img_3ditem_back_0_WeaponBack;                     		// 0x17D4 ( 0x0020 ) 
	struct FImage                                      img_3ditem_back_0_TrophyBack;                     		// 0x17F4 ( 0x0020 ) 
	struct FImage                                      img_3ditem_back_0_EditBack;                       		// 0x1814 ( 0x0020 ) 
	struct FImage                                      img_3ditem_back_1;                                		// 0x1834 ( 0x0020 ) 
	struct FImage                                      img_gauge_arow;                                   		// 0x1854 ( 0x0020 ) 
	struct FImage                                      img_edge_icon;                                    		// 0x1874 ( 0x0020 ) 
	struct FImage                                      Lv_Mark[ 0x4C ];                                  		// 0x1894 ( 0x0980 ) 
	struct FImage                                      ClanLevel[ 0x1F ];                                		// 0x2214 ( 0x03E0 ) 
	struct FImage                                      list_serv_n;                                      		// 0x25F4 ( 0x0020 ) 
	struct FImage                                      Item_Item_FT_point;                               		// 0x2614 ( 0x0020 ) 
	struct FImage                                      Item_Item_FT_epgain;                              		// 0x2634 ( 0x0020 ) 
	struct FImage                                      Item_Item_FT_ptgain;                              		// 0x2654 ( 0x0020 ) 
	struct FImage                                      Item_Item_FT_pt_bns;                              		// 0x2674 ( 0x0020 ) 
	struct FImage                                      img_panel_1;                                      		// 0x2694 ( 0x0020 ) 
	struct FImage                                      img_panel_2;                                      		// 0x26B4 ( 0x0020 ) 
	struct FImage                                      img_panel_3;                                      		// 0x26D4 ( 0x0020 ) 
	struct FImage                                      panel_inven_in;                                   		// 0x26F4 ( 0x0020 ) 
	struct FImage                                      panel_inven_out;                                  		// 0x2714 ( 0x0020 ) 
	struct FImage                                      panel_store_in;                                   		// 0x2734 ( 0x0020 ) 
	struct FImage                                      panel_store_out;                                  		// 0x2754 ( 0x0020 ) 
	struct FImage                                      img_inven;                                        		// 0x2774 ( 0x0020 ) 
	struct FImage                                      list_item_inven_n;                                		// 0x2794 ( 0x0020 ) 
	struct FImage                                      list_item_inven_on;                               		// 0x27B4 ( 0x0020 ) 
	struct FImage                                      list_item_inven_cli;                              		// 0x27D4 ( 0x0020 ) 
	struct FImage                                      list_item_inven_foc;                              		// 0x27F4 ( 0x0020 ) 
	struct FImage                                      list_item_store_n;                                		// 0x2814 ( 0x0020 ) 
	struct FImage                                      list_item_store_on;                               		// 0x2834 ( 0x0020 ) 
	struct FImage                                      list_item_store_cli;                              		// 0x2854 ( 0x0020 ) 
	struct FImage                                      list_item_store_foc;                              		// 0x2874 ( 0x0020 ) 
	struct FImage                                      butt_inven_n;                                     		// 0x2894 ( 0x0020 ) 
	struct FImage                                      butt_inven_on;                                    		// 0x28B4 ( 0x0020 ) 
	struct FImage                                      butt_inven_cli;                                   		// 0x28D4 ( 0x0020 ) 
	struct FImage                                      butt_inven_dis;                                   		// 0x28F4 ( 0x0020 ) 
	struct FImage                                      tap_n_inven;                                      		// 0x2914 ( 0x0020 ) 
	struct FImage                                      tap_on_inven;                                     		// 0x2934 ( 0x0020 ) 
	struct FImage                                      tap_cli_inven;                                    		// 0x2954 ( 0x0020 ) 
	struct FImage                                      tap_dis_inven;                                    		// 0x2974 ( 0x0020 ) 
	struct FImage                                      tap_n_store;                                      		// 0x2994 ( 0x0020 ) 
	struct FImage                                      tap_on_store;                                     		// 0x29B4 ( 0x0020 ) 
	struct FImage                                      tap_cli_store;                                    		// 0x29D4 ( 0x0020 ) 
	struct FImage                                      tap_dis_store;                                    		// 0x29F4 ( 0x0020 ) 
	struct FImage                                      icon_clan_free;                                   		// 0x2A14 ( 0x0020 ) 
	struct FImage                                      img_make_clan;                                    		// 0x2A34 ( 0x0020 ) 
	struct FImage                                      list_serv_cli;                                    		// 0x2A54 ( 0x0020 ) 
	struct FImage                                      list_commu_on;                                    		// 0x2A74 ( 0x0020 ) 
	struct FImage                                      list_commu_cli;                                   		// 0x2A94 ( 0x0020 ) 
	struct FImage                                      icon_leader;                                      		// 0x2AB4 ( 0x0020 ) 
	struct FImage                                      icon_cl_a1;                                       		// 0x2AD4 ( 0x0020 ) 
	struct FImage                                      icon_cl_a2;                                       		// 0x2AF4 ( 0x0020 ) 
	struct FImage                                      icon_cl_a3;                                       		// 0x2B14 ( 0x0020 ) 
	struct FImage                                      icon_cl_a4;                                       		// 0x2B34 ( 0x0020 ) 
	struct FImage                                      icon_cl_a5;                                       		// 0x2B54 ( 0x0020 ) 
	struct FImage                                      img_cm_128_ds_sku_03;                             		// 0x2B74 ( 0x0020 ) 
	struct FImage                                      img_cm_128_ds_sku_04;                             		// 0x2B94 ( 0x0020 ) 
	struct FImage                                      img_cm_128_ds_sku_06;                             		// 0x2BB4 ( 0x0020 ) 
	struct FImage                                      img_cm_128_ds_sku_07;                             		// 0x2BD4 ( 0x0020 ) 
	struct FImage                                      scrol_back;                                       		// 0x2BF4 ( 0x0020 ) 
	struct FImage                                      scrol_up_n;                                       		// 0x2C14 ( 0x0020 ) 
	struct FImage                                      scrol_up_on;                                      		// 0x2C34 ( 0x0020 ) 
	struct FImage                                      scrol_dn_n;                                       		// 0x2C54 ( 0x0020 ) 
	struct FImage                                      scrol_dn_on;                                      		// 0x2C74 ( 0x0020 ) 
	struct FImage                                      scrol_grip_n;                                     		// 0x2C94 ( 0x0020 ) 
	struct FImage                                      scrol_grip_on;                                    		// 0x2CB4 ( 0x0020 ) 
	struct FImage                                      gau_ser_back;                                     		// 0x2CD4 ( 0x0020 ) 
	struct FImage                                      gau_ser_gauge;                                    		// 0x2CF4 ( 0x0020 ) 
	struct FImage                                      icon_fixroom;                                     		// 0x2D14 ( 0x0020 ) 
	struct FImage                                      icon_quest_day;                                   		// 0x2D34 ( 0x0020 ) 
	struct FImage                                      icon_quest_tuto;                                  		// 0x2D54 ( 0x0020 ) 
	struct FImage                                      icon_quest_pcroom;                                		// 0x2D74 ( 0x0020 ) 
	struct FImage                                      icon_quest_pcroom2;                               		// 0x2D94 ( 0x0020 ) 
	struct FImage                                      icon_quest_event;                                 		// 0x2DB4 ( 0x0020 ) 
	struct FImage                                      img_point_help;                                   		// 0x2DD4 ( 0x0020 ) 
	struct FImage                                      img_exclamation;                                  		// 0x2DF4 ( 0x0020 ) 
	struct FImage                                      butt_rot_rt_n;                                    		// 0x2E14 ( 0x0020 ) 
	struct FImage                                      butt_rot_rt_on;                                   		// 0x2E34 ( 0x0020 ) 
	struct FImage                                      butt_rot_rt_cli;                                  		// 0x2E54 ( 0x0020 ) 
	struct FImage                                      butt_rot_lt_n;                                    		// 0x2E74 ( 0x0020 ) 
	struct FImage                                      butt_rot_lt_on;                                   		// 0x2E94 ( 0x0020 ) 
	struct FImage                                      butt_rot_lt_cli;                                  		// 0x2EB4 ( 0x0020 ) 
	struct FImage                                      butt_rot_af_n;                                    		// 0x2ED4 ( 0x0020 ) 
	struct FImage                                      butt_rot_af_on;                                   		// 0x2EF4 ( 0x0020 ) 
	struct FImage                                      butt_rot_af_cli;                                  		// 0x2F14 ( 0x0020 ) 
	struct FImage                                      butt_rot_rsa_n;                                   		// 0x2F34 ( 0x0020 ) 
	struct FImage                                      butt_rot_rsa_on;                                  		// 0x2F54 ( 0x0020 ) 
	struct FImage                                      butt_rot_rsa_cli;                                 		// 0x2F74 ( 0x0020 ) 
	struct FImage                                      img_help_all0;                                    		// 0x2F94 ( 0x0020 ) 
	struct FImage                                      img_help_all1;                                    		// 0x2FB4 ( 0x0020 ) 
	struct FImage                                      img_help_all2;                                    		// 0x2FD4 ( 0x0020 ) 
	struct FImage                                      img_help_all3;                                    		// 0x2FF4 ( 0x0020 ) 
	struct FImage                                      img_help_all4;                                    		// 0x3014 ( 0x0020 ) 
	struct FImage                                      img_help_all5;                                    		// 0x3034 ( 0x0020 ) 
	struct FImage                                      img_help_all6;                                    		// 0x3054 ( 0x0020 ) 
	struct FImage                                      img_help_all7;                                    		// 0x3074 ( 0x0020 ) 
	struct FImage                                      img_help_all8;                                    		// 0x3094 ( 0x0020 ) 
	struct FImage                                      img_help_all9;                                    		// 0x30B4 ( 0x0020 ) 
	struct FImage                                      img_help_all10;                                   		// 0x30D4 ( 0x0020 ) 
	struct FImage                                      icon_bns[ 0x07 ];                                 		// 0x30F4 ( 0x00E0 ) 
	struct FImage                                      icon_bns_chnl;                                    		// 0x31D4 ( 0x0020 ) 
	struct FImage                                      help_top;                                         		// 0x31F4 ( 0x0020 ) 
	struct FImage                                      help_btn_n;                                       		// 0x3214 ( 0x0020 ) 
	struct FImage                                      help_btn_on;                                      		// 0x3234 ( 0x0020 ) 
	struct FImage                                      help_btn_cli;                                     		// 0x3254 ( 0x0020 ) 
	struct FImage                                      help_back_web;                                    		// 0x3274 ( 0x0020 ) 
	struct FImage                                      help_back;                                        		// 0x3294 ( 0x0020 ) 
	struct FImage                                      help_Title_Notice;                                		// 0x32B4 ( 0x0020 ) 
	struct FImage                                      help_Notice;                                      		// 0x32D4 ( 0x0020 ) 
	struct FImage                                      cf_on;                                            		// 0x32F4 ( 0x0020 ) 
	struct FImage                                      cf_foc;                                           		// 0x3314 ( 0x0020 ) 
	struct FImage                                      cf_cli;                                           		// 0x3334 ( 0x0020 ) 
	struct FImage                                      icon_new;                                         		// 0x3354 ( 0x0020 ) 
	struct FImage                                      img_white;                                        		// 0x3374 ( 0x0020 ) 
	struct FImage                                      ex_clanmark_01;                                   		// 0x3394 ( 0x0020 ) 
	struct FImage                                      ex_clanmark_02;                                   		// 0x33B4 ( 0x0020 ) 
	struct FImage                                      img_quest_top;                                    		// 0x33D4 ( 0x0020 ) 
	struct FImage                                      img_quest_back;                                   		// 0x33F4 ( 0x0020 ) 
	struct FImage                                      img_quest_bottom;                                 		// 0x3414 ( 0x0020 ) 
	struct FImage                                      item_item_cash;                                   		// 0x3434 ( 0x0020 ) 
	struct FImage                                      img_top_win_af;                                   		// 0x3454 ( 0x0020 ) 
	struct FImage                                      img_top_win_rsa;                                  		// 0x3474 ( 0x0020 ) 
	struct FImage                                      img_top_lose_af;                                  		// 0x3494 ( 0x0020 ) 
	struct FImage                                      img_top_lose_rsa;                                 		// 0x34B4 ( 0x0020 ) 
	struct FImage                                      icon_notify_click;                                		// 0x34D4 ( 0x0020 ) 
	struct FImage                                      img_timeitempopup_info;                           		// 0x34F4 ( 0x0020 ) 
	struct FImage                                      img_timeitempopup_renew;                          		// 0x3514 ( 0x0020 ) 
	struct FImage                                      butt_big_Bling;                                   		// 0x3534 ( 0x0020 ) 
	struct FImage                                      img_serverchannel_bgdeco;                         		// 0x3554 ( 0x0020 ) 
	struct FImage                                      newlist_serv_n;                                   		// 0x3574 ( 0x0020 ) 
	struct FImage                                      newlist_serv_on;                                  		// 0x3594 ( 0x0020 ) 
	struct FImage                                      newlist_serv_cli;                                 		// 0x35B4 ( 0x0020 ) 
	struct FImage                                      newlist_serv_block;                               		// 0x35D4 ( 0x0020 ) 
	struct FImage                                      newlist_serv_Focus;                               		// 0x35F4 ( 0x0020 ) 
	struct FImage                                      newlist_Channel_n;                                		// 0x3614 ( 0x0020 ) 
	struct FImage                                      newlist_Channel_on;                               		// 0x3634 ( 0x0020 ) 
	struct FImage                                      newlist_Channel_cli;                              		// 0x3654 ( 0x0020 ) 
	struct FImage                                      newlist_Channel_block;                            		// 0x3674 ( 0x0020 ) 
	struct FImage                                      newlist_Channel_Focus;                            		// 0x3694 ( 0x0020 ) 
	struct FImage                                      ServerSelPageBtn_n;                               		// 0x36B4 ( 0x0020 ) 
	struct FImage                                      ServerSelPageBtn_on;                              		// 0x36D4 ( 0x0020 ) 
	struct FImage                                      ServerSelPageBtn_cli;                             		// 0x36F4 ( 0x0020 ) 
	struct FImage                                      ServerSelPageBtn_block;                           		// 0x3714 ( 0x0020 ) 
	struct FImage                                      ServerGroup[ 0x05 ];                              		// 0x3734 ( 0x00A0 ) 
	struct FImage                                      OptionBtn_n;                                      		// 0x37D4 ( 0x0020 ) 
	struct FImage                                      OptionBtn_on;                                     		// 0x37F4 ( 0x0020 ) 
	struct FImage                                      OptionBtn_cli;                                    		// 0x3814 ( 0x0020 ) 
	struct FImage                                      OptionBtn_block;                                  		// 0x3834 ( 0x0020 ) 
	struct FImage                                      OptionBtn_Focus;                                  		// 0x3854 ( 0x0020 ) 
	struct FImage                                      ExitBtn_n;                                        		// 0x3874 ( 0x0020 ) 
	struct FImage                                      ExitBtn_on;                                       		// 0x3894 ( 0x0020 ) 
	struct FImage                                      ExitBtn_cli;                                      		// 0x38B4 ( 0x0020 ) 
	struct FImage                                      ExitBtn_block;                                    		// 0x38D4 ( 0x0020 ) 
	struct FImage                                      ExitBtn_Focus;                                    		// 0x38F4 ( 0x0020 ) 
	struct FImage                                      ClanBtn_n;                                        		// 0x3914 ( 0x0020 ) 
	struct FImage                                      ClanBtn_on;                                       		// 0x3934 ( 0x0020 ) 
	struct FImage                                      ClanBtn_cli;                                      		// 0x3954 ( 0x0020 ) 
	struct FImage                                      ClanBtn_block;                                    		// 0x3974 ( 0x0020 ) 
	struct FImage                                      ClanBtn_Focus;                                    		// 0x3994 ( 0x0020 ) 
	struct FImage                                      Mailbox_n;                                        		// 0x39B4 ( 0x0020 ) 
	struct FImage                                      Mailbox_on;                                       		// 0x39D4 ( 0x0020 ) 
	struct FImage                                      Mailbox_cli;                                      		// 0x39F4 ( 0x0020 ) 
	struct FImage                                      Mailbox_block;                                    		// 0x3A14 ( 0x0020 ) 
	struct FImage                                      Mailbox_Focus;                                    		// 0x3A34 ( 0x0020 ) 
	struct FImage                                      Quest_n;                                          		// 0x3A54 ( 0x0020 ) 
	struct FImage                                      Quest_on;                                         		// 0x3A74 ( 0x0020 ) 
	struct FImage                                      Quest_cli;                                        		// 0x3A94 ( 0x0020 ) 
	struct FImage                                      Quest_block;                                      		// 0x3AB4 ( 0x0020 ) 
	struct FImage                                      Quest_Focus;                                      		// 0x3AD4 ( 0x0020 ) 
	struct FImage                                      Back_n;                                           		// 0x3AF4 ( 0x0020 ) 
	struct FImage                                      Back_on;                                          		// 0x3B14 ( 0x0020 ) 
	struct FImage                                      Back_cli;                                         		// 0x3B34 ( 0x0020 ) 
	struct FImage                                      Back_block;                                       		// 0x3B54 ( 0x0020 ) 
	struct FImage                                      Back_Focus;                                       		// 0x3B74 ( 0x0020 ) 
	struct FImage                                      ad_serverchannel;                                 		// 0x3B94 ( 0x0020 ) 
	struct FImage                                      Ad_ServerChannel2;                                		// 0x3BB4 ( 0x0020 ) 
	struct FImage                                      gau_servers_status_back;                          		// 0x3BD4 ( 0x0020 ) 
	struct FImage                                      gau_servers_status_gauge;                         		// 0x3BF4 ( 0x0020 ) 
	struct FImage                                      ChannelBg;                                        		// 0x3C14 ( 0x0020 ) 
	struct FImage                                      ChannelBgBeginner;                                		// 0x3C34 ( 0x0020 ) 
	struct FImage                                      ChannelBgTraining;                                		// 0x3C54 ( 0x0020 ) 
	struct FImage                                      ChannelBgNormal;                                  		// 0x3C74 ( 0x0020 ) 
	struct FImage                                      ChannelBgExpert;                                  		// 0x3C94 ( 0x0020 ) 
	struct FImage                                      ChannelBgClan;                                    		// 0x3CB4 ( 0x0020 ) 
	struct FImage                                      LobbyBG;                                          		// 0x3CD4 ( 0x0020 ) 
	struct FImage                                      newlist_Lobby_n;                                  		// 0x3CF4 ( 0x0020 ) 
	struct FImage                                      newlist_Lobby_on;                                 		// 0x3D14 ( 0x0020 ) 
	struct FImage                                      newlist_Lobby_cli;                                		// 0x3D34 ( 0x0020 ) 
	struct FImage                                      newlist_Lobby_block;                              		// 0x3D54 ( 0x0020 ) 
	struct FImage                                      newlist_Lobby_Focus;                              		// 0x3D74 ( 0x0020 ) 
	struct FImage                                      ad_lobby;                                         		// 0x3D94 ( 0x0020 ) 
	struct FImage                                      Msg_list_n;                                       		// 0x3DB4 ( 0x0020 ) 
	struct FImage                                      Msg_list_on;                                      		// 0x3DD4 ( 0x0020 ) 
	struct FImage                                      Msg_list_cli;                                     		// 0x3DF4 ( 0x0020 ) 
	struct FImage                                      Msg_list_block;                                   		// 0x3E14 ( 0x0020 ) 
	struct FImage                                      Msg_list_Focus;                                   		// 0x3E34 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_Big_n;                                  		// 0x3E54 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_Big_on;                                 		// 0x3E74 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_Big_cli;                                		// 0x3E94 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_Big_block;                              		// 0x3EB4 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_mid_n;                                  		// 0x3ED4 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_mid_on;                                 		// 0x3EF4 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_mid_cli;                                		// 0x3F14 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_mid_block;                              		// 0x3F34 ( 0x0020 ) 
	struct FImage                                      Lobby_Enter_Btn_n;                                		// 0x3F54 ( 0x0020 ) 
	struct FImage                                      Lobby_Enter_Btn_on;                               		// 0x3F74 ( 0x0020 ) 
	struct FImage                                      Lobby_Enter_Btn_cli;                              		// 0x3F94 ( 0x0020 ) 
	struct FImage                                      Lobby_Enter_Btn_block;                            		// 0x3FB4 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Btn_n;                          		// 0x3FD4 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Btn_on;                         		// 0x3FF4 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Btn_cli;                        		// 0x4014 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Btn_block;                      		// 0x4034 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Setting_Btn_n;                  		// 0x4054 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Setting_Btn_on;                 		// 0x4074 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Setting_Btn_cli;                		// 0x4094 ( 0x0020 ) 
	struct FImage                                      Lobby_Quick_Enter_Setting_Btn_block;              		// 0x40B4 ( 0x0020 ) 
	struct FImage                                      Cash_Btn_mid_n;                                   		// 0x40D4 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_small_n;                                		// 0x40F4 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_small_on;                               		// 0x4114 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_small_cli;                              		// 0x4134 ( 0x0020 ) 
	struct FImage                                      Lobby_Btn_small_block;                            		// 0x4154 ( 0x0020 ) 
	struct FImage                                      Lobby_Chat_Input_Bg;                              		// 0x4174 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtn_small_n;                            		// 0x4194 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtn_small_on;                           		// 0x41B4 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtn_small_cli;                          		// 0x41D4 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtn_small_block;                        		// 0x41F4 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnUp_small_n;                          		// 0x4214 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnUp_small_on;                         		// 0x4234 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnUp_small_cli;                        		// 0x4254 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnUp_small_block;                      		// 0x4274 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnDn_small_n;                          		// 0x4294 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnDn_small_on;                         		// 0x42B4 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnDn_small_cli;                        		// 0x42D4 ( 0x0020 ) 
	struct FImage                                      Lobby_ChatBtnDn_small_block;                      		// 0x42F4 ( 0x0020 ) 
	struct FImage                                      Lobby_MyInfo_Btn_n;                               		// 0x4314 ( 0x0020 ) 
	struct FImage                                      Lobby_MyInfo_Btn_on;                              		// 0x4334 ( 0x0020 ) 
	struct FImage                                      Lobby_MyInfo_Btn_cli;                             		// 0x4354 ( 0x0020 ) 
	struct FImage                                      Lobby_MyInfo_Btn_block;                           		// 0x4374 ( 0x0020 ) 
	struct FImage                                      Lobby_MyInfo_Btn_Focus;                           		// 0x4394 ( 0x0020 ) 
	struct FImage                                      TopMenuBtn_n;                                     		// 0x43B4 ( 0x0020 ) 
	struct FImage                                      TopMenuBtn_on;                                    		// 0x43D4 ( 0x0020 ) 
	struct FImage                                      TopMenuBtn_cli;                                   		// 0x43F4 ( 0x0020 ) 
	struct FImage                                      TopMenuBtn_block;                                 		// 0x4414 ( 0x0020 ) 
	struct FImage                                      TopMenuShop_Btn_n;                                		// 0x4434 ( 0x0020 ) 
	struct FImage                                      TopMenuShop_Btn_on;                               		// 0x4454 ( 0x0020 ) 
	struct FImage                                      TopMenuShop_Btn_cli;                              		// 0x4474 ( 0x0020 ) 
	struct FImage                                      TopMenuShop_Btn_block;                            		// 0x4494 ( 0x0020 ) 
	struct FImage                                      TopMenuInven_Btn_n;                               		// 0x44B4 ( 0x0020 ) 
	struct FImage                                      TopMenuInven_Btn_on;                              		// 0x44D4 ( 0x0020 ) 
	struct FImage                                      TopMenuInven_Btn_cli;                             		// 0x44F4 ( 0x0020 ) 
	struct FImage                                      TopMenuInven_Btn_block;                           		// 0x4514 ( 0x0020 ) 
	struct FImage                                      TopBgDeco;                                        		// 0x4534 ( 0x0020 ) 
	struct FImage                                      newimg_point_LC;                                  		// 0x4554 ( 0x0020 ) 
	struct FImage                                      newimg_cash_LC;                                   		// 0x4574 ( 0x0020 ) 
	struct FImage                                      newgau_exp_back;                                  		// 0x4594 ( 0x0020 ) 
	struct FImage                                      newgau_exp_gauge;                                 		// 0x45B4 ( 0x0020 ) 
	struct FImage                                      Inven_bg;                                         		// 0x45D4 ( 0x0020 ) 
	struct FImage                                      new_img_slot_MainGun;                             		// 0x45F4 ( 0x0020 ) 
	struct FImage                                      new_img_slot_Pistol;                              		// 0x4614 ( 0x0020 ) 
	struct FImage                                      new_img_slot_Knife;                               		// 0x4634 ( 0x0020 ) 
	struct FImage                                      new_img_slot_hlmt;                                		// 0x4654 ( 0x0020 ) 
	struct FImage                                      new_img_slot_grnd1;                               		// 0x4674 ( 0x0020 ) 
	struct FImage                                      new_img_slot_grnd2;                               		// 0x4694 ( 0x0020 ) 
	struct FImage                                      new_img_slot_gogl;                                		// 0x46B4 ( 0x0020 ) 
	struct FImage                                      new_img_slot_face;                                		// 0x46D4 ( 0x0020 ) 
	struct FImage                                      new_img_slot_clth_af;                             		// 0x46F4 ( 0x0020 ) 
	struct FImage                                      new_img_slot_clth_rsa;                            		// 0x4714 ( 0x0020 ) 
	struct FImage                                      new_img_slot_class;                               		// 0x4734 ( 0x0020 ) 
	struct FImage                                      Block_Weapon;                                     		// 0x4754 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot1_Btn_n;                             		// 0x4774 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot1_Btn_on;                            		// 0x4794 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot1_Btn_cli;                           		// 0x47B4 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot1_Btn_Disable;                       		// 0x47D4 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot1_Btn_Focus;                         		// 0x47F4 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot2_Btn_n;                             		// 0x4814 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot2_Btn_on;                            		// 0x4834 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot2_Btn_cli;                           		// 0x4854 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot2_Btn_Disable;                       		// 0x4874 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot2_Btn_Focus;                         		// 0x4894 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot3_Btn_n;                             		// 0x48B4 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot3_Btn_on;                            		// 0x48D4 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot3_Btn_cli;                           		// 0x48F4 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot3_Btn_Disable;                       		// 0x4914 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot3_Btn_Focus;                         		// 0x4934 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot4_Btn_n;                             		// 0x4954 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot4_Btn_on;                            		// 0x4974 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot4_Btn_cli;                           		// 0x4994 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot4_Btn_Disable;                       		// 0x49B4 ( 0x0020 ) 
	struct FImage                                      Inven_QuiSlot4_Btn_Focus;                         		// 0x49D4 ( 0x0020 ) 
	struct FImage                                      Inven_tab_small_n;                                		// 0x49F4 ( 0x0020 ) 
	struct FImage                                      Inven_tab_small_on;                               		// 0x4A14 ( 0x0020 ) 
	struct FImage                                      Inven_tab_small_cli;                              		// 0x4A34 ( 0x0020 ) 
	struct FImage                                      Inven_tab_small_Disable;                          		// 0x4A54 ( 0x0020 ) 
	struct FImage                                      Inven_tab_small_Focus;                            		// 0x4A74 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Mid_n;                                  		// 0x4A94 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Mid_on;                                 		// 0x4AB4 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Mid_cli;                                		// 0x4AD4 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Mid_Disable;                            		// 0x4AF4 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Mid_Focus;                              		// 0x4B14 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Big_n;                                  		// 0x4B34 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Big_on;                                 		// 0x4B54 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Big_cli;                                		// 0x4B74 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Big_Disable;                            		// 0x4B94 ( 0x0020 ) 
	struct FImage                                      Inven_tab_Big_Focus;                              		// 0x4BB4 ( 0x0020 ) 
	struct FImage                                      Inven_Chattab_Big_n;                              		// 0x4BD4 ( 0x0020 ) 
	struct FImage                                      Inven_Chattab_Big_on;                             		// 0x4BF4 ( 0x0020 ) 
	struct FImage                                      Inven_Chattab_Big_cli;                            		// 0x4C14 ( 0x0020 ) 
	struct FImage                                      Inven_Chattab_Big_Disable;                        		// 0x4C34 ( 0x0020 ) 
	struct FImage                                      Inven_Chattab_Big_Focus;                          		// 0x4C54 ( 0x0020 ) 
	struct FImage                                      Inven_Msntab_n;                                   		// 0x4C74 ( 0x0020 ) 
	struct FImage                                      Inven_Msntab_on;                                  		// 0x4C94 ( 0x0020 ) 
	struct FImage                                      Inven_Msntab_cli;                                 		// 0x4CB4 ( 0x0020 ) 
	struct FImage                                      Inven_Msntab_Disable;                             		// 0x4CD4 ( 0x0020 ) 
	struct FImage                                      Inven_Msntab_Focus;                               		// 0x4CF4 ( 0x0020 ) 
	struct FImage                                      Item_List_BG;                                     		// 0x4D14 ( 0x0020 ) 
	struct FImage                                      Item_List_n;                                      		// 0x4D34 ( 0x0020 ) 
	struct FImage                                      Item_List_on;                                     		// 0x4D54 ( 0x0020 ) 
	struct FImage                                      Item_List_cli;                                    		// 0x4D74 ( 0x0020 ) 
	struct FImage                                      Item_List_Sel;                                    		// 0x4D94 ( 0x0020 ) 
	struct FImage                                      Item_List_quick_sel;                              		// 0x4DB4 ( 0x0020 ) 
	struct FImage                                      Inven_gauge_bg;                                   		// 0x4DD4 ( 0x0020 ) 
	struct FImage                                      Inven_Total_fix_btn_n;                            		// 0x4DF4 ( 0x0020 ) 
	struct FImage                                      Inven_Total_fix_btn_on;                           		// 0x4E14 ( 0x0020 ) 
	struct FImage                                      Inven_Total_fix_btn_cli;                          		// 0x4E34 ( 0x0020 ) 
	struct FImage                                      Inven_Total_fix_btn_Disable;                      		// 0x4E54 ( 0x0020 ) 
	struct FImage                                      Inven_Total_fix_btn_Focus;                        		// 0x4E74 ( 0x0020 ) 
	struct FImage                                      Equip_QS_WP_BG;                                   		// 0x4E94 ( 0x0020 ) 
	struct FImage                                      Inven_sub_btn_n;                                  		// 0x4EB4 ( 0x0020 ) 
	struct FImage                                      Inven_sub_btn_on;                                 		// 0x4ED4 ( 0x0020 ) 
	struct FImage                                      Inven_sub_btn_cli;                                		// 0x4EF4 ( 0x0020 ) 
	struct FImage                                      Inven_sub_btn_Disable;                            		// 0x4F14 ( 0x0020 ) 
	struct FImage                                      Inven_sub_btn_Focus;                              		// 0x4F34 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_GreenBtn_n;                        		// 0x4F54 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_GreenBtn_on;                       		// 0x4F74 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_GreenBtn_cli;                      		// 0x4F94 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_GreenBtn_Disable;                  		// 0x4FB4 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_GreenBtn_Focus;                    		// 0x4FD4 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_YellowBtn_n;                       		// 0x4FF4 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_YellowBtn_on;                      		// 0x5014 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_YellowBtn_cli;                     		// 0x5034 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_YellowBtn_Disable;                 		// 0x5054 ( 0x0020 ) 
	struct FImage                                      Inven_ItemList_YellowBtn_Focus;                   		// 0x5074 ( 0x0020 ) 
	struct FImage                                      Inven_Skill_Lock;                                 		// 0x5094 ( 0x0020 ) 
	struct FImage                                      new_img_cash;                                     		// 0x50B4 ( 0x0020 ) 
	struct FImage                                      new_img_point;                                    		// 0x50D4 ( 0x0020 ) 
	struct FImage                                      char_rot_Left_n;                                  		// 0x50F4 ( 0x0020 ) 
	struct FImage                                      char_rot_Left_on;                                 		// 0x5114 ( 0x0020 ) 
	struct FImage                                      char_rot_Left_cli;                                		// 0x5134 ( 0x0020 ) 
	struct FImage                                      char_rot_Left_Dis;                                		// 0x5154 ( 0x0020 ) 
	struct FImage                                      char_rot_Left_focus;                              		// 0x5174 ( 0x0020 ) 
	struct FImage                                      char_rot_Right_n;                                 		// 0x5194 ( 0x0020 ) 
	struct FImage                                      char_rot_Right_on;                                		// 0x51B4 ( 0x0020 ) 
	struct FImage                                      char_rot_Right_cli;                               		// 0x51D4 ( 0x0020 ) 
	struct FImage                                      char_rot_Right_Dis;                               		// 0x51F4 ( 0x0020 ) 
	struct FImage                                      char_rot_Right_focus;                             		// 0x5214 ( 0x0020 ) 
	struct FImage                                      MainWeapon_List_Bg;                               		// 0x5234 ( 0x0020 ) 
	struct FImage                                      MainWeapon_List_n;                                		// 0x5254 ( 0x0020 ) 
	struct FImage                                      MainWeapon_List_on;                               		// 0x5274 ( 0x0020 ) 
	struct FImage                                      MainWeapon_List_cli;                              		// 0x5294 ( 0x0020 ) 
	struct FImage                                      MainWeapon_List_Dis;                              		// 0x52B4 ( 0x0020 ) 
	struct FImage                                      MainWeapon_List_focus;                            		// 0x52D4 ( 0x0020 ) 
	struct FImage                                      sgau_weap_gauge_y;                                		// 0x52F4 ( 0x0020 ) 
	struct FImage                                      sgau_weap_incre_g;                                		// 0x5314 ( 0x0020 ) 
	struct FImage                                      sgau_weap_decre_r;                                		// 0x5334 ( 0x0020 ) 
	struct FImage                                      new_Page_Thema;                                   		// 0x5354 ( 0x0020 ) 
	struct FImage                                      Store_bg;                                         		// 0x5374 ( 0x0020 ) 
	struct FImage                                      Charge_Cash_Btn_n;                                		// 0x5394 ( 0x0020 ) 
	struct FImage                                      Charge_Cash_Btn_on;                               		// 0x53B4 ( 0x0020 ) 
	struct FImage                                      Charge_Cash_Btn_cli;                              		// 0x53D4 ( 0x0020 ) 
	struct FImage                                      Charge_Cash_Btn_focus;                            		// 0x53F4 ( 0x0020 ) 
	struct FImage                                      Charge_Cash_Btn_Dis;                              		// 0x5414 ( 0x0020 ) 
	struct FImage                                      Billing_Btn_n;                                    		// 0x5434 ( 0x0020 ) 
	struct FImage                                      Quest_Info_BG;                                    		// 0x5454 ( 0x0020 ) 
	struct FImage                                      Quest_PC_B_Mark;                                  		// 0x5474 ( 0x0020 ) 
	struct FImage                                      Quest_Day_Mark;                                   		// 0x5494 ( 0x0020 ) 
	struct FImage                                      Quest_Event_Mark;                                 		// 0x54B4 ( 0x0020 ) 
	struct FImage                                      Quest_PC_Y_Mark;                                  		// 0x54D4 ( 0x0020 ) 
	struct FImage                                      Quest_Basic_Tr_Mark;                              		// 0x54F4 ( 0x0020 ) 
	struct FImage                                      Quest_List_n;                                     		// 0x5514 ( 0x0020 ) 
	struct FImage                                      Quest_List_On;                                    		// 0x5534 ( 0x0020 ) 
	struct FImage                                      Quest_List_ci;                                    		// 0x5554 ( 0x0020 ) 
	struct FImage                                      Quest_List_focus;                                 		// 0x5574 ( 0x0020 ) 
	struct FImage                                      Quest_List_Dis;                                   		// 0x5594 ( 0x0020 ) 
	struct FImage                                      RoomLoby_BG_Deco;                                 		// 0x55B4 ( 0x0020 ) 
	struct FImage                                      Store_Item_Prop_Mark_Own;                         		// 0x55D4 ( 0x0020 ) 
	struct FImage                                      Store_Item_Prop_Mark_Best;                        		// 0x55F4 ( 0x0020 ) 
	struct FImage                                      Store_Item_Prop_Mark_New;                         		// 0x5614 ( 0x0020 ) 
	struct FImage                                      Store_Item_Prop_Mark_Cool;                        		// 0x5634 ( 0x0020 ) 
	struct FImage                                      WaitRoom_List_n;                                  		// 0x5654 ( 0x0020 ) 
	struct FImage                                      WaitRoom_List_On;                                 		// 0x5674 ( 0x0020 ) 
	struct FImage                                      WaitRoom_List_cli;                                		// 0x5694 ( 0x0020 ) 
	struct FImage                                      WaitRoom_List_Me;                                 		// 0x56B4 ( 0x0020 ) 
	struct FImage                                      WaitRoom_List_Focus;                              		// 0x56D4 ( 0x0020 ) 
	struct FImage                                      WaitRoom_Team_AF_n;                               		// 0x56F4 ( 0x0020 ) 
	struct FImage                                      WaitRoom_Team_AF_On;                              		// 0x5714 ( 0x0020 ) 
	struct FImage                                      WaitRoom_Team_AF_Cli;                             		// 0x5734 ( 0x0020 ) 
	struct FImage                                      WaitRoom_Team_RSA_n;                              		// 0x5754 ( 0x0020 ) 
	struct FImage                                      WaitRoom_Team_RSA_On;                             		// 0x5774 ( 0x0020 ) 
	struct FImage                                      WaitRoom_Team_RSA_Cli;                            		// 0x5794 ( 0x0020 ) 
	struct FImage                                      WaitRoom_StartGame_n;                             		// 0x57B4 ( 0x0020 ) 
	struct FImage                                      WaitRoom_StartGame_on;                            		// 0x57D4 ( 0x0020 ) 
	struct FImage                                      WaitRoom_StartGame_cli;                           		// 0x57F4 ( 0x0020 ) 
	struct FImage                                      WaitRoom_RoomInfo_n;                              		// 0x5814 ( 0x0020 ) 
	struct FImage                                      WaitRoom_RoomInfo_on;                             		// 0x5834 ( 0x0020 ) 
	struct FImage                                      WaitRoom_RoomInfo_cli;                            		// 0x5854 ( 0x0020 ) 
	struct FImage                                      WaitRoom_RoomInof_SubBG;                          		// 0x5874 ( 0x0020 ) 
	struct FImage                                      ImageList_On;                                     		// 0x5894 ( 0x0020 ) 
	struct FImage                                      GameResult_Win_AF_BG;                             		// 0x58B4 ( 0x0020 ) 
	struct FImage                                      GameResult_Lose_AF_BG;                            		// 0x58D4 ( 0x0020 ) 
	struct FImage                                      GameResult_Win_RSA_BG;                            		// 0x58F4 ( 0x0020 ) 
	struct FImage                                      GameResult_Lose_RSA_BG;                           		// 0x5914 ( 0x0020 ) 
	struct FImage                                      GameResult_Win_AF_Mark;                           		// 0x5934 ( 0x0020 ) 
	struct FImage                                      GameResult_Win_RSA_Mark;                          		// 0x5954 ( 0x0020 ) 
	struct FImage                                      GameResult_MyInfo_BG;                             		// 0x5974 ( 0x0020 ) 
	struct FImage                                      GameResult_Deco_BG;                               		// 0x5994 ( 0x0020 ) 
	struct FImage                                      GameResult_Top_BG;                                		// 0x59B4 ( 0x0020 ) 
	struct FImage                                      GameResult_Private_BG;                            		// 0x59D4 ( 0x0020 ) 
	struct FImage                                      GameResult_Private_Mark;                          		// 0x59F4 ( 0x0020 ) 
	struct FImage                                      GameResult_Close_Btn_n;                           		// 0x5A14 ( 0x0020 ) 
	struct FImage                                      GameResult_Close_Btn_On;                          		// 0x5A34 ( 0x0020 ) 
	struct FImage                                      GameResult_Close_Btn_Cli;                         		// 0x5A54 ( 0x0020 ) 
	struct FImage                                      GameResult_Close_Btn_Dis;                         		// 0x5A74 ( 0x0020 ) 
	struct FImage                                      Option_Panel_BG;                                  		// 0x5A94 ( 0x0020 ) 
	struct FImage                                      Option_Init_Btn_n;                                		// 0x5AB4 ( 0x0020 ) 
	struct FImage                                      Option_Init_Btn_on;                               		// 0x5AD4 ( 0x0020 ) 
	struct FImage                                      Option_Init_Btn_cli;                              		// 0x5AF4 ( 0x0020 ) 
	struct FImage                                      Option_Init_Btn_block;                            		// 0x5B14 ( 0x0020 ) 
	struct FImage                                      MakeRoom_Win_BG;                                  		// 0x5B34 ( 0x0020 ) 
	struct FImage                                      MakeRoom_Input_Text_BG;                           		// 0x5B54 ( 0x0020 ) 
	struct FImage                                      scrol_new_up_n;                                   		// 0x5B74 ( 0x0020 ) 
	struct FImage                                      scrol_new_up_on;                                  		// 0x5B94 ( 0x0020 ) 
	struct FImage                                      scrol_new_up_cli;                                 		// 0x5BB4 ( 0x0020 ) 
	struct FImage                                      scrol_new_up_dis;                                 		// 0x5BD4 ( 0x0020 ) 
	struct FImage                                      scrol_new_dn_n;                                   		// 0x5BF4 ( 0x0020 ) 
	struct FImage                                      scrol_new_dn_on;                                  		// 0x5C14 ( 0x0020 ) 
	struct FImage                                      scrol_new_dn_cli;                                 		// 0x5C34 ( 0x0020 ) 
	struct FImage                                      scrol_new_dn_dis;                                 		// 0x5C54 ( 0x0020 ) 
	struct FImage                                      scrol_new_grip_n;                                 		// 0x5C74 ( 0x0020 ) 
	struct FImage                                      scrol_new_grip_on;                                		// 0x5C94 ( 0x0020 ) 
	struct FImage                                      scrol_new_grip_cli;                               		// 0x5CB4 ( 0x0020 ) 
	struct FImage                                      scrol_new_grip_dis;                               		// 0x5CD4 ( 0x0020 ) 
	struct FImage                                      Scrol_New_BG;                                     		// 0x5CF4 ( 0x0020 ) 
	struct FImage                                      slider_new_back;                                  		// 0x5D14 ( 0x0020 ) 
	struct FImage                                      slider_new_grip_n;                                		// 0x5D34 ( 0x0020 ) 
	struct FImage                                      slider_new_grip_on;                               		// 0x5D54 ( 0x0020 ) 
	struct FImage                                      slider_new_grip_cli;                              		// 0x5D74 ( 0x0020 ) 
	struct FImage                                      slider_new_grip_dis;                              		// 0x5D94 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_1_n;                       		// 0x5DB4 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_1_on;                      		// 0x5DD4 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_1_cli;                     		// 0x5DF4 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_1_dis;                     		// 0x5E14 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_2_n;                       		// 0x5E34 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_2_on;                      		// 0x5E54 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_2_cli;                     		// 0x5E74 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_2_dis;                     		// 0x5E94 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_3_n;                       		// 0x5EB4 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_3_on;                      		// 0x5ED4 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_3_cli;                     		// 0x5EF4 ( 0x0020 ) 
	struct FImage                                      Button_Graphic_Opt_all_3_dis;                     		// 0x5F14 ( 0x0020 ) 
	struct FImage                                      Button_Control_Opt_all_n;                         		// 0x5F34 ( 0x0020 ) 
	struct FImage                                      Button_Control_Opt_all_on;                        		// 0x5F54 ( 0x0020 ) 
	struct FImage                                      Button_Control_Opt_all_cli;                       		// 0x5F74 ( 0x0020 ) 
	struct FImage                                      Button_Control_Opt_all_dis;                       		// 0x5F94 ( 0x0020 ) 
	struct FImage                                      List_New_Opt_backnlist;                           		// 0x5FB4 ( 0x0020 ) 
	struct FImage                                      List_New_Opt_n;                                   		// 0x5FD4 ( 0x0020 ) 
	struct FImage                                      List_New_Opt_on;                                  		// 0x5FF4 ( 0x0020 ) 
	struct FImage                                      List_New_Opt_cli;                                 		// 0x6014 ( 0x0020 ) 
	struct FImage                                      List_New_Opt_dis;                                 		// 0x6034 ( 0x0020 ) 
	struct FImage                                      Combo_New_Butt_n;                                 		// 0x6054 ( 0x0020 ) 
	struct FImage                                      Combo_New_Butt_on;                                		// 0x6074 ( 0x0020 ) 
	struct FImage                                      Combo_New_Butt_cli;                               		// 0x6094 ( 0x0020 ) 
	struct FImage                                      Combo_New_Butt_dis;                               		// 0x60B4 ( 0x0020 ) 
	struct FImage                                      Combo_New_Expand;                                 		// 0x60D4 ( 0x0020 ) 
	struct FImage                                      Combo_New_Expand_on;                              		// 0x60F4 ( 0x0020 ) 
	struct FImage                                      Combo_New_Back;                                   		// 0x6114 ( 0x0020 ) 
	struct FImage                                      ItemPopup_Bgdeco;                                 		// 0x6134 ( 0x0020 ) 
	struct FImage                                      ItemPopup_ItemInfo_back;                          		// 0x6154 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_bgdeco;                               		// 0x6174 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_Btn_Rollback_n;                       		// 0x6194 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_Btn_Rollback_cli;                     		// 0x61B4 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_Btn_Rollback_on;                      		// 0x61D4 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_Btn_Rollback_dis;                     		// 0x61F4 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_List_BG_n;                            		// 0x6214 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_List_BG_on;                           		// 0x6234 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_List_BG_cli;                          		// 0x6254 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_List_BG_Focus;                        		// 0x6274 ( 0x0020 ) 
	struct FImage                                      ItemRemodel_Buy_bgdeco;                           		// 0x6294 ( 0x0020 ) 
	struct FImage                                      QuickEnterRoom_Win_BG;                            		// 0x62B4 ( 0x0020 ) 
	struct FImage                                      Icon_ServeMode[ 0x07 ];                           		// 0x62D4 ( 0x00E0 ) 
	struct FImage                                      img_Tilte;                                        		// 0x63B4 ( 0x0020 ) 
	struct FImage                                      All_Map_Img;                                      		// 0x63D4 ( 0x0020 ) 
	struct FImage                                      newMap_Icon;                                      		// 0x63F4 ( 0x0020 ) 
	struct FImage                                      BillingPopup_Deco_Img;                            		// 0x6414 ( 0x0020 ) 
	struct FImage                                      Expired_Deco_Img;                                 		// 0x6434 ( 0x0020 ) 
	struct FImage                                      Coupon_Bg_Img;                                    		// 0x6454 ( 0x0020 ) 
	struct FImage                                      Coupon_oversquare_Img;                            		// 0x6474 ( 0x0020 ) 

	// UScript Functions
	 int                       BounsIDToBounsIconIndex ( int i );                		//  GUIWarfareControls.BTUIResourcePoolHK.BounsIDToBounsIconIndex
}; // Size: 0x6468

// Class GUIWarfareControls.BTWindowSelectHK
class DLL_IMPORT UBTWindowSelectHK : public UBTWindowHK
{
public:
	unsigned long                                      bChangeText:1;                                    		// 0x04AC ( 0x0004 )  [0x00000001]
	struct FFloatBox                                   fbLabelInfo;                                      		// 0x04B0 ( 0x0010 ) 
	class UBTOwnerDrawImageHK*                         LabelInfo;                                        		// 0x04C0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 bool                      Internal_OnKeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfareControls.BTWindowSelectHK.Internal_OnKeyEvent
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfareControls.BTWindowSelectHK.Internal_OnPreDraw
	 void                      ShowWindow ( class UGUIController* con, struct FString Title, struct FString Msg, struct FString btnOk, struct FString btnCancel );		//  GUIWarfareControls.BTWindowSelectHK.ShowWindow
	 void                      SetData ( struct FString Title, int titlepadding, struct FString Msg, struct FString btnOk, struct FString btnCancel );		//  GUIWarfareControls.BTWindowSelectHK.SetData
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowSelectHK.InitComponent
}; // Size: 0x0018

// Class GUIWarfareControls.BTWindowDefineSelectHK
class DLL_IMPORT UBTWindowDefineSelectHK : public UBTWindowSelectHK
{
public:
	struct FString                                     strClientDefaultTitle;                            		// 0x04C4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClientTitle[ 0x32 ];                           		// 0x04D0 ( 0x0258 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClientDefine[ 0x32 ];                          		// 0x0728 ( 0x0258 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      ShowInfo ( class UGUIController* con, int Code, struct FString arg0, struct FString arg1, struct FString arg2 );		//  GUIWarfareControls.BTWindowDefineSelectHK.ShowInfo
}; // Size: 0x04BC

// Class GUIWarfareControls.BTChatEditBoxHK
class DLL_IMPORT UBTChatEditBoxHK : public UBTEditBoxHK
{
public:

	// UScript Functions
	 bool                      CheckPastedTextCondition ( struct FString Text ); 		//  GUIWarfareControls.BTChatEditBoxHK.CheckPastedTextCondition
	 bool                      CheckKeyInputCondition ( struct FString st );     		//  GUIWarfareControls.BTChatEditBoxHK.CheckKeyInputCondition
}; // Size: 0x0000

// Class GUIWarfareControls.PageOnWindowManager
class DLL_IMPORT UPageOnWindowManager : public UObject
{
public:
	unsigned long                                      bProcess:1;                                       		// 0x002C ( 0x0004 )  [0x00000001]
	class UGUIController*                              Controller;                                       		// 0x0030 ( 0x0004 ) 
	class UPageOnWindow*                               Pow[ 0x1E ];                                      		// 0x0034 ( 0x0078 ) 

	// UScript Functions
	 class UBTWindowHK*        Pop ( unsigned char destpage );                   		//  GUIWarfareControls.PageOnWindowManager.Pop
	 class UBTWindowHK*        back ( unsigned char destpage );                  		//  GUIWarfareControls.PageOnWindowManager.back
	 class UBTWindowHK*        Last ( unsigned char destpage );                  		//  GUIWarfareControls.PageOnWindowManager.Last
	 bool                      RemoveWindowOnStack ( unsigned char destpage, struct FName WindowName, bool bAll );		//  GUIWarfareControls.PageOnWindowManager.RemoveWindowOnStack
	 class UBTWindowHK*        FindWindowOnStack ( unsigned char destpage, struct FName WindowName );		//  GUIWarfareControls.PageOnWindowManager.FindWindowOnStack
	 int                       ListLen ( unsigned char destpage );               		//  GUIWarfareControls.PageOnWindowManager.ListLen
	 void                      Push ( unsigned char destpage, class UBTWindowHK* N, bool bUseInsert, int insertPos, bool bUseInsertAtName, struct FName nobject );		//  GUIWarfareControls.PageOnWindowManager.Push
	 class UBTWindowHK*        CreateAndPush ( unsigned char destpage, struct FString WindowName, bool bUseInsert, int insertPos, bool bUseInsertAtName, struct FName nobject );		//  GUIWarfareControls.PageOnWindowManager.CreateAndPush
	 void                      CloseAndClear (  );                               		//  GUIWarfareControls.PageOnWindowManager.CloseAndClear
	 void                      Init ( class UGUIController* C );                 		//  GUIWarfareControls.PageOnWindowManager.Init
	 void                      StopProcess (  );                                 		//  GUIWarfareControls.PageOnWindowManager.StopProcess
	 void                      StartProcess (  );                                		//  GUIWarfareControls.PageOnWindowManager.StartProcess
	 bool                      IsAvailable (  );                                 		//  GUIWarfareControls.PageOnWindowManager.IsAvailable
}; // Size: 0x0080

// Class GUIWarfareControls.BTOwnerDrawCaptionButtonHK
class DLL_IMPORT UBTOwnerDrawCaptionButtonHK : public UGUIButton
{
public:
	float                                              TimeOut;                                          		// 0x02F4 ( 0x0004 ) 
	unsigned long                                      bSetTimeOut:1;                                    		// 0x02F8 ( 0x0004 )  [0x00000001]
	int                                                CanvasStyle;                                      		// 0x02FC ( 0x0004 ) 
	float                                              CurrentTimeSecond;                                		// 0x0300 ( 0x0004 ) 
	float                                              LastTimeSecond;                                   		// 0x0304 ( 0x0004 ) 
	int                                                CaptionTopPadding[ 0x06 ];                        		// 0x0308 ( 0x0018 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned long                                      bActiveCursor:1;                                  		// 0x0320 ( 0x0004 )  [0x00000001]
	unsigned long                                      bSelect:1;                                        		// 0x0320 ( 0x0004 )  [0x00000002]
	unsigned long                                      bSelectHighlight:1;                               		// 0x0320 ( 0x0004 )  [0x00000004]
	unsigned long                                      bDisable:1;                                       		// 0x0320 ( 0x0004 )  [0x00000008]
	int                                                ButtonID;                                         		// 0x0324 ( 0x0004 ) 
	int                                                Extra;                                            		// 0x0328 ( 0x0004 ) 
	int                                                FontSize[ 0x06 ];                                 		// 0x032C ( 0x0018 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       FontColor[ 0x06 ];                                		// 0x0344 ( 0x0018 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       FontShadowColor[ 0x06 ];                          		// 0x035C ( 0x0018 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	int                                                CaptionPadding[ 0x04 ];                           		// 0x0374 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned char                                      CaptionDrawType;                                  		// 0x0384 ( 0x0001 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     Caption;                                          		// 0x0388 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FImage                                      buttonImage[ 0x06 ];                              		// 0x0394 ( 0x00C0 ) 
	struct FImage                                      BackgroundImage;                                  		// 0x0454 ( 0x0020 ) 
	struct FImage                                      BlingImgBig;                                      		// 0x0474 ( 0x0020 ) 
	class UBTRODecorateStringHK*                       btToolTip;                                        		// 0x0494 ( 0x0004 ) 
	struct FString                                     strTooltip;                                       		// 0x0498 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      isShowToolTip:1;                                  		// 0x04A4 ( 0x0004 )  [0x00000001]
	float                                              CursorUSize;                                      		// 0x04A8 ( 0x0004 ) 
	float                                              CursorVSize;                                      		// 0x04AC ( 0x0004 ) 
	unsigned long                                      isFlicker:1;                                      		// 0x04B0 ( 0x0004 )  [0x00000001]
	struct FBtrDouble                                  dbUniqID;                                         		// 0x04B4 ( 0x0008 ) 
	struct FScriptDelegate                             __OnTimeOut__Delegate;                            		// 0x04BC ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InternalDeactivate (  );                          		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.InternalDeactivate
	 void                      InternalActivate (  );                            		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.InternalActivate
	 void                      OnRendered ( class UCanvas* C );                  		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.OnRendered
	 void                      DrawToolTip ( class UCanvas* C );                 		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.DrawToolTip
	 struct FFloatBox          GetTooltipPos ( int tooltipWidth, int tooltipHeight, int nOffsetX, int nOffsetY );		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.GetTooltipPos
	 void                      SetFontDrawType ( unsigned char dt );             		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontDrawType
	 void                      SetFontSizeAll ( int Size );                      		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontSizeAll
	 void                      SetFontShadowColorAll ( class FColor Col );       		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontShadowColorAll
	 void                      SetAlphaValue ( float A );                        		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetAlphaValue
	 void                      SetFontColorAll ( class FColor Col );             		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontColorAll
	 void                      SetDefaultNonSelectFontColor (  );                		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultNonSelectFontColor
	 void                      SetDefaultListFontColor (  );                     		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultListFontColor
	 void                      SetDefaultListTopButtonFontColor (  );            		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultListTopButtonFontColor
	 void                      SetDefaultMTabButtonFontColor (  );               		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultMTabButtonFontColor
	 void                      SetPaidItemTabButtonFontColor (  );               		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetPaidItemTabButtonFontColor
	 void                      SetDefaultTabButtonFontColor (  );                		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultTabButtonFontColor
	 void                      SetDefaultRadioButtonFontColor (  );              		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRadioButtonFontColor
	 void                      SetDefaultPageListButtonColor (  );               		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultPageListButtonColor
	 void                      SetDefaultBigButtonFontColor (  );                		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultBigButtonFontColor
	 void                      SetDefaultFontColor (  );                         		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultFontColor
	 void                      LeftPaddingPerc ( float perc );                   		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.LeftPaddingPerc
	 void                      SetDefaultPaintingButtonImage (  );               		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultPaintingButtonImage
	 void                      SetDefaultListButtonImage (  );                   		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultListButtonImage
	 void                      SetDefaultOptionInitButtonImage (  );             		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultOptionInitButtonImage
	 void                      SetDefaultRArrowButtonImage (  );                 		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRArrowButtonImage
	 void                      SetDefaultLArrowButtonImage (  );                 		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultLArrowButtonImage
	 void                      SetDefaultRRotateRSAButtonImage (  );             		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRRotateRSAButtonImage
	 void                      SetDefaultLRotateAFButtonImage (  );              		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultLRotateAFButtonImage
	 void                      SetDefaultRRotateButtonImage (  );                		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRRotateButtonImage
	 void                      SetDefaultLRotateButtonImage (  );                		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultLRotateButtonImage
	 void                      SetDefaultBigTabButtonImage (  );                 		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultBigTabButtonImage
	 void                      SetPaidItemTabButtonImage (  );                   		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetPaidItemTabButtonImage
	 void                      SetDefaultTabButtonImageNotDis (  );              		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultTabButtonImageNotDis
	 void                      SetDefaultTabButtonImage (  );                    		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultTabButtonImage
	 void                      SetDefaultSliderGripButtonImage (  );             		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultSliderGripButtonImage
	 void                      SetNewSliderGripButtonImage (  );                 		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetNewSliderGripButtonImage
	 void                      SetDefaultMButtonImage (  );                      		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultMButtonImage
	 void                      SetDefaultBigButtonImage (  );                    		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultBigButtonImage
	 void                      SetTabButtonFontColor (  );                       		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetTabButtonFontColor
	 void                      SetSmallTabButtonImage (  );                      		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetSmallTabButtonImage
	 void                      SetMidTabButtonImage (  );                        		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetMidTabButtonImage
	 void                      SetMsgTabButtonImage (  );                        		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetMsgTabButtonImage
	 void                      SetChatTabButtonImage (  );                       		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetChatTabButtonImage
	 void                      SetBigTabButtonImage (  );                        		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetBigTabButtonImage
	 void                      SetGameStartBtnImage (  );                        		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetGameStartBtnImage
	 void                      SetDefaultQuickSlotButtonImage (  );              		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultQuickSlotButtonImage
	 void                      SetControlKeyBtnImage (  );                       		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetControlKeyBtnImage
	 void                      SetGraphicAdvanceBtnImage (  );                   		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetGraphicAdvanceBtnImage
	 void                      SetGraphicUpDownBtnImage (  );                    		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetGraphicUpDownBtnImage
	 void                      SetWaitRoomInfoBtnImage (  );                     		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetWaitRoomInfoBtnImage
	 void                      SetDefaultButtonImage (  );                       		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultButtonImage
	 void                      SetDefaultCheckBoxImage (  );                     		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultCheckBoxImage
	 void                      SetDefaultRadioImage (  );                        		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRadioImage
	 void                      StopTimeOut ( float SetTime );                    		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.StopTimeOut
	 void                      StartTimeOut ( float SetTime );                   		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.StartTimeOut
	 void                      OnTimeOut ( class UGUIComponent* Sender );        		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.OnTimeOut
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTOwnerDrawCaptionButtonHK.InitComponent
}; // Size: 0x01D0

// Class GUIWarfareControls.BTOwnerDrawImageHK
class DLL_IMPORT UBTOwnerDrawImageHK : public UFloatingImage
{
public:
	int                                                CanvasStyle;                                      		// 0x02FC ( 0x0004 ) 
	int                                                LabelID;                                          		// 0x0300 ( 0x0004 ) 
	float                                              CurrentTimeSecond;                                		// 0x0304 ( 0x0004 ) 
	float                                              LastTimeSecond;                                   		// 0x0308 ( 0x0004 ) 
	unsigned long                                      bUseFontScaleValue:1;                             		// 0x030C ( 0x0004 )  [0x00000001]
	float                                              FontScaleValue;                                   		// 0x0310 ( 0x0004 ) 
	int                                                FontStyle[ 0x05 ];                                		// 0x0314 ( 0x0014 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	int                                                FontSize[ 0x05 ];                                 		// 0x0328 ( 0x0014 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       FontColor[ 0x05 ];                                		// 0x033C ( 0x0014 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       FontShadowColor[ 0x05 ];                          		// 0x0350 ( 0x0014 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	int                                                CaptionPadding[ 0x04 ];                           		// 0x0364 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned char                                      CaptionDrawType;                                  		// 0x0374 ( 0x0001 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     Caption;                                          		// 0x0378 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FImage                                      BackgroundImage;                                  		// 0x0384 ( 0x0020 ) 
	unsigned long                                      bDrawToolTips:1;                                  		// 0x03A4 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	class UBTRODecorateStringHK*                       decoToolTips;                                     		// 0x03A8 ( 0x0004 ) [ CPF_Edit ]
	struct FBtrDouble                                  UniqueID;                                         		// 0x03AC ( 0x0008 ) 

	// UScript Functions
	 void                      Internal_OnRendered ( class UCanvas* C );         		//  GUIWarfareControls.BTOwnerDrawImageHK.Internal_OnRendered
	 void                      SetFontDrawType ( unsigned char dt );             		//  GUIWarfareControls.BTOwnerDrawImageHK.SetFontDrawType
	 void                      SetFontShadowColorAll ( class FColor Col );       		//  GUIWarfareControls.BTOwnerDrawImageHK.SetFontShadowColorAll
	 void                      SetFontAndImageColorAll ( class FColor Col );     		//  GUIWarfareControls.BTOwnerDrawImageHK.SetFontAndImageColorAll
	 void                      SetFontColorAll ( class FColor Col );             		//  GUIWarfareControls.BTOwnerDrawImageHK.SetFontColorAll
	 void                      SetFontSizeAll ( int Size );                      		//  GUIWarfareControls.BTOwnerDrawImageHK.SetFontSizeAll
	 void                      SetDefaultFontColor (  );                         		//  GUIWarfareControls.BTOwnerDrawImageHK.SetDefaultFontColor
	 void                      SetToolTipsText ( struct FString t );             		//  GUIWarfareControls.BTOwnerDrawImageHK.SetToolTipsText
}; // Size: 0x00B8

// Class GUIWarfareControls.BTMultiLineEditBoxHK
class DLL_IMPORT UBTMultiLineEditBoxHK : public UGUIEditBox
{
public:
	unsigned long                                      bActiveCursor:1;                                  		// 0x0368 ( 0x0004 )  [0x00000001]
	class UCanvas*                                     saveC;                                            		// 0x036C ( 0x0004 ) 
	class FColor                                       CursorColor;                                      		// 0x0370 ( 0x0004 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       SelectionColor;                                   		// 0x0374 ( 0x0004 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FImage                                      bgImg;                                            		// 0x0378 ( 0x0020 ) 
	struct FImage                                      cursorImg;                                        		// 0x0398 ( 0x0020 ) 
	struct FImage                                      selectionImg;                                     		// 0x03B8 ( 0x0020 ) 
	int                                                FontSize[ 0x05 ];                                 		// 0x03D8 ( 0x0014 ) 
	class FColor                                       FontColor[ 0x05 ];                                		// 0x03EC ( 0x0014 ) 
	class FColor                                       FontShadowColor[ 0x05 ];                          		// 0x0400 ( 0x0014 ) 
	int                                                CaretLinePos;                                     		// 0x0414 ( 0x0004 ) 
	class TArray< int >                                sumLineTextCount;                                 		// 0x0418 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                sumLineW;                                         		// 0x0424 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                sumLineHT;                                        		// 0x0430 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     textStrVis;                                       		// 0x043C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                bEndofNewLineCharacter;                           		// 0x0448 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bUndo:1;                                          		// 0x0454 ( 0x0004 )  [0x00000001]
	int                                                UndoCaretPos;                                     		// 0x0458 ( 0x0004 ) 
	struct FString                                     UndoTextStr;                                      		// 0x045C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                VisibleLineCount;                                 		// 0x0468 ( 0x0004 ) 
	unsigned long                                      bSelectionMode:1;                                 		// 0x046C ( 0x0004 )  [0x00000001]
	unsigned long                                      bMouseFirstPress:1;                               		// 0x046C ( 0x0004 )  [0x00000002]
	unsigned long                                      bMousePressed:1;                                  		// 0x046C ( 0x0004 )  [0x00000004]
	struct FSelectionArea                              SelArea;                                          		// 0x0470 ( 0x0008 ) 
	struct FScriptDelegate                             __OnChat__Delegate;                               		// 0x0478 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InternalDeactivate (  );                          		//  GUIWarfareControls.BTMultiLineEditBoxHK.InternalDeactivate
	 void                      InternalActivate (  );                            		//  GUIWarfareControls.BTMultiLineEditBoxHK.InternalActivate
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  GUIWarfareControls.BTMultiLineEditBoxHK.InternalOnKeyEvent
	 bool                      CheckKeyInputCondition ( struct FString st );     		//  GUIWarfareControls.BTMultiLineEditBoxHK.CheckKeyInputCondition
	 bool                      InternalOnKeyType ( struct FString Unicode, unsigned char* key );		//  GUIWarfareControls.BTMultiLineEditBoxHK.InternalOnKeyType
	 struct FString            ConvertIllegal ( struct FString inputstr );       		//  GUIWarfareControls.BTMultiLineEditBoxHK.ConvertIllegal
	 int                       CaretBinarySearch ( int vlc, int lCursor, int rCursor, float mx );		//  GUIWarfareControls.BTMultiLineEditBoxHK.CaretBinarySearch
	 int                       MousePosToCaretPos ( float mx, float my );        		//  GUIWarfareControls.BTMultiLineEditBoxHK.MousePosToCaretPos
	 void                      UpdateLineInfo (  );                              		//  GUIWarfareControls.BTMultiLineEditBoxHK.UpdateLineInfo
	 void                      OnMousePressed ( class UGUIComponent* Sender, bool bRepeat );		//  GUIWarfareControls.BTMultiLineEditBoxHK.OnMousePressed
	 void                      OnMouseRelease ( class UGUIComponent* Sender );   		//  GUIWarfareControls.BTMultiLineEditBoxHK.OnMouseRelease
	 void                      OnChange ( class UGUIComponent* Sender );         		//  GUIWarfareControls.BTMultiLineEditBoxHK.OnChange
	 void                      CaculateVisibleText (  );                         		//  GUIWarfareControls.BTMultiLineEditBoxHK.CaculateVisibleText
	 void                      DrawIMEInfo ( class UCanvas* C, float CursorWidth );		//  GUIWarfareControls.BTMultiLineEditBoxHK.DrawIMEInfo
	 bool                      OwnerDraw ( class UCanvas* C );                   		//  GUIWarfareControls.BTMultiLineEditBoxHK.OwnerDraw
	 int                       CaretPosToLinePos ( int pos );                    		//  GUIWarfareControls.BTMultiLineEditBoxHK.CaretPosToLinePos
	 void                      Clear (  );                                       		//  GUIWarfareControls.BTMultiLineEditBoxHK.Clear
	 void                      SetVisibleLineCount ( int lc );                   		//  GUIWarfareControls.BTMultiLineEditBoxHK.SetVisibleLineCount
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTMultiLineEditBoxHK.InitComponent
	 void                      SetText ( struct FString Text );                  		//  GUIWarfareControls.BTMultiLineEditBoxHK.SetText
	 void                      InputSelectionPos ( int pos );                    		//  GUIWarfareControls.BTMultiLineEditBoxHK.InputSelectionPos
	 void                      ResetSelectionPos ( int pos );                    		//  GUIWarfareControls.BTMultiLineEditBoxHK.ResetSelectionPos
	 struct FString            GetSelectionText (  );                            		//  GUIWarfareControls.BTMultiLineEditBoxHK.GetSelectionText
	 void                      RemoveSelectionText (  );                         		//  GUIWarfareControls.BTMultiLineEditBoxHK.RemoveSelectionText
	 void                      ProcessUndo ( bool bForceBack );                  		//  GUIWarfareControls.BTMultiLineEditBoxHK.ProcessUndo
	 void                      SaveUndo (  );                                    		//  GUIWarfareControls.BTMultiLineEditBoxHK.SaveUndo
	 void                      OnChat ( struct FString Text );                   		//  GUIWarfareControls.BTMultiLineEditBoxHK.OnChat
	 void                      SetFontSizeAll ( int Size );                      		//  GUIWarfareControls.BTMultiLineEditBoxHK.SetFontSizeAll
	 void                      SetSadowColor ( unsigned char _R, unsigned char _G, unsigned char _B, unsigned char _A );		//  GUIWarfareControls.BTMultiLineEditBoxHK.SetSadowColor
	 void                      SetFontColor ( unsigned char _R, unsigned char _G, unsigned char _B, unsigned char _A );		//  GUIWarfareControls.BTMultiLineEditBoxHK.SetFontColor
	 void                      SetDefaultFontColor (  );                         		//  GUIWarfareControls.BTMultiLineEditBoxHK.SetDefaultFontColor
}; // Size: 0x0118

// Class GUIWarfareControls.PageOnWindow
class DLL_IMPORT UPageOnWindow : public UObject
{
public:
	class UBTWindowHK*                                 Last;                                             		// 0x002C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UBTWindowHK* >                 WindowList;                                       		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
}; // Size: 0x0010

// Class GUIWarfareControls.BTWindowErrorDefineHK
class DLL_IMPORT UBTWindowErrorDefineHK : public UBTWindowInfoHK
{
public:
	struct FString                                     strErrorTitle[ 0x02 ];                            		// 0x04C4 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strErrorDefine[ 0x4B0 ];                          		// 0x04DC ( 0x3840 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      ShowErrorMsg ( class UGUIController* con, struct FString ErrorMsg, unsigned char titleID );		//  GUIWarfareControls.BTWindowErrorDefineHK.ShowErrorMsg
	 void                      ShowError ( class UGUIController* con, int errorCode, unsigned char titleID );		//  GUIWarfareControls.BTWindowErrorDefineHK.ShowError
	 struct FString            GetFormatString ( int Code, struct FString arg0, struct FString arg1, struct FString arg2 );		//  GUIWarfareControls.BTWindowErrorDefineHK.GetFormatString
	 bool                      ExceptionCondtion ( int errorCode );              		//  GUIWarfareControls.BTWindowErrorDefineHK.ExceptionCondtion
	 void                      SetContentText_Instance ( int Title, int Code, struct FString arg0, struct FString arg1, struct FString arg2, struct FString arg3 );		//  GUIWarfareControls.BTWindowErrorDefineHK.SetContentText_Instance
}; // Size: 0x3858

// Class GUIWarfareControls.BTWindowWebBrowser
class DLL_IMPORT UBTWindowWebBrowser : public UBTWindowHK
{
public:
	struct FString                                     strClose;                                         		// 0x04AC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      AllowOpen ( struct FString MenuClass );           		//  GUIWarfareControls.BTWindowWebBrowser.AllowOpen
	 void                      OpenWeb ( struct FString openURL, int Left, int Top, int Right, int Bottom );		//  GUIWarfareControls.BTWindowWebBrowser.OpenWeb
	 void                      OpenWebWindow ( class UGUIController* Controller, struct FString openURL, int Left, int Top, int Right, int Bottom, struct FString Title );		//  GUIWarfareControls.BTWindowWebBrowser.OpenWebWindow
	 bool                      ButtonOK_OnClick ( class UGUIComponent* Sender ); 		//  GUIWarfareControls.BTWindowWebBrowser.ButtonOK_OnClick
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowWebBrowser.InitComponent
}; // Size: 0x000C

// Class GUIWarfareControls.BTTabPanelHK
class DLL_IMPORT UBTTabPanelHK : public UGUITabPanel
{
public:
	int                                                TabID;                                            		// 0x0330 ( 0x0004 ) 
	unsigned long                                      bSelect:1;                                        		// 0x0334 ( 0x0004 )  [0x00000001]

	// UScript Functions
	 class UBTOwnerDrawCaptionButtonHK* NewButtonComponent ( struct FFloatBox fbNewCompo, float RenderWeight );		//  GUIWarfareControls.BTTabPanelHK.NewButtonComponent
	 class UBTOwnerDrawImageHK* NewLabelComponent ( struct FFloatBox fbNewCompo, struct FImage bgImg, float RenderWeight );		//  GUIWarfareControls.BTTabPanelHK.NewLabelComponent
	 void                      TabGroups_OnSelect (  );                          		//  GUIWarfareControls.BTTabPanelHK.TabGroups_OnSelect
}; // Size: 0x0008

// Class GUIWarfareControls.BTTPChatHK
class DLL_IMPORT UBTTPChatHK : public UBTTabPanelHK
{
public:
	class UCanvas*                                     saveC;                                            		// 0x0338 ( 0x0004 ) 
	float                                              StartAniTime;                                     		// 0x033C ( 0x0004 ) 
	float                                              StartAniTimeOffset;                               		// 0x0340 ( 0x0004 ) 
	float                                              SlideAniTime;                                     		// 0x0344 ( 0x0004 ) 
	unsigned long                                      bShowChatState:1;                                 		// 0x0348 ( 0x0004 )  [0x00000001]
	unsigned long                                      bShowAni:1;                                       		// 0x0348 ( 0x0004 )  [0x00000002]
	class TArray< struct FFloatBox >                   fbButtonChatStateArray;                           		// 0x034C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FFloatBox >                   fbSnapShotButtonChatStateArray;                   		// 0x0358 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UBTOwnerDrawCaptionButtonHK* > ButtonChatStateArray;                             		// 0x0364 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonChatState;                                  		// 0x0370 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         BackgroundImage[ 0x02 ];                          		// 0x0374 ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UTabControlMocker*                           TabControl;                                       		// 0x037C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class TArray< class UBTOwnerDrawCaptionButtonHK* > ButtonChat;                                       		// 0x0380 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UBTAutoScrollListHK* >         ASLChat;                                          		// 0x038C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTChatEditBoxHK*                            InputBox;                                         		// 0x0398 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strChatState[ 0x07 ];                             		// 0x039C ( 0x0054 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strAll;                                           		// 0x03F0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strWhisper;                                       		// 0x03FC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClan;                                          		// 0x0408 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class TArray< struct FColoredChatText >            ccText;                                           		// 0x0414 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ChangeTab_OnClick__Delegate;                    		// 0x0420 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnChageChatMode__Delegate;                      		// 0x0428 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      Internal_DeActivate (  );                         		//  GUIWarfareControls.BTTPChatHK.Internal_DeActivate
	 bool                      Internal_OnPostDraw ( class UCanvas* C );         		//  GUIWarfareControls.BTTPChatHK.Internal_OnPostDraw
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfareControls.BTTPChatHK.Internal_OnPreDraw
	 struct FFloatBox          FloatBoxMultiply ( float B, struct FFloatBox* A );		//  GUIWarfareControls.BTTPChatHK.FloatBoxMultiply
	 struct FFloatBox          FloatBoxSubstract ( struct FFloatBox* A, struct FFloatBox* B );		//  GUIWarfareControls.BTTPChatHK.FloatBoxSubstract
	 struct FFloatBox          FloatBoxAdd ( struct FFloatBox* A, struct FFloatBox* B );		//  GUIWarfareControls.BTTPChatHK.FloatBoxAdd
	 void                      ClearAll (  );                                    		//  GUIWarfareControls.BTTPChatHK.ClearAll
	 void                      SetChatState ( int ChatState );                   		//  GUIWarfareControls.BTTPChatHK.SetChatState
	 bool                      ButtonChatState_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPChatHK.ButtonChatState_OnClick
	 bool                      ButtonChatStateArray_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPChatHK.ButtonChatStateArray_OnClick
	 bool                      ButttonChat_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPChatHK.ButttonChat_OnClick
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTTPChatHK.InitComponent
	 void                      SetEditText ( struct FString Chat );              		//  GUIWarfareControls.BTTPChatHK.SetEditText
	 void                      AddChatHistory ( int Panel, struct FString Chat, class FColor tcolor );		//  GUIWarfareControls.BTTPChatHK.AddChatHistory
	 void                      AddChatHistoryNoColor ( int Panel, struct FString Chat );		//  GUIWarfareControls.BTTPChatHK.AddChatHistoryNoColor
	 void                      OnChageChatMode ( int ChatMode );                 		//  GUIWarfareControls.BTTPChatHK.OnChageChatMode
	 void                      ChangeTab_OnClick ( int TabIndex );               		//  GUIWarfareControls.BTTPChatHK.ChangeTab_OnClick
}; // Size: 0x00F8

// Class GUIWarfareControls.BTWindowStateHK
class DLL_IMPORT UBTWindowStateHK : public UBTWindowHK
{
public:
	unsigned long                                      bChangeText:1;                                    		// 0x04AC ( 0x0004 )  [0x00000001]
	struct FFloatBox                                   fbBackgroundImage2;                               		// 0x04B0 ( 0x0010 ) 
	class UBTOwnerDrawImageHK*                         LabelInfo;                                        		// 0x04C0 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]

	// UScript Functions
	 bool                      Internal_OnKeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfareControls.BTWindowStateHK.Internal_OnKeyEvent
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfareControls.BTWindowStateHK.Internal_OnPreDraw
	 void                      ShowWindow ( class UGUIController* con, struct FString Msg );		//  GUIWarfareControls.BTWindowStateHK.ShowWindow
	 void                      UpdateRoomLobbyWindow (  );                       		//  GUIWarfareControls.BTWindowStateHK.UpdateRoomLobbyWindow
	 void                      UpdateDefaultWindow (  );                         		//  GUIWarfareControls.BTWindowStateHK.UpdateDefaultWindow
	 void                      SetData ( struct FString Msg );                   		//  GUIWarfareControls.BTWindowStateHK.SetData
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowStateHK.InitComponent
}; // Size: 0x0018

// Class GUIWarfareControls.BTWindowAutoStateHK
class DLL_IMPORT UBTWindowAutoStateHK : public UBTWindowStateHK
{
public:
	struct FString                                     strClientDefine[ 0x0F ];                          		// 0x04C4 ( 0x00B4 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      ShowState ( class UGUIController* con, int Code, struct FString arg0, struct FString arg1, struct FString arg2 );		//  GUIWarfareControls.BTWindowAutoStateHK.ShowState
	 struct FString            GetFormatString ( int Code, struct FString arg0, struct FString arg1, struct FString arg2 );		//  GUIWarfareControls.BTWindowAutoStateHK.GetFormatString
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowAutoStateHK.InitComponent
}; // Size: 0x00B4

// Class GUIWarfareControls.BTTPTopMenuHK
class DLL_IMPORT UBTTPTopMenuHK : public UGUITabPanel
{
public:
	class UBTOwnerDrawImageHK*                         LabelNewMail;                                     		// 0x0330 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 Quest;                                            		// 0x0334 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 PostBox;                                          		// 0x0338 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 Shop;                                             		// 0x033C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 Inventory;                                        		// 0x0340 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 Clan;                                             		// 0x0344 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 Option;                                           		// 0x0348 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 GoBack;                                           		// 0x034C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 Exit;                                             		// 0x0350 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         TopBgDeco;                                        		// 0x0354 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strShop;                                          		// 0x0358 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strInven;                                         		// 0x0364 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonList[ 0x08 ];                               		// 0x0370 ( 0x0020 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strTooltip[ 0x08 ];                               		// 0x0390 ( 0x0060 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTRODecorateStringHK*                       btToolTip;                                        		// 0x03F0 ( 0x0004 ) 
	struct FScriptDelegate                             __HeaderButton_OnClick__Delegate;                 		// 0x03F4 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTTPTopMenuHK.InitComponent
	 void                      Internal_OnRendered ( class UCanvas* Canvas );    		//  GUIWarfareControls.BTTPTopMenuHK.Internal_OnRendered
	 void                      SetNewMailArrived ( bool bNewMail );              		//  GUIWarfareControls.BTTPTopMenuHK.SetNewMailArrived
	 bool                      TopMenuButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPTopMenuHK.TopMenuButton_OnClick
	 bool                      HeaderButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPTopMenuHK.HeaderButton_OnClick
}; // Size: 0x00CC

// Class GUIWarfareControls.BTWindowDefineStateHK
class DLL_IMPORT UBTWindowDefineStateHK : public UBTWindowStateHK
{
public:
	struct FString                                     strClientDefine[ 0x0F ];                          		// 0x04C4 ( 0x00B4 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      ShowState ( class UGUIController* con, int Code, struct FString arg0, struct FString arg1, struct FString arg2 );		//  GUIWarfareControls.BTWindowDefineStateHK.ShowState
	 struct FString            GetFormatString ( int Code, struct FString arg0, struct FString arg1, struct FString arg2 );		//  GUIWarfareControls.BTWindowDefineStateHK.GetFormatString
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowDefineStateHK.InitComponent
}; // Size: 0x00B4

// Class GUIWarfareControls.BTTPItemListHK
class DLL_IMPORT UBTTPItemListHK : public UGUITabPanel
{
public:
	class UBTItemImageListHK*                          ItemList;                                         		// 0x0330 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTItemCommonInfoHK*                         MyData;                                           		// 0x0334 ( 0x0004 ) 
	unsigned long                                      bAuctionList:1;                                   		// 0x0338 ( 0x0004 )  [0x00000001]
	struct FString                                     strRRMsg[ 0x08 ];                                 		// 0x033C ( 0x0060 ) [ CPF_Localized | CPF_NeedCtorLink ]
	int                                                savedRRIndex;                                     		// 0x039C ( 0x0004 ) 
	class UBTRODecorateStringHK*                       decoAuctionToolTips;                              		// 0x03A0 ( 0x0004 ) 
	int                                                OutLineHorzBorder;                                		// 0x03A4 ( 0x0004 ) 
	int                                                OutLineVertBorder;                                		// 0x03A8 ( 0x0004 ) 

	// UScript Functions
	 void                      Internal_OnRendered ( class UCanvas* C );         		//  GUIWarfareControls.BTTPItemListHK.Internal_OnRendered
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTTPItemListHK.InitComponent
	 void                      SetOutlineBorder ( int horz, int vert );          		//  GUIWarfareControls.BTTPItemListHK.SetOutlineBorder
	 void                      UpdateServerTime ( struct FBtrDouble D );         		//  GUIWarfareControls.BTTPItemListHK.UpdateServerTime
}; // Size: 0x007C

// Class GUIWarfareControls.BTWindowTodayResultHK
class DLL_IMPORT UBTWindowTodayResultHK : public UBTWindowHK
{
public:
	class UBTRODecorateStringHK*                       decoString;                                       		// 0x04AC ( 0x0004 ) 
	struct FFloatBox                                   fbLabel[ 0x02 ];                                  		// 0x04B0 ( 0x0020 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strLabel[ 0x02 ];                                 		// 0x04D0 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawImageHK*                         Label[ 0x02 ];                                    		// 0x04E8 ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelLevelBG[ 0x04 ];                           		// 0x04F0 ( 0x0040 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelLevelBG[ 0x04 ];                             		// 0x0530 ( 0x0010 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelLevelIConB[ 0x04 ];                        		// 0x0540 ( 0x0040 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelLevelIConB[ 0x04 ];                          		// 0x0580 ( 0x0010 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelLevelIConF[ 0x04 ];                        		// 0x0590 ( 0x0040 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelLevelIConF[ 0x04 ];                          		// 0x05D0 ( 0x0010 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelLevel[ 0x03 ];                             		// 0x05E0 ( 0x0030 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelLevel[ 0x03 ];                               		// 0x0610 ( 0x000C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbTPItemList[ 0x03 ];                             		// 0x061C ( 0x0030 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPItemListHK*                             TPItemList[ 0x03 ];                               		// 0x064C ( 0x000C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strExpBar;                                        		// 0x0658 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbExpBar;                                         		// 0x0664 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTExpBarHK*                                 expbar;                                           		// 0x0674 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                iMaxLevel;                                        		// 0x0678 ( 0x0004 ) [ CPF_Const ]

	// UScript Functions
	 void                      AddItem ( int pos, int ItemID, int PartID );      		//  GUIWarfareControls.BTWindowTodayResultHK.AddItem
	 void                      UpdateData (  );                                  		//  GUIWarfareControls.BTWindowTodayResultHK.UpdateData
	 void                      TPItemList_ImageListBox_OnRendered_2 ( class UCanvas* C );		//  GUIWarfareControls.BTWindowTodayResultHK.TPItemList_ImageListBox_OnRendered_2
	 void                      TPItemList_ImageListBox_OnRendered_1 ( class UCanvas* C );		//  GUIWarfareControls.BTWindowTodayResultHK.TPItemList_ImageListBox_OnRendered_1
	 void                      TPItemList_ImageListBox_OnRendered_0 ( class UCanvas* C );		//  GUIWarfareControls.BTWindowTodayResultHK.TPItemList_ImageListBox_OnRendered_0
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowTodayResultHK.InitComponent
	 bool                      Exit_OnClick ( class UGUIComponent* Sender );     		//  GUIWarfareControls.BTWindowTodayResultHK.Exit_OnClick
	 bool                      ImageListBox_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowTodayResultHK.ImageListBox_OnClick
}; // Size: 0x01D0

// Class GUIWarfareControls.BTOwnerDrawSourceClipImageHK
class DLL_IMPORT UBTOwnerDrawSourceClipImageHK : public UBTOwnerDrawImageHK
{
public:
	struct FFloatBox                                   ClipArea;                                         		// 0x03B4 ( 0x0010 ) 

	// UScript Functions
	 void                      Internal_OnRendered ( class UCanvas* C );         		//  GUIWarfareControls.BTOwnerDrawSourceClipImageHK.Internal_OnRendered
}; // Size: 0x0010

// Class GUIWarfareControls.BTTPQuestInfoHK
class DLL_IMPORT UBTTPQuestInfoHK : public UBTTabPanelHK
{
public:
	class UTabControlMocker*                           TabControl;                                       		// 0x0338 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         BackgroundImage;                                  		// 0x033C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UBTOwnerDrawCaptionButtonHK* > ButtonCategory;                                   		// 0x0340 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTACLQuestHK*                               ACLQuest;                                         		// 0x034C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTLabelQuestDescHK*                         LabelQuestDesc;                                   		// 0x0350 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTab[ 0x06 ];                                		// 0x0354 ( 0x0018 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonClose;                                      		// 0x036C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strButtonTab[ 0x06 ];                             		// 0x0370 ( 0x0048 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strButtonClose;                                   		// 0x03B8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bSelfTopMenuOwner:1;                              		// 0x03C4 ( 0x0004 )  [0x00000001]
	unsigned long                                      bSlidingTabPanel:1;                               		// 0x03C4 ( 0x0004 )  [0x00000002]
	unsigned long                                      bShowing:1;                                       		// 0x03C4 ( 0x0004 )  [0x00000004]
	float                                              SlideTime;                                        		// 0x03C8 ( 0x0004 ) 
	float                                              SlideMultiplier;                                  		// 0x03CC ( 0x0004 ) 
	struct FFloatBox                                   ShowAWinFrame;                                    		// 0x03D0 ( 0x0010 ) 
	struct FFloatBox                                   HideAWinFrame;                                    		// 0x03E0 ( 0x0010 ) 

	// UScript Functions
	 void                      SetLabelQuestDesc ( int RowIndex );               		//  GUIWarfareControls.BTTPQuestInfoHK.SetLabelQuestDesc
	 void                      Hide (  );                                        		//  GUIWarfareControls.BTTPQuestInfoHK.Hide
	 void                      Show (  );                                        		//  GUIWarfareControls.BTTPQuestInfoHK.Show
	 void                      SetMatchMaker ( class UwMatchMaker* MM );         		//  GUIWarfareControls.BTTPQuestInfoHK.SetMatchMaker
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfareControls.BTTPQuestInfoHK.Internal_OnPreDraw
	 bool                      ACLQuest_OnClick ( class UGUIComponent* Sender ); 		//  GUIWarfareControls.BTTPQuestInfoHK.ACLQuest_OnClick
	 bool                      ButtonClose_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPQuestInfoHK.ButtonClose_OnClick
	 class UGUIComponent*      GetTopMenuOwner (  );                             		//  GUIWarfareControls.BTTPQuestInfoHK.GetTopMenuOwner
	 void                      SetSlideTabPanel (  );                            		//  GUIWarfareControls.BTTPQuestInfoHK.SetSlideTabPanel
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTTPQuestInfoHK.InitComponent
	 bool                      ButtonTab_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPQuestInfoHK.ButtonTab_OnClick
}; // Size: 0x00B8

// Class GUIWarfareControls.BTTPTeamMemberList
class DLL_IMPORT UBTTPTeamMemberList : public UBTTabPanelHK
{
public:
	class UBTOwnerDrawImageHK*                         LabelTop[ 0x06 ];                                 		// 0x0338 ( 0x0018 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbButtonTop[ 0x06 ];                              		// 0x0350 ( 0x0060 ) 
	struct FString                                     strButtonTop[ 0x06 ];                             		// 0x03B0 ( 0x0048 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTop[ 0x06 ];                                		// 0x03F8 ( 0x0018 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTACLTeamMemberListHK*                      ACLList;                                          		// 0x0410 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMTeamMemberListHK*                       CMList;                                           		// 0x0414 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FScriptDelegate                             __OnPopup__Delegate;                              		// 0x0418 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnNonSelectPopup__Delegate;                     		// 0x0420 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupCheck__Delegate;                         		// 0x0428 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 int                       GetUserCount (  );                                		//  GUIWarfareControls.BTTPTeamMemberList.GetUserCount
	 void                      ContextMenu_OnSelected ( int ContextMenuIndex );  		//  GUIWarfareControls.BTTPTeamMemberList.ContextMenu_OnSelected
	 void                      OnPopupCheck ( class UBTACLTeamMemberListHK* acl, class UBTCMTeamMemberListHK* cm );		//  GUIWarfareControls.BTTPTeamMemberList.OnPopupCheck
	 void                      OnNonSelectPopup ( int ContextMenuIndex, class UBTACLTeamMemberListHK* acl );		//  GUIWarfareControls.BTTPTeamMemberList.OnNonSelectPopup
	 void                      OnPopup ( int ContextMenuIndex, class UBTACLTeamMemberListHK* acl );		//  GUIWarfareControls.BTTPTeamMemberList.OnPopup
	 bool                      ContextMenu_OnClose ( class UGUIContextMenu* Sender );		//  GUIWarfareControls.BTTPTeamMemberList.ContextMenu_OnClose
	 bool                      ContextMenu_OnOpen ( class UGUIContextMenu* Sender );		//  GUIWarfareControls.BTTPTeamMemberList.ContextMenu_OnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTTPTeamMemberList.InitComponent
	 bool                      ButtonTop_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPTeamMemberList.ButtonTop_OnClick
}; // Size: 0x00F8

// Class GUIWarfareControls.BTAutoColumnListDataHK
class DLL_IMPORT UBTAutoColumnListDataHK : public UObject
{
public:
	unsigned long                                      bCustomSpliter:1;                                 		// 0x002C ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned long                                      bSpliter:1;                                       		// 0x002C ( 0x0004 )  [0x00000002][ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	int                                                SpliterIndex;                                     		// 0x0030 ( 0x0004 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class TArray< struct FACLData >                    DataPerColumn;                                    		// 0x0034 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FImage                                      BackgroundImage;                                  		// 0x0040 ( 0x0020 ) [ CPF_Edit ]

	// UScript Functions
	 void                      InitData ( int Index );                           		//  GUIWarfareControls.BTAutoColumnListDataHK.InitData
	 void                      Init ( int ColumnCount );                         		//  GUIWarfareControls.BTAutoColumnListDataHK.Init
}; // Size: 0x0034

// Class GUIWarfareControls.BTTPMessengerHK
class DLL_IMPORT UBTTPMessengerHK : public UGUITabPanel
{
public:
	class UBTOwnerDrawCaptionButtonHK*                 ButtonMainPCBang;                                 		// 0x0330 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTStretchedImageHK*                         BackgroundImage;                                  		// 0x0334 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTStretchedImageHK*                         ListBoundImage[ 0x03 ];                           		// 0x0338 ( 0x000C ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UTabControlMocker*                           TabControl;                                       		// 0x0344 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class TArray< class UBTOwnerDrawCaptionButtonHK* > ButtonMsg;                                        		// 0x0348 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UBTAutoColumnListHK* >         ACLMsg;                                           		// 0x0354 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UBTContextMenuHK* >            CMMsg;                                            		// 0x0360 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UwMatchMaker*                                MM;                                               		// 0x036C ( 0x0004 ) 
	struct FString                                     strConnected;                                     		// 0x0370 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strFriend;                                        		// 0x037C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClan;                                          		// 0x0388 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strDeny;                                          		// 0x0394 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strPCBang;                                        		// 0x03A0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strOffLine;                                       		// 0x03AC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strLogout;                                        		// 0x03B8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strMainPCBang[ 0x04 ];                            		// 0x03C4 ( 0x0030 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupChannel__Delegate;                       		// 0x03F4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupFriend__Delegate;                        		// 0x03FC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupClan__Delegate;                          		// 0x0404 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupPCBang__Delegate;                        		// 0x040C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupChannelCheck__Delegate;                  		// 0x0414 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupFriendCheck__Delegate;                   		// 0x041C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupClanCheck__Delegate;                     		// 0x0424 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPopupPCBangCheck__Delegate;                   		// 0x042C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ChannelUserList_OnHitBottom__Delegate;          		// 0x0434 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ChannelUserList_OnHitTop__Delegate;             		// 0x043C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ChannelUserList_OnAdjustWindow__Delegate;       		// 0x0444 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      SetUserServerInfo ( struct FString szServername, struct FString szServerShortName, struct FString szServerIP, int serverPort, unsigned char CurPos, unsigned char CurState, int ChannelNum, struct FString szChannelNickName, int GameRoomNum );		//  GUIWarfareControls.BTTPMessengerHK.SetUserServerInfo
	 void                      HideTabButton ( unsigned char eTabMenuType );     		//  GUIWarfareControls.BTTPMessengerHK.HideTabButton
	 void                      ShowTabButton ( unsigned char eTabMenuType );     		//  GUIWarfareControls.BTTPMessengerHK.ShowTabButton
	 void                      UpdateTabButtonPosition (  );                     		//  GUIWarfareControls.BTTPMessengerHK.UpdateTabButtonPosition
	 void                      Internal_OnVisiblePanelChanged ( int Index );     		//  GUIWarfareControls.BTTPMessengerHK.Internal_OnVisiblePanelChanged
	 void                      UpdatePCBangInfo (  );                            		//  GUIWarfareControls.BTTPMessengerHK.UpdatePCBangInfo
	 bool                      ButtonMainPCBang_Playing_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPMessengerHK.ButtonMainPCBang_Playing_OnClick
	 bool                      ButtonMainPCBang_Change_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPMessengerHK.ButtonMainPCBang_Change_OnClick
	 bool                      ButtonMainPCBang_Register_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPMessengerHK.ButtonMainPCBang_Register_OnClick
	 bool                      BTWindowDefineARHK_18_19_OnOK ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTTPMessengerHK.BTWindowDefineARHK_18_19_OnOK
	 void                      AddAclMsgMenu ( int Index );                      		//  GUIWarfareControls.BTTPMessengerHK.AddAclMsgMenu
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTTPMessengerHK.InitComponent
	 void                      BTACLMessengerChannelHK_OnHitTop ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTTPMessengerHK.BTACLMessengerChannelHK_OnHitTop
	 void                      BTACLMessengerChannelHK_OnHitBottom ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTTPMessengerHK.BTACLMessengerChannelHK_OnHitBottom
	 void                      BTACLMessengerChannelHK_OnAdjustWindow ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTTPMessengerHK.BTACLMessengerChannelHK_OnAdjustWindow
	 void                      ChannelUserList_OnAdjustWindow ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTTPMessengerHK.ChannelUserList_OnAdjustWindow
	 void                      ChannelUserList_OnHitTop ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTTPMessengerHK.ChannelUserList_OnHitTop
	 void                      ChannelUserList_OnHitBottom ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTTPMessengerHK.ChannelUserList_OnHitBottom
	 void                      ContextMenu_OnSelected ( int ContextMenuIndex );  		//  GUIWarfareControls.BTTPMessengerHK.ContextMenu_OnSelected
	 void                      OnPopupPCBangCheck ( class UBTACLMessengerPCBangHK* acl, class UBTCMMessengerPCBangHK* cm );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupPCBangCheck
	 void                      OnPopupClanCheck ( class UBTACLMessengerClanHK* acl, class UBTCMMessengerClanHK* cm );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupClanCheck
	 void                      OnPopupFriendCheck ( class UBTACLMessengerFriendHK* acl, class UBTCMMessengerFriendHK* cm );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupFriendCheck
	 void                      OnPopupChannelCheck ( class UBTACLMessengerChannelHK* acl, class UBTCMMessengerChannelHK* cm );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupChannelCheck
	 void                      OnPopupCheck ( int Panel, class UBTAutoColumnListHK* acl );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupCheck
	 void                      OnPopupPCBang ( int ContextMenuIndex, class UBTACLMessengerPCBangHK* acl );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupPCBang
	 void                      OnPopupClan ( int ContextMenuIndex, class UBTACLMessengerClanHK* acl );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupClan
	 void                      OnPopupFriend ( int ContextMenuIndex, class UBTACLMessengerFriendHK* acl );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupFriend
	 void                      OnPopupChannel ( int ContextMenuIndex, class UBTACLMessengerChannelHK* acl );		//  GUIWarfareControls.BTTPMessengerHK.OnPopupChannel
	 bool                      ContextMenu_OnClose ( class UGUIContextMenu* Sender );		//  GUIWarfareControls.BTTPMessengerHK.ContextMenu_OnClose
	 bool                      ContextMenu_OnOpen ( class UGUIContextMenu* Sender );		//  GUIWarfareControls.BTTPMessengerHK.ContextMenu_OnOpen
	 void                      LoadPos ( unsigned char eTabMenuType );           		//  GUIWarfareControls.BTTPMessengerHK.LoadPos
	 void                      SavePos ( unsigned char eTabMenuType );           		//  GUIWarfareControls.BTTPMessengerHK.SavePos
	 void                      RemoveAll ( unsigned char eTabMenuType );         		//  GUIWarfareControls.BTTPMessengerHK.RemoveAll
	 void                      RemoveChannelUser ( int UID );                    		//  GUIWarfareControls.BTTPMessengerHK.RemoveChannelUser
	 bool                      IsFriendlyUser ( struct FString UserName, struct FString ClanName, int ListIdx );		//  GUIWarfareControls.BTTPMessengerHK.IsFriendlyUser
	 void                      UpdateFriendlyUser ( int ListIdx );               		//  GUIWarfareControls.BTTPMessengerHK.UpdateFriendlyUser
	 int                       FindFriendFromUserName ( struct FString UserName );		//  GUIWarfareControls.BTTPMessengerHK.FindFriendFromUserName
	 void                      AddPCBangUser ( struct FString UserName, int ClanMark, int ClanBG, int ClanBL, struct FString ClanName, int Level, struct FString ServerName, struct FString ServerIP, int serverPort, int CurPos, int ChannelNum, struct FString ChannelNickName, int RoomNum, int ClanGrade, int ClanWin, int ClanLose, unsigned char IsLookForClan, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfareControls.BTTPMessengerHK.AddPCBangUser
	 void                      AddClanUser ( struct FString UserName, unsigned char IsLogOn, int Level, int ClanGrade, int ClanWinCnt, int ClanLoseCnt, int LevelMarkID, int TitleMarkID );		//  GUIWarfareControls.BTTPMessengerHK.AddClanUser
	 void                      AddFriendUser ( struct FString UserName, unsigned char IsLogOn, int ClanMark, int ClanBG, int ClanBL, struct FString ClanName, int Level, int ClanGrade, unsigned char IsLookForClan, int ClanLevel, int LevelMarkID );		//  GUIWarfareControls.BTTPMessengerHK.AddFriendUser
	 void                      ReplaceChannelUser ( int Index, int ClanPattern, int ClanBG, int ClanBL, struct FString ClanName, int Level, struct FString UserName, int UID, int ClanGrade, int ClanWinCnt, int ClanLoseCnt, unsigned char IsLookForClan, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfareControls.BTTPMessengerHK.ReplaceChannelUser
	 class UBTAutoColumnListHK* GetMessengerType ( unsigned char CommunityType ); 		//  GUIWarfareControls.BTTPMessengerHK.GetMessengerType
	 void                      ReplaceClanName ( unsigned char CommunityType, struct FString OldClanName, struct FString NewClanname );		//  GUIWarfareControls.BTTPMessengerHK.ReplaceClanName
	 void                      ReplaceClanLevel ( unsigned char CommunityType, struct FString ClanName, int ClanLevel );		//  GUIWarfareControls.BTTPMessengerHK.ReplaceClanLevel
	 void                      ReplaceMyClanName ( unsigned char CommunityType, struct FString UserName, struct FString NewClanname );		//  GUIWarfareControls.BTTPMessengerHK.ReplaceMyClanName
	 void                      ReplaceUserNickName ( unsigned char CommunityType, struct FString OldUserName, struct FString NewUserName );		//  GUIWarfareControls.BTTPMessengerHK.ReplaceUserNickName
	 void                      AddChannelUser ( int ClanPattern, int ClanBG, int ClanBL, struct FString ClanName, int Level, struct FString UserName, int UID, int ClanGrade, int ClanWinCnt, int ClanLoseCnt, unsigned char IsLookForClan, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfareControls.BTTPMessengerHK.AddChannelUser
	 int                       FindChannelUser ( int UID );                      		//  GUIWarfareControls.BTTPMessengerHK.FindChannelUser
}; // Size: 0x011C

// Class GUIWarfareControls.TabControlMocker
class DLL_IMPORT UTabControlMocker : public UGUIComponent
{
public:
	class TArray< class UGUIButton* >                  Buttons;                                          		// 0x02BC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UGUIPanel* >                   Panels;                                           		// 0x02C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UGUIButton*                                  VisiblePanelsButton;                              		// 0x02D4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIPanel*                                   VisiblePanel;                                     		// 0x02D8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                CurrentTabIndex;                                  		// 0x02DC ( 0x0004 ) 
	struct FScriptDelegate                             __OnVisiblePanelChanged__Delegate;                		// 0x02E0 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnChangedTab__Delegate;                         		// 0x02E8 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      TabButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.TabControlMocker.TabButton_OnClick
	 void                      OnChangedTab ( int CurrentIndex, int PrevIndex ); 		//  GUIWarfareControls.TabControlMocker.OnChangedTab
	 int                       GetCurrentTabIndex (  );                          		//  GUIWarfareControls.TabControlMocker.GetCurrentTabIndex
	 int                       GetVisiblePanelIndex (  );                        		//  GUIWarfareControls.TabControlMocker.GetVisiblePanelIndex
	 class UGUIPanel*          GetVisiblePanel (  );                             		//  GUIWarfareControls.TabControlMocker.GetVisiblePanel
	 void                      SetVisiblePanel ( int Index, bool bChange );      		//  GUIWarfareControls.TabControlMocker.SetVisiblePanel
	 void                      Clear (  );                                       		//  GUIWarfareControls.TabControlMocker.Clear
	 void                      BindTabButtonAndPanel ( class UGUIButton* TabButton, class UGUITabPanel* Panel );		//  GUIWarfareControls.TabControlMocker.BindTabButtonAndPanel
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.TabControlMocker.InitComponent
	 void                      OnVisiblePanelChanged ( int Index );              		//  GUIWarfareControls.TabControlMocker.OnVisiblePanelChanged
}; // Size: 0x0034

// Class GUIWarfareControls.BTContextMenuHK
class DLL_IMPORT UBTContextMenuHK : public UGUIContextMenu
{
public:
	unsigned long                                      bCondition:1;                                     		// 0x0304 ( 0x0004 )  [0x00000001]
	int                                                OpenMouseX;                                       		// 0x0308 ( 0x0004 ) 
	int                                                OpenMouseY;                                       		// 0x030C ( 0x0004 ) 
	int                                                ItemWidth;                                        		// 0x0310 ( 0x0004 ) 
	int                                                SelectedIndex;                                    		// 0x0314 ( 0x0004 ) 
	int                                                FontSize[ 0x03 ];                                 		// 0x0318 ( 0x000C ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       FontColor[ 0x03 ];                                		// 0x0324 ( 0x000C ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class FColor                                       FontShadowColor[ 0x03 ];                          		// 0x0330 ( 0x000C ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	int                                                CaptionPadding[ 0x04 ];                           		// 0x033C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned char                                      CaptionDrawType;                                  		// 0x034C ( 0x0001 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class TArray< unsigned char >                      ContextItemsState;                                		// 0x0350 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FImage                                      buttonImage[ 0x03 ];                              		// 0x035C ( 0x0060 ) 
	struct FImage                                      BackgroundImage;                                  		// 0x03BC ( 0x0020 ) 
	struct FScriptDelegate                             __OnSelected__Delegate;                           		// 0x03DC ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      RemoveItemByIndex ( int Index );                  		//  GUIWarfareControls.BTContextMenuHK.RemoveItemByIndex
	 bool                      RemoveItemByName ( struct FString ItemName );     		//  GUIWarfareControls.BTContextMenuHK.RemoveItemByName
	 int                       InsertItem ( struct FString NewItem, int Index ); 		//  GUIWarfareControls.BTContextMenuHK.InsertItem
	 int                       AddItem ( struct FString NewItem );               		//  GUIWarfareControls.BTContextMenuHK.AddItem
	 bool                      ChangeStateByName ( struct FString ItemName, unsigned char st );		//  GUIWarfareControls.BTContextMenuHK.ChangeStateByName
	 bool                      ChangeStateByIndex ( int Index, unsigned char st );		//  GUIWarfareControls.BTContextMenuHK.ChangeStateByIndex
	 unsigned char             GetItemState ( int Index );                       		//  GUIWarfareControls.BTContextMenuHK.GetItemState
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTContextMenuHK.InitComponent
	 bool                      OnDraw ( class UCanvas* C );                      		//  GUIWarfareControls.BTContextMenuHK.OnDraw
	 void                      OpenContextMenu ( int MouseX, int MouseY );       		//  GUIWarfareControls.BTContextMenuHK.OpenContextMenu
	 bool                      OnPreDraw ( class UCanvas* C );                   		//  GUIWarfareControls.BTContextMenuHK.OnPreDraw
	 void                      OnSelect ( class UGUIContextMenu* Sender, int ClickIndex );		//  GUIWarfareControls.BTContextMenuHK.OnSelect
	 void                      OnSelected ( int SelectedIndex );                 		//  GUIWarfareControls.BTContextMenuHK.OnSelected
}; // Size: 0x00E0

// Class GUIWarfareControls.BTCMMessengerOnOffline
class DLL_IMPORT UBTCMMessengerOnOffline : public UBTContextMenuHK
{
public:
	int                                                nOnLine;                                          		// 0x03E4 ( 0x0004 ) 
	struct FString                                     strOnOff[ 0x03 ];                                 		// 0x03E8 ( 0x0024 ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned char                                      nPopupSize[ 0x02 ];                               		// 0x040C ( 0x0002 ) 
	struct FString                                     strLineText[ 0x02 ];                              		// 0x0410 ( 0x0018 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      IsActiveMoveRoomState (  );                       		//  GUIWarfareControls.BTCMMessengerOnOffline.IsActiveMoveRoomState
	 bool                      IsActiveInviteState (  );                         		//  GUIWarfareControls.BTCMMessengerOnOffline.IsActiveInviteState
	 void                      ChangeMoveRoomState ( bool bActive );             		//  GUIWarfareControls.BTCMMessengerOnOffline.ChangeMoveRoomState
	 void                      ChangeInviteState ( bool bActive );               		//  GUIWarfareControls.BTCMMessengerOnOffline.ChangeInviteState
	 void                      ChangeWispherState ( bool bActive );              		//  GUIWarfareControls.BTCMMessengerOnOffline.ChangeWispherState
	 void                      SetLocation ( struct FString strChannelName, int GameRoomNum );		//  GUIWarfareControls.BTCMMessengerOnOffline.SetLocation
	 void                      SetLogOnState ( int nLogOnState );                		//  GUIWarfareControls.BTCMMessengerOnOffline.SetLogOnState
	 bool                      OnDraw ( class UCanvas* C );                      		//  GUIWarfareControls.BTCMMessengerOnOffline.OnDraw
}; // Size: 0x0044

// Class GUIWarfareControls.BTAutoColumnListHK
class DLL_IMPORT UBTAutoColumnListHK : public UGUITabPanel
{
public:
	struct FSaveListPos                                slp;                                              		// 0x0330 ( 0x0020 ) 
	unsigned long                                      bAlwaysActiveCursor:1;                            		// 0x0350 ( 0x0004 )  [0x00000001]
	unsigned long                                      bActiveCursor:1;                                  		// 0x0350 ( 0x0004 )  [0x00000002]
	class UBTStretchedImageHK*                         BackgroundImage;                                  		// 0x0354 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIMultiColumnListBox*                      MultiColumnBox;                                   		// 0x0358 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIMultiColumnList*                         MultiColumnList;                                  		// 0x035C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UBTAutoColumnListHeaderHK* >   ACLHeaderList;                                    		// 0x0360 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UBTAutoColumnListDataHK* >     ACLRowList;                                       		// 0x036C ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              saveTime;                                         		// 0x0378 ( 0x0004 ) 
	unsigned long                                      bSaveMode:1;                                      		// 0x037C ( 0x0004 )  [0x00000001]
	int                                                maxFontSize;                                      		// 0x0380 ( 0x0004 ) 
	class FColor                                       DefaultColor;                                     		// 0x0384 ( 0x0004 ) 
	int                                                selectIndex;                                      		// 0x0388 ( 0x0004 ) 
	int                                                SelectIndexX;                                     		// 0x038C ( 0x0004 ) 
	int                                                SelectIndexY;                                     		// 0x0390 ( 0x0004 ) 
	int                                                LastSelectedIndex;                                		// 0x0394 ( 0x0004 ) 
	int                                                LastSelectedIndexHistory;                         		// 0x0398 ( 0x0004 ) 
	struct FImage                                      SelectImage;                                      		// 0x039C ( 0x0020 ) 
	struct FImage                                      LastSelectedImage;                                		// 0x03BC ( 0x0020 ) 
	struct FImage                                      DefaultRowImage;                                  		// 0x03DC ( 0x0020 ) 
	struct FImage                                      ClickImage;                                       		// 0x03FC ( 0x0020 ) 
	struct FImage                                      MarkMe;                                           		// 0x041C ( 0x0020 ) 
	unsigned long                                      isFullRoom:1;                                     		// 0x043C ( 0x0004 )  [0x00000001]
	struct FScriptDelegate                             __SpliterDraw__Delegate;                          		// 0x0440 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnAdjustWindow__Delegate;                       		// 0x0448 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnHitBottom__Delegate;                          		// 0x0450 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnHitTop__Delegate;                             		// 0x0458 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      OnHitTop ( int Top, int Count, int itemperpage ); 		//  GUIWarfareControls.BTAutoColumnListHK.OnHitTop
	 void                      OnHitBottom ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTAutoColumnListHK.OnHitBottom
	 void                      OnAdjustWindow ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTAutoColumnListHK.OnAdjustWindow
	 void                      MultiColumnList_OnAdjustTop ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnAdjustTop
	 void                      MultiColumnList_InternalDeactivate (  );          		//  GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_InternalDeactivate
	 void                      MultiColumnList_InternalActivate (  );            		//  GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_InternalActivate
	 void                      MultiColumnList_OnDrawItem ( class UCanvas* C, int Item, float X, float Y, float W, float HT, bool bSelected, bool bPending );		//  GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnDrawItem
	 void                      DrawDefaultRowImage ( class UCanvas* C );         		//  GUIWarfareControls.BTAutoColumnListHK.DrawDefaultRowImage
	 bool                      BackgroundImage_OnDraw ( class UCanvas* C );      		//  GUIWarfareControls.BTAutoColumnListHK.BackgroundImage_OnDraw
	 void                      SpliterDraw ( class UCanvas* C, float X, float Y, float W, float HT, int SpliterIndex );		//  GUIWarfareControls.BTAutoColumnListHK.SpliterDraw
	 float                     GetItemHeight ( class UCanvas* C );               		//  GUIWarfareControls.BTAutoColumnListHK.GetItemHeight
	 bool                      MultiColumnList_OnPreDraw ( class UCanvas* C );   		//  GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnPreDraw
	 int                       FindLastPressedColumn (  );                       		//  GUIWarfareControls.BTAutoColumnListHK.FindLastPressedColumn
	 bool                      MultiColumnList_OnDblClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnDblClick
	 bool                      MultiColumnList_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnClick
	 void                      NormalizeColumnPerc (  );                         		//  GUIWarfareControls.BTAutoColumnListHK.NormalizeColumnPerc
	 void                      NormalizeMultiColumnPerc (  );                    		//  GUIWarfareControls.BTAutoColumnListHK.NormalizeMultiColumnPerc
	 int                       BinarySearchIndexBySelectLocation ( int ColumnIndex, int valueIndex, int dataIndex );		//  GUIWarfareControls.BTAutoColumnListHK.BinarySearchIndexBySelectLocation
	 int                       ReverseBinarySearchIndexBySelectLocation ( int ColumnIndex, int valueIndex, int dataIndex );		//  GUIWarfareControls.BTAutoColumnListHK.ReverseBinarySearchIndexBySelectLocation
	 void                      SortRoom (  );                                    		//  GUIWarfareControls.BTAutoColumnListHK.SortRoom
	 void                      SortBySelectLocation ( int ColumnIndex, int valueIndex, bool bReverseSort );		//  GUIWarfareControls.BTAutoColumnListHK.SortBySelectLocation
	 int                       BinarySearchIndex ( int ColumnIndex, int dataIndex );		//  GUIWarfareControls.BTAutoColumnListHK.BinarySearchIndex
	 int                       ReverseBinarySearchIndex ( int ColumnIndex, int dataIndex );		//  GUIWarfareControls.BTAutoColumnListHK.ReverseBinarySearchIndex
	 void                      SortColumn ( int ColumnIndex, bool bReverseSort );		//  GUIWarfareControls.BTAutoColumnListHK.SortColumn
	 int                       MultiCalculateIndex (  );                         		//  GUIWarfareControls.BTAutoColumnListHK.MultiCalculateIndex
	 int                       GetCurrentIndex (  );                             		//  GUIWarfareControls.BTAutoColumnListHK.GetCurrentIndex
	 class UBTAutoColumnListDataHK* GetRowByIndex ( int Index );                      		//  GUIWarfareControls.BTAutoColumnListHK.GetRowByIndex
	 void                      RemoveAll (  );                                   		//  GUIWarfareControls.BTAutoColumnListHK.RemoveAll
	 void                      RemoveRowArray ( int StartIndex, int endLength ); 		//  GUIWarfareControls.BTAutoColumnListHK.RemoveRowArray
	 void                      RemoveRow ( int Index );                          		//  GUIWarfareControls.BTAutoColumnListHK.RemoveRow
	 void                      AddRow ( class UBTAutoColumnListDataHK* Item, bool bSet, int Index );		//  GUIWarfareControls.BTAutoColumnListHK.AddRow
	 int                       AddColumn ( class UBTAutoColumnListHeaderHK* Item );		//  GUIWarfareControls.BTAutoColumnListHK.AddColumn
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTAutoColumnListHK.InitComponent
	 void                      LoadPos (  );                                     		//  GUIWarfareControls.BTAutoColumnListHK.LoadPos
	 void                      SavePos (  );                                     		//  GUIWarfareControls.BTAutoColumnListHK.SavePos
	 void                      InitScrollBar (  );                               		//  GUIWarfareControls.BTAutoColumnListHK.InitScrollBar
}; // Size: 0x0130

// Class GUIWarfareControls.BTACLMessengerCommon
class DLL_IMPORT UBTACLMessengerCommon : public UBTAutoColumnListHK
{
public:
	struct FScriptDelegate                             __deleClanName__Delegate;                         		// 0x0460 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      MultiColumnList_OnEndToolTip (  );                		//  GUIWarfareControls.BTACLMessengerCommon.MultiColumnList_OnEndToolTip
	 class UGUIToolTip*        MultiColumnList_OnBeginToolTip (  );              		//  GUIWarfareControls.BTACLMessengerCommon.MultiColumnList_OnBeginToolTip
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTACLMessengerCommon.InitComponent
	 void                      DrawClanName ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, struct FString szClanName, int row );		//  GUIWarfareControls.BTACLMessengerCommon.DrawClanName
	 void                      deleClanName ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, struct FString szClanName, int row );		//  GUIWarfareControls.BTACLMessengerCommon.deleClanName
	 struct FString            GetClanName ( int row );                          		//  GUIWarfareControls.BTACLMessengerCommon.GetClanName
	 void                      SetCurState ( int row, int Value );               		//  GUIWarfareControls.BTACLMessengerCommon.SetCurState
	 void                      SetChannelNumber ( int row, int Value );          		//  GUIWarfareControls.BTACLMessengerCommon.SetChannelNumber
	 void                      SetGameRoomNumber ( int row, int Value );         		//  GUIWarfareControls.BTACLMessengerCommon.SetGameRoomNumber
	 void                      SetServerName ( int row, struct FString Value );  		//  GUIWarfareControls.BTACLMessengerCommon.SetServerName
	 void                      SetServerIP ( int row, struct FString Value );    		//  GUIWarfareControls.BTACLMessengerCommon.SetServerIP
	 void                      SetServerPort ( int row, int Value );             		//  GUIWarfareControls.BTACLMessengerCommon.SetServerPort
	 void                      SetChannelName ( int row, struct FString Value ); 		//  GUIWarfareControls.BTACLMessengerCommon.SetChannelName
	 void                      SetCurLocationName ( int row, struct FString Value );		//  GUIWarfareControls.BTACLMessengerCommon.SetCurLocationName
	 void                      SetCurpos ( int row, int Value );                 		//  GUIWarfareControls.BTACLMessengerCommon.SetCurpos
}; // Size: 0x0008

// Class GUIWarfareControls.BTWindowRequestApprovalClanHK
class DLL_IMPORT UBTWindowRequestApprovalClanHK : public UBTWindowHK
{
public:
	struct FString                                     strLabel[ 0x0C ];                                 		// 0x04AC ( 0x0090 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabel[ 0x0C ];                                  		// 0x053C ( 0x00C0 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Label[ 0x0C ];                                    		// 0x05FC ( 0x0030 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTLabelLevelHK*                             LabelLevel;                                       		// 0x062C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbEdit[ 0x08 ];                                   		// 0x0630 ( 0x0080 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strEdit[ 0x08 ];                                  		// 0x06B0 ( 0x0060 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawTextArrayHK*                     Edit[ 0x08 ];                                     		// 0x0710 ( 0x0020 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strButtonSuspend;                                 		// 0x0730 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbButtonSuspend;                                  		// 0x073C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonSuspend;                                    		// 0x074C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       EditAddMsg;                                       		// 0x0750 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                ReqJoinUserIdx;                                   		// 0x0754 ( 0x0004 ) 
	struct FString                                     CharName;                                         		// 0x0758 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     InviteMsg;                                        		// 0x0764 ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowRequestApprovalClanHK.Internal_OnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowRequestApprovalClanHK.InitComponent
	 void                      SetCharInfo ( struct FCharInfo stCharInfo );      		//  GUIWarfareControls.BTWindowRequestApprovalClanHK.SetCharInfo
	 void                      SetData ( int ReqJoinUserIdx, struct FString CharName, struct FString Message );		//  GUIWarfareControls.BTWindowRequestApprovalClanHK.SetData
}; // Size: 0x02C4

// Class GUIWarfareControls.BTWindowFindClanHK
class DLL_IMPORT UBTWindowFindClanHK : public UBTWindowHK
{
public:
	unsigned long                                      bReceiveLock:1;                                   		// 0x04AC ( 0x0004 )  [0x00000001]
	int                                                CurrentPage;                                      		// 0x04B0 ( 0x0004 ) 
	int                                                MinPage;                                          		// 0x04B4 ( 0x0004 ) 
	int                                                MaxPage;                                          		// 0x04B8 ( 0x0004 ) 
	struct FString                                     searchtext;                                       		// 0x04BC ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                SearchType;                                       		// 0x04C8 ( 0x0004 ) 
	int                                                Status;                                           		// 0x04CC ( 0x0004 ) 
	int                                                Region;                                           		// 0x04D0 ( 0x0004 ) 
	class UBTTcpLink_Channel*                          TcpChannel;                                       		// 0x04D4 ( 0x0004 ) 
	struct FString                                     strCreateDate[ 0x02 ];                            		// 0x04D8 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strRound;                                         		// 0x04F0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strRank;                                          		// 0x04FC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strButtonCafe;                                    		// 0x0508 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strButtonInfo;                                    		// 0x0514 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClanSearchType[ 0x04 ];                        		// 0x0520 ( 0x0030 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbButtonCafe;                                     		// 0x0550 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbButtonInfo;                                     		// 0x0560 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonCafe;                                       		// 0x0570 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonInfo;                                       		// 0x0574 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strLabel[ 0x03 ];                                 		// 0x0578 ( 0x0024 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabel[ 0x03 ];                                  		// 0x059C ( 0x0030 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Label[ 0x03 ];                                    		// 0x05CC ( 0x000C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbComboSearch;                                    		// 0x05D8 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTComboBoxHK*                               ComboSearch;                                      		// 0x05E8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbEdit;                                           		// 0x05EC ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Edit;                                             		// 0x05FC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTEditBoxHK*                                EditSearch;                                       		// 0x0600 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strButtonSearch;                                  		// 0x0604 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbButtonSearch;                                   		// 0x0610 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonSearch;                                     		// 0x0620 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         LabelTop[ 0x07 ];                                 		// 0x0624 ( 0x001C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbButtonTop[ 0x07 ];                              		// 0x0640 ( 0x0070 ) 
	struct FString                                     strButtonTop[ 0x07 ];                             		// 0x06B0 ( 0x0054 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTop[ 0x07 ];                                		// 0x0704 ( 0x001C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UButtonGroups*                               RadioGroup;                                       		// 0x0720 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strRadioOption[ 0x02 ];                           		// 0x0724 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbRadioOption[ 0x02 ];                            		// 0x073C ( 0x0020 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTCheckBoxHK*                               RadioOption[ 0x02 ];                              		// 0x075C ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTComboBoxHK*                               ClanLocation;                                     		// 0x0764 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbClanLocation;                                   		// 0x0768 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTLabelLocationHK*                          sampleLocation;                                   		// 0x0778 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         lbClanLocation;                                   		// 0x077C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fblbClanLocation;                                 		// 0x0780 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strClanLocation;                                  		// 0x0790 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbACLClanList;                                    		// 0x079C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTACLClanHK*                                ACLClanList;                                      		// 0x07AC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowFindClanHK.Internal_OnOpen
	 bool                      ButtonSearch_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowFindClanHK.ButtonSearch_OnClick
	 void                      ACLClanList_OnHitBottom ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTWindowFindClanHK.ACLClanList_OnHitBottom
	 void                      ACLClanList_OnHitTop ( int Top, int Count, int itemperpage );		//  GUIWarfareControls.BTWindowFindClanHK.ACLClanList_OnHitTop
	 void                      SetPageLimit ( int minp, int maxp );              		//  GUIWarfareControls.BTWindowFindClanHK.SetPageLimit
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowFindClanHK.InitComponent
	 struct FString            GetSelectClanName (  );                           		//  GUIWarfareControls.BTWindowFindClanHK.GetSelectClanName
	 void                      SetData ( int TotalPage, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< unsigned char > ClanMarkBL, class TArray< struct FString > ClanName, class TArray< struct FString > ClanMaster, class TArray< int > ClanMember, class TArray< int > ClanMemberMax, class TArray< int > ClanCreateDate, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< int > ClanDraw, class TArray< int > ClanRank, class TArray< unsigned char > ClanRecruit, class TArray< int > ClanLevel );		//  GUIWarfareControls.BTWindowFindClanHK.SetData
}; // Size: 0x0304

// Class GUIWarfareControls.BTWindowRequestClanHK
class DLL_IMPORT UBTWindowRequestClanHK : public UBTWindowHK
{
public:
	struct FString                                     strLabel[ 0x0E ];                                 		// 0x04AC ( 0x00A8 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabel[ 0x0E ];                                  		// 0x0554 ( 0x00E0 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Label[ 0x0E ];                                    		// 0x0634 ( 0x0038 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTLabelClanMarkHK*                          LabelClanMark;                                    		// 0x066C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbEdit[ 0x09 ];                                   		// 0x0670 ( 0x0090 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strEdit[ 0x09 ];                                  		// 0x0700 ( 0x006C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawTextArrayHK*                     Edit[ 0x09 ];                                     		// 0x076C ( 0x0024 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strButtonSuspend;                                 		// 0x0790 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbButtonSuspend;                                  		// 0x079C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonSuspend;                                    		// 0x07AC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       EditAddMsg;                                       		// 0x07B0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       EditClanIntroduction;                             		// 0x07B4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                InviterUserIdx;                                   		// 0x07B8 ( 0x0004 ) 
	struct FString                                     InviterCharname;                                  		// 0x07BC ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x07C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     InviteMsg;                                        		// 0x07D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strNoRankState;                                   		// 0x07E0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowRequestClanHK.Internal_OnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowRequestClanHK.InitComponent
	 void                      SetClanInfo ( struct FClanInfo stClanInfo );      		//  GUIWarfareControls.BTWindowRequestClanHK.SetClanInfo
	 void                      SetData ( int InviterUserIdx, struct FString InviterCharname, struct FString ClanName, struct FString InviteMsg );		//  GUIWarfareControls.BTWindowRequestClanHK.SetData
}; // Size: 0x0340

// Class GUIWarfareControls.BTWindowClanInfoHK
class DLL_IMPORT UBTWindowClanInfoHK : public UBTWindowHK
{
public:
	struct FString                                     strRadioLocation[ 0x0E ];                         		// 0x04AC ( 0x00A8 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strLabel[ 0x0F ];                                 		// 0x0554 ( 0x00B4 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabel[ 0x0F ];                                  		// 0x0608 ( 0x00F0 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Label[ 0x0F ];                                    		// 0x06F8 ( 0x003C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strEdit[ 0x0F ];                                  		// 0x0734 ( 0x00B4 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbEdit[ 0x0F ];                                   		// 0x07E8 ( 0x00F0 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbLabelClanMark;                                  		// 0x08D8 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawTextArrayHK*                     Edit[ 0x0F ];                                     		// 0x08E8 ( 0x003C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTLabelClanMarkHK*                          LabelClanMark;                                    		// 0x0924 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       ClanIntroduction;                                 		// 0x0928 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTAutoScrollListHK*                         ClanIntroduction2;                                		// 0x092C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strNoRankState;                                   		// 0x0930 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowClanInfoHK.Internal_OnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowClanInfoHK.InitComponent
	 void                      SetData ( struct FClanInfo stClanInfo );          		//  GUIWarfareControls.BTWindowClanInfoHK.SetData
}; // Size: 0x0490

// Class GUIWarfareControls.BTWindowUserDetailInfoHK
class DLL_IMPORT UBTWindowUserDetailInfoHK : public UBTWindowHK
{
public:
	class UBTOwnerDrawCaptionButtonHK*                 ButtonAF;                                         		// 0x04AC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonRSA;                                        		// 0x04B0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bLRMousePressed:1;                                		// 0x04B4 ( 0x0004 )  [0x00000001]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonLR;                                         		// 0x04B8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRRMousePressed:1;                                		// 0x04BC ( 0x0004 )  [0x00000001]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonRR;                                         		// 0x04C0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         EdgeLine;                                         		// 0x04C4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         AFTeamBG;                                         		// 0x04C8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         RSATeamBG;                                        		// 0x04CC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bVisibleAFModel:1;                                		// 0x04D0 ( 0x0004 )  [0x00000001]
	struct FString                                     strAF;                                            		// 0x04D4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strRSA;                                           		// 0x04E0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class ABTROModelNew*                               CharacterModel;                                   		// 0x04EC ( 0x0004 ) 
	class UBTModelHK*                                  UIModel;                                          		// 0x04F0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     CharName;                                         		// 0x04F4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0500 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strLabel[ 0x0E ];                                 		// 0x050C ( 0x00A8 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabel[ 0x0E ];                                  		// 0x05B4 ( 0x00E0 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Label[ 0x0E ];                                    		// 0x0694 ( 0x0038 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strEdit[ 0x0E ];                                  		// 0x06CC ( 0x00A8 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbEdit[ 0x0E ];                                   		// 0x0774 ( 0x00E0 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawTextArrayHK*                     Edit[ 0x0E ];                                     		// 0x0854 ( 0x0038 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLevelImg;                                       		// 0x088C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbLabelClanMark;                                  		// 0x089C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LevelImg;                                         		// 0x08AC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTLabelClanMarkHK*                          LabelClanMark;                                    		// 0x08B0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbSelfIntroduction;                               		// 0x08B4 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTAutoScrollListHK*                         SelfIntroduction;                                 		// 0x08C4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbEquipWeapon[ 0x02 ];                            		// 0x08C8 ( 0x0020 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTItemBoxButtonHK*                          EquipWeapon[ 0x02 ];                              		// 0x08E8 ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbExpBar;                                         		// 0x08F0 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTExpBarHK*                                 expbar;                                           		// 0x0900 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strOnLine;                                        		// 0x0904 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strOffLine;                                       		// 0x0910 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawImageHK*                         strCharInfo;                                      		// 0x091C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbCharInfo;                                       		// 0x0920 ( 0x0010 ) 
	struct FString                                     strDefaultSelfIntro;                              		// 0x0930 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strNoRankState;                                   		// 0x093C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowUserDetailInfoHK.Internal_OnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.InitComponent
	 void                      InitializeRightPanel (  );                        		//  GUIWarfareControls.BTWindowUserDetailInfoHK.InitializeRightPanel
	 void                      InitializeLeftPanel (  );                         		//  GUIWarfareControls.BTWindowUserDetailInfoHK.InitializeLeftPanel
	 void                      SetData ( struct FString CharName, struct FString ClanName, int MainWeaponID, int MainWeaponPartID, int SubWeaponID, int SubWeaponPartID, int HelmetID, int FaceID, int AcceID, int AFBodyID, int RSABodyID, struct FCharInfo stCharInfo );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.SetData
	 void                      SetRankingInfo ( int Ranking, int Win, int Lose, int DisCon );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.SetRankingInfo
	 void                      SetEquipItemInfo ( int MainWeaponID, int MainWeaponPartID, int SubWeaponID, int SubWeaponPartID, int HelmetID, int FaceID, int AcceID, int AFBodyID, int RSABodyID );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.SetEquipItemInfo
	 void                      SetClanInfo ( struct FString ClanName, int ClanPattern, int ClanBG, int ClanBL, int ClanLevel );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.SetClanInfo
	 void                      SetMyInfo ( struct FString CharName, struct FString ClanName, int Level, int curExp, int startExp, int maxExp, int LevelMarkID );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.SetMyInfo
	 void                      SetSelfIntro ( struct FString Intro );            		//  GUIWarfareControls.BTWindowUserDetailInfoHK.SetSelfIntro
	 void                      ChangeVisibleModel ( bool bAF );                  		//  GUIWarfareControls.BTWindowUserDetailInfoHK.ChangeVisibleModel
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfareControls.BTWindowUserDetailInfoHK.Internal_OnPreDraw
	 bool                      ButtonRSA_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonRSA_OnClick
	 bool                      ButtonAF_OnClick ( class UGUIComponent* Sender ); 		//  GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonAF_OnClick
	 void                      ButtonRR_OnRelease ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonRR_OnRelease
	 void                      ButtonRR_OnPressed ( class UGUIComponent* Sender, bool bRepeat );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonRR_OnPressed
	 void                      ButtonLR_OnRelease ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonLR_OnRelease
	 void                      ButtonLR_OnPressed ( class UGUIComponent* Sender, bool bRepeat );		//  GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonLR_OnPressed
}; // Size: 0x049C

// Class GUIWarfareControls.BTWindowUserPersonalInfo
class DLL_IMPORT UBTWindowUserPersonalInfo : public UBTWindowHK
{
public:
	struct FString                                     strButtonTab[ 0x02 ];                             		// 0x04AC ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UTabControlMocker*                           TabControl;                                       		// 0x04C4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbButtonTab[ 0x02 ];                              		// 0x04C8 ( 0x0020 ) 
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTab[ 0x02 ];                                		// 0x04E8 ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbTPPanel;                                        		// 0x04F0 ( 0x0010 ) 
	class UBTTPOptionBaseHK*                           TPPanel[ 0x02 ];                                  		// 0x0500 ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                VisiblePanelIdx;                                  		// 0x0508 ( 0x0004 ) 
	class UBTTPMyInfoBasicHK*                          TPBasic;                                          		// 0x050C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTTPMyInfoStatHK*                           TPStat;                                           		// 0x0510 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         BackgroundPanel;                                  		// 0x0514 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbBackgroundPanel;                                		// 0x0518 ( 0x0010 ) 
	class UBTTcpLink_Channel*                          kTcpChannel;                                      		// 0x0528 ( 0x0004 ) 
	struct FClanInfo                                   kMyClanInfo;                                      		// 0x052C ( 0x00A8 ) [ CPF_NeedCtorLink ]
	struct FCharInfo                                   kMyCharInfo;                                      		// 0x05D4 ( 0x00C0 ) 

	// UScript Functions
	 void                      SetClanInfo ( struct FClanInfo ClanInfo );        		//  GUIWarfareControls.BTWindowUserPersonalInfo.SetClanInfo
	 void                      SetCharInfo ( struct FCharInfo CharInfo );        		//  GUIWarfareControls.BTWindowUserPersonalInfo.SetCharInfo
	 void                      SetTcpChannel ( class UBTTcpLink_Channel* TcpChannel );		//  GUIWarfareControls.BTWindowUserPersonalInfo.SetTcpChannel
	 void                      UpdateRankingInfoCompleted (  );                  		//  GUIWarfareControls.BTWindowUserPersonalInfo.UpdateRankingInfoCompleted
	 void                      UpdateRankingInfoList ( unsigned char RankingType, unsigned char CommunityType, class TArray< struct FString > CharName, class TArray< int > CharLevel, class TArray< struct FString > ClanName, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< int > ClanMarkBL, class TArray< int > Ranking_Accum, class TArray< int > Ranking_Accum_Prev, class TArray< int > Ranking_Accum_Exp, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfareControls.BTWindowUserPersonalInfo.UpdateRankingInfoList
	 void                      UpdateRankingCount ( unsigned char RankingType, unsigned char CommunityType, int TotalCount );		//  GUIWarfareControls.BTWindowUserPersonalInfo.UpdateRankingCount
	 void                      UpdateCharDetailInfo ( int MaxSerial, int MaxScore, int MaxKill, int MaxAssist, int Serial3, int Serial5, int Serial7, int Serial10, int Serial15, int AR, int SMG, int SR, int SW, int Melee, int Grenade, int FlashBang, int Foot, int AT4, int MG, int Fire, int RPG7, int TimeBomb, int IcendiaryBomb, int ClusterBomb, int ByChopper, int Artillery, int KillChopper, int FirstKill, int LastKill, int AllKill, int Dominate, int InstallBomb, int DefuseBomb );		//  GUIWarfareControls.BTWindowUserPersonalInfo.UpdateCharDetailInfo
	 void                      UpdateFriendCharInfo ( struct FString CharName, struct FString ClanName, int CM_Pattern, int CM_BG, int CM_BL, struct FString ClanPersonIntro, int MainWeaponItemID, int MainWeaponPartID, int SubWeaponItemID, int SubWeaponPartID, int AFSpecialCostumeItemID, int RSASpecialCostumeItemID, struct FCharInfo stCharInfo, int ClanLevel );		//  GUIWarfareControls.BTWindowUserPersonalInfo.UpdateFriendCharInfo
	 void                      UpdateCharInfo (  );                              		//  GUIWarfareControls.BTWindowUserPersonalInfo.UpdateCharInfo
	 void                      UpdateRequestServer (  );                         		//  GUIWarfareControls.BTWindowUserPersonalInfo.UpdateRequestServer
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowUserPersonalInfo.Internal_OnOpen
	 bool                      ButtonTab_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowUserPersonalInfo.ButtonTab_OnClick
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowUserPersonalInfo.InitComponent
}; // Size: 0x01E8

// Class GUIWarfareControls.BTWindowCreateClanHK
class DLL_IMPORT UBTWindowCreateClanHK : public UBTWindowHK
{
public:
	struct FString                                     strLabel[ 0x0B ];                                 		// 0x04AC ( 0x0084 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabel[ 0x0B ];                                  		// 0x0530 ( 0x00B0 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Label[ 0x0B ];                                    		// 0x05E0 ( 0x002C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbEdit[ 0x03 ];                                   		// 0x060C ( 0x0030 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Edit[ 0x03 ];                                     		// 0x063C ( 0x000C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strButtonOverlapCheck;                            		// 0x0648 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbButtonOverlapCheck;                             		// 0x0654 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonOverlapCheck;                               		// 0x0664 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTEditBoxHK*                                ClanName;                                         		// 0x0668 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       ClanIntroduction;                                 		// 0x066C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTEditBoxHK*                                ClanKeyword;                                      		// 0x0670 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTComboBoxHK*                               ClanLocation;                                     		// 0x0674 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbClanLocation;                                   		// 0x0678 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTLabelLocationHK*                          sampleLocation;                                   		// 0x0688 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bCheckDupName:1;                                  		// 0x068C ( 0x0004 )  [0x00000001]
	unsigned long                                      bCheckDupID:1;                                    		// 0x068C ( 0x0004 )  [0x00000002]
	class UBTTcpLink_Channel*                          TcpChannel;                                       		// 0x0690 ( 0x0004 ) 

	// UScript Functions
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowCreateClanHK.Internal_OnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowCreateClanHK.InitComponent
	 bool                      ButtonOverlapCheck_OnClick ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowCreateClanHK.ButtonOverlapCheck_OnClick
	 bool                      CheckDup (  );                                    		//  GUIWarfareControls.BTWindowCreateClanHK.CheckDup
	 void                      ClanName_OnChange ( class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowCreateClanHK.ClanName_OnChange
}; // Size: 0x01E8

// Class GUIWarfareControls.BTACLTeamMemberListHK
class DLL_IMPORT UBTACLTeamMemberListHK : public UBTAutoColumnListHK
{
public:
	struct FString                                     strStatus[ 0x0A ];                                		// 0x0460 ( 0x0078 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FImage                                      LevelImg;                                         		// 0x04D8 ( 0x0020 ) 

	// UScript Functions
	 int                       GetLevelMarkID ( int row );                       		//  GUIWarfareControls.BTACLTeamMemberListHK.GetLevelMarkID
	 class FColor              GetUserNameColor ( int row );                     		//  GUIWarfareControls.BTACLTeamMemberListHK.GetUserNameColor
	 int                       GetClanPatternID ( int row );                     		//  GUIWarfareControls.BTACLTeamMemberListHK.GetClanPatternID
	 int                       GetUserID ( int Index );                          		//  GUIWarfareControls.BTACLTeamMemberListHK.GetUserID
	 struct FString            GetClanName ( int Index );                        		//  GUIWarfareControls.BTACLTeamMemberListHK.GetClanName
	 struct FString            GetUserName ( int Index );                        		//  GUIWarfareControls.BTACLTeamMemberListHK.GetUserName
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTACLTeamMemberListHK.InitComponent
	 void                      LC5_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLTeamMemberListHK.LC5_Draw
	 void                      LC4_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLTeamMemberListHK.LC4_Draw
	 void                      LC2_3_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLTeamMemberListHK.LC2_3_Draw
	 void                      LC1_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLTeamMemberListHK.LC1_Draw
	 void                      LC0_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLTeamMemberListHK.LC0_Draw
	 class UBTAutoColumnListDataHK* FindTeamMember ( int UID );                       		//  GUIWarfareControls.BTACLTeamMemberListHK.FindTeamMember
	 int                       PingToIndex ( int msec );                         		//  GUIWarfareControls.BTACLTeamMemberListHK.PingToIndex
	 bool                      ChangePingInfo ( int UID, int PingValue );        		//  GUIWarfareControls.BTACLTeamMemberListHK.ChangePingInfo
	 bool                      ChangeLevelMarkID ( struct FString UserName, int LevelMarkID );		//  GUIWarfareControls.BTACLTeamMemberListHK.ChangeLevelMarkID
	 bool                      ChangeTeamMemberStatus ( int UID, int Status );   		//  GUIWarfareControls.BTACLTeamMemberListHK.ChangeTeamMemberStatus
	 bool                      IsAllReady (  );                                  		//  GUIWarfareControls.BTACLTeamMemberListHK.IsAllReady
	 int                       GetReadyUserCount (  );                           		//  GUIWarfareControls.BTACLTeamMemberListHK.GetReadyUserCount
	 struct FString            GetMaxSameClanName (  );                          		//  GUIWarfareControls.BTACLTeamMemberListHK.GetMaxSameClanName
	 int                       GetMaxSameClanUserCount (  );                     		//  GUIWarfareControls.BTACLTeamMemberListHK.GetMaxSameClanUserCount
	 struct FStrInt_Struct     GetMaxSameClanUserInfo (  );                      		//  GUIWarfareControls.BTACLTeamMemberListHK.GetMaxSameClanUserInfo
	 bool                      ChangeRoomOwnerInfo ( int UID );                  		//  GUIWarfareControls.BTACLTeamMemberListHK.ChangeRoomOwnerInfo
	 bool                      RemoveTeamMemberByUID ( int UID );                		//  GUIWarfareControls.BTACLTeamMemberListHK.RemoveTeamMemberByUID
	 bool                      ChangeTeamMember ( int UID, int ClanMark, int ClanBG, int ClanBL, int Level, struct FString NickName, struct FString ClanName, int Status, int Host, int Ping, struct FString UserIP, unsigned char LookingFor, int ClanLevel, bool bMe );		//  GUIWarfareControls.BTACLTeamMemberListHK.ChangeTeamMember
	 int                       FindTeamMemberIndex ( int UID );                  		//  GUIWarfareControls.BTACLTeamMemberListHK.FindTeamMemberIndex
	 void                      ReplaceClanLevel ( struct FString ClanName, int ClanLevel );		//  GUIWarfareControls.BTACLTeamMemberListHK.ReplaceClanLevel
	 void                      ReplaceClanName ( struct FString old_ClanName, struct FString new_ClanName );		//  GUIWarfareControls.BTACLTeamMemberListHK.ReplaceClanName
	 bool                      ReplaceUserNickName ( struct FString Old_NickName, struct FString New_NickName );		//  GUIWarfareControls.BTACLTeamMemberListHK.ReplaceUserNickName
	 void                      AddTeamMember ( int UID, int ClanMark, int ClanBG, int ClanBL, int Level, struct FString NickName, struct FString ClanName, int Status, int Host, int Ping, struct FString UserIP, unsigned char LookingFor, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3, bool bMe );		//  GUIWarfareControls.BTACLTeamMemberListHK.AddTeamMember
	 float                     GetItemHeight ( class UCanvas* C );               		//  GUIWarfareControls.BTACLTeamMemberListHK.GetItemHeight
}; // Size: 0x0098

// Class GUIWarfareControls.BTCMTeamMemberListHK
class DLL_IMPORT UBTCMTeamMemberListHK : public UBTContextMenuHK
{
public:
	struct FString                                     strContextMenuName[ 0x09 ];                       		// 0x03E4 ( 0x006C ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTCMTeamMemberListHK.InitComponent
}; // Size: 0x006C

// Class GUIWarfareControls.BTWindow
class DLL_IMPORT UBTWindow : public UFloatingWindow
{
public:
	unsigned long                                      bHandleEsc:1;                                     		// 0x03F4 ( 0x0004 )  [0x00000001]

	// UScript Functions
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  GUIWarfareControls.BTWindow.InternalOnKeyEvent
	 void                      Closed ( class UGUIComponent* Sender, bool bCancelled );		//  GUIWarfareControls.BTWindow.Closed
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUIWarfareControls.BTWindow.Opened
}; // Size: 0x0004

// Class GUIWarfareControls.BTWindowInviteFriendHK
class DLL_IMPORT UBTWindowInviteFriendHK : public UBTWindow
{
public:
	class UBTOwnerDrawImageHK*                         BackgroundImage;                                  		// 0x03F8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         TopLine;                                          		// 0x03FC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         BottomLine;                                       		// 0x0400 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonOK;                                         		// 0x0404 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonCancel;                                     		// 0x0408 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelDivider;                                     		// 0x040C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelInviteMsg;                                   		// 0x0410 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelSendMsg;                                     		// 0x0414 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelEditMsg;                                     		// 0x0418 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTMultiLineEditBoxHK*                       MultiLineEditMsg;                                 		// 0x041C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strTitle;                                         		// 0x0420 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strSendMsg;                                       		// 0x042C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strInviteMsg;                                     		// 0x0438 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strOK;                                            		// 0x0444 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strCancel;                                        		// 0x0450 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     FriendName;                                       		// 0x045C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                friendUID;                                        		// 0x0468 ( 0x0004 ) 
	struct FScriptDelegate                             __OnOK__Delegate;                                 		// 0x046C ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      ButtonOK_OnClick ( class UGUIComponent* Sender ); 		//  GUIWarfareControls.BTWindowInviteFriendHK.ButtonOK_OnClick
	 void                      InternalOnCreateComponent ( class UGUIComponent* NewComp, class UGUIComponent* Sender );		//  GUIWarfareControls.BTWindowInviteFriendHK.InternalOnCreateComponent
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  GUIWarfareControls.BTWindowInviteFriendHK.InternalOnKeyEvent
	 void                      Closed ( class UGUIComponent* Sender, bool bCancelled );		//  GUIWarfareControls.BTWindowInviteFriendHK.Closed
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUIWarfareControls.BTWindowInviteFriendHK.Opened
	 void                      ApplyLocalizedStrings (  );                       		//  GUIWarfareControls.BTWindowInviteFriendHK.ApplyLocalizedStrings
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowInviteFriendHK.InitComponent
	 bool                      OnOK ( class UGUIComponent* Sender );             		//  GUIWarfareControls.BTWindowInviteFriendHK.OnOK
	 void                      SetData ( struct FString UserName, int UID );     		//  GUIWarfareControls.BTWindowInviteFriendHK.SetData
}; // Size: 0x007C

// Class GUIWarfareControls.BTWindowInviteClanHK
class DLL_IMPORT UBTWindowInviteClanHK : public UBTWindowHK
{
public:
	struct FString                                     strLabel[ 0x04 ];                                 		// 0x04AC ( 0x0030 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strModeTitle[ 0x02 ];                             		// 0x04DC ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strModeContent[ 0x02 ];                           		// 0x04F4 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabel[ 0x04 ];                                  		// 0x050C ( 0x0040 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         Label[ 0x04 ];                                    		// 0x054C ( 0x0010 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTMultiLineEditBoxHK*                       ClanInviteMsg;                                    		// 0x055C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     SaveData;                                         		// 0x0560 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     SaveInviterName;                                  		// 0x056C ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      Internal_OnOpen (  );                             		//  GUIWarfareControls.BTWindowInviteClanHK.Internal_OnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowInviteClanHK.InitComponent
	 void                      SetClanJoin ( struct FString ClanName, struct FString Inviter );		//  GUIWarfareControls.BTWindowInviteClanHK.SetClanJoin
	 void                      SetClanInvite ( struct FString UserName );        		//  GUIWarfareControls.BTWindowInviteClanHK.SetClanInvite
}; // Size: 0x00CC

// Class GUIWarfareControls.BTACLMessengerBanHK
class DLL_IMPORT UBTACLMessengerBanHK : public UBTAutoColumnListHK
{
public:
	struct FImage                                      CommonSizeImg;                                    		// 0x0460 ( 0x0020 ) 

	// UScript Functions
	 void                      RemoveBlockUser ( struct FString UserName );      		//  GUIWarfareControls.BTACLMessengerBanHK.RemoveBlockUser
	 void                      AddBlockUser ( struct FString UserName );         		//  GUIWarfareControls.BTACLMessengerBanHK.AddBlockUser
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTACLMessengerBanHK.InitComponent
	 float                     GetItemHeight ( class UCanvas* C );               		//  GUIWarfareControls.BTACLMessengerBanHK.GetItemHeight
	 void                      LC0_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLMessengerBanHK.LC0_Draw
	 struct FString            GetUserName ( int row );                          		//  GUIWarfareControls.BTACLMessengerBanHK.GetUserName
	 void                      InitScrollBar (  );                               		//  GUIWarfareControls.BTACLMessengerBanHK.InitScrollBar
}; // Size: 0x0020

// Class GUIWarfareControls.BTCMMessengerBanHK
class DLL_IMPORT UBTCMMessengerBanHK : public UBTContextMenuHK
{
public:
	struct FString                                     strContextMenuName[ 0x02 ];                       		// 0x03E4 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTCMMessengerBanHK.InitComponent
}; // Size: 0x0018

// Class GUIWarfareControls.BTACLMessengerPCBangHK
class DLL_IMPORT UBTACLMessengerPCBangHK : public UBTACLMessengerCommon
{
public:
	struct FImage                                      CommonSizeImg;                                    		// 0x0468 ( 0x0020 ) 

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTACLMessengerPCBangHK.InitComponent
	 float                     GetItemHeight ( class UCanvas* C );               		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetItemHeight
	 int                       GetLevelMarkID ( int row );                       		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetLevelMarkID
	 int                       GetClanNum ( int row );                           		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetClanNum
	 struct FImage             GetClanBL ( int row );                            		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetClanBL
	 struct FImage             GetClanBG ( int row );                            		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetClanBG
	 struct FImage             GetClanPattern ( int row );                       		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetClanPattern
	 int                       GetClanPatternID ( int row );                     		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetClanPatternID
	 struct FString            GetClanName ( int row );                          		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetClanName
	 int                       GetChannelNum ( int row );                        		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetChannelNum
	 struct FString            GetServerName ( int row );                        		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetServerName
	 int                       GetServerPort ( int row );                        		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetServerPort
	 int                       GetCurPosInt ( int row );                         		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetCurPosInt
	 int                       GetCurPos ( int row );                            		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetCurPos
	 struct FString            GetServerIP ( int row );                          		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetServerIP
	 int                       GetRoomNumber ( int row );                        		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetRoomNumber
	 struct FString            GetUserName ( int row );                          		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetUserName
	 int                       GetLevel ( int row );                             		//  GUIWarfareControls.BTACLMessengerPCBangHK.GetLevel
	 void                      LC1_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLMessengerPCBangHK.LC1_Draw
	 void                      LC0_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLMessengerPCBangHK.LC0_Draw
}; // Size: 0x0020

// Class GUIWarfareControls.BTCMMessengerPCBangHK
class DLL_IMPORT UBTCMMessengerPCBangHK : public UBTCMMessengerOnOffline
{
public:
	struct FString                                     strContextMenuName[ 0x07 ];                       		// 0x0428 ( 0x0054 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTCMMessengerPCBangHK.InitComponent
}; // Size: 0x0054

// Class GUIWarfareControls.BTACLMessengerClanHK
class DLL_IMPORT UBTACLMessengerClanHK : public UBTACLMessengerCommon
{
public:
	struct FImage                                      CommonSizeImg;                                    		// 0x0468 ( 0x0020 ) 
	class UBTRODecorateStringHK*                       btToolTip;                                        		// 0x0488 ( 0x0004 ) 

	// UScript Functions
	 class UGUIToolTip*        MultiColumnList_OnBeginToolTip (  );              		//  GUIWarfareControls.BTACLMessengerClanHK.MultiColumnList_OnBeginToolTip
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTACLMessengerClanHK.InitComponent
	 void                      SortByConnectionStatus (  );                      		//  GUIWarfareControls.BTACLMessengerClanHK.SortByConnectionStatus
	 float                     GetItemHeight ( class UCanvas* C );               		//  GUIWarfareControls.BTACLMessengerClanHK.GetItemHeight
	 int                       GetLogOnState ( int row );                        		//  GUIWarfareControls.BTACLMessengerClanHK.GetLogOnState
	 int                       GetLevelMarkID ( int row );                       		//  GUIWarfareControls.BTACLMessengerClanHK.GetLevelMarkID
	 struct FString            GetSelfIntro ( int row );                         		//  GUIWarfareControls.BTACLMessengerClanHK.GetSelfIntro
	 int                       GetRoomNumber ( int row );                        		//  GUIWarfareControls.BTACLMessengerClanHK.GetRoomNumber
	 int                       GetChannelNum ( int row );                        		//  GUIWarfareControls.BTACLMessengerClanHK.GetChannelNum
	 int                       GetServerPort ( int row );                        		//  GUIWarfareControls.BTACLMessengerClanHK.GetServerPort
	 struct FString            GetServerIP ( int row );                          		//  GUIWarfareControls.BTACLMessengerClanHK.GetServerIP
	 struct FString            GetUserName ( int row );                          		//  GUIWarfareControls.BTACLMessengerClanHK.GetUserName
	 int                       GetCurPosInt ( int row );                         		//  GUIWarfareControls.BTACLMessengerClanHK.GetCurPosInt
	 struct FString            GetCurPos ( int row );                            		//  GUIWarfareControls.BTACLMessengerClanHK.GetCurPos
	 int                       GetCurState ( int row );                          		//  GUIWarfareControls.BTACLMessengerClanHK.GetCurState
	 int                       GetLevel ( int row );                             		//  GUIWarfareControls.BTACLMessengerClanHK.GetLevel
	 void                      SetCurState ( int row, int Value );               		//  GUIWarfareControls.BTACLMessengerClanHK.SetCurState
	 void                      SetChannelNumber ( int row, int Value );          		//  GUIWarfareControls.BTACLMessengerClanHK.SetChannelNumber
	 void                      SetGameRoomNumber ( int row, int Value );         		//  GUIWarfareControls.BTACLMessengerClanHK.SetGameRoomNumber
	 void                      SetServerName ( int row, struct FString Value );  		//  GUIWarfareControls.BTACLMessengerClanHK.SetServerName
	 void                      SetServerIP ( int row, struct FString Value );    		//  GUIWarfareControls.BTACLMessengerClanHK.SetServerIP
	 void                      SetServerPort ( int row, int Value );             		//  GUIWarfareControls.BTACLMessengerClanHK.SetServerPort
	 void                      SetChannelName ( int row, struct FString Value ); 		//  GUIWarfareControls.BTACLMessengerClanHK.SetChannelName
	 void                      SetCurLocationName ( int row, struct FString Value );		//  GUIWarfareControls.BTACLMessengerClanHK.SetCurLocationName
	 void                      SetCurpos ( int row, int Value );                 		//  GUIWarfareControls.BTACLMessengerClanHK.SetCurpos
	 void                      Internal_OnRendered ( class UCanvas* Canvas );    		//  GUIWarfareControls.BTACLMessengerClanHK.Internal_OnRendered
	 void                      LC0_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLMessengerClanHK.LC0_Draw
}; // Size: 0x0024

// Class GUIWarfareControls.BTCMMessengerClanHK
class DLL_IMPORT UBTCMMessengerClanHK : public UBTCMMessengerOnOffline
{
public:
	struct FString                                     strContextMenuName[ 0x05 ];                       		// 0x0428 ( 0x003C ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTCMMessengerClanHK.InitComponent
}; // Size: 0x003C

// Class GUIWarfareControls.BTACLMessengerFriendHK
class DLL_IMPORT UBTACLMessengerFriendHK : public UBTACLMessengerCommon
{
public:
	struct FImage                                      CommonSizeImg;                                    		// 0x0468 ( 0x0020 ) 

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTACLMessengerFriendHK.InitComponent
	 float                     GetItemHeight ( class UCanvas* C );               		//  GUIWarfareControls.BTACLMessengerFriendHK.GetItemHeight
	 void                      SortByConnectionStatus (  );                      		//  GUIWarfareControls.BTACLMessengerFriendHK.SortByConnectionStatus
	 int                       GetLogOnState ( int row );                        		//  GUIWarfareControls.BTACLMessengerFriendHK.GetLogOnState
	 int                       GetLevelMarkID ( int row );                       		//  GUIWarfareControls.BTACLMessengerFriendHK.GetLevelMarkID
	 int                       GetClanNum ( int row );                           		//  GUIWarfareControls.BTACLMessengerFriendHK.GetClanNum
	 struct FImage             GetClanBL ( int row );                            		//  GUIWarfareControls.BTACLMessengerFriendHK.GetClanBL
	 struct FImage             GetClanBG ( int row );                            		//  GUIWarfareControls.BTACLMessengerFriendHK.GetClanBG
	 struct FImage             GetClanPattern ( int row );                       		//  GUIWarfareControls.BTACLMessengerFriendHK.GetClanPattern
	 int                       GetClanPatternID ( int row );                     		//  GUIWarfareControls.BTACLMessengerFriendHK.GetClanPatternID
	 struct FString            GetClanName ( int row );                          		//  GUIWarfareControls.BTACLMessengerFriendHK.GetClanName
	 int                       GetChannelNum ( int row );                        		//  GUIWarfareControls.BTACLMessengerFriendHK.GetChannelNum
	 struct FString            GetServerName ( int row );                        		//  GUIWarfareControls.BTACLMessengerFriendHK.GetServerName
	 int                       GetServerPort ( int row );                        		//  GUIWarfareControls.BTACLMessengerFriendHK.GetServerPort
	 int                       GetCurPosInt ( int row );                         		//  GUIWarfareControls.BTACLMessengerFriendHK.GetCurPosInt
	 int                       GetCurState ( int row );                          		//  GUIWarfareControls.BTACLMessengerFriendHK.GetCurState
	 int                       GetCurPos ( int row );                            		//  GUIWarfareControls.BTACLMessengerFriendHK.GetCurPos
	 struct FString            GetServerIP ( int row );                          		//  GUIWarfareControls.BTACLMessengerFriendHK.GetServerIP
	 int                       GetRoomNumber ( int row );                        		//  GUIWarfareControls.BTACLMessengerFriendHK.GetRoomNumber
	 struct FString            GetUserName ( int row );                          		//  GUIWarfareControls.BTACLMessengerFriendHK.GetUserName
	 int                       GetLevel ( int row );                             		//  GUIWarfareControls.BTACLMessengerFriendHK.GetLevel
	 void                      SetCurState ( int row, int Value );               		//  GUIWarfareControls.BTACLMessengerFriendHK.SetCurState
	 void                      SetChannelNumber ( int row, int Value );          		//  GUIWarfareControls.BTACLMessengerFriendHK.SetChannelNumber
	 void                      SetGameRoomNumber ( int row, int Value );         		//  GUIWarfareControls.BTACLMessengerFriendHK.SetGameRoomNumber
	 void                      SetServerName ( int row, struct FString Value );  		//  GUIWarfareControls.BTACLMessengerFriendHK.SetServerName
	 void                      SetServerIP ( int row, struct FString Value );    		//  GUIWarfareControls.BTACLMessengerFriendHK.SetServerIP
	 void                      SetServerPort ( int row, int Value );             		//  GUIWarfareControls.BTACLMessengerFriendHK.SetServerPort
	 void                      SetChannelName ( int row, struct FString Value ); 		//  GUIWarfareControls.BTACLMessengerFriendHK.SetChannelName
	 void                      SetCurLocationName ( int row, struct FString Value );		//  GUIWarfareControls.BTACLMessengerFriendHK.SetCurLocationName
	 void                      SetCurpos ( int row, int Value );                 		//  GUIWarfareControls.BTACLMessengerFriendHK.SetCurpos
	 void                      LC1_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLMessengerFriendHK.LC1_Draw
	 void                      LC0_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLMessengerFriendHK.LC0_Draw
}; // Size: 0x0020

// Class GUIWarfareControls.BTCMMessengerFriendHK
class DLL_IMPORT UBTCMMessengerFriendHK : public UBTCMMessengerOnOffline
{
public:
	struct FString                                     strContextMenuName[ 0x08 ];                       		// 0x0428 ( 0x0060 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTCMMessengerFriendHK.InitComponent
}; // Size: 0x0060

// Class GUIWarfareControls.BTACLMessengerChannelHK
class DLL_IMPORT UBTACLMessengerChannelHK : public UBTACLMessengerCommon
{
public:
	struct FImage                                      CommonSizeImg;                                    		// 0x0468 ( 0x0020 ) 

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTACLMessengerChannelHK.InitComponent
	 float                     GetItemHeight ( class UCanvas* C );               		//  GUIWarfareControls.BTACLMessengerChannelHK.GetItemHeight
	 int                       GetLevelMarkID ( int row );                       		//  GUIWarfareControls.BTACLMessengerChannelHK.GetLevelMarkID
	 class FColor              GetUserNameColor ( int row, int idx );            		//  GUIWarfareControls.BTACLMessengerChannelHK.GetUserNameColor
	 bool                      IsFriendlyUser ( int row );                       		//  GUIWarfareControls.BTACLMessengerChannelHK.IsFriendlyUser
	 int                       GetClanPatternID ( int row );                     		//  GUIWarfareControls.BTACLMessengerChannelHK.GetClanPatternID
	 struct FString            GetUserName ( int row );                          		//  GUIWarfareControls.BTACLMessengerChannelHK.GetUserName
	 int                       GetUserID ( int row );                            		//  GUIWarfareControls.BTACLMessengerChannelHK.GetUserID
	 int                       GetLevel ( int row );                             		//  GUIWarfareControls.BTACLMessengerChannelHK.GetLevel
	 struct FString            GetClanName ( int row );                          		//  GUIWarfareControls.BTACLMessengerChannelHK.GetClanName
	 int                       GetClanID ( int row );                            		//  GUIWarfareControls.BTACLMessengerChannelHK.GetClanID
	 void                      LC0_Draw ( class UCanvas* C, float L, float t, float R, float B, struct FACLData Data, int Column, int row );		//  GUIWarfareControls.BTACLMessengerChannelHK.LC0_Draw
}; // Size: 0x0020

// Class GUIWarfareControls.BTCMMessengerChannelHK
class DLL_IMPORT UBTCMMessengerChannelHK : public UBTContextMenuHK
{
public:
	struct FString                                     strContextMenuName[ 0x08 ];                       		// 0x03E4 ( 0x0060 ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTCMMessengerChannelHK.InitComponent
}; // Size: 0x0060

// Class GUIWarfareControls.BTWindowRequestFriendHK
class DLL_IMPORT UBTWindowRequestFriendHK : public UBTWindowHK
{
public:
	class UBTOwnerDrawImageHK*                         LabelDivider;                                     		// 0x04AC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelInviteMsg;                                   		// 0x04B0 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelEditMsg;                                     		// 0x04B4 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTMultiLineEditBoxHK*                       MultiLineEditMsg;                                 		// 0x04B8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strInviteMsg;                                     		// 0x04BC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class TArray< struct FString >                     friendNames;                                      		// 0x04C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                friendUIDs;                                       		// 0x04D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     friendRequestMsg;                                 		// 0x04E0 ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUIWarfareControls.BTWindowRequestFriendHK.Opened
	 void                      ApplyLocalizedStrings (  );                       		//  GUIWarfareControls.BTWindowRequestFriendHK.ApplyLocalizedStrings
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfareControls.BTWindowRequestFriendHK.InitComponent
	 bool                      IsExistFrinedList (  );                           		//  GUIWarfareControls.BTWindowRequestFriendHK.IsExistFrinedList
	 bool                      CheckExistFriendList ( int UID );                 		//  GUIWarfareControls.BTWindowRequestFriendHK.CheckExistFriendList
	 void                      GetTopFriendInfo ( struct FString* friName, int* friID );		//  GUIWarfareControls.BTWindowRequestFriendHK.GetTopFriendInfo
	 void                      DelData (  );                                     		//  GUIWarfareControls.BTWindowRequestFriendHK.DelData
