#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : GUIWarfareControls
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function GUIWarfareControls.BTWindowDefineARHK.CloseWindowAll
// Flags: 
struct UBTWindowDefineARHK_execCloseWindowAll_Parms
{
	class UGUIController*                              Controller;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	class UBTWindowDefineARHK*                         BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowDefineARHK.ShowInfo
// Flags: 
struct UBTWindowDefineARHK_execShowInfo_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Code;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg3;                                             		// 0x002C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0038 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FString >                     arrStr;                                           		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     strTitle;                                         		// 0x0048 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     strMsg;                                           		// 0x0054 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowDefineARHK.SetContentText
// Flags: 
struct UBTWindowDefineARHK_execSetContentText_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Code;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg3;                                             		// 0x002C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0038 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowDefineARHK*                         BTWindow;                                         		// 0x003C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	class TArray< struct FString >                     arrStr;                                           		// 0x0040 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     strTitle;                                         		// 0x004C ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     strMsg;                                           		// 0x0058 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowDefineARHK.SetContentText_Instance
// Flags: 
struct UBTWindowDefineARHK_execSetContentText_Instance_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg3;                                             		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FString >                     arrStr;                                           		// 0x0038 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     str_Title;                                        		// 0x0044 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     str_Msg;                                          		// 0x0050 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.ResizeWidth
// Flags: 
struct UBTWindowAutoResizeHK_execResizeWidth_Parms
{
	int                                                W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                cw;                                               		// 0x0008 ( 0x0004
	float                                              bwperc;                                           		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.ShowWindow
// Flags: 
struct UBTWindowAutoResizeHK_execShowWindow_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Title;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Msg;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Warn;                                             		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnOk;                                            		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnCancel;                                        		// 0x0034 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0040 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.RemoveSizeY
// Flags: 
struct UBTWindowAutoResizeHK_execRemoveSizeY_Parms
{
	int                                                halfsize;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                halfy;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.InsertSizeY
// Flags: 
struct UBTWindowAutoResizeHK_execInsertSizeY_Parms
{
	int                                                halfsize;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                halfy;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.Internal_OnPreDraw
// Flags: 
struct UBTWindowAutoResizeHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                j;                                                		// 0x000C ( 0x0004
//	float                                              HT;                                               		// 0x0010 ( 0x0004
//	class FColor                                       forecolor;                                        		// 0x0014 ( 0x0004
//	class TArray< struct FString >                     temparray;                                        		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     mergetarray;                                      		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FStringAndFontSize >          OriginArray;                                      		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FStringAndFontSize >          AddArray;                                         		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
//	float                                              VLCHeight;                                        		// 0x0048 ( 0x0004
//	float                                              ExtHeight;                                        		// 0x004C ( 0x0004
//	float                                              LastVisibleLabelHeight;                           		// 0x0050 ( 0x0004
//	int                                                LabelInfoWidth;                                   		// 0x0054 ( 0x0004
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.SetButtonCaption
// Flags: 
struct UBTWindowAutoResizeHK_execSetButtonCaption_Parms
{
	struct FString                                     strOK;                                            		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     strCancel;                                        		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.SetData
// Flags: 
struct UBTWindowAutoResizeHK_execSetData_Parms
{
	struct FString                                     Title;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Caption;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Warning;                                          		// 0x0018 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowAutoResizeHK.InitComponent
// Flags: 
struct UBTWindowAutoResizeHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowHK.CloseWindowAllByName
// Flags: 
struct UBTWindowHK_execCloseWindowAllByName_Parms
{
	class UGUIController*                              Controller;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      WindowName;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowHK.TimeOutPreDraw
// Flags: 
struct UBTWindowHK_execTimeOutPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Delta;                                            		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowHK.StopTimeOut
// Flags: 
struct UBTWindowHK_execStopTimeOut_Parms
{
	float                                              SetTime;                                          		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowHK.StartTimeOut
// Flags: 
struct UBTWindowHK_execStartTimeOut_Parms
{
	float                                              SetTime;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowHK.DefaultCloseWindow_OnTimeOut
// Flags: 
struct UBTWindowHK_execDefaultCloseWindow_OnTimeOut_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowHK.OnTimeOut
// Flags: 
struct UBTWindowHK_execOnTimeOut_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowHK.OnTimeTick
// Flags: 
struct UBTWindowHK_execOnTimeTick_Parms
{
	float                                              leftime;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowHK.InternalOnKeyEvent
// Flags: 
struct UBTWindowHK_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      iKey;                                             		// 0x000C ( 0x0001
};

// Function GUIWarfareControls.BTWindowHK.NewButtonComponent
// Flags: 
struct UBTWindowHK_execNewButtonComponent_Parms
{
	struct FFloatBox                                   fbNewCompo;                                       		// 0x0000 ( 0x0010[ CPF_Parm ]
	float                                              RenderWeight;                                     		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTOwnerDrawCaptionButtonHK*                 ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowHK.NewLabelComponent
// Flags: 
struct UBTWindowHK_execNewLabelComponent_Parms
{
	struct FFloatBox                                   fbNewCompo;                                       		// 0x0000 ( 0x0010[ CPF_Parm ]
	struct FImage                                      bgImg;                                            		// 0x0010 ( 0x0020[ CPF_Parm ]
	float                                              RenderWeight;                                     		// 0x0030 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTOwnerDrawImageHK*                         ReturnValue;                                      		// 0x0034 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTOwnerDrawImageHK*                         Label;                                            		// 0x0038 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowHK.ButtonCancel_OnClick
// Flags: 
struct UBTWindowHK_execButtonCancel_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowHK.ButtonOK_OnClick
// Flags: 
struct UBTWindowHK_execButtonOK_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowHK.Closed
// Flags: 
struct UBTWindowHK_execClosed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bCancelled:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowHK.Opened
// Flags: [ FUNC_Event ]
struct UBTWindowHK_eventOpened_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowHK.InitComponent
// Flags: 
struct UBTWindowHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowHK.SetTitleCaption
// Flags: 
struct UBTWindowHK_execSetTitleCaption_Parms
{
	struct FString                                     S;                                                		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowHK.SetContentOffset
// Flags: 
struct UBTWindowHK_execSetContentOffset_Parms
{
	int                                                nOffsetX;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                nOffsetY;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowHK.UpdateDefaultWindow
// Flags: 
struct UBTWindowHK_execUpdateDefaultWindow_Parms
{
};

// Function GUIWarfareControls.BTWindowHK.DefaultCloseWindow_OnOK
// Flags: 
struct UBTWindowHK_execDefaultCloseWindow_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowHK.OnCancel
// Flags: 
struct UBTWindowHK_execOnCancel_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowHK.OnOK
// Flags: 
struct UBTWindowHK_execOnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowDefineInfoHK.ShowInfo
// Flags: 
struct UBTWindowDefineInfoHK_execShowInfo_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Code;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     strTitle;                                         		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     strMsg;                                           		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     arrStr;                                           		// 0x0048 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowDefineInfoHK.GetClientString
// Flags: 
struct UBTWindowDefineInfoHK_execGetClientString_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class UBTWindowDefineInfoHK*                       BTWindow;                                         		// 0x0010 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowDefineInfoHK.GetFormatString
// Flags: 
struct UBTWindowDefineInfoHK_execGetFormatString_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg3;                                             		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg4;                                             		// 0x0034 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg5;                                             		// 0x0040 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg6;                                             		// 0x004C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg7;                                             		// 0x0058 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg8;                                             		// 0x0064 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0070 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class UBTWindowDefineInfoHK*                       BTWindow;                                         		// 0x007C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowDefineInfoHK.SetContentText_Instance
// Flags: 
struct UBTWindowDefineInfoHK_execSetContentText_Instance_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg3;                                             		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     arrStr;                                           		// 0x0034 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     str_Title;                                        		// 0x0040 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     str_Msg;                                          		// 0x004C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowDefineInfoHK.InitComponent
// Flags: 
struct UBTWindowDefineInfoHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowInfoHK.Internal_OnKeyEvent
// Flags: 
struct UBTWindowInfoHK_execInternal_OnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      Action;                                           		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      iKey;                                             		// 0x000C ( 0x0001
//	unsigned char                                      iAction;                                          		// 0x000D ( 0x0001
};

// Function GUIWarfareControls.BTWindowInfoHK.Internal_OnPreDraw
// Flags: 
struct UBTWindowInfoHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   fbLI;                                             		// 0x0008 ( 0x0010
//	struct FFloatBox                                   fbT;                                              		// 0x0018 ( 0x0010
//	float                                              lW;                                               		// 0x0028 ( 0x0004
//	float                                              tW;                                               		// 0x002C ( 0x0004
//	float                                              BW;                                               		// 0x0030 ( 0x0004
//	float                                              maxW;                                             		// 0x0034 ( 0x0004
//	float                                              ratioX;                                           		// 0x0038 ( 0x0004
//	float                                              ratioY;                                           		// 0x003C ( 0x0004
};

// Function GUIWarfareControls.BTWindowInfoHK.ShowWindow
// Flags: 
struct UBTWindowInfoHK_execShowWindow_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Title;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Msg;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnOk;                                            		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowInfoHK.SetData
// Flags: 
struct UBTWindowInfoHK_execSetData_Parms
{
	struct FString                                     Title;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                titlepadding;                                     		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnOk;                                            		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowInfoHK.InitComponent
// Flags: 
struct UBTWindowInfoHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.InternalDeactivate
// Flags: 
struct UBTEditBoxHK_execInternalDeactivate_Parms
{
};

// Function GUIWarfareControls.BTEditBoxHK.InternalActivate
// Flags: 
struct UBTEditBoxHK_execInternalActivate_Parms
{
};

// Function GUIWarfareControls.BTEditBoxHK.InternalOnKeyEvent
// Flags: 
struct UBTEditBoxHK_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTEditBoxHK.InternalOnKeyType
// Flags: 
struct UBTEditBoxHK_execInternalOnKeyType_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	struct FString                                     Unicode;                                          		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              W;                                                		// 0x0014 ( 0x0004
//	struct FString                                     temp;                                             		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     st;                                               		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FFloatBox                                   fb;                                               		// 0x0030 ( 0x0010
};

// Function GUIWarfareControls.BTEditBoxHK.CheckPastedTextCondition
// Flags: 
struct UBTEditBoxHK_execCheckPastedTextCondition_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	int                                                i2;                                               		// 0x0014 ( 0x0004
//	int                                                ch;                                               		// 0x0018 ( 0x0004
//	struct FString                                     st;                                               		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.CheckKeyInputCondition
// Flags: 
struct UBTEditBoxHK_execCheckKeyInputCondition_Parms
{
	struct FString                                     st;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                CharCode;                                         		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.ConvertIllegal
// Flags: 
struct UBTEditBoxHK_execConvertIllegal_Parms
{
	struct FString                                     inputstr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	int                                                Max;                                              		// 0x001C ( 0x0004
//	struct FString                                     retval;                                           		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     C;                                                		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.CaretBinarySearch
// Flags: 
struct UBTEditBoxHK_execCaretBinarySearch_Parms
{
	int                                                lCursor;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                rCursor;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              mx;                                               		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Parent;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                textLen;                                          		// 0x0014 ( 0x0004
//	int                                                pivotIndex;                                       		// 0x0018 ( 0x0004
//	int                                                Child;                                            		// 0x001C ( 0x0004
//	float                                              W;                                                		// 0x0020 ( 0x0004
//	float                                              HT;                                               		// 0x0024 ( 0x0004
//	struct FString                                     Text;                                             		// 0x0028 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.MousePosToCaretPos
// Flags: 
struct UBTEditBoxHK_execMousePosToCaretPos_Parms
{
	float                                              mx;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              my;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              W;                                                		// 0x000C ( 0x0004
//	float                                              HT;                                               		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.OnMousePressed
// Flags: 
struct UBTEditBoxHK_execOnMousePressed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRepeat:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTEditBoxHK.OnMouseRelease
// Flags: 
struct UBTEditBoxHK_execOnMouseRelease_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTEditBoxHK.Internal_OnChange
// Flags: 
struct UBTEditBoxHK_execInternal_OnChange_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTEditBoxHK.ResetCache
// Flags: 
struct UBTEditBoxHK_execResetCache_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.CaculateVisibleText
// Flags: 
struct UBTEditBoxHK_execCaculateVisibleText_Parms
{
	unsigned long                                      bHoldFirst:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                pos;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	float                                              HT;                                               		// 0x000C ( 0x0004
	float                                              scrollW;                                          		// 0x0010 ( 0x0004
	struct FString                                     temp;                                             		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                lenStr;                                           		// 0x0020 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.SetFontColorAll
// Flags: 
struct UBTEditBoxHK_execSetFontColorAll_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.DrawIMEInfo
// Flags: 
struct UBTEditBoxHK_execDrawIMEInfo_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              CursorWidth;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     tempString;                                       		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              width;                                            		// 0x0014 ( 0x0004
	float                                              SelectWidth;                                      		// 0x0018 ( 0x0004
	float                                              Height;                                           		// 0x001C ( 0x0004
	float                                              OffsetX;                                          		// 0x0020 ( 0x0004
	int                                                TextSize;                                         		// 0x0024 ( 0x0004
	int                                                CompSize;                                         		// 0x0028 ( 0x0004
	int                                                SelectSize;                                       		// 0x002C ( 0x0004
	int                                                SelPosStart;                                      		// 0x0030 ( 0x0004
	struct FFloatBox                                   fbDraw;                                           		// 0x0034 ( 0x0010
};

// Function GUIWarfareControls.BTEditBoxHK.OwnerDraw
// Flags: 
struct UBTEditBoxHK_execOwnerDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                MousePos;                                         		// 0x0008 ( 0x0004
//	float                                              X;                                                		// 0x000C ( 0x0004
//	float                                              X2;                                               		// 0x0010 ( 0x0004
//	float                                              S;                                                		// 0x0014 ( 0x0004
//	float                                              E;                                                		// 0x0018 ( 0x0004
//	float                                              cursorW;                                          		// 0x001C ( 0x0004
//	float                                              HT;                                               		// 0x0020 ( 0x0004
//	struct FString                                     tempString;                                       		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.Clear
// Flags: 
struct UBTEditBoxHK_execClear_Parms
{
};

// Function GUIWarfareControls.BTEditBoxHK.InitComponent
// Flags: 
struct UBTEditBoxHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTEditBoxHK.SetTextSelect
// Flags: 
struct UBTEditBoxHK_execSetTextSelect_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bAllSelect:1;                                     		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTEditBoxHK.SetText
// Flags: 
struct UBTEditBoxHK_execSetText_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.InputSelectionPos
// Flags: 
struct UBTEditBoxHK_execInputSelectionPos_Parms
{
	int                                                pos;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTEditBoxHK.ResetSelectionPos
// Flags: 
struct UBTEditBoxHK_execResetSelectionPos_Parms
{
	int                                                pos;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTEditBoxHK.GetSelectionText
// Flags: 
struct UBTEditBoxHK_execGetSelectionText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.RemoveSelectionText
// Flags: 
struct UBTEditBoxHK_execRemoveSelectionText_Parms
{
};

// Function GUIWarfareControls.BTEditBoxHK.SetFontSizeAll
// Flags: 
struct UBTEditBoxHK_execSetFontSizeAll_Parms
{
	int                                                Size;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.SetDefaultFontColor
// Flags: 
struct UBTEditBoxHK_execSetDefaultFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTEditBoxHK.OnMaxTextStrNum
// Flags: 
struct UBTEditBoxHK_execOnMaxTextStrNum_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTEditBoxHK.OnFunctionKey
// Flags: 
struct UBTEditBoxHK_execOnFunctionKey_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned char                                      FunctionKey;                                      		// 0x0004 ( 0x0001[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTEditBoxHK.OnInputSpace
// Flags: 
struct UBTEditBoxHK_execOnInputSpace_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.OnInputTab
// Flags: 
struct UBTEditBoxHK_execOnInputTab_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTEditBoxHK.OnChat
// Flags: 
struct UBTEditBoxHK_execOnChat_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameDisable
// Flags: 
struct UBTUIColorPoolHK_execFriendlyUserNameDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameSelected
// Flags: 
struct UBTUIColorPoolHK_execFriendlyUserNameSelected_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNamePressed
// Flags: 
struct UBTUIColorPoolHK_execFriendlyUserNamePressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameOn
// Flags: 
struct UBTUIColorPoolHK_execFriendlyUserNameOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.FriendlyUserNameN
// Flags: 
struct UBTUIColorPoolHK_execFriendlyUserNameN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.NewQuest_Reward
// Flags: 
struct UBTUIColorPoolHK_execNewQuest_Reward_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.NewQuest_Content
// Flags: 
struct UBTUIColorPoolHK_execNewQuest_Content_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.NewQuest_Title
// Flags: 
struct UBTUIColorPoolHK_execNewQuest_Title_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.CompletedQuest_Reward
// Flags: 
struct UBTUIColorPoolHK_execCompletedQuest_Reward_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.CompletedQuest_Content
// Flags: 
struct UBTUIColorPoolHK_execCompletedQuest_Content_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.CompletedQuest_Title
// Flags: 
struct UBTUIColorPoolHK_execCompletedQuest_Title_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListItem_Disable
// Flags: 
struct UBTUIColorPoolHK_execListItem_Disable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListItem_Select
// Flags: 
struct UBTUIColorPoolHK_execListItem_Select_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListItem_On
// Flags: 
struct UBTUIColorPoolHK_execListItem_On_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListItem_Normal
// Flags: 
struct UBTUIColorPoolHK_execListItem_Normal_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ItemUIStatus_Minus
// Flags: 
struct UBTUIColorPoolHK_execItemUIStatus_Minus_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ItemUIStatus_Plus
// Flags: 
struct UBTUIColorPoolHK_execItemUIStatus_Plus_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ItemUIStatus_Normal
// Flags: 
struct UBTUIColorPoolHK_execItemUIStatus_Normal_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.DefaultRed
// Flags: 
struct UBTUIColorPoolHK_execDefaultRed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.DefaultGray
// Flags: 
struct UBTUIColorPoolHK_execDefaultGray_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.DefaultShadow
// Flags: 
struct UBTUIColorPoolHK_execDefaultShadow_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.DefaultWhite
// Flags: 
struct UBTUIColorPoolHK_execDefaultWhite_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.InverseLabelWarning
// Flags: 
struct UBTUIColorPoolHK_execInverseLabelWarning_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.LabelWarning
// Flags: 
struct UBTUIColorPoolHK_execLabelWarning_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.Damage4
// Flags: 
struct UBTUIColorPoolHK_execDamage4_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.Damage3
// Flags: 
struct UBTUIColorPoolHK_execDamage3_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.Damage2
// Flags: 
struct UBTUIColorPoolHK_execDamage2_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.Damage1
// Flags: 
struct UBTUIColorPoolHK_execDamage1_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.Damage0
// Flags: 
struct UBTUIColorPoolHK_execDamage0_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.SmallPerc
// Flags: 
struct UBTUIColorPoolHK_execSmallPerc_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.Point
// Flags: 
struct UBTUIColorPoolHK_execPoint_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.Cash
// Flags: 
struct UBTUIColorPoolHK_execCash_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.QuestReward
// Flags: 
struct UBTUIColorPoolHK_execQuestReward_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListTopButtonDisable
// Flags: 
struct UBTUIColorPoolHK_execListTopButtonDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListTopButtonPressed
// Flags: 
struct UBTUIColorPoolHK_execListTopButtonPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListTopButtonWatched
// Flags: 
struct UBTUIColorPoolHK_execListTopButtonWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListTopButtonOn
// Flags: 
struct UBTUIColorPoolHK_execListTopButtonOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ListTopButtonN
// Flags: 
struct UBTUIColorPoolHK_execListTopButtonN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.SubTabButtonDisable
// Flags: 
struct UBTUIColorPoolHK_execSubTabButtonDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.SubTabButtonPressed
// Flags: 
struct UBTUIColorPoolHK_execSubTabButtonPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.SubTabButtonWatched
// Flags: 
struct UBTUIColorPoolHK_execSubTabButtonWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.SubTabButtonOn
// Flags: 
struct UBTUIColorPoolHK_execSubTabButtonOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.SubTabButtonN
// Flags: 
struct UBTUIColorPoolHK_execSubTabButtonN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonDisable_PaidItem
// Flags: 
struct UBTUIColorPoolHK_execTabButtonDisable_PaidItem_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonPressed_PaidItem
// Flags: 
struct UBTUIColorPoolHK_execTabButtonPressed_PaidItem_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonWatched_PaidItem
// Flags: 
struct UBTUIColorPoolHK_execTabButtonWatched_PaidItem_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonOn_PaidItem
// Flags: 
struct UBTUIColorPoolHK_execTabButtonOn_PaidItem_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonN_PaidItem
// Flags: 
struct UBTUIColorPoolHK_execTabButtonN_PaidItem_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonDisable
// Flags: 
struct UBTUIColorPoolHK_execTabButtonDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonPressed
// Flags: 
struct UBTUIColorPoolHK_execTabButtonPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonWatched
// Flags: 
struct UBTUIColorPoolHK_execTabButtonWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonOn
// Flags: 
struct UBTUIColorPoolHK_execTabButtonOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.TabButtonN
// Flags: 
struct UBTUIColorPoolHK_execTabButtonN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonPageListDisable
// Flags: 
struct UBTUIColorPoolHK_execButtonPageListDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonPageListPressed
// Flags: 
struct UBTUIColorPoolHK_execButtonPageListPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonPageListWatched
// Flags: 
struct UBTUIColorPoolHK_execButtonPageListWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonPageListOn
// Flags: 
struct UBTUIColorPoolHK_execButtonPageListOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonPageListN
// Flags: 
struct UBTUIColorPoolHK_execButtonPageListN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.RadioButtonSelect
// Flags: 
struct UBTUIColorPoolHK_execRadioButtonSelect_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.RadioButtonDisable
// Flags: 
struct UBTUIColorPoolHK_execRadioButtonDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.RadioButtonPressed
// Flags: 
struct UBTUIColorPoolHK_execRadioButtonPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.RadioButtonWatched
// Flags: 
struct UBTUIColorPoolHK_execRadioButtonWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.RadioButtonOn
// Flags: 
struct UBTUIColorPoolHK_execRadioButtonOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.RadioButtonNBold
// Flags: 
struct UBTUIColorPoolHK_execRadioButtonNBold_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.RadioButtonN
// Flags: 
struct UBTUIColorPoolHK_execRadioButtonN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.BigButtonPressedShadow
// Flags: 
struct UBTUIColorPoolHK_execBigButtonPressedShadow_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.BigButtonOnShadow
// Flags: 
struct UBTUIColorPoolHK_execBigButtonOnShadow_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.BigButtonDisable
// Flags: 
struct UBTUIColorPoolHK_execBigButtonDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.BigButtonPressed
// Flags: 
struct UBTUIColorPoolHK_execBigButtonPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.BigButtonWatched
// Flags: 
struct UBTUIColorPoolHK_execBigButtonWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.BigButtonOn
// Flags: 
struct UBTUIColorPoolHK_execBigButtonOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.BigButtonN
// Flags: 
struct UBTUIColorPoolHK_execBigButtonN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonPressedShadow
// Flags: 
struct UBTUIColorPoolHK_execButtonPressedShadow_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonOnShadow
// Flags: 
struct UBTUIColorPoolHK_execButtonOnShadow_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.newButtonDisable
// Flags: 
struct UBTUIColorPoolHK_execnewButtonDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.newButtonPressed
// Flags: 
struct UBTUIColorPoolHK_execnewButtonPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.newButtonWatched
// Flags: 
struct UBTUIColorPoolHK_execnewButtonWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.newButtonOn
// Flags: 
struct UBTUIColorPoolHK_execnewButtonOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.newButtonN
// Flags: 
struct UBTUIColorPoolHK_execnewButtonN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonDisable
// Flags: 
struct UBTUIColorPoolHK_execButtonDisable_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonPressed
// Flags: 
struct UBTUIColorPoolHK_execButtonPressed_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonWatched
// Flags: 
struct UBTUIColorPoolHK_execButtonWatched_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonOn
// Flags: 
struct UBTUIColorPoolHK_execButtonOn_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ButtonN
// Flags: 
struct UBTUIColorPoolHK_execButtonN_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.AASLevel7
// Flags: 
struct UBTUIColorPoolHK_execAASLevel7_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.AASLevel3
// Flags: 
struct UBTUIColorPoolHK_execAASLevel3_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatTeam
// Flags: 
struct UBTUIColorPoolHK_execChatTeam_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatTeamGhost
// Flags: 
struct UBTUIColorPoolHK_execChatTeamGhost_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatGhost
// Flags: 
struct UBTUIColorPoolHK_execChatGhost_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatBroadCastItem
// Flags: 
struct UBTUIColorPoolHK_execChatBroadCastItem_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatSystem
// Flags: 
struct UBTUIColorPoolHK_execChatSystem_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatClan
// Flags: 
struct UBTUIColorPoolHK_execChatClan_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatWhisper
// Flags: 
struct UBTUIColorPoolHK_execChatWhisper_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatSelf
// Flags: 
struct UBTUIColorPoolHK_execChatSelf_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ChatNormal
// Flags: 
struct UBTUIColorPoolHK_execChatNormal_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradePCBang
// Flags: 
struct UBTUIColorPoolHK_execGradePCBang_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeLegend
// Flags: 
struct UBTUIColorPoolHK_execGradeLegend_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeRare
// Flags: 
struct UBTUIColorPoolHK_execGradeRare_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeHigh
// Flags: 
struct UBTUIColorPoolHK_execGradeHigh_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeNormal
// Flags: 
struct UBTUIColorPoolHK_execGradeNormal_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeCommon
// Flags: 
struct UBTUIColorPoolHK_execGradeCommon_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeShop
// Flags: 
struct UBTUIColorPoolHK_execGradeShop_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeShop_DurabilityX
// Flags: 
struct UBTUIColorPoolHK_execGradeShop_DurabilityX_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.GradeBase
// Flags: 
struct UBTUIColorPoolHK_execGradeBase_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.myName
// Flags: 
struct UBTUIColorPoolHK_execmyName_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIColorPoolHK.ClanName
// Flags: 
struct UBTUIColorPoolHK_execClanName_Parms
{
	class FColor                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTUIResourcePoolHK.BounsIDToBounsIconIndex
// Flags: 
struct UBTUIResourcePoolHK_execBounsIDToBounsIconIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowDefineSelectHK.ShowInfo
// Flags: 
struct UBTWindowDefineSelectHK_execShowInfo_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Code;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FString >                     arrStr;                                           		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     strTitle;                                         		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     strMsg;                                           		// 0x0048 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowSelectHK.Internal_OnKeyEvent
// Flags: 
struct UBTWindowSelectHK_execInternal_OnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      Action;                                           		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      iKey;                                             		// 0x000C ( 0x0001
//	unsigned char                                      iAction;                                          		// 0x000D ( 0x0001
};

// Function GUIWarfareControls.BTWindowSelectHK.Internal_OnPreDraw
// Flags: 
struct UBTWindowSelectHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   fbLI;                                             		// 0x0008 ( 0x0010
//	struct FFloatBox                                   fbT;                                              		// 0x0018 ( 0x0010
//	float                                              lW;                                               		// 0x0028 ( 0x0004
//	float                                              tW;                                               		// 0x002C ( 0x0004
//	float                                              BW;                                               		// 0x0030 ( 0x0004
//	float                                              maxW;                                             		// 0x0034 ( 0x0004
//	float                                              ratioX;                                           		// 0x0038 ( 0x0004
//	float                                              ratioY;                                           		// 0x003C ( 0x0004
};

// Function GUIWarfareControls.BTWindowSelectHK.ShowWindow
// Flags: 
struct UBTWindowSelectHK_execShowWindow_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Title;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Msg;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnOk;                                            		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnCancel;                                        		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowSelectHK.SetData
// Flags: 
struct UBTWindowSelectHK_execSetData_Parms
{
	struct FString                                     Title;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                titlepadding;                                     		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnOk;                                            		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     btnCancel;                                        		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowSelectHK.InitComponent
// Flags: 
struct UBTWindowSelectHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTChatEditBoxHK.CheckPastedTextCondition
// Flags: 
struct UBTChatEditBoxHK_execCheckPastedTextCondition_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTChatEditBoxHK.CheckKeyInputCondition
// Flags: 
struct UBTChatEditBoxHK_execCheckKeyInputCondition_Parms
{
	struct FString                                     st;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.PageOnWindowManager.Pop
// Flags: 
struct UPageOnWindowManager_execPop_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UBTWindowHK*                                 ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTWindowHK*                                 BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.PageOnWindowManager.back
// Flags: 
struct UPageOnWindowManager_execback_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UBTWindowHK*                                 ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.PageOnWindowManager.Last
// Flags: 
struct UPageOnWindowManager_execLast_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UBTWindowHK*                                 ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.PageOnWindowManager.RemoveWindowOnStack
// Flags: 
struct UPageOnWindowManager_execRemoveWindowOnStack_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FName                                       WindowName;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bAll:1;                                           		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	unsigned long                                      bFindAndRemove:1;                                 		// 0x0014 ( 0x0004 [0x00000001]
};

// Function GUIWarfareControls.PageOnWindowManager.FindWindowOnStack
// Flags: 
struct UPageOnWindowManager_execFindWindowOnStack_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FName                                       WindowName;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UBTWindowHK*                                 ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.PageOnWindowManager.ListLen
// Flags: 
struct UPageOnWindowManager_execListLen_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.PageOnWindowManager.Push
// Flags: 
struct UPageOnWindowManager_execPush_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UBTWindowHK*                                 N;                                                		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bUseInsert:1;                                     		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                insertPos;                                        		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bUseInsertAtName:1;                               		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FName                                       nobject;                                          		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function GUIWarfareControls.PageOnWindowManager.CreateAndPush
// Flags: 
struct UPageOnWindowManager_execCreateAndPush_Parms
{
	unsigned char                                      destpage;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     WindowName;                                       		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bUseInsert:1;                                     		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                insertPos;                                        		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bUseInsertAtName:1;                               		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FName                                       nobject;                                          		// 0x001C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTWindowHK*                                 ReturnValue;                                      		// 0x0020 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UGUIPage*                                    GP;                                               		// 0x0024 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	class UClass*                                      NewMenuClass;                                     		// 0x0028 ( 0x0004
};

// Function GUIWarfareControls.PageOnWindowManager.CloseAndClear
// Flags: 
struct UPageOnWindowManager_execCloseAndClear_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                j;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.PageOnWindowManager.Init
// Flags: 
struct UPageOnWindowManager_execInit_Parms
{
	class UGUIController*                              C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.PageOnWindowManager.StopProcess
// Flags: 
struct UPageOnWindowManager_execStopProcess_Parms
{
};

// Function GUIWarfareControls.PageOnWindowManager.StartProcess
// Flags: 
struct UPageOnWindowManager_execStartProcess_Parms
{
};

// Function GUIWarfareControls.PageOnWindowManager.IsAvailable
// Flags: 
struct UPageOnWindowManager_execIsAvailable_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.InternalDeactivate
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execInternalDeactivate_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.InternalActivate
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execInternalActivate_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.OnRendered
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execOnRendered_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004
	int                                                SelectMenuState;                                  		// 0x0008 ( 0x0004
	int                                                savemenustate;                                    		// 0x000C ( 0x0004
	int                                                click_L;                                          		// 0x0010 ( 0x0004
	int                                                click_R;                                          		// 0x0014 ( 0x0004
	int                                                click_T;                                          		// 0x0018 ( 0x0004
	int                                                click_B;                                          		// 0x001C ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.DrawToolTip
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execDrawToolTip_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.GetTooltipPos
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execGetTooltipPos_Parms
{
	int                                                tooltipWidth;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                tooltipHeight;                                    		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                nOffsetX;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                nOffsetY;                                         		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FFloatBox                                   ReturnValue;                                      		// 0x0010 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   TooltipPos;                                       		// 0x0020 ( 0x0010
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontDrawType
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetFontDrawType_Parms
{
	unsigned char                                      dt;                                               		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontSizeAll
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetFontSizeAll_Parms
{
	int                                                Size;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontShadowColorAll
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetFontShadowColorAll_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetAlphaValue
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetAlphaValue_Parms
{
	float                                              A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                a255;                                             		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetFontColorAll
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetFontColorAll_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultNonSelectFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultNonSelectFontColor_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004
	class FColor                                       scol;                                             		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultListFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultListFontColor_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004
	class FColor                                       scol;                                             		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultListTopButtonFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultListTopButtonFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultMTabButtonFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultMTabButtonFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetPaidItemTabButtonFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetPaidItemTabButtonFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultTabButtonFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultTabButtonFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRadioButtonFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultRadioButtonFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultPageListButtonColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultPageListButtonColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultBigButtonFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultBigButtonFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.LeftPaddingPerc
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execLeftPaddingPerc_Parms
{
	float                                              perc;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultPaintingButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultPaintingButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultListButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultListButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultOptionInitButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultOptionInitButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRArrowButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultRArrowButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultLArrowButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultLArrowButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRRotateRSAButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultRRotateRSAButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultLRotateAFButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultLRotateAFButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRRotateButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultRRotateButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultLRotateButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultLRotateButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultBigTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultBigTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetPaidItemTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetPaidItemTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultTabButtonImageNotDis
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultTabButtonImageNotDis_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultSliderGripButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultSliderGripButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetNewSliderGripButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetNewSliderGripButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultMButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultMButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultBigButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultBigButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetTabButtonFontColor
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetTabButtonFontColor_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetSmallTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetSmallTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetMidTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetMidTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetMsgTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetMsgTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetChatTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetChatTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetBigTabButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetBigTabButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetGameStartBtnImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetGameStartBtnImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultQuickSlotButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultQuickSlotButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetControlKeyBtnImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetControlKeyBtnImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetGraphicAdvanceBtnImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetGraphicAdvanceBtnImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetGraphicUpDownBtnImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetGraphicUpDownBtnImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetWaitRoomInfoBtnImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetWaitRoomInfoBtnImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultButtonImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultButtonImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultCheckBoxImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultCheckBoxImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.SetDefaultRadioImage
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execSetDefaultRadioImage_Parms
{
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.StopTimeOut
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execStopTimeOut_Parms
{
	float                                              SetTime;                                          		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.StartTimeOut
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execStartTimeOut_Parms
{
	float                                              SetTime;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.OnTimeOut
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execOnTimeOut_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTOwnerDrawCaptionButtonHK.InitComponent
// Flags: 
struct UBTOwnerDrawCaptionButtonHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.Internal_OnRendered
// Flags: 
struct UBTOwnerDrawImageHK_execInternal_OnRendered_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              OldValueX;                                        		// 0x0004 ( 0x0004
	float                                              OldValueY;                                        		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.SetFontDrawType
// Flags: 
struct UBTOwnerDrawImageHK_execSetFontDrawType_Parms
{
	unsigned char                                      dt;                                               		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.SetFontShadowColorAll
// Flags: 
struct UBTOwnerDrawImageHK_execSetFontShadowColorAll_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.SetFontAndImageColorAll
// Flags: 
struct UBTOwnerDrawImageHK_execSetFontAndImageColorAll_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.SetFontColorAll
// Flags: 
struct UBTOwnerDrawImageHK_execSetFontColorAll_Parms
{
	class FColor                                       Col;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.SetFontSizeAll
// Flags: 
struct UBTOwnerDrawImageHK_execSetFontSizeAll_Parms
{
	int                                                Size;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.SetDefaultFontColor
// Flags: 
struct UBTOwnerDrawImageHK_execSetDefaultFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTOwnerDrawImageHK.SetToolTipsText
// Flags: 
struct UBTOwnerDrawImageHK_execSetToolTipsText_Parms
{
	struct FString                                     t;                                                		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.InternalDeactivate
// Flags: 
struct UBTMultiLineEditBoxHK_execInternalDeactivate_Parms
{
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.InternalActivate
// Flags: 
struct UBTMultiLineEditBoxHK_execInternalActivate_Parms
{
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.InternalOnKeyEvent
// Flags: 
struct UBTMultiLineEditBoxHK_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     temp;                                             		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     rightone;                                         		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
//	float                                              W;                                                		// 0x0024 ( 0x0004
//	float                                              HT;                                               		// 0x0028 ( 0x0004
//	int                                                lentextstrvis;                                    		// 0x002C ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.CheckKeyInputCondition
// Flags: 
struct UBTMultiLineEditBoxHK_execCheckKeyInputCondition_Parms
{
	struct FString                                     st;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.InternalOnKeyType
// Flags: 
struct UBTMultiLineEditBoxHK_execInternalOnKeyType_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	struct FString                                     Unicode;                                          		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     temp;                                             		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     st;                                               		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.ConvertIllegal
// Flags: 
struct UBTMultiLineEditBoxHK_execConvertIllegal_Parms
{
	struct FString                                     inputstr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	int                                                Max;                                              		// 0x001C ( 0x0004
//	struct FString                                     retval;                                           		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     C;                                                		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.CaretBinarySearch
// Flags: 
struct UBTMultiLineEditBoxHK_execCaretBinarySearch_Parms
{
	int                                                vlc;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lCursor;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                rCursor;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              mx;                                               		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                textLen;                                          		// 0x0014 ( 0x0004
//	int                                                pivotIndex;                                       		// 0x0018 ( 0x0004
//	float                                              W;                                                		// 0x001C ( 0x0004
//	float                                              HT;                                               		// 0x0020 ( 0x0004
//	struct FString                                     Text;                                             		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.MousePosToCaretPos
// Flags: 
struct UBTMultiLineEditBoxHK_execMousePosToCaretPos_Parms
{
	float                                              mx;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              my;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
//	int                                                lentextstrvis;                                    		// 0x0010 ( 0x0004
//	struct FString                                     rightone;                                         		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
//	float                                              W;                                                		// 0x0020 ( 0x0004
//	float                                              HT;                                               		// 0x0024 ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.UpdateLineInfo
// Flags: 
struct UBTMultiLineEditBoxHK_execUpdateLineInfo_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                TC;                                               		// 0x0004 ( 0x0004
	float                                              W;                                                		// 0x0008 ( 0x0004
	float                                              HT;                                               		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.OnMousePressed
// Flags: 
struct UBTMultiLineEditBoxHK_execOnMousePressed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRepeat:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.OnMouseRelease
// Flags: 
struct UBTMultiLineEditBoxHK_execOnMouseRelease_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.OnChange
// Flags: 
struct UBTMultiLineEditBoxHK_execOnChange_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.CaculateVisibleText
// Flags: 
struct UBTMultiLineEditBoxHK_execCaculateVisibleText_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                vlc;                                              		// 0x0004 ( 0x0004
	int                                                pos;                                              		// 0x0008 ( 0x0004
	float                                              HT;                                               		// 0x000C ( 0x0004
	float                                              scrollW;                                          		// 0x0010 ( 0x0004
	struct FString                                     temp;                                             		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                lenStr;                                           		// 0x0020 ( 0x0004
	unsigned long                                      bEnter:1;                                         		// 0x0024 ( 0x0004 [0x00000001]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.DrawIMEInfo
// Flags: 
struct UBTMultiLineEditBoxHK_execDrawIMEInfo_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              CursorWidth;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     tempString;                                       		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              width;                                            		// 0x0014 ( 0x0004
	float                                              SelectWidth;                                      		// 0x0018 ( 0x0004
	float                                              Height;                                           		// 0x001C ( 0x0004
	float                                              OffsetX;                                          		// 0x0020 ( 0x0004
	int                                                TextSize;                                         		// 0x0024 ( 0x0004
	int                                                SelectSize;                                       		// 0x0028 ( 0x0004
	struct FFloatBox                                   fbDraw;                                           		// 0x002C ( 0x0010
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.OwnerDraw
// Flags: 
struct UBTMultiLineEditBoxHK_execOwnerDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                MousePos;                                         		// 0x0008 ( 0x0004
//	int                                                i;                                                		// 0x000C ( 0x0004
//	float                                              X;                                                		// 0x0010 ( 0x0004
//	float                                              X2;                                               		// 0x0014 ( 0x0004
//	float                                              S;                                                		// 0x0018 ( 0x0004
//	float                                              E;                                                		// 0x001C ( 0x0004
//	float                                              sl;                                               		// 0x0020 ( 0x0004
//	float                                              el;                                               		// 0x0024 ( 0x0004
//	float                                              cursorW;                                          		// 0x0028 ( 0x0004
//	float                                              HT;                                               		// 0x002C ( 0x0004
//	struct FString                                     tempString;                                       		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.CaretPosToLinePos
// Flags: 
struct UBTMultiLineEditBoxHK_execCaretPosToLinePos_Parms
{
	int                                                pos;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                LinePos;                                          		// 0x0008 ( 0x0004
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.Clear
// Flags: 
struct UBTMultiLineEditBoxHK_execClear_Parms
{
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.SetVisibleLineCount
// Flags: 
struct UBTMultiLineEditBoxHK_execSetVisibleLineCount_Parms
{
	int                                                lc;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.InitComponent
// Flags: 
struct UBTMultiLineEditBoxHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.SetText
// Flags: 
struct UBTMultiLineEditBoxHK_execSetText_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.InputSelectionPos
// Flags: 
struct UBTMultiLineEditBoxHK_execInputSelectionPos_Parms
{
	int                                                pos;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.ResetSelectionPos
// Flags: 
struct UBTMultiLineEditBoxHK_execResetSelectionPos_Parms
{
	int                                                pos;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.GetSelectionText
// Flags: 
struct UBTMultiLineEditBoxHK_execGetSelectionText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.RemoveSelectionText
// Flags: 
struct UBTMultiLineEditBoxHK_execRemoveSelectionText_Parms
{
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.ProcessUndo
// Flags: 
struct UBTMultiLineEditBoxHK_execProcessUndo_Parms
{
	unsigned long                                      bForceBack:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                tempPos;                                          		// 0x0004 ( 0x0004
	struct FString                                     TempStr;                                          		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.SaveUndo
// Flags: 
struct UBTMultiLineEditBoxHK_execSaveUndo_Parms
{
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.OnChat
// Flags: 
struct UBTMultiLineEditBoxHK_execOnChat_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.SetFontSizeAll
// Flags: 
struct UBTMultiLineEditBoxHK_execSetFontSizeAll_Parms
{
	int                                                Size;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.SetSadowColor
// Flags: 
struct UBTMultiLineEditBoxHK_execSetSadowColor_Parms
{
	unsigned char                                      _R;                                               		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      _G;                                               		// 0x0001 ( 0x0001[ CPF_Parm ]
	unsigned char                                      _B;                                               		// 0x0002 ( 0x0001[ CPF_Parm ]
	unsigned char                                      _A;                                               		// 0x0003 ( 0x0001[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.SetFontColor
// Flags: 
struct UBTMultiLineEditBoxHK_execSetFontColor_Parms
{
	unsigned char                                      _R;                                               		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      _G;                                               		// 0x0001 ( 0x0001[ CPF_Parm ]
	unsigned char                                      _B;                                               		// 0x0002 ( 0x0001[ CPF_Parm ]
	unsigned char                                      _A;                                               		// 0x0003 ( 0x0001[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTMultiLineEditBoxHK.SetDefaultFontColor
// Flags: 
struct UBTMultiLineEditBoxHK_execSetDefaultFontColor_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTWindowErrorDefineHK.ShowErrorMsg
// Flags: 
struct UBTWindowErrorDefineHK_execShowErrorMsg_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrorMsg;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      titleID;                                          		// 0x0010 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     strTitle;                                         		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     strMsg;                                           		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowErrorDefineHK.ShowError
// Flags: 
struct UBTWindowErrorDefineHK_execShowError_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                errorCode;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      titleID;                                          		// 0x0008 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     strTitle;                                         		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     strMsg;                                           		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowErrorDefineHK.GetFormatString
// Flags: 
struct UBTWindowErrorDefineHK_execGetFormatString_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0028 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class UBTWindowErrorDefineHK*                      BTWindow;                                         		// 0x0034 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowErrorDefineHK.ExceptionCondtion
// Flags: 
struct UBTWindowErrorDefineHK_execExceptionCondtion_Parms
{
	int                                                errorCode;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowErrorDefineHK.SetContentText_Instance
// Flags: 
struct UBTWindowErrorDefineHK_execSetContentText_Instance_Parms
{
	int                                                Title;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Code;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg3;                                             		// 0x002C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     arrStr;                                           		// 0x0038 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     str_Title;                                        		// 0x0044 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     str_Msg;                                          		// 0x0050 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowWebBrowser.AllowOpen
// Flags: 
struct UBTWindowWebBrowser_execAllowOpen_Parms
{
	struct FString                                     MenuClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowWebBrowser.OpenWeb
// Flags: 
struct UBTWindowWebBrowser_execOpenWeb_Parms
{
	struct FString                                     openURL;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Left;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Top;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                Right;                                            		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Bottom;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x001C ( 0x0004
};

// Function GUIWarfareControls.BTWindowWebBrowser.OpenWebWindow
// Flags: 
struct UBTWindowWebBrowser_execOpenWebWindow_Parms
{
	class UGUIController*                              Controller;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     openURL;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Left;                                             		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                Top;                                              		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Right;                                            		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                Bottom;                                           		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FString                                     Title;                                            		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowWebBrowser.ButtonOK_OnClick
// Flags: 
struct UBTWindowWebBrowser_execButtonOK_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowWebBrowser.InitComponent
// Flags: 
struct UBTWindowWebBrowser_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPChatHK.Internal_DeActivate
// Flags: 
struct UBTTPChatHK_execInternal_DeActivate_Parms
{
	unsigned long                                      bInBounds:1;                                      		// 0x0000 ( 0x0004 [0x00000001]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPChatHK.Internal_OnPostDraw
// Flags: 
struct UBTTPChatHK_execInternal_OnPostDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTTPChatHK.Internal_OnPreDraw
// Flags: 
struct UBTTPChatHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	float                                              CurrentTime;                                      		// 0x000C ( 0x0004
//	float                                              ElapsedTime;                                      		// 0x0010 ( 0x0004
//	float                                              perc;                                             		// 0x0014 ( 0x0004
//	struct FFloatBox                                   fb;                                               		// 0x0018 ( 0x0010
//	struct FFloatBox                                   fb2;                                              		// 0x0028 ( 0x0010
};

// Function GUIWarfareControls.BTTPChatHK.FloatBoxMultiply
// Flags: 
struct UBTTPChatHK_execFloatBoxMultiply_Parms
{
	struct FFloatBox                                   A;                                                		// 0x0000 ( 0x0010[ CPF_Parm | CPF_OutParm ]
	float                                              B;                                                		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FFloatBox                                   ReturnValue;                                      		// 0x0014 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   temp;                                             		// 0x0024 ( 0x0010
};

// Function GUIWarfareControls.BTTPChatHK.FloatBoxSubstract
// Flags: 
struct UBTTPChatHK_execFloatBoxSubstract_Parms
{
	struct FFloatBox                                   A;                                                		// 0x0000 ( 0x0010[ CPF_Parm | CPF_OutParm ]
	struct FFloatBox                                   B;                                                		// 0x0010 ( 0x0010[ CPF_Parm | CPF_OutParm ]
	struct FFloatBox                                   ReturnValue;                                      		// 0x0020 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   temp;                                             		// 0x0030 ( 0x0010
};

// Function GUIWarfareControls.BTTPChatHK.FloatBoxAdd
// Flags: 
struct UBTTPChatHK_execFloatBoxAdd_Parms
{
	struct FFloatBox                                   A;                                                		// 0x0000 ( 0x0010[ CPF_Parm | CPF_OutParm ]
	struct FFloatBox                                   B;                                                		// 0x0010 ( 0x0010[ CPF_Parm | CPF_OutParm ]
	struct FFloatBox                                   ReturnValue;                                      		// 0x0020 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   temp;                                             		// 0x0030 ( 0x0010
};

// Function GUIWarfareControls.BTTPChatHK.ClearAll
// Flags: 
struct UBTTPChatHK_execClearAll_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfareControls.BTTPChatHK.SetChatState
// Flags: 
struct UBTTPChatHK_execSetChatState_Parms
{
	int                                                ChatState;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPChatHK.ButtonChatState_OnClick
// Flags: 
struct UBTTPChatHK_execButtonChatState_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTTPChatHK.ButtonChatStateArray_OnClick
// Flags: 
struct UBTTPChatHK_execButtonChatStateArray_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPChatHK.ButttonChat_OnClick
// Flags: 
struct UBTTPChatHK_execButttonChat_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPChatHK.InitComponent
// Flags: 
struct UBTTPChatHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTAutoScrollListHK*                         serverACL;                                        		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 serverButton;                                     		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fb;                                               		// 0x0010 ( 0x0010
	int                                                i;                                                		// 0x0020 ( 0x0004
};

// Function GUIWarfareControls.BTTPChatHK.SetEditText
// Flags: 
struct UBTTPChatHK_execSetEditText_Parms
{
	struct FString                                     Chat;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTTPChatHK.AddChatHistory
// Flags: 
struct UBTTPChatHK_execAddChatHistory_Parms
{
	int                                                Panel;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Chat;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class FColor                                       tcolor;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPChatHK.AddChatHistoryNoColor
// Flags: 
struct UBTTPChatHK_execAddChatHistoryNoColor_Parms
{
	int                                                Panel;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Chat;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTTPChatHK.OnChageChatMode
// Flags: 
struct UBTTPChatHK_execOnChageChatMode_Parms
{
	int                                                ChatMode;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPChatHK.ChangeTab_OnClick
// Flags: 
struct UBTTPChatHK_execChangeTab_OnClick_Parms
{
	int                                                TabIndex;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTabPanelHK.NewButtonComponent
// Flags: 
struct UBTTabPanelHK_execNewButtonComponent_Parms
{
	struct FFloatBox                                   fbNewCompo;                                       		// 0x0000 ( 0x0010[ CPF_Parm ]
	float                                              RenderWeight;                                     		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTOwnerDrawCaptionButtonHK*                 ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTabPanelHK.NewLabelComponent
// Flags: 
struct UBTTabPanelHK_execNewLabelComponent_Parms
{
	struct FFloatBox                                   fbNewCompo;                                       		// 0x0000 ( 0x0010[ CPF_Parm ]
	struct FImage                                      bgImg;                                            		// 0x0010 ( 0x0020[ CPF_Parm ]
	float                                              RenderWeight;                                     		// 0x0030 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTOwnerDrawImageHK*                         ReturnValue;                                      		// 0x0034 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTOwnerDrawImageHK*                         Label;                                            		// 0x0038 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTabPanelHK.TabGroups_OnSelect
// Flags: 
struct UBTTabPanelHK_execTabGroups_OnSelect_Parms
{
};

// Function GUIWarfareControls.BTWindowAutoStateHK.ShowState
// Flags: 
struct UBTWindowAutoStateHK_execShowState_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Code;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     strMsg;                                           		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowAutoStateHK.GetFormatString
// Flags: 
struct UBTWindowAutoStateHK_execGetFormatString_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0028 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class UBTWindowDefineInfoHK*                       BTWindow;                                         		// 0x0034 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowAutoStateHK.InitComponent
// Flags: 
struct UBTWindowAutoStateHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowStateHK.Internal_OnKeyEvent
// Flags: 
struct UBTWindowStateHK_execInternal_OnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      Action;                                           		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      iKey;                                             		// 0x000C ( 0x0001
//	unsigned char                                      iAction;                                          		// 0x000D ( 0x0001
};

// Function GUIWarfareControls.BTWindowStateHK.Internal_OnPreDraw
// Flags: 
struct UBTWindowStateHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              HT;                                               		// 0x0008 ( 0x0004
//	float                                              maxW;                                             		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.BTWindowStateHK.ShowWindow
// Flags: 
struct UBTWindowStateHK_execShowWindow_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowStateHK.UpdateRoomLobbyWindow
// Flags: 
struct UBTWindowStateHK_execUpdateRoomLobbyWindow_Parms
{
};

// Function GUIWarfareControls.BTWindowStateHK.UpdateDefaultWindow
// Flags: 
struct UBTWindowStateHK_execUpdateDefaultWindow_Parms
{
};

// Function GUIWarfareControls.BTWindowStateHK.SetData
// Flags: 
struct UBTWindowStateHK_execSetData_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowStateHK.InitComponent
// Flags: 
struct UBTWindowStateHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTTPTopMenuHK.InitComponent
// Flags: 
struct UBTTPTopMenuHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FImage                                      btimg;                                            		// 0x000C ( 0x0020
};

// Function GUIWarfareControls.BTTPTopMenuHK.Internal_OnRendered
// Flags: 
struct UBTTPTopMenuHK_execInternal_OnRendered_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPTopMenuHK.SetNewMailArrived
// Flags: 
struct UBTTPTopMenuHK_execSetNewMailArrived_Parms
{
	unsigned long                                      bNewMail:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPTopMenuHK.TopMenuButton_OnClick
// Flags: 
struct UBTTPTopMenuHK_execTopMenuButton_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPTopMenuHK.HeaderButton_OnClick
// Flags: 
struct UBTTPTopMenuHK_execHeaderButton_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowDefineStateHK.ShowState
// Flags: 
struct UBTWindowDefineStateHK_execShowState_Parms
{
	class UGUIController*                              con;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Code;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     strMsg;                                           		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowDefineStateHK.GetFormatString
// Flags: 
struct UBTWindowDefineStateHK_execGetFormatString_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     arg0;                                             		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg1;                                             		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     arg2;                                             		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0028 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class UBTWindowDefineInfoHK*                       BTWindow;                                         		// 0x0034 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowDefineStateHK.InitComponent
// Flags: 
struct UBTWindowDefineStateHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPItemListHK.Internal_OnRendered
// Flags: 
struct UBTTPItemListHK_execInternal_OnRendered_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTROItemBoxHK*                              ro;                                               		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPItemListHK.InitComponent
// Flags: 
struct UBTTPItemListHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPItemListHK.SetOutlineBorder
// Flags: 
struct UBTTPItemListHK_execSetOutlineBorder_Parms
{
	int                                                horz;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                vert;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPItemListHK.UpdateServerTime
// Flags: 
struct UBTTPItemListHK_execUpdateServerTime_Parms
{
	struct FBtrDouble                                  D;                                                		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowTodayResultHK.AddItem
// Flags: 
struct UBTWindowTodayResultHK_execAddItem_Parms
{
	int                                                pos;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ItemID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                PartID;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	class UBTROItemBoxHK*                              ro;                                               		// 0x000C ( 0x0004
	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x0010 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x0014 ( 0x0004
};

// Function GUIWarfareControls.BTWindowTodayResultHK.UpdateData
// Flags: 
struct UBTWindowTodayResultHK_execUpdateData_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                j;                                                		// 0x0004 ( 0x0004
	int                                                iLevelCount;                                      		// 0x0008 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x000C ( 0x0004
	class UwMatchMaker*                                MM;                                               		// 0x0010 ( 0x0004
	int                                                perc;                                             		// 0x0014 ( 0x0004
	int                                                curExp;                                           		// 0x0018 ( 0x0004
	int                                                maxExp;                                           		// 0x001C ( 0x0004
	int                                                startExp;                                         		// 0x0020 ( 0x0004
	struct FString                                     LevelName[ 0x03 ];                                		// 0x0024 ( 0x0024[ CPF_NeedCtorLink ]
	class TArray< class UwPromotionParam* >            arrItems;                                         		// 0x0048 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowTodayResultHK.TPItemList_ImageListBox_OnRendered_2
// Flags: 
struct UBTWindowTodayResultHK_execTPItemList_ImageListBox_OnRendered_2_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTROItemBoxHK*                              ro;                                               		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTWindowTodayResultHK.TPItemList_ImageListBox_OnRendered_1
// Flags: 
struct UBTWindowTodayResultHK_execTPItemList_ImageListBox_OnRendered_1_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTROItemBoxHK*                              ro;                                               		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTWindowTodayResultHK.TPItemList_ImageListBox_OnRendered_0
// Flags: 
struct UBTWindowTodayResultHK_execTPItemList_ImageListBox_OnRendered_0_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTROItemBoxHK*                              ro;                                               		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTWindowTodayResultHK.InitComponent
// Flags: 
struct UBTWindowTodayResultHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.BTWindowTodayResultHK.Exit_OnClick
// Flags: 
struct UBTWindowTodayResultHK_execExit_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowTodayResultHK.ImageListBox_OnClick
// Flags: 
struct UBTWindowTodayResultHK_execImageListBox_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTOwnerDrawSourceClipImageHK.Internal_OnRendered
// Flags: 
struct UBTOwnerDrawSourceClipImageHK_execInternal_OnRendered_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPQuestInfoHK.SetLabelQuestDesc
// Flags: 
struct UBTTPQuestInfoHK_execSetLabelQuestDesc_Parms
{
	int                                                RowIndex;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPQuestInfoHK.Hide
// Flags: 
struct UBTTPQuestInfoHK_execHide_Parms
{
};

// Function GUIWarfareControls.BTTPQuestInfoHK.Show
// Flags: 
struct UBTTPQuestInfoHK_execShow_Parms
{
};

// Function GUIWarfareControls.BTTPQuestInfoHK.SetMatchMaker
// Flags: 
struct UBTTPQuestInfoHK_execSetMatchMaker_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPQuestInfoHK.Internal_OnPreDraw
// Flags: 
struct UBTTPQuestInfoHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPQuestInfoHK.ACLQuest_OnClick
// Flags: 
struct UBTTPQuestInfoHK_execACLQuest_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPQuestInfoHK.ButtonClose_OnClick
// Flags: 
struct UBTTPQuestInfoHK_execButtonClose_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPQuestInfoHK.GetTopMenuOwner
// Flags: 
struct UBTTPQuestInfoHK_execGetTopMenuOwner_Parms
{
	class UGUIComponent*                               ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPQuestInfoHK.SetSlideTabPanel
// Flags: 
struct UBTTPQuestInfoHK_execSetSlideTabPanel_Parms
{
};

// Function GUIWarfareControls.BTTPQuestInfoHK.InitComponent
// Flags: 
struct UBTTPQuestInfoHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FFloatBox                                   fb;                                               		// 0x000C ( 0x0010
};

// Function GUIWarfareControls.BTTPQuestInfoHK.ButtonTab_OnClick
// Flags: 
struct UBTTPQuestInfoHK_execButtonTab_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPTeamMemberList.GetUserCount
// Flags: 
struct UBTTPTeamMemberList_execGetUserCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPTeamMemberList.ContextMenu_OnSelected
// Flags: 
struct UBTTPTeamMemberList_execContextMenu_OnSelected_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPTeamMemberList.OnPopupCheck
// Flags: 
struct UBTTPTeamMemberList_execOnPopupCheck_Parms
{
	class UBTACLTeamMemberListHK*                      acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMTeamMemberListHK*                       cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UwMatchMaker*                                MM;                                               		// 0x0008 ( 0x0004
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.BTTPTeamMemberList.OnNonSelectPopup
// Flags: 
struct UBTTPTeamMemberList_execOnNonSelectPopup_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLTeamMemberListHK*                      acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPTeamMemberList.OnPopup
// Flags: 
struct UBTTPTeamMemberList_execOnPopup_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLTeamMemberListHK*                      acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPTeamMemberList.ContextMenu_OnClose
// Flags: 
struct UBTTPTeamMemberList_execContextMenu_OnClose_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPTeamMemberList.ContextMenu_OnOpen
// Flags: 
struct UBTTPTeamMemberList_execContextMenu_OnOpen_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPTeamMemberList.InitComponent
// Flags: 
struct UBTTPTeamMemberList_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FFloatBox                                   fb;                                               		// 0x000C ( 0x0010
};

// Function GUIWarfareControls.BTTPTeamMemberList.ButtonTop_OnClick
// Flags: 
struct UBTTPTeamMemberList_execButtonTop_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTAutoColumnListDataHK.InitData
// Flags: 
struct UBTAutoColumnListDataHK_execInitData_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListDataHK.Init
// Flags: 
struct UBTAutoColumnListDataHK_execInit_Parms
{
	int                                                ColumnCount;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.SetUserServerInfo
// Flags: 
struct UBTTPMessengerHK_execSetUserServerInfo_Parms
{
	struct FString                                     szServername;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szServerShortName;                                		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szServerIP;                                       		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                serverPort;                                       		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned char                                      CurPos;                                           		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CurState;                                         		// 0x0029 ( 0x0001[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x002C ( 0x0004[ CPF_Parm ]
	struct FString                                     szChannelNickName;                                		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameRoomNum;                                      		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                Index;                                            		// 0x0040 ( 0x0004
	int                                                iRowIndex;                                        		// 0x0044 ( 0x0004
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0048 ( 0x0004
	unsigned long                                      bPlaying:1;                                       		// 0x004C ( 0x0004 [0x00000001]
	class UBTACLMessengerCommon*                       kACL;                                             		// 0x0050 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.HideTabButton
// Flags: 
struct UBTTPMessengerHK_execHideTabButton_Parms
{
	unsigned char                                      eTabMenuType;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ShowTabButton
// Flags: 
struct UBTTPMessengerHK_execShowTabButton_Parms
{
	unsigned char                                      eTabMenuType;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.UpdateTabButtonPosition
// Flags: 
struct UBTTPMessengerHK_execUpdateTabButtonPosition_Parms
{
	int                                                VisibleIndex;                                     		// 0x0000 ( 0x0004
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.Internal_OnVisiblePanelChanged
// Flags: 
struct UBTTPMessengerHK_execInternal_OnVisiblePanelChanged_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.UpdatePCBangInfo
// Flags: 
struct UBTTPMessengerHK_execUpdatePCBangInfo_Parms
{
};

// Function GUIWarfareControls.BTTPMessengerHK.ButtonMainPCBang_Playing_OnClick
// Flags: 
struct UBTTPMessengerHK_execButtonMainPCBang_Playing_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ButtonMainPCBang_Change_OnClick
// Flags: 
struct UBTTPMessengerHK_execButtonMainPCBang_Change_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ButtonMainPCBang_Register_OnClick
// Flags: 
struct UBTTPMessengerHK_execButtonMainPCBang_Register_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.BTWindowDefineARHK_18_19_OnOK
// Flags: 
struct UBTTPMessengerHK_execBTWindowDefineARHK_18_19_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.AddAclMsgMenu
// Flags: 
struct UBTTPMessengerHK_execAddAclMsgMenu_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.InitComponent
// Flags: 
struct UBTTPMessengerHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTAutoColumnListHK*                         serverACL;                                        		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 serverButton;                                     		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fb;                                               		// 0x0010 ( 0x0010
	int                                                i;                                                		// 0x0020 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.BTACLMessengerChannelHK_OnHitTop
// Flags: 
struct UBTTPMessengerHK_execBTACLMessengerChannelHK_OnHitTop_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.BTACLMessengerChannelHK_OnHitBottom
// Flags: 
struct UBTTPMessengerHK_execBTACLMessengerChannelHK_OnHitBottom_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.BTACLMessengerChannelHK_OnAdjustWindow
// Flags: 
struct UBTTPMessengerHK_execBTACLMessengerChannelHK_OnAdjustWindow_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ChannelUserList_OnAdjustWindow
// Flags: 
struct UBTTPMessengerHK_execChannelUserList_OnAdjustWindow_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ChannelUserList_OnHitTop
// Flags: 
struct UBTTPMessengerHK_execChannelUserList_OnHitTop_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ChannelUserList_OnHitBottom
// Flags: 
struct UBTTPMessengerHK_execChannelUserList_OnHitBottom_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ContextMenu_OnSelected
// Flags: 
struct UBTTPMessengerHK_execContextMenu_OnSelected_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupPCBangCheck
// Flags: 
struct UBTTPMessengerHK_execOnPopupPCBangCheck_Parms
{
	class UBTACLMessengerPCBangHK*                     acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerPCBangHK*                      cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupClanCheck
// Flags: 
struct UBTTPMessengerHK_execOnPopupClanCheck_Parms
{
	class UBTACLMessengerClanHK*                       acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerClanHK*                        cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupFriendCheck
// Flags: 
struct UBTTPMessengerHK_execOnPopupFriendCheck_Parms
{
	class UBTACLMessengerFriendHK*                     acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerFriendHK*                      cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupChannelCheck
// Flags: 
struct UBTTPMessengerHK_execOnPopupChannelCheck_Parms
{
	class UBTACLMessengerChannelHK*                    acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerChannelHK*                     cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupCheck
// Flags: 
struct UBTTPMessengerHK_execOnPopupCheck_Parms
{
	int                                                Panel;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListHK*                         acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupPCBang
// Flags: 
struct UBTTPMessengerHK_execOnPopupPCBang_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerPCBangHK*                     acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupClan
// Flags: 
struct UBTTPMessengerHK_execOnPopupClan_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerClanHK*                       acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupFriend
// Flags: 
struct UBTTPMessengerHK_execOnPopupFriend_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerFriendHK*                     acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.OnPopupChannel
// Flags: 
struct UBTTPMessengerHK_execOnPopupChannel_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerChannelHK*                    acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ContextMenu_OnClose
// Flags: 
struct UBTTPMessengerHK_execContextMenu_OnClose_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ContextMenu_OnOpen
// Flags: 
struct UBTTPMessengerHK_execContextMenu_OnOpen_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.LoadPos
// Flags: 
struct UBTTPMessengerHK_execLoadPos_Parms
{
	unsigned char                                      eTabMenuType;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.SavePos
// Flags: 
struct UBTTPMessengerHK_execSavePos_Parms
{
	unsigned char                                      eTabMenuType;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.RemoveAll
// Flags: 
struct UBTTPMessengerHK_execRemoveAll_Parms
{
	unsigned char                                      eTabMenuType;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfareControls.BTTPMessengerHK.RemoveChannelUser
// Flags: 
struct UBTTPMessengerHK_execRemoveChannelUser_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                Index;                                            		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.IsFriendlyUser
// Flags: 
struct UBTTPMessengerHK_execIsFriendlyUser_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                ListIdx;                                          		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0020 ( 0x0004
//	int                                                j;                                                		// 0x0024 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.UpdateFriendlyUser
// Flags: 
struct UBTTPMessengerHK_execUpdateFriendlyUser_Parms
{
	int                                                ListIdx;                                          		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                Index;                                            		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.FindFriendFromUserName
// Flags: 
struct UBTTPMessengerHK_execFindFriendFromUserName_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	int                                                Index;                                            		// 0x0014 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.AddPCBangUser
// Flags: 
struct UBTTPMessengerHK_execAddPCBangUser_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanMark;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0024 ( 0x0004[ CPF_Parm ]
	struct FString                                     ServerName;                                       		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ServerIP;                                         		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                serverPort;                                       		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                CurPos;                                           		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0048 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelNickName;                                  		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                RoomNum;                                          		// 0x0058 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x005C ( 0x0004[ CPF_Parm ]
	int                                                ClanWin;                                          		// 0x0060 ( 0x0004[ CPF_Parm ]
	int                                                ClanLose;                                         		// 0x0064 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookForClan;                                    		// 0x0068 ( 0x0001[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x006C ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0070 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0074 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x0078 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x007C ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x0080 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0084 ( 0x0004
	struct FImage                                      uii;                                              		// 0x0088 ( 0x0020
	int                                                i;                                                		// 0x00A8 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x00AC ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.AddClanUser
// Flags: 
struct UBTTPMessengerHK_execAddClanUser_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsLogOn;                                          		// 0x000C ( 0x0001[ CPF_Parm ]
	int                                                Level;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ClanWinCnt;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                ClanLoseCnt;                                      		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0024 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0028 ( 0x0004
	struct FImage                                      uii;                                              		// 0x002C ( 0x0020
	int                                                i;                                                		// 0x004C ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.AddFriendUser
// Flags: 
struct UBTTPMessengerHK_execAddFriendUser_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsLogOn;                                          		// 0x000C ( 0x0001[ CPF_Parm ]
	int                                                ClanMark;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x002C ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookForClan;                                    		// 0x0030 ( 0x0001[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0038 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x003C ( 0x0004
	struct FImage                                      uii;                                              		// 0x0040 ( 0x0020
	int                                                i;                                                		// 0x0060 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x0064 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.ReplaceChannelUser
// Flags: 
struct UBTTPMessengerHK_execReplaceChannelUser_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ClanPattern;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FString                                     UserName;                                         		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                UID;                                              		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                ClanWinCnt;                                       		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                ClanLoseCnt;                                      		// 0x0038 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookForClan;                                    		// 0x003C ( 0x0001[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x0054 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0058 ( 0x0004
	int                                                i;                                                		// 0x005C ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x0060 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.GetMessengerType
// Flags: 
struct UBTTPMessengerHK_execGetMessengerType_Parms
{
	unsigned char                                      CommunityType;                                    		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UBTAutoColumnListHK*                         ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTAutoColumnListHK*                         acl;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTTPMessengerHK.ReplaceClanName
// Flags: 
struct UBTTPMessengerHK_execReplaceClanName_Parms
{
	unsigned char                                      CommunityType;                                    		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     OldClanName;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     NewClanname;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UBTAutoColumnListHK*                         acl;                                              		// 0x001C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0020 ( 0x0004
	int                                                lp1;                                              		// 0x0024 ( 0x0004
	int                                                iUserNameIdx;                                     		// 0x0028 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.ReplaceClanLevel
// Flags: 
struct UBTTPMessengerHK_execReplaceClanLevel_Parms
{
	unsigned char                                      CommunityType;                                    		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanLevel;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0014 ( 0x0004
	class UBTAutoColumnListHK*                         acl;                                              		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                iClanNameIdx[ 0x04 ];                             		// 0x001C ( 0x0010
	int                                                iClanLevelIdx[ 0x04 ];                            		// 0x002C ( 0x0010
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x003C ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.ReplaceMyClanName
// Flags: 
struct UBTTPMessengerHK_execReplaceMyClanName_Parms
{
	unsigned char                                      CommunityType;                                    		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     UserName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     NewClanname;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UBTAutoColumnListHK*                         acl;                                              		// 0x001C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0020 ( 0x0004
	int                                                lp1;                                              		// 0x0024 ( 0x0004
	int                                                iUserNameIdx[ 0x02 ];                             		// 0x0028 ( 0x0008
};

// Function GUIWarfareControls.BTTPMessengerHK.ReplaceUserNickName
// Flags: 
struct UBTTPMessengerHK_execReplaceUserNickName_Parms
{
	unsigned char                                      CommunityType;                                    		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     OldUserName;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     NewUserName;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UBTAutoColumnListHK*                         acl;                                              		// 0x001C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0020 ( 0x0004
	int                                                lp1;                                              		// 0x0024 ( 0x0004
	int                                                iUserNameIdx;                                     		// 0x0028 ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.AddChannelUser
// Flags: 
struct UBTTPMessengerHK_execAddChannelUser_Parms
{
	int                                                ClanPattern;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                UID;                                              		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                ClanWinCnt;                                       		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                ClanLoseCnt;                                      		// 0x0034 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookForClan;                                    		// 0x0038 ( 0x0001[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x0050 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListDataHK*                     row;                                              		// 0x0054 ( 0x0004
	int                                                i;                                                		// 0x0058 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x005C ( 0x0004
};

// Function GUIWarfareControls.BTTPMessengerHK.FindChannelUser
// Flags: 
struct UBTTPMessengerHK_execFindChannelUser_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                Index;                                            		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.TabControlMocker.TabButton_OnClick
// Flags: 
struct UTabControlMocker_execTabButton_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.TabControlMocker.OnChangedTab
// Flags: 
struct UTabControlMocker_execOnChangedTab_Parms
{
	int                                                CurrentIndex;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                PrevIndex;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.TabControlMocker.GetCurrentTabIndex
// Flags: 
struct UTabControlMocker_execGetCurrentTabIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.TabControlMocker.GetVisiblePanelIndex
// Flags: 
struct UTabControlMocker_execGetVisiblePanelIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.TabControlMocker.GetVisiblePanel
// Flags: 
struct UTabControlMocker_execGetVisiblePanel_Parms
{
	class UGUIPanel*                                   ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.TabControlMocker.SetVisiblePanel
// Flags: 
struct UTabControlMocker_execSetVisiblePanel_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bChange:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.TabControlMocker.Clear
// Flags: 
struct UTabControlMocker_execClear_Parms
{
};

// Function GUIWarfareControls.TabControlMocker.BindTabButtonAndPanel
// Flags: 
struct UTabControlMocker_execBindTabButtonAndPanel_Parms
{
	class UGUIButton*                                  TabButton;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUITabPanel*                                Panel;                                            		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.TabControlMocker.InitComponent
// Flags: 
struct UTabControlMocker_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.TabControlMocker.OnVisiblePanelChanged
// Flags: 
struct UTabControlMocker_execOnVisiblePanelChanged_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.IsActiveMoveRoomState
// Flags: 
struct UBTCMMessengerOnOffline_execIsActiveMoveRoomState_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.IsActiveInviteState
// Flags: 
struct UBTCMMessengerOnOffline_execIsActiveInviteState_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.ChangeMoveRoomState
// Flags: 
struct UBTCMMessengerOnOffline_execChangeMoveRoomState_Parms
{
	unsigned long                                      bActive:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.ChangeInviteState
// Flags: 
struct UBTCMMessengerOnOffline_execChangeInviteState_Parms
{
	unsigned long                                      bActive:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.ChangeWispherState
// Flags: 
struct UBTCMMessengerOnOffline_execChangeWispherState_Parms
{
	unsigned long                                      bActive:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.SetLocation
// Flags: 
struct UBTCMMessengerOnOffline_execSetLocation_Parms
{
	struct FString                                     strChannelName;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameRoomNum;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     szLocName;                                        		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.SetLogOnState
// Flags: 
struct UBTCMMessengerOnOffline_execSetLogOnState_Parms
{
	int                                                nLogOnState;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTCMMessengerOnOffline.OnDraw
// Flags: 
struct UBTCMMessengerOnOffline_execOnDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                X;                                                		// 0x0008 ( 0x0004
//	int                                                Y;                                                		// 0x000C ( 0x0004
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	int                                                dy1;                                              		// 0x0014 ( 0x0004
//	int                                                dy2;                                              		// 0x0018 ( 0x0004
};

// Function GUIWarfareControls.BTContextMenuHK.RemoveItemByIndex
// Flags: 
struct UBTContextMenuHK_execRemoveItemByIndex_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTContextMenuHK.RemoveItemByName
// Flags: 
struct UBTContextMenuHK_execRemoveItemByName_Parms
{
	struct FString                                     ItemName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Index;                                            		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTContextMenuHK.InsertItem
// Flags: 
struct UBTContextMenuHK_execInsertItem_Parms
{
	struct FString                                     NewItem;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Index;                                            		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTContextMenuHK.AddItem
// Flags: 
struct UBTContextMenuHK_execAddItem_Parms
{
	struct FString                                     NewItem;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Index;                                            		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTContextMenuHK.ChangeStateByName
// Flags: 
struct UBTContextMenuHK_execChangeStateByName_Parms
{
	struct FString                                     ItemName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      st;                                               		// 0x000C ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Index;                                            		// 0x0014 ( 0x0004
};

// Function GUIWarfareControls.BTContextMenuHK.ChangeStateByIndex
// Flags: 
struct UBTContextMenuHK_execChangeStateByIndex_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      st;                                               		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTContextMenuHK.GetItemState
// Flags: 
struct UBTContextMenuHK_execGetItemState_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTContextMenuHK.InitComponent
// Flags: 
struct UBTContextMenuHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTContextMenuHK.OnDraw
// Flags: 
struct UBTContextMenuHK_execOnDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                CurState;                                         		// 0x000C ( 0x0004
//	float                                              X;                                                		// 0x0010 ( 0x0004
//	float                                              Y;                                                		// 0x0014 ( 0x0004
//	float                                              X2;                                               		// 0x0018 ( 0x0004
//	float                                              Y2;                                               		// 0x001C ( 0x0004
};

// Function GUIWarfareControls.BTContextMenuHK.OpenContextMenu
// Flags: 
struct UBTContextMenuHK_execOpenContextMenu_Parms
{
	int                                                MouseX;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MouseY;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTContextMenuHK.OnPreDraw
// Flags: 
struct UBTContextMenuHK_execOnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTContextMenuHK.OnSelect
// Flags: 
struct UBTContextMenuHK_execOnSelect_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                ClickIndex;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTContextMenuHK.OnSelected
// Flags: 
struct UBTContextMenuHK_execOnSelected_Parms
{
	int                                                SelectedIndex;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.MultiColumnList_OnEndToolTip
// Flags: 
struct UBTACLMessengerCommon_execMultiColumnList_OnEndToolTip_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.MultiColumnList_OnBeginToolTip
// Flags: 
struct UBTACLMessengerCommon_execMultiColumnList_OnBeginToolTip_Parms
{
	class UGUIToolTip*                                 ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.InitComponent
// Flags: 
struct UBTACLMessengerCommon_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.DrawClanName
// Flags: 
struct UBTACLMessengerCommon_execDrawClanName_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              L;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              t;                                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              R;                                                		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              B;                                                		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FACLData                                    Data;                                             		// 0x0014 ( 0x00AC[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szClanName;                                       		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                row;                                              		// 0x00CC ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.deleClanName
// Flags: 
struct UBTACLMessengerCommon_execdeleClanName_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              L;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              t;                                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              R;                                                		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              B;                                                		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FACLData                                    Data;                                             		// 0x0014 ( 0x00AC[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szClanName;                                       		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                row;                                              		// 0x00CC ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.GetClanName
// Flags: 
struct UBTACLMessengerCommon_execGetClanName_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetCurState
// Flags: 
struct UBTACLMessengerCommon_execSetCurState_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Value;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetChannelNumber
// Flags: 
struct UBTACLMessengerCommon_execSetChannelNumber_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Value;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetGameRoomNumber
// Flags: 
struct UBTACLMessengerCommon_execSetGameRoomNumber_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Value;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetServerName
// Flags: 
struct UBTACLMessengerCommon_execSetServerName_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Value;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetServerIP
// Flags: 
struct UBTACLMessengerCommon_execSetServerIP_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Value;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetServerPort
// Flags: 
struct UBTACLMessengerCommon_execSetServerPort_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Value;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetChannelName
// Flags: 
struct UBTACLMessengerCommon_execSetChannelName_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Value;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetCurLocationName
// Flags: 
struct UBTACLMessengerCommon_execSetCurLocationName_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Value;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTACLMessengerCommon.SetCurpos
// Flags: 
struct UBTACLMessengerCommon_execSetCurpos_Parms
{
	int                                                row;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Value;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.OnHitTop
// Flags: 
struct UBTAutoColumnListHK_execOnHitTop_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.OnHitBottom
// Flags: 
struct UBTAutoColumnListHK_execOnHitBottom_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.OnAdjustWindow
// Flags: 
struct UBTAutoColumnListHK_execOnAdjustWindow_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnAdjustTop
// Flags: 
struct UBTAutoColumnListHK_execMultiColumnList_OnAdjustTop_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_InternalDeactivate
// Flags: 
struct UBTAutoColumnListHK_execMultiColumnList_InternalDeactivate_Parms
{
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_InternalActivate
// Flags: 
struct UBTAutoColumnListHK_execMultiColumnList_InternalActivate_Parms
{
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnDrawItem
// Flags: 
struct UBTAutoColumnListHK_execMultiColumnList_OnDrawItem_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Item;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              X;                                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Y;                                                		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              W;                                                		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              HT;                                               		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSelected:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bPending:1;                                       		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0020 ( 0x0004
	int                                                rowState;                                         		// 0x0024 ( 0x0004
	float                                              Left;                                             		// 0x0028 ( 0x0004
	float                                              width;                                            		// 0x002C ( 0x0004
	struct FACLData                                    Data;                                             		// 0x0030 ( 0x00AC[ CPF_NeedCtorLink ]
	struct FACLData                                    data1;                                            		// 0x00DC ( 0x00AC[ CPF_NeedCtorLink ]
	float                                              ColumnWidth;                                      		// 0x0188 ( 0x0004
	float                                              columnHeight;                                     		// 0x018C ( 0x0004
	int                                                ImageIndex;                                       		// 0x0190 ( 0x0004
	struct FString                                     DrawText;                                         		// 0x0194 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.DrawDefaultRowImage
// Flags: 
struct UBTAutoColumnListHK_execDrawDefaultRowImage_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                hStep;                                            		// 0x0004 ( 0x0004
	int                                                X;                                                		// 0x0008 ( 0x0004
	int                                                Y;                                                		// 0x000C ( 0x0004
	int                                                X2;                                               		// 0x0010 ( 0x0004
	int                                                hCount;                                           		// 0x0014 ( 0x0004
	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.BackgroundImage_OnDraw
// Flags: 
struct UBTAutoColumnListHK_execBackgroundImage_OnDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.SpliterDraw
// Flags: 
struct UBTAutoColumnListHK_execSpliterDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              X;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              Y;                                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              W;                                                		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              HT;                                               		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                SpliterIndex;                                     		// 0x0014 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.GetItemHeight
// Flags: 
struct UBTAutoColumnListHK_execGetItemHeight_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnPreDraw
// Flags: 
struct UBTAutoColumnListHK_execMultiColumnList_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.FindLastPressedColumn
// Flags: 
struct UBTAutoColumnListHK_execFindLastPressedColumn_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Left;                                             		// 0x0004 ( 0x0004
//	float                                              width;                                            		// 0x0008 ( 0x0004
//	int                                                i;                                                		// 0x000C ( 0x0004
//	int                                                lx;                                               		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnDblClick
// Flags: 
struct UBTAutoColumnListHK_execMultiColumnList_OnDblClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiColumnList_OnClick
// Flags: 
struct UBTAutoColumnListHK_execMultiColumnList_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.NormalizeColumnPerc
// Flags: 
struct UBTAutoColumnListHK_execNormalizeColumnPerc_Parms
{
	float                                              sumPerc;                                          		// 0x0000 ( 0x0004
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.NormalizeMultiColumnPerc
// Flags: 
struct UBTAutoColumnListHK_execNormalizeMultiColumnPerc_Parms
{
	float                                              sumPerc;                                          		// 0x0000 ( 0x0004
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.BinarySearchIndexBySelectLocation
// Flags: 
struct UBTAutoColumnListHK_execBinarySearchIndexBySelectLocation_Parms
{
	int                                                ColumnIndex;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                valueIndex;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                dataIndex;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.ReverseBinarySearchIndexBySelectLocation
// Flags: 
struct UBTAutoColumnListHK_execReverseBinarySearchIndexBySelectLocation_Parms
{
	int                                                ColumnIndex;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                valueIndex;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                dataIndex;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.SortRoom
// Flags: 
struct UBTAutoColumnListHK_execSortRoom_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	class TArray< class UBTAutoColumnListDataHK* >     temp;                                             		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.SortBySelectLocation
// Flags: 
struct UBTAutoColumnListHK_execSortBySelectLocation_Parms
{
	int                                                ColumnIndex;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                valueIndex;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bReverseSort:1;                                   		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UBTAutoColumnListDataHK*                     Item;                                             		// 0x000C ( 0x0004
	int                                                insertPos;                                        		// 0x0010 ( 0x0004
	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.BinarySearchIndex
// Flags: 
struct UBTAutoColumnListHK_execBinarySearchIndex_Parms
{
	int                                                ColumnIndex;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                dataIndex;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
//	unsigned char                                      ct;                                               		// 0x0010 ( 0x0001
};

// Function GUIWarfareControls.BTAutoColumnListHK.ReverseBinarySearchIndex
// Flags: 
struct UBTAutoColumnListHK_execReverseBinarySearchIndex_Parms
{
	int                                                ColumnIndex;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                dataIndex;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.SortColumn
// Flags: 
struct UBTAutoColumnListHK_execSortColumn_Parms
{
	int                                                ColumnIndex;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bReverseSort:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UBTAutoColumnListDataHK*                     Item;                                             		// 0x0008 ( 0x0004
	int                                                insertPos;                                        		// 0x000C ( 0x0004
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.MultiCalculateIndex
// Flags: 
struct UBTAutoColumnListHK_execMultiCalculateIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	int                                                j;                                                		// 0x0008 ( 0x0004
//	int                                                NewIndex;                                         		// 0x000C ( 0x0004
//	int                                                ItemCount;                                        		// 0x0010 ( 0x0004
//	int                                                width;                                            		// 0x0014 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.GetCurrentIndex
// Flags: 
struct UBTAutoColumnListHK_execGetCurrentIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.GetRowByIndex
// Flags: 
struct UBTAutoColumnListHK_execGetRowByIndex_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTAutoColumnListDataHK*                     ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.RemoveAll
// Flags: 
struct UBTAutoColumnListHK_execRemoveAll_Parms
{
};

// Function GUIWarfareControls.BTAutoColumnListHK.RemoveRowArray
// Flags: 
struct UBTAutoColumnListHK_execRemoveRowArray_Parms
{
	int                                                StartIndex;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                endLength;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTAutoColumnListHK.RemoveRow
// Flags: 
struct UBTAutoColumnListHK_execRemoveRow_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.AddRow
// Flags: 
struct UBTAutoColumnListHK_execAddRow_Parms
{
	class UBTAutoColumnListDataHK*                     Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSet:1;                                           		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                Index;                                            		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.AddColumn
// Flags: 
struct UBTAutoColumnListHK_execAddColumn_Parms
{
	class UBTAutoColumnListHeaderHK*                   Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTAutoColumnListHK.InitComponent
// Flags: 
struct UBTAutoColumnListHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fb;                                               		// 0x0008 ( 0x0010
};

// Function GUIWarfareControls.BTAutoColumnListHK.LoadPos
// Flags: 
struct UBTAutoColumnListHK_execLoadPos_Parms
{
};

// Function GUIWarfareControls.BTAutoColumnListHK.SavePos
// Flags: 
struct UBTAutoColumnListHK_execSavePos_Parms
{
};

// Function GUIWarfareControls.BTAutoColumnListHK.InitScrollBar
// Flags: 
struct UBTAutoColumnListHK_execInitScrollBar_Parms
{
	struct FImage                                      zoneimg;                                          		// 0x0000 ( 0x0020
	class UBTScrollButtonHK*                           ibtn;                                             		// 0x0020 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTScrollButtonHK*                           dbtn;                                             		// 0x0024 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTGripButtonHK*                             Grip;                                             		// 0x0028 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTScrollZoneHK*                             Zone;                                             		// 0x002C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIVertScrollBar*                           vsb;                                              		// 0x0030 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowRequestApprovalClanHK.Internal_OnOpen
// Flags: 
struct UBTWindowRequestApprovalClanHK_execInternal_OnOpen_Parms
{
};

// Function GUIWarfareControls.BTWindowRequestApprovalClanHK.InitComponent
// Flags: 
struct UBTWindowRequestApprovalClanHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowRequestApprovalClanHK.SetCharInfo
// Flags: 
struct UBTWindowRequestApprovalClanHK_execSetCharInfo_Parms
{
	struct FCharInfo                                   stCharInfo;                                       		// 0x0000 ( 0x00C0[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowRequestApprovalClanHK.SetData
// Flags: 
struct UBTWindowRequestApprovalClanHK_execSetData_Parms
{
	int                                                ReqJoinUserIdx;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     CharName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Message;                                          		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowFindClanHK.Internal_OnOpen
// Flags: 
struct UBTWindowFindClanHK_execInternal_OnOpen_Parms
{
};

// Function GUIWarfareControls.BTWindowFindClanHK.ButtonSearch_OnClick
// Flags: 
struct UBTWindowFindClanHK_execButtonSearch_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowFindClanHK.ACLClanList_OnHitBottom
// Flags: 
struct UBTWindowFindClanHK_execACLClanList_OnHitBottom_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowFindClanHK.ACLClanList_OnHitTop
// Flags: 
struct UBTWindowFindClanHK_execACLClanList_OnHitTop_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowFindClanHK.SetPageLimit
// Flags: 
struct UBTWindowFindClanHK_execSetPageLimit_Parms
{
	int                                                minp;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                maxp;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowFindClanHK.InitComponent
// Flags: 
struct UBTWindowFindClanHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FFloatBox                                   fb;                                               		// 0x000C ( 0x0010
};

// Function GUIWarfareControls.BTWindowFindClanHK.GetSelectClanName
// Flags: 
struct UBTWindowFindClanHK_execGetSelectClanName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowFindClanHK.SetData
// Flags: 
struct UBTWindowFindClanHK_execSetData_Parms
{
	int                                                TotalPage;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ClanMarkPattern;                                  		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBG;                                       		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ClanMarkBL;                                       		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanMaster;                                       		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMember;                                       		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMemberMax;                                    		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanCreateDate;                                   		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanWin;                                          		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLose;                                         		// 0x0070 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanDraw;                                         		// 0x007C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanRank;                                         		// 0x0088 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ClanRecruit;                                      		// 0x0094 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x00A0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x00AC ( 0x0004
	struct FString                                     formCreateDate;                                   		// 0x00B0 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowRequestClanHK.Internal_OnOpen
// Flags: 
struct UBTWindowRequestClanHK_execInternal_OnOpen_Parms
{
};

// Function GUIWarfareControls.BTWindowRequestClanHK.InitComponent
// Flags: 
struct UBTWindowRequestClanHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfareControls.BTWindowRequestClanHK.SetClanInfo
// Flags: 
struct UBTWindowRequestClanHK_execSetClanInfo_Parms
{
	struct FClanInfo                                   stClanInfo;                                       		// 0x0000 ( 0x00A8[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowRequestClanHK.SetData
// Flags: 
struct UBTWindowRequestClanHK_execSetData_Parms
{
	int                                                InviterUserIdx;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     InviterCharname;                                  		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InviteMsg;                                        		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowClanInfoHK.Internal_OnOpen
// Flags: 
struct UBTWindowClanInfoHK_execInternal_OnOpen_Parms
{
};

// Function GUIWarfareControls.BTWindowClanInfoHK.InitComponent
// Flags: 
struct UBTWindowClanInfoHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FFloatBox                                   fb;                                               		// 0x000C ( 0x0010
};

// Function GUIWarfareControls.BTWindowClanInfoHK.SetData
// Flags: 
struct UBTWindowClanInfoHK_execSetData_Parms
{
	struct FClanInfo                                   stClanInfo;                                       		// 0x0000 ( 0x00A8[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                nPerc;                                            		// 0x00A8 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x00AC ( 0x0004
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.Internal_OnOpen
// Flags: 
struct UBTWindowUserDetailInfoHK_execInternal_OnOpen_Parms
{
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.InitComponent
// Flags: 
struct UBTWindowUserDetailInfoHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.InitializeRightPanel
// Flags: 
struct UBTWindowUserDetailInfoHK_execInitializeRightPanel_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	struct FFloatBox                                   fb;                                               		// 0x0004 ( 0x0010
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.InitializeLeftPanel
// Flags: 
struct UBTWindowUserDetailInfoHK_execInitializeLeftPanel_Parms
{
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.SetData
// Flags: 
struct UBTWindowUserDetailInfoHK_execSetData_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                MainWeaponID;                                     		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                MainWeaponPartID;                                 		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponID;                                      		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponPartID;                                  		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                HelmetID;                                         		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                FaceID;                                           		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                AcceID;                                           		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                AFBodyID;                                         		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                RSABodyID;                                        		// 0x0038 ( 0x0004[ CPF_Parm ]
	struct FCharInfo                                   stCharInfo;                                       		// 0x003C ( 0x00C0[ CPF_Parm ]
	int                                                nPerc;                                            		// 0x00FC ( 0x0004
	int                                                startExp;                                         		// 0x0100 ( 0x0004
	int                                                maxExp;                                           		// 0x0104 ( 0x0004
	struct FString                                     strPerc;                                          		// 0x0108 ( 0x000C[ CPF_NeedCtorLink ]
	class UwGameManager*                               GameMgr;                                          		// 0x0114 ( 0x0004
	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0118 ( 0x0004
	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x011C ( 0x0004
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.SetRankingInfo
// Flags: 
struct UBTWindowUserDetailInfoHK_execSetRankingInfo_Parms
{
	int                                                Ranking;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Win;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Lose;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                DisCon;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              fPerc;                                            		// 0x0010 ( 0x0004
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.SetEquipItemInfo
// Flags: 
struct UBTWindowUserDetailInfoHK_execSetEquipItemInfo_Parms
{
	int                                                MainWeaponID;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MainWeaponPartID;                                 		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponID;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponPartID;                                  		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                HelmetID;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                FaceID;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                AcceID;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                AFBodyID;                                         		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                RSABodyID;                                        		// 0x0020 ( 0x0004[ CPF_Parm ]
	class UwGameManager*                               GameMgr;                                          		// 0x0024 ( 0x0004
	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0028 ( 0x0004
	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x002C ( 0x0004
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.SetClanInfo
// Flags: 
struct UBTWindowUserDetailInfoHK_execSetClanInfo_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanPattern;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UwGameManager*                               GameMgr;                                          		// 0x001C ( 0x0004
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.SetMyInfo
// Flags: 
struct UBTWindowUserDetailInfoHK_execSetMyInfo_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                curExp;                                           		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                startExp;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                maxExp;                                           		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0028 ( 0x0004[ CPF_Parm ]
	struct FString                                     strPerc;                                          		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
	class UwGameManager*                               GameMgr;                                          		// 0x0038 ( 0x0004
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.SetSelfIntro
// Flags: 
struct UBTWindowUserDetailInfoHK_execSetSelfIntro_Parms
{
	struct FString                                     Intro;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.ChangeVisibleModel
// Flags: 
struct UBTWindowUserDetailInfoHK_execChangeVisibleModel_Parms
{
	unsigned long                                      bAF:1;                                            		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.Internal_OnPreDraw
// Flags: 
struct UBTWindowUserDetailInfoHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonRSA_OnClick
// Flags: 
struct UBTWindowUserDetailInfoHK_execButtonRSA_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonAF_OnClick
// Flags: 
struct UBTWindowUserDetailInfoHK_execButtonAF_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonRR_OnRelease
// Flags: 
struct UBTWindowUserDetailInfoHK_execButtonRR_OnRelease_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonRR_OnPressed
// Flags: 
struct UBTWindowUserDetailInfoHK_execButtonRR_OnPressed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRepeat:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonLR_OnRelease
// Flags: 
struct UBTWindowUserDetailInfoHK_execButtonLR_OnRelease_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfareControls.BTWindowUserDetailInfoHK.ButtonLR_OnPressed
// Flags: 
struct UBTWindowUserDetailInfoHK_execButtonLR_OnPressed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRepeat:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowUserPersonalInfo.SetClanInfo
// Flags: 
struct UBTWindowUserPersonalInfo_execSetClanInfo_Parms
{
	struct FClanInfo                                   ClanInfo;                                         		// 0x0000 ( 0x00A8[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowUserPersonalInfo.SetCharInfo
// Flags: 
struct UBTWindowUserPersonalInfo_execSetCharInfo_Parms
{
	struct FCharInfo                                   CharInfo;                                         		// 0x0000 ( 0x00C0[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowUserPersonalInfo.SetTcpChannel
// Flags: 
struct UBTWindowUserPersonalInfo_execSetTcpChannel_Parms
{
	class UBTTcpLink_Channel*                          TcpChannel;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowUserPersonalInfo.UpdateRankingInfoCompleted
// Flags: 
struct UBTWindowUserPersonalInfo_execUpdateRankingInfoCompleted_Parms
{
};

// Function GUIWarfareControls.BTWindowUserPersonalInfo.UpdateRankingInfoList
// Flags: 
struct UBTWindowUserPersonalInfo_execUpdateRankingInfoList_Parms
{
	unsigned char                                      RankingType;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CommunityType;                                    		// 0x0001 ( 0x0001[ CPF_Parm ]
	class TArray< struct FString >                     CharName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CharLevel;                                        		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkPattern;                                  		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBG;                                       		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBL;                                       		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum;                                    		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum_Prev;                               		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum_Exp;                                		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x0070 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x007C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x0088 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x0094 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00A0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfareControls.BTWindowUserPersonalInfo.UpdateRankingCount
// Flags: 
struct UBTWindowUserPersonalInfo_execUpdateRankingCount_Parms
{
	unsigned char                                      RankingType;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CommunityType;                                    		// 0x0001 ( 0x0001[ CPF_Parm ]
	int                                                TotalCount;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfareControls.BTWindowUserPersonalInfo.UpdateCharDetailInfo
// Flags: 
struct UBTWindowUserPersonalInfo_execUpdateCharDetailInfo_Parms
{
	int                                                MaxSerial;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MaxScore;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MaxKill;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                MaxAssist;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Serial3;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                Serial5;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Serial7;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                Serial10;                                         		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                Serial15;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                AR;                                               		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                SMG;                                              		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                SR;                                               		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                SW;                                               		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                Melee;                                            		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                Grenade;                                          		// 0x0038 ( 0x0004[ CPF_Parm ]
	int                                                FlashBang;                                        		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                Foot;                                             		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                AT4;                                              		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                MG;                                               		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Fire;                                             		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                RPG7;                                             		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                TimeBomb;                                         		// 0x0054 ( 0x0004[ CPF_Parm ]
	int                                                IcendiaryBomb;                                    		// 0x0058 ( 0x0004[ CPF_Parm ]
	int                                                ClusterBomb;                                      		// 0x005C ( 0x0004[ CPF_Parm ]
	int                                                ByChopper;                                        		// 0x0060 ( 0x0004[ CPF_Parm ]
	int                                                Artillery;                                        		// 0x0064 ( 0x0004[ CPF_Parm ]
	int                                                KillChopper;                                      		// 0x0068 ( 0x0004[ CPF_Parm ]
	int                                                FirstKill;                                        		// 0x006C ( 0x0004[ CPF_Parm ]
	int                                                LastKill;                                         		// 0x0070 ( 0x0004[ CPF_Parm ]
	int                                                AllKill;                                          		// 0x0074 ( 0x0004[ CPF_Parm ]
	int                                                Dominate;                                         		// 0x0078 ( 0x0004[ CPF_Parm ]
