#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : GUIWarfareControls
# >    File : Structs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Structs
# ======================================================================================== #
*/

// Struct GUIWarfareControls.BTEditBoxHK.SelectionArea
struct DLL_IMPORT FSelectionArea
{
	int                                                StartPos;                                         		// 0x0000 ( 0x0004[ CPF_Edit ]
	int                                                EndPos;                                           		// 0x0004 ( 0x0004[ CPF_Edit ]
}; // Size: 0x0008

// Struct GUIWarfareControls.BTWindowAutoResizeHK.StringAndFontSize
struct DLL_IMPORT FStringAndFontSize
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                FontSize;                                         		// 0x000C ( 0x0004
	class FColor                                       FontColor;                                        		// 0x0010 ( 0x0004
}; // Size: 0x0014

// Struct GUIWarfareControls.BTAutoColumnListDataHK.ACLData
struct DLL_IMPORT FACLData
{
	struct FString                                     strValue;                                         		// 0x0000 ( 0x000C[ CPF_Edit | CPF_NeedCtorLink ]
	int                                                IntValue;                                         		// 0x000C ( 0x0004[ CPF_Edit ]
	int                                                tempValue;                                        		// 0x0010 ( 0x0004[ CPF_Edit ]
	float                                              floatValue;                                       		// 0x0014 ( 0x0004[ CPF_Edit ]
	struct FImage                                      Image;                                            		// 0x0018 ( 0x0020[ CPF_Edit ]
	struct FText                                       Text[ 0x03 ];                                     		// 0x0038 ( 0x0054[ CPF_Edit | CPF_NeedCtorLink ]
	struct FImage                                      ServerGroupImg;                                   		// 0x008C ( 0x0020[ CPF_Edit ]
}; // Size: 0x00AC

// Struct GUIWarfareControls.BTTPOptionGraphicAdvanceHK.OptionGraphicAdvanceInfo
struct DLL_IMPORT FOptionGraphicAdvanceInfo
{
	int                                                TextureQuality;                                   		// 0x0000 ( 0x0004
	int                                                BackgroundQuality;                                		// 0x0004 ( 0x0004
	int                                                LOD;                                              		// 0x0008 ( 0x0004
	int                                                CharacterShadow;                                  		// 0x000C ( 0x0004
	unsigned long                                      bVSync:1;                                         		// 0x0010 ( 0x0004 [0x00000001]
	unsigned long                                      bShader:1;                                        		// 0x0010 ( 0x0004 [0x00000002]
	unsigned long                                      bShadows:1;                                       		// 0x0010 ( 0x0004 [0x00000004]
	unsigned long                                      bReflectionMap:1;                                 		// 0x0010 ( 0x0004 [0x00000008]
	unsigned long                                      bHDR:1;                                           		// 0x0010 ( 0x0004 [0x00000010]
	unsigned long                                      bDOF:1;                                           		// 0x0010 ( 0x0004 [0x00000020]
	unsigned long                                      bGlow:1;                                          		// 0x0010 ( 0x0004 [0x00000040]
	unsigned long                                      bDynamicLighting:1;                               		// 0x0010 ( 0x0004 [0x00000080]
	unsigned long                                      bCorona:1;                                        		// 0x0010 ( 0x0004 [0x00000100]
	unsigned long                                      bBlood:1;                                         		// 0x0010 ( 0x0004 [0x00000200]
	unsigned long                                      bDecal:1;                                         		// 0x0010 ( 0x0004 [0x00000400]
	int                                                DecalStayScale;                                   		// 0x0014 ( 0x0004
	int                                                PhysicEffect;                                     		// 0x0018 ( 0x0004
	unsigned long                                      bRagDoll:1;                                       		// 0x001C ( 0x0004 [0x00000001]
	int                                                Antialiasing;                                     		// 0x0020 ( 0x0004
	int                                                LevelOfAnisotropy;                                		// 0x0024 ( 0x0004
}; // Size: 0x0028

// Struct GUIWarfareControls.BTAutoColumnListHK.SaveListPos
struct DLL_IMPORT FSaveListPos
{
	int                                                Top;                                              		// 0x0000 ( 0x0004
	int                                                Index;                                            		// 0x0004 ( 0x0004
	int                                                LastSelected;                                     		// 0x0008 ( 0x0004
	int                                                selectIndex;                                      		// 0x000C ( 0x0004
	int                                                SelectIndexX;                                     		// 0x0010 ( 0x0004
	int                                                SelectIndexY;                                     		// 0x0014 ( 0x0004
	int                                                LastSelectedIndex;                                		// 0x0018 ( 0x0004
	int                                                LastSelectedIndexHistory;                         		// 0x001C ( 0x0004
}; // Size: 0x0020

// Struct GUIWarfareControls.BTACLTeamMemberListHK.StrInt_Struct
struct DLL_IMPORT FStrInt_Struct
{
	struct FString                                     strValue;                                         		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                IntValue;                                         		// 0x000C ( 0x0004
}; // Size: 0x0010

// Struct GUIWarfareControls.BTTPChatHK.ColoredChatText
struct DLL_IMPORT FColoredChatText
{
	int                                                ChatPanel;                                        		// 0x0000 ( 0x0004
	class FColor                                       ChatColor;                                        		// 0x0004 ( 0x0004
	struct FString                                     chatText;                                         		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
}; // Size: 0x0014

// Struct GUIWarfareControls.BTWindowRoomInfoHK.UIRoomInfoStruct
struct DLL_IMPORT FUIRoomInfoStruct
{
	struct FString                                     RoomName;                                         		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     RoomPassword;                                     		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     MapName;                                          		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                GameMode;                                         		// 0x0024 ( 0x0004
	int                                                TimeLimit;                                        		// 0x0028 ( 0x0004
	int                                                Score;                                            		// 0x002C ( 0x0004
	int                                                UserCount;                                        		// 0x0030 ( 0x0004
	int                                                WeaponLimit;                                      		// 0x0034 ( 0x0004
	unsigned long                                      bTeamBalance:1;                                   		// 0x0038 ( 0x0004 [0x00000001]
	unsigned long                                      bMultiBomb:1;                                     		// 0x0038 ( 0x0004 [0x00000002]
	unsigned long                                      bPlayWithBots:1;                                  		// 0x0038 ( 0x0004 [0x00000004]
	int                                                BotUserTeam;                                      		// 0x003C ( 0x0004
	int                                                BotNum0;                                          		// 0x0040 ( 0x0004
	int                                                BotNum1;                                          		// 0x0044 ( 0x0004
	int                                                BotDifficulty;                                    		// 0x0048 ( 0x0004
	unsigned long                                      bResPawnType:1;                                   		// 0x004C ( 0x0004 [0x00000001]
}; // Size: 0x0050

// Struct GUIWarfareControls.BTTPInventoryQuickSlotHK.SaveQuickSlot
struct DLL_IMPORT FSaveQuickSlot
{
	class UwItemBoxHK*                                 ItemInfo[ 0x09 ];                                 		// 0x0000 ( 0x0024
	class UwItemBoxInstanceHK*                         instanceInfo[ 0x09 ];                             		// 0x0024 ( 0x0024
}; // Size: 0x0048

// Struct GUIWarfareControls.BTTPOptionGraphicHK.DisplayModeInfo
struct DLL_IMPORT FDisplayModeInfo
{
	int                                                width;                                            		// 0x0000 ( 0x0004
	int                                                Height;                                           		// 0x0004 ( 0x0004
	int                                                SupportComboIdx;                                  		// 0x0008 ( 0x0004
	int                                                GraphicQuality;                                   		// 0x000C ( 0x0004
	unsigned long                                      UseGore:1;                                        		// 0x0010 ( 0x0004 [0x00000001]
	int                                                Brightness;                                       		// 0x0014 ( 0x0004
}; // Size: 0x0018

// Struct GUIWarfareControls.BTPageListButtonHK.PageBox
struct DLL_IMPORT FPageBox
{
	int                                                BeginIndex;                                       		// 0x0000 ( 0x0004
	int                                                EndIndex;                                         		// 0x0004 ( 0x0004
	int                                                MaxIndex;                                         		// 0x0008 ( 0x0004
	int                                                ListPerPageCount;                                 		// 0x000C ( 0x0004
	int                                                CurrentIndex;                                     		// 0x0010 ( 0x0004
}; // Size: 0x0014

// Struct GUIWarfareControls.BTTPAuctionMyAuctionHK.ReqAuctionList
struct DLL_IMPORT FReqAuctionList
{
	unsigned long                                      bLock:1;                                          		// 0x0000 ( 0x0004 [0x00000001]
	unsigned long                                      bHave:1;                                          		// 0x0000 ( 0x0004 [0x00000002]
	int                                                SaveTab[ 0x02 ];                                  		// 0x0004 ( 0x0008
}; // Size: 0x000C

// Struct GUIWarfareControls.BTTPOptionETCHK.ETCModeInfo
struct DLL_IMPORT FETCModeInfo
{
	int                                                nVoiceIndex;                                      		// 0x0000 ( 0x0004
	struct FString                                     strVoiceLang;                                     		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                iMinimapMode;                                     		// 0x0010 ( 0x0004
	int                                                iRecordResolution;                                		// 0x0014 ( 0x0004
	int                                                iRecordQuality;                                   		// 0x0018 ( 0x0004
	unsigned long                                      bRecordEnable:1;                                  		// 0x001C ( 0x0004 [0x00000001]
}; // Size: 0x0020

// Struct GUIWarfareControls.BTTPOptionSoundHK.OptionSoundInfo
struct DLL_IMPORT FOptionSoundInfo
{
	unsigned long                                      bSound:1;                                         		// 0x0000 ( 0x0004 [0x00000001]
	unsigned long                                      bMusic:1;                                         		// 0x0000 ( 0x0004 [0x00000002]
	int                                                SoundVolume;                                      		// 0x0004 ( 0x0004
	int                                                MusicVolume;                                      		// 0x0008 ( 0x0004
	unsigned long                                      bEAXSound:1;                                      		// 0x000C ( 0x0004 [0x00000001]
}; // Size: 0x0010

// Struct GUIWarfareControls.BTTPOptionInputHK.OptionInputInfo
struct DLL_IMPORT FOptionInputInfo
{
	float                                              MouseSensibility;                                 		// 0x0000 ( 0x0004
	float                                              MouseSensibilityAim;                              		// 0x0004 ( 0x0004
	unsigned long                                      bMouseInvert:1;                                   		// 0x0008 ( 0x0004 [0x00000001]
	unsigned long                                      bMouseAccel:1;                                    		// 0x0008 ( 0x0004 [0x00000002]
	unsigned long                                      bMouseRevision:1;                                 		// 0x0008 ( 0x0004 [0x00000004]
	unsigned long                                      bStanceToggle:1;                                  		// 0x0008 ( 0x0004 [0x00000008]
	unsigned long                                      bUseAdvCamShake:1;                                		// 0x0008 ( 0x0004 [0x00000010]
	unsigned long                                      bUseInverseWeapon:1;                              		// 0x0008 ( 0x0004 [0x00000020]
	struct FString                                     StoreKey[ 0x22 ];                                 		// 0x000C ( 0x0198[ CPF_NeedCtorLink ]
}; // Size: 0x01A4

// Struct GUIWarfareControls.BTTPOptionInputHK.InputKeyInfo
struct DLL_IMPORT FInputKeyInfo
{
	int                                                KeyNumber;                                        		// 0x0000 ( 0x0004
	struct FString                                     KeyName;                                          		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     LocalizedKeyName;                                 		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     Alias;                                            		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
}; // Size: 0x0028

#ifdef _MSC_VER
#pragma pack ( pop )
#endif

