#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : GUIWarfare
# >    File : Classes.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Constants
# ======================================================================================== #
*/

#define CONST_UserPingRefreshTime                                5
#define CONST_SendPingDelayTime                                  3

/*
# ======================================================================================== #
# > Enums
# ======================================================================================== #
*/

// Enum GUIWarfare.BTNetGUIPage.eUserState
enum eUserState
{
	eUState_waiting                                    = 0,
	eUState_ready                                      = 1,
	eUState_playing                                    = 2,
	eUState_shop                                       = 3,
	eUState_auction                                    = 4,
	eUState_inventory                                  = 5,
	eUState_mail                                       = 6,
	eUState_Tutorial                                   = 7,
	eUState_MyInfo                                     = 8
};

// Enum GUIWarfare.BTNetMainMenu.GameRoomType
enum GameRoomType
{
	GameRoomType_Normal                                = 0,
	GameRoomType_Permanent                             = 1,
	GameRoomType_ClanPermanent                         = 2,
	GameRoomType_Clan                                  = 3,
	GameRoomType_League                                = 4,
	GameRoomType_End                                   = 5
};

// Enum GUIWarfare.BTPageRoomLobby.E_MyAction
enum E_MyAction
{
	E_MY_ACTION_NONE                                   = 0,
	E_MY_ACTION_INTERVENTION                           = 1
};

// Enum GUIWarfare.BTWindowItemExpiredHK.eExpiredBuyType
enum eExpiredBuyType
{
	EBT_NONE                                           = 0,
	EBT_PCOIN                                          = 1,
	EBT_CCOIN                                          = 2,
	EBT_POINT                                          = 3
};


/*
# ======================================================================================== #
# > Classes
# ======================================================================================== #
*/

// Class GUIWarfare.BTConsole
class DLL_IMPORT UBTConsole : public UExtendedConsole
{
public:
	struct FString                                     strRecordRetCode[ 0x04 ];                         		// 0x0994 ( 0x0030 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     lsNotEnableRecordOption;                          		// 0x09C4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bStopOutofSeat:1;                                 		// 0x09D0 ( 0x0004 )  [0x00000001]
	int                                                OutofSeatTime;                                    		// 0x09D4 ( 0x0004 ) 
	int                                                OwnerOutofSeatTime;                               		// 0x09D8 ( 0x0004 ) 
	int                                                UserReadyTime;                                    		// 0x09DC ( 0x0004 ) 
	int                                                UserReadyTimeCount;                               		// 0x09E0 ( 0x0004 ) 
	int                                                preLevelTime;                                     		// 0x09E4 ( 0x0004 ) 
	int                                                LevelTime;                                        		// 0x09E8 ( 0x0004 ) 
	float                                              LastKeySleepTime;                                 		// 0x09EC ( 0x0004 ) 
	unsigned long                                      bReqFontReset:1;                                  		// 0x09F0 ( 0x0004 )  [0x00000001]
	struct FString                                     strChangeQS;                                      		// 0x09F4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strCloseQSWindow;                                 		// 0x0A00 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strChatMode[ 0x07 ];                              		// 0x0A0C ( 0x0054 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strChattingHelpGFS;                               		// 0x0A60 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strChattingHelp;                                  		// 0x0A6C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strRegulateShot;                                  		// 0x0A78 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strSaveShot;                                      		// 0x0A84 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbChatHistory[ 0x02 ];                            		// 0x0A90 ( 0x0020 ) 
	struct FFloatBox                                   fbButtonChatMode;                                 		// 0x0AB0 ( 0x0010 ) 
	struct FFloatBox                                   fbChatEditBox;                                    		// 0x0AC0 ( 0x0010 ) 
	struct FFloatBox                                   fbLabelEditBox;                                   		// 0x0AD0 ( 0x0010 ) 
	struct FString                                     strGhostChatModeTeam;                             		// 0x0AE0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strGhostChatModeAll;                              		// 0x0AEC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class TArray< struct FString >                     MessageType_PostString;                           		// 0x0AF8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class FColor >                       MessageType_Color;                                		// 0x0B04 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bChatEnabled:1;                                   		// 0x0B10 ( 0x0004 )  [0x00000001]
	class UBTChatEditBoxHK*                            ChatEditBox;                                      		// 0x0B14 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	float                                              CharEditBoxCursorHeightRatio;                     		// 0x0B18 ( 0x0004 ) 
	unsigned char                                      ChatMessageType;                                  		// 0x0B1C ( 0x0001 ) 
	unsigned long                                      bChatInGhostMode:1;                               		// 0x0B20 ( 0x0004 )  [0x00000001]
	class UMaterial*                                   ChatSelectImg;                                    		// 0x0B24 ( 0x0004 ) 
	class TArray< struct FMessageItem >                MessageItems;                                     		// 0x0B28 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              MessageItemsX;                                    		// 0x0B34 ( 0x0004 ) 
	float                                              MessageItemsYFromBottom;                          		// 0x0B38 ( 0x0004 ) 
	float                                              MessageItemsLineSpacing;                          		// 0x0B3C ( 0x0004 ) 
	int                                                MaxMessageItems;                                  		// 0x0B40 ( 0x0004 ) 
	unsigned char                                      byPressed_Shift;                                  		// 0x0B44 ( 0x0001 ) 
	unsigned long                                      ToggleIme:1;                                      		// 0x0B48 ( 0x0004 )  [0x00000001]
	unsigned long                                      ImeNative:1;                                      		// 0x0B48 ( 0x0004 )  [0x00000002]
	class UBTTcpLink_Channel*                          TcpHandler;                                       		// 0x0B4C ( 0x0004 ) 
	float                                              AccumDelta;                                       		// 0x0B50 ( 0x0004 ) 
	float                                              EventTimerDelta;                                  		// 0x0B54 ( 0x0004 ) 
	float                                              EventTimerNextStep;                               		// 0x0B58 ( 0x0004 ) 
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0B5C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class FColor                                       ShadowColor;                                      		// 0x0B60 ( 0x0004 ) 
	int                                                ResetImeCount;                                    		// 0x0B64 ( 0x0004 ) 
	unsigned long                                      bAltPressed:1;                                    		// 0x0B68 ( 0x0004 )  [0x00000001]
	int                                                currentBGM;                                       		// 0x0B6C ( 0x0004 ) 
	int                                                CurrentBGMHandle;                                 		// 0x0B70 ( 0x0004 ) 
	unsigned long                                      HasBGMDuration:1;                                 		// 0x0B74 ( 0x0004 )  [0x00000001]
	int                                                BGMStartTime;                                     		// 0x0B78 ( 0x0004 ) 
	int                                                BGMDuration;                                      		// 0x0B7C ( 0x0004 ) 
	float                                              BGMFadeInTime;                                    		// 0x0B80 ( 0x0004 ) 
	float                                              BGMFadeOutTime;                                   		// 0x0B84 ( 0x0004 ) 
	int                                                BGMTermBetween;                                   		// 0x0B88 ( 0x0004 ) 
	int                                                Term;                                             		// 0x0B8C ( 0x0004 ) 
	class TArray< struct FString >                     BGMs;                                             		// 0x0B90 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                BGMDurations;                                     		// 0x0B9C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FIntArray >                   BGMPartialPlayInitialSeeks;                       		// 0x0BA8 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      BGMPartialPlay:1;                                 		// 0x0BB4 ( 0x0004 )  [0x00000001]
	int                                                BGMPartialPlayDuration;                           		// 0x0BB8 ( 0x0004 ) 
	unsigned long                                      bGmPause:1;                                       		// 0x0BBC ( 0x0004 )  [0x00000001]

	// UScript Functions
	 void                      execConsoleCMD ( struct FString Line );           		// [ FUNC_Exec ] GUIWarfare.BTConsole.ConsoleCMD
	 void                      execSendQuestUpdate (  );                         		// [ FUNC_Exec ] GUIWarfare.BTConsole.SendQuestUpdate
	 void                      execShowTutorialEndWindow (  );                   		// [ FUNC_Exec ] GUIWarfare.BTConsole.ShowTutorialEndWindow
	 bool                      CheckTurorial_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTConsole.CheckTurorial_OnOK
	 void                      execSetAdminSpec ( int B );                       		// [ FUNC_Exec ] GUIWarfare.BTConsole.SetAdminSpec
	 void                      execGetBot (  );                                  		// [ FUNC_Exec ] GUIWarfare.BTConsole.GetBot
	 void                      execSetBot ( int withBot, int num0, int num1, int Grade );		// [ FUNC_Exec ] GUIWarfare.BTConsole.SetBot
	 void                      execLogBot (  );                                  		// [ FUNC_Exec ] GUIWarfare.BTConsole.LogBot
	 void                      UpdateAAS (  );                                   		//  GUIWarfare.BTConsole.UpdateAAS
	 void                      UpdateGameNotice (  );                            		//  GUIWarfare.BTConsole.UpdateGameNotice
	 void                      UpdateConnection ( float Delta );                 		//  GUIWarfare.BTConsole.UpdateConnection
	 void                      ProcessChatBan ( float Delta );                   		//  GUIWarfare.BTConsole.ProcessChatBan
	 void                      ProcessOutOfSleep_InRoomLobby (  );               		//  GUIWarfare.BTConsole.ProcessOutOfSleep_InRoomLobby
	 void                      ProcessOutOfDoing_InRoomLobby (  );               		//  GUIWarfare.BTConsole.ProcessOutOfDoing_InRoomLobby
	 void                      ProcessOutOfCounting ( int MaxTime, int CountTime, int CountingMsgCode, int OutMsgCode );		//  GUIWarfare.BTConsole.ProcessOutOfCounting
	 bool                      IsInRoomLobby (  );                               		//  GUIWarfare.BTConsole.IsInRoomLobby
	 void                      ProcessOutOfSeat ( float Delta );                 		//  GUIWarfare.BTConsole.ProcessOutOfSeat
	 bool                      IsExceptionOutOfSeat (  );                        		//  GUIWarfare.BTConsole.IsExceptionOutOfSeat
	 void                      eventTick ( float Delta );                        		// [ FUNC_Simulated | FUNC_Event ] GUIWarfare.BTConsole.Tick
	 void                      SetTermBetweenBGM ( float val );                  		//  GUIWarfare.BTConsole.SetTermBetweenBGM
	 void                      UpdateBGM ( float dt );                           		//  GUIWarfare.BTConsole.UpdateBGM
	 bool                      IsBGMPlaying (  );                                		//  GUIWarfare.BTConsole.IsBGMPlaying
	 void                      StopBGM (  );                                     		//  GUIWarfare.BTConsole.StopBGM
	 void                      NextBGM (  );                                     		//  GUIWarfare.BTConsole.NextBGM
	 void                      SetBGMAdvanced ( class TArray< struct FString > List, bool partialPlay, int partialDuration, class TArray< struct FIntArray > initialSeeks );		//  GUIWarfare.BTConsole.SetBGMAdvanced
	 void                      SetBGM ( class TArray< struct FString > List );   		//  GUIWarfare.BTConsole.SetBGM
	 void                      SetOneBGM ( struct FString List );                		//  GUIWarfare.BTConsole.SetOneBGM
	 struct FString            GetCurrentBGM (  );                               		//  GUIWarfare.BTConsole.GetCurrentBGM
	 void                      SwitchChatMessageType ( unsigned char key );      		//  GUIWarfare.BTConsole.SwitchChatMessageType
	 void                      execCallChatWhisper (  );                         		// [ FUNC_Exec ] GUIWarfare.BTConsole.CallChatWhisper
	 void                      execCallChatClan (  );                            		// [ FUNC_Exec ] GUIWarfare.BTConsole.CallChatClan
	 void                      execCallChatTeam (  );                            		// [ FUNC_Exec ] GUIWarfare.BTConsole.CallChatTeam
	 void                      execCallChatAll (  );                             		// [ FUNC_Exec ] GUIWarfare.BTConsole.CallChatAll
	 void                      execCallChatMode (  );                            		// [ FUNC_Exec ] GUIWarfare.BTConsole.CallChatMode
	 void                      SetChatHelpString (  );                           		//  GUIWarfare.BTConsole.SetChatHelpString
	 bool                      eventOnIME_Notify ( int Type, int LangID, struct FString strText, int StartPos, int Size );		// [ FUNC_Event ] GUIWarfare.BTConsole.OnIME_Notify
	 bool                      eventNeedToOffIME (  );                           		// [ FUNC_Event ] GUIWarfare.BTConsole.NeedToOffIME
	 void                      execDownloadWebzenShop (  );                      		// [ FUNC_Exec ] GUIWarfare.BTConsole.DownloadWebzenShop
	 void                      execCompletedQuest (  );                          		// [ FUNC_Exec ] GUIWarfare.BTConsole.CompletedQuest
	 void                      SendMessage ( struct FMessageItem msgItem );      		//  GUIWarfare.BTConsole.SendMessage
	 void                      ClearMessageItems (  );                           		//  GUIWarfare.BTConsole.ClearMessageItems
	 void                      AddMessageItem ( struct FMessageItem Item );      		//  GUIWarfare.BTConsole.AddMessageItem
	 struct FMessageItem       ConstructMessageItem ( struct FString Text, unsigned char MessageType );		//  GUIWarfare.BTConsole.ConstructMessageItem
	 void                      execProhibitAltTab (  );                          		// [ FUNC_Exec ] GUIWarfare.BTConsole.ProhibitAltTab
	 void                      execAddSystemMessageSaveShot ( struct FString Text );		// [ FUNC_Exec ] GUIWarfare.BTConsole.AddSystemMessageSaveShot
	 void                      execAddSystemMessageRegulateShot (  );            		// [ FUNC_Exec ] GUIWarfare.BTConsole.AddSystemMessageRegulateShot
	 void                      DrawMessageItems ( class UCanvas* C );            		//  GUIWarfare.BTConsole.DrawMessageItems
	 void                      DrawTextChattingHelp ( class UCanvas* C );        		//  GUIWarfare.BTConsole.DrawTextChattingHelp
	 void                      DrawChatEditBox ( class UCanvas* C );             		//  GUIWarfare.BTConsole.DrawChatEditBox
	 void                      PostRender ( class UCanvas* C );                  		//  GUIWarfare.BTConsole.PostRender
	 void                      PreRender ( class UCanvas* Canvas );              		//  GUIWarfare.BTConsole.PreRender
	 void                      FontReset (  );                                   		//  GUIWarfare.BTConsole.FontReset
	 void                      CallBattleHelp (  );                              		//  GUIWarfare.BTConsole.CallBattleHelp
	 void                      CallSelectRadioMessage ( int iIndex );            		//  GUIWarfare.BTConsole.CallSelectRadioMessage
	 void                      CallSelectQuickSlot ( int iIndex );               		//  GUIWarfare.BTConsole.CallSelectQuickSlot
	 void                      execCallToggleQuickSlot (  );                     		// [ FUNC_Exec ] GUIWarfare.BTConsole.CallToggleQuickSlot
	 void                      execSetLoadingTime ( int L, int P );              		// [ FUNC_Exec ] GUIWarfare.BTConsole.SetLoadingTime
	 void                      execCMDHK ( int Index, struct FString Param1, struct FString Param2, struct FString param3 );		// [ FUNC_Exec ] GUIWarfare.BTConsole.CMDHK
	 void                      execStopQuestLog (  );                            		// [ FUNC_Exec ] GUIWarfare.BTConsole.StopQuestLog
	 void                      execCloseWindow ( int Count );                    		// [ FUNC_Exec ] GUIWarfare.BTConsole.CloseWindow
	 void                      RecordOn_Exception ( int retCode );               		//  GUIWarfare.BTConsole.RecordOn_Exception
	 void                      RecordOn_FnRun ( int Index );                     		//  GUIWarfare.BTConsole.RecordOn_FnRun
	 bool                      RecordOn_OnOK ( class UGUIComponent* Sender );    		//  GUIWarfare.BTConsole.RecordOn_OnOK
	 void                      execRecordOn (  );                                		// [ FUNC_Exec ] GUIWarfare.BTConsole.RecordOn
	 void                      execShowWindow ( struct FString windowclassname );		// [ FUNC_Exec ] GUIWarfare.BTConsole.ShowWindow
	 void                      execStartAutoMove ( int Server, int Channel, int gameroom );		// [ FUNC_Exec ] GUIWarfare.BTConsole.StartAutoMove
	 void                      execendTutorial (  );                             		// [ FUNC_Exec ] GUIWarfare.BTConsole.endTutorial
	 void                      exectutorial ( struct FString Map );              		// [ FUNC_Exec ] GUIWarfare.BTConsole.tutorial
	 void                      execstopoos (  );                                 		// [ FUNC_Exec ] GUIWarfare.BTConsole.stopoos
	 bool                      BlockChangeWeapon ( int nIndex );                 		//  GUIWarfare.BTConsole.BlockChangeWeapon
	 bool                      IsHaveMainWeapon ( int nIndex );                  		//  GUIWarfare.BTConsole.IsHaveMainWeapon
	 bool                      KeyEvent ( unsigned char key, unsigned char Action, float Delta );		//  GUIWarfare.BTConsole.KeyEvent
	 bool                      KeyType ( unsigned char key, struct FString Unicode );		//  GUIWarfare.BTConsole.KeyType
	 bool                      GetChatEnabled (  );                              		//  GUIWarfare.BTConsole.GetChatEnabled
	 void                      SetChatEnabled ( bool Value );                    		//  GUIWarfare.BTConsole.SetChatEnabled
	 void                      ChatEditBox_OnInputSpace ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfare.BTConsole.ChatEditBox_OnInputSpace
	 void                      ChatEditBox_OnInputTab ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfare.BTConsole.ChatEditBox_OnInputTab
}; // Size: 0x022C

// Class GUIWarfare.BTNetGUIPage
class DLL_IMPORT UBTNetGUIPage : public UGUIPage
{
public:
	class UBTNetMainMenu*                              page_Main;                                        		// 0x0354 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTTcpLink_Channel*                          TcpChannel;                                       		// 0x0358 ( 0x0004 ) 
	class UBTTcpLink_Login*                            TcpLogin;                                         		// 0x035C ( 0x0004 ) 
	class TArray< struct FString >                     BGMList;                                          		// 0x0360 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTNetGameData*                              NetGameData;                                      		// 0x036C ( 0x0004 ) 
	class UBTDataTransferClientLink*                   DataTransferLink;                                 		// 0x0370 ( 0x0004 ) 
	struct FString                                     strSystem;                                        		// 0x0374 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strClanGrade[ 0x05 ];                             		// 0x0380 ( 0x003C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strSlashW;                                        		// 0x03BC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strSlashN;                                        		// 0x03C8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strSlashC;                                        		// 0x03D4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strSlashT;                                        		// 0x03E0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strTo;                                            		// 0x03EC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strFrom;                                          		// 0x03F8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strLink;                                          		// 0x0404 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strExit;                                          		// 0x0410 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      OnCompleteOpened (  );                            		//  GUIWarfare.BTNetGUIPage.OnCompleteOpened
	 void                      OnBackToLastPage (  );                            		//  GUIWarfare.BTNetGUIPage.OnBackToLastPage
	 void                      ProcessNat (  );                                  		//  GUIWarfare.BTNetGUIPage.ProcessNat
	 bool                      InternalOnPreDraw ( class UCanvas* C );           		//  GUIWarfare.BTNetGUIPage.InternalOnPreDraw
	 bool                      MyCanClose ( bool bCanceled );                    		//  GUIWarfare.BTNetGUIPage.MyCanClose
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUIWarfare.BTNetGUIPage.Opened
	 class UBTTcpLink_Login*   GetTcpLogin (  );                                 		//  GUIWarfare.BTNetGUIPage.GetTcpLogin
	 class UBTTcpLink_Channel* GetTcpChannel (  );                               		//  GUIWarfare.BTNetGUIPage.GetTcpChannel
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTNetGUIPage.InitComponent
	 struct FChatInfo          TextToChatInfo ( struct FString Text );           		//  GUIWarfare.BTNetGUIPage.TextToChatInfo
	 void                      RefreshPage (  );                                 		//  GUIWarfare.BTNetGUIPage.RefreshPage
}; // Size: 0x00C8

// Class GUIWarfare.BTNetMainMenu
class DLL_IMPORT UBTNetMainMenu : public UBTNetGUIPage
{
public:
	class UBTTPChatHK*                                 TPChat;                                           		// 0x041C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                CheckOneHour;                                     		// 0x0420 ( 0x0004 ) 
	unsigned char                                      eCurrPage;                                        		// 0x0424 ( 0x0001 ) 
	unsigned long                                      kClanWarUserCountIgnore:1;                        		// 0x0428 ( 0x0004 )  [0x00000001]
	class UPageOnWindowManager*                        pwm;                                              		// 0x042C ( 0x0004 ) 
	class UwMatchMaker*                                rMM;                                              		// 0x0430 ( 0x0004 ) [ CPF_Transient ]
	class UwMyPlayerStatus*                            rMyStatus;                                        		// 0x0434 ( 0x0004 ) [ CPF_Transient ]
	class UwGameManager*                               rGameMgr;                                         		// 0x0438 ( 0x0004 ) [ CPF_Transient ]
	struct FClanInfo                                   MyClanInfo;                                       		// 0x043C ( 0x00A8 ) [ CPF_NeedCtorLink ]
	struct FClanInfo                                   kRecvClanInfo;                                    		// 0x04E4 ( 0x00A8 ) [ CPF_NeedCtorLink ]
	struct FCharInfo                                   MyCharInfo;                                       		// 0x058C ( 0x00C0 ) 
	struct FString                                     MyClanName;                                       		// 0x064C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     SaveClanName;                                     		// 0x0658 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      InTutorial:1;                                     		// 0x0664 ( 0x0004 )  [0x00000001]
	unsigned long                                      EnterBotMode:1;                                   		// 0x0664 ( 0x0004 )  [0x00000002]
	unsigned long                                      CreateBotMode:1;                                  		// 0x0664 ( 0x0004 )  [0x00000004]
	unsigned long                                      bRequestItemList:1;                               		// 0x0664 ( 0x0004 )  [0x00000008]
	struct FWZInvenListProcess                         WZILP;                                            		// 0x0668 ( 0x001C ) [ CPF_NeedCtorLink ]
	int                                                CommandType;                                      		// 0x0684 ( 0x0004 ) 
	int                                                CommandParameter_int;                             		// 0x0688 ( 0x0004 ) 
	struct FString                                     CommandParameter_string;                          		// 0x068C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bIsInPCBang:1;                                    		// 0x0698 ( 0x0004 )  [0x00000001]
	unsigned long                                      bFirstLogin:1;                                    		// 0x0698 ( 0x0004 )  [0x00000002]
	unsigned long                                      bAutoMove:1;                                      		// 0x0698 ( 0x0004 )  [0x00000004]
	unsigned char                                      AutoMoveState;                                    		// 0x069C ( 0x0001 ) 
	unsigned long                                      AutoMoveDirectionOut:1;                           		// 0x06A0 ( 0x0004 )  [0x00000001]
	int                                                AutoMoveClanWar;                                  		// 0x06A4 ( 0x0004 ) 
	int                                                AutoMoveServerID;                                 		// 0x06A8 ( 0x0004 ) 
	int                                                AutoMoveChannelID;                                		// 0x06AC ( 0x0004 ) 
	int                                                AutoMoveGameRoomNum;                              		// 0x06B0 ( 0x0004 ) 
	struct FString                                     AutoMoveGameRoomPassword;                         		// 0x06B4 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bPostBoxFull:1;                                   		// 0x06C0 ( 0x0004 )  [0x00000001]
	unsigned long                                      bNewMailArrived:1;                                		// 0x06C0 ( 0x0004 )  [0x00000002]
	int                                                NewMailCount;                                     		// 0x06C4 ( 0x0004 ) 
	class TArray< struct FServerConnectionInfo >       SCIList;                                          		// 0x06C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FMapNameInfo >                MapNameList;                                      		// 0x06D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     AuthLogin_ClientIP;                               		// 0x06E0 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      AuthLogin_ChannelType;                            		// 0x06EC ( 0x0001 ) 
	unsigned char                                      AuthLogin_ConnectAlpha;                           		// 0x06ED ( 0x0001 ) 
	unsigned char                                      AuthLogin_AccountType;                            		// 0x06EE ( 0x0001 ) 
	struct FString                                     AuthLogin_GUID;                                   		// 0x06F0 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     AuthLogin_AccountID;                              		// 0x06FC ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                AuthLogin_ChannelingType;                         		// 0x0708 ( 0x0004 ) 
	struct FString                                     AuthLogin_AuthKey;                                		// 0x070C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     AuthLogin_RegionKey;                              		// 0x0718 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     BirthDay;                                         		// 0x0724 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      Sex;                                              		// 0x0730 ( 0x0001 ) 
	struct FString                                     szLoginPassword;                                  		// 0x0734 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                LoginTimeStamp;                                   		// 0x0740 ( 0x0004 ) 
	int                                                LoginHash1;                                       		// 0x0744 ( 0x0004 ) 
	int                                                LoginHash2;                                       		// 0x0748 ( 0x0004 ) 
	int                                                LoginHash3;                                       		// 0x074C ( 0x0004 ) 
	int                                                LoginHash4;                                       		// 0x0750 ( 0x0004 ) 
	int                                                LoginHash5;                                       		// 0x0754 ( 0x0004 ) 
	unsigned long                                      bWarningDurabilityAndExpired:1;                   		// 0x0758 ( 0x0004 )  [0x00000001]
	struct FString                                     strGMList;                                        		// 0x075C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bChatBan:1;                                       		// 0x0768 ( 0x0004 )  [0x00000001]
	unsigned long                                      bSystemChatBlock:1;                               		// 0x0768 ( 0x0004 )  [0x00000002]
	float                                              ChatAccumTime[ 0x04 ];                            		// 0x076C ( 0x0010 ) 
	int                                                ChatLogTop;                                       		// 0x077C ( 0x0004 ) 
	class TArray< struct FChatHistory >                ChatLog;                                          		// 0x0780 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     LastRecvWhispherName;                             		// 0x078C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FChatInfo                                   PrevChatMode;                                     		// 0x0798 ( 0x001C ) [ CPF_NeedCtorLink ]
	struct FString                                     strNotice_All;                                    		// 0x07B4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strNotice_Server;                                 		// 0x07C0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strNotice_Channel;                                		// 0x07CC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strNotice_Room;                                   		// 0x07D8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strKick;                                          		// 0x07E4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strChangeRoomTitle;                               		// 0x07F0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	float                                              NoticeUITimeSeconds;                              		// 0x07FC ( 0x0004 ) 
	float                                              NoticeUIPos;                                      		// 0x0800 ( 0x0004 ) 
	int                                                NoticeIndex;                                      		// 0x0804 ( 0x0004 ) 
	class TArray< struct FString >                     BatteryNotice;                                    		// 0x0808 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              AASUITimeSeconds;                                 		// 0x0814 ( 0x0004 ) 
	float                                              AASUIPos;                                         		// 0x0818 ( 0x0004 ) 
	class TArray< struct FAAS_Struct >                 BatteryAAS;                                       		// 0x081C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FAAS_Struct                                 AASTemp[ 0x02 ];                                  		// 0x0828 ( 0x0048 ) [ CPF_NeedCtorLink ]
	struct FString                                     strAASMessage[ 0x06 ];                            		// 0x0870 ( 0x0048 ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bNewAvailableQuest:1;                             		// 0x08B8 ( 0x0004 )  [0x00000001]
	unsigned long                                      bNewAvailableEventQuest:1;                        		// 0x08B8 ( 0x0004 )  [0x00000002]
	struct FLevelUpInfoStruct                          LevelUpInfo;                                      		// 0x08BC ( 0x0024 ) [ CPF_NeedCtorLink ]
	struct FExpiredItemsStruct                         ExpiredItems;                                     		// 0x08E0 ( 0x0010 ) [ CPF_NeedCtorLink ]
	struct FDurabilityWarningItemsStruct               DurWarningItems;                                  		// 0x08F0 ( 0x0010 ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     DestroyedDurabilityXItems;                        		// 0x0900 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                iSendUpdateQuickSlotList;                         		// 0x090C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageLogo*                                 page_Logo;                                        		// 0x0918 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Logo;                                    		// 0x091C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageLogin*                                page_Login;                                       		// 0x0928 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Login;                                   		// 0x092C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageLobby*                                page_Lobby2;                                      		// 0x0938 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Lobby2;                                  		// 0x093C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageCharacterCreation*                    page_CharacterCreation;                           		// 0x0948 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_CharacterCreation;                       		// 0x094C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageServerSelection*                      page_ServerSelection;                             		// 0x0958 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_ServerSelection;                         		// 0x095C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageRoomLobby*                            page_RoomLobby;                                   		// 0x0968 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_RoomLobby;                               		// 0x096C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageMatchResult*                          page_MatchResult2;                                		// 0x0978 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_MatchResult2;                            		// 0x097C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageAuction*                              page_Auction;                                     		// 0x0988 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Auction;                                 		// 0x098C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageHelp*                                 page_Help;                                        		// 0x0998 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Help;                                    		// 0x099C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageMail*                                 page_Mail;                                        		// 0x09A8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Mail;                                    		// 0x09AC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageStore*                                page_Store;                                       		// 0x09B8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Store;                                   		// 0x09BC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageInventory*                            page_Inventory;                                   		// 0x09C8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Inventory;                               		// 0x09CC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageMyInfo*                               page_MyInfo;                                      		// 0x09D8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_MyInfo;                                  		// 0x09DC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageClan*                                 page_Clan;                                        		// 0x09E8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Clan;                                    		// 0x09EC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageCredit*                               page_Credit;                                      		// 0x09F8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_Credit;                                  		// 0x09FC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTPageClanWar*                              page_ClanWar;                                     		// 0x0A08 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     pagename_ClanWar;                                 		// 0x0A0C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      PageOnOpen;                                       		// 0x0A18 ( 0x0001 ) 
	class UBTNetGUIPage*                               page_curr;                                        		// 0x0A1C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UBTNetGUIPage* >               Pages;                                            		// 0x0A20 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szAccountName;                                    		// 0x0A2C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szLoginServerIP;                                  		// 0x0A38 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                szLoginServerPort;                                		// 0x0A44 ( 0x0004 ) 
	int                                                GameRunningCount;                                 		// 0x0A48 ( 0x0004 ) 
	unsigned long                                      bConnectedLoginServer:1;                          		// 0x0A4C ( 0x0004 )  [0x00000001]
	unsigned long                                      bConnectedChannelServer:1;                        		// 0x0A4C ( 0x0004 )  [0x00000002]
	unsigned long                                      bAuthKeySuccess:1;                                		// 0x0A4C ( 0x0004 )  [0x00000004]
	struct FString                                     DefaultLobbyBGM;                                  		// 0x0A50 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     LastMainPageBGM;                                  		// 0x0A5C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                iUID;                                             		// 0x0A68 ( 0x0004 ) [ CPF_Transient ]
	int                                                iChannel;                                         		// 0x0A6C ( 0x0004 ) [ CPF_Transient ]
	struct FString                                     ServerName;                                       		// 0x0A70 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ServerShortName;                                  		// 0x0A7C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                ServerGroupID;                                    		// 0x0A88 ( 0x0004 ) 
	int                                                ServerID;                                         		// 0x0A8C ( 0x0004 ) 
	int                                                GameRoomID;                                       		// 0x0A90 ( 0x0004 ) 
	struct FString                                     ServerGroupName;                                  		// 0x0A94 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ChannelName;                                      		// 0x0AA0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                iRoomNum;                                         		// 0x0AAC ( 0x0004 ) [ CPF_Transient ]
	int                                                NatType;                                          		// 0x0AB0 ( 0x0004 ) 
	class TArray< struct FString >                     NatAddrs;                                         		// 0x0AB4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                NatPorts;                                         		// 0x0AC0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTNatDiag*                                  NatDiag;                                          		// 0x0ACC ( 0x0004 ) 
	float                                              TimeNatDiagStarted;                               		// 0x0AD0 ( 0x0004 ) 
	int                                                NatCheckLoop;                                     		// 0x0AD4 ( 0x0004 ) 
	float                                              NatDiagInterval;                                  		// 0x0AD8 ( 0x0004 ) 
	struct FString                                     LocalLogStr[ 0x09 ];                              		// 0x0ADC ( 0x006C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strNatType[ 0x04 ];                               		// 0x0B48 ( 0x0030 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strCashCharge;                                    		// 0x0B78 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FScriptDelegate                             __delegateCheckNat__Delegate;                     		// 0x0B84 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateRecv_ClanInfo__Delegate;                  		// 0x0B8C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateExpiredItemList__Delegate;                		// 0x0B94 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateDurabilityWarningItemList__Delegate;      		// 0x0B9C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateWebzenInvenList__Delegate;                		// 0x0BA4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateWebzenInvenListEnd__Delegate;             		// 0x0BAC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ClearChatLog__Delegate;                         		// 0x0BB4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __NormalChatLog__Delegate;                        		// 0x0BBC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ClanChatLog__Delegate;                          		// 0x0BC4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __WhisperChatLog__Delegate;                       		// 0x0BCC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __SelfChatLog__Delegate;                          		// 0x0BD4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __SystemChatLog__Delegate;                        		// 0x0BDC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __TeamChatLog__Delegate;                          		// 0x0BE4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __BroadCastItemChatLog__Delegate;                 		// 0x0BEC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ClearChatLog_Extra__Delegate;                   		// 0x0BF4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __NormalChatLog_Extra__Delegate;                  		// 0x0BFC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ClanChatLog_Extra__Delegate;                    		// 0x0C04 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __WhisperChatLog_Extra__Delegate;                 		// 0x0C0C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __SelfChatLog_Extra__Delegate;                    		// 0x0C14 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __SystemChatLog_Extra__Delegate;                  		// 0x0C1C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __TeamChatLog_Extra__Delegate;                    		// 0x0C24 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __BroadCastItemChatLog_Extra__Delegate;           		// 0x0C2C ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      SendLogin (  );                                   		//  GUIWarfare.BTNetMainMenu.SendLogin
	 bool                      OnAppExit ( class UGUIComponent* Sender );        		//  GUIWarfare.BTNetMainMenu.OnAppExit
	 bool                      TcpLogin_rfAckLoginWithGlobal_Test ( int Result );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithGlobal_Test
	 bool                      TcpLogin_rfAckLoginWithGlobal_Live ( int Result );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithGlobal_Live
	 bool                      TcpLogin_rfAckLoginWithThailand_Test ( int Result );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithThailand_Test
	 bool                      TcpLogin_rfAckLoginWithThailand_Live ( int Result );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithThailand_Live
	 bool                      TcpLogin_rfAckLoginWithWZAuth_Test ( int Result, unsigned char wzp_AccountType, unsigned char wzp_IsBlock, unsigned char wzp_AuthKeySuccess, unsigned char ChannelType );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithWZAuth_Test
	 bool                      TcpLogin_rfAckLoginWithWZAuth_Live ( int Result, unsigned char wzp_AccountType, unsigned char wzp_IsBlock, unsigned char wzp_AuthKeySuccess, unsigned char ChannelType );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithWZAuth_Live
	 bool                      TcpLogin_rfAckLoginWithTencentAuth_Test ( int Result, unsigned char tc_AccountType, unsigned char tc_IsBlock );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithTencentAuth_Test
	 bool                      TcpLogin_rfAckLoginWithTencentAuth_Live ( int Result, unsigned char tc_AccountType, unsigned char tc_IsBlock );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithTencentAuth_Live
	 void                      RequestUpdateQuickSlot ( int iQuickSlotIdx );     		//  GUIWarfare.BTNetMainMenu.RequestUpdateQuickSlot
	 void                      UpdateSendQuickSlotIndex ( int iQuickSlotIndex ); 		//  GUIWarfare.BTNetMainMenu.UpdateSendQuickSlotIndex
	 bool                      CheckMoveToChannel ( int iServerIndex );          		//  GUIWarfare.BTNetMainMenu.CheckMoveToChannel
	 void                      CheckWebzenShopItemList (  );                     		//  GUIWarfare.BTNetMainMenu.CheckWebzenShopItemList
	 void                      UpdateWebzenShopItemList ( int Year, int YearId, int SalesZoneCode );		//  GUIWarfare.BTNetMainMenu.UpdateWebzenShopItemList
	 bool                      ShowHelpWindow_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTNetMainMenu.ShowHelpWindow_OnOK
	 void                      ShowHelpWindow (  );                              		//  GUIWarfare.BTNetMainMenu.ShowHelpWindow
	 bool                      ShowReqCashWindow_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTNetMainMenu.ShowReqCashWindow_OnOK
	 bool                      ShowCashChargeWindow_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTNetMainMenu.ShowCashChargeWindow_OnOK
	 void                      ShowCashChargeWindow (  );                        		//  GUIWarfare.BTNetMainMenu.ShowCashChargeWindow
	 bool                      Internal_OnFunctionKey ( class UGUIComponent* Sender, unsigned char FunctionKey, struct FString Text );		//  GUIWarfare.BTNetMainMenu.Internal_OnFunctionKey
	 void                      TPChat_ChangeTab_OnClickTemp ( int TabIndex );    		//  GUIWarfare.BTNetMainMenu.TPChat_ChangeTab_OnClickTemp
	 void                      TPChat_ChangeTab_OnClick ( int TabIndex );        		//  GUIWarfare.BTNetMainMenu.TPChat_ChangeTab_OnClick
	 void                      TPChat_OnChageChatMode ( int ChatMode );          		//  GUIWarfare.BTNetMainMenu.TPChat_OnChageChatMode
	 void                      TPChat_OnInputTab ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfare.BTNetMainMenu.TPChat_OnInputTab
	 void                      TPChat_OnInputSpace ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfare.BTNetMainMenu.TPChat_OnInputSpace
	 bool                      Internal_OnChat ( class UGUIComponent* Sender, struct FString Text );		//  GUIWarfare.BTNetMainMenu.Internal_OnChat
	 void                      ChatBanEnd_OnTimer ( int Index );                 		//  GUIWarfare.BTNetMainMenu.ChatBanEnd_OnTimer
	 bool                      CheckChatBan (  );                                		//  GUIWarfare.BTNetMainMenu.CheckChatBan
	 bool                      UpdateChatBan (  );                               		//  GUIWarfare.BTNetMainMenu.UpdateChatBan
	 int                       IsInClanChannel ( struct FString ServerIP, int serverPort, int ChannelID );		//  GUIWarfare.BTNetMainMenu.IsInClanChannel
	 bool                      IsInPageLobby (  );                               		//  GUIWarfare.BTNetMainMenu.IsInPageLobby
	 bool                      IsInPageServerSelection (  );                     		//  GUIWarfare.BTNetMainMenu.IsInPageServerSelection
	 bool                      IsGameReadyOrPlaying (  );                        		//  GUIWarfare.BTNetMainMenu.IsGameReadyOrPlaying
	 bool                      IsInRangeDate ( struct FBtrDouble ServerTime, int syear, int smonth, int sday, int shour, int smin, int eyear, int emonth, int eday, int ehour, int emin );		//  GUIWarfare.BTNetMainMenu.IsInRangeDate
	 bool                      Is18YearsOld ( struct FBtrDouble ServerTime, struct FString BirthDay );		//  GUIWarfare.BTNetMainMenu.Is18YearsOld
	 void                      UpdateTimeBatteryAAS (  );                        		//  GUIWarfare.BTNetMainMenu.UpdateTimeBatteryAAS
	 void                      PopAASQueue (  );                                 		//  GUIWarfare.BTNetMainMenu.PopAASQueue
	 float                     GetAASFirstTime (  );                             		//  GUIWarfare.BTNetMainMenu.GetAASFirstTime
	 struct FString            GetAASFirst (  );                                 		//  GUIWarfare.BTNetMainMenu.GetAASFirst
	 void                      PushAASQueue ( struct FString Text, float Time, unsigned char AASLevel );		//  GUIWarfare.BTNetMainMenu.PushAASQueue
	 float                     GetAASBeginTime ( unsigned char byLevel );        		//  GUIWarfare.BTNetMainMenu.GetAASBeginTime
	 unsigned char             GetAASLevel (  );                                 		//  GUIWarfare.BTNetMainMenu.GetAASLevel
	 void                      SetAASMessage ( unsigned char byType, int AccumTime );		//  GUIWarfare.BTNetMainMenu.SetAASMessage
	 void                      ResetBatteryAAS (  );                             		//  GUIWarfare.BTNetMainMenu.ResetBatteryAAS
	 void                      UpdateTimeBatteryNotice (  );                     		//  GUIWarfare.BTNetMainMenu.UpdateTimeBatteryNotice
	 void                      PopNoticeQueue (  );                              		//  GUIWarfare.BTNetMainMenu.PopNoticeQueue
	 struct FString            GetNoticeFirst (  );                              		//  GUIWarfare.BTNetMainMenu.GetNoticeFirst
	 void                      PushNoticeQueue ( struct FString Notice );        		//  GUIWarfare.BTNetMainMenu.PushNoticeQueue
	 void                      ResetBatteryNotice (  );                          		//  GUIWarfare.BTNetMainMenu.ResetBatteryNotice
	 bool                      TextToGMCommand ( struct FString Text );          		//  GUIWarfare.BTNetMainMenu.TextToGMCommand
	 bool                      TextToCommand ( struct FString Text );            		//  GUIWarfare.BTNetMainMenu.TextToCommand
	 void                      UpdateChatLog (  );                               		//  GUIWarfare.BTNetMainMenu.UpdateChatLog
	 void                      ResetChatLog (  );                                		//  GUIWarfare.BTNetMainMenu.ResetChatLog
	 bool                      SelectChatLog ( int ChatType, struct FString chatText );		//  GUIWarfare.BTNetMainMenu.SelectChatLog
	 void                      BroadCastItemChatLog_Extra ( struct FString cL ); 		//  GUIWarfare.BTNetMainMenu.BroadCastItemChatLog_Extra
	 void                      TeamChatLog_Extra ( struct FString cL );          		//  GUIWarfare.BTNetMainMenu.TeamChatLog_Extra
	 void                      SystemChatLog_Extra ( struct FString cL );        		//  GUIWarfare.BTNetMainMenu.SystemChatLog_Extra
	 void                      SelfChatLog_Extra ( struct FString cL );          		//  GUIWarfare.BTNetMainMenu.SelfChatLog_Extra
	 void                      WhisperChatLog_Extra ( struct FString cL );       		//  GUIWarfare.BTNetMainMenu.WhisperChatLog_Extra
	 void                      ClanChatLog_Extra ( struct FString cL );          		//  GUIWarfare.BTNetMainMenu.ClanChatLog_Extra
	 void                      NormalChatLog_Extra ( struct FString cL );        		//  GUIWarfare.BTNetMainMenu.NormalChatLog_Extra
	 void                      ClearChatLog_Extra (  );                          		//  GUIWarfare.BTNetMainMenu.ClearChatLog_Extra
	 void                      BroadCastItemChatLog ( struct FString cL );       		//  GUIWarfare.BTNetMainMenu.BroadCastItemChatLog
	 void                      TeamChatLog ( struct FString cL );                		//  GUIWarfare.BTNetMainMenu.TeamChatLog
	 void                      SystemChatLog ( struct FString cL );              		//  GUIWarfare.BTNetMainMenu.SystemChatLog
	 void                      SelfChatLog ( struct FString cL );                		//  GUIWarfare.BTNetMainMenu.SelfChatLog
	 void                      WhisperChatLog ( struct FString cL );             		//  GUIWarfare.BTNetMainMenu.WhisperChatLog
	 void                      ClanChatLog ( struct FString cL );                		//  GUIWarfare.BTNetMainMenu.ClanChatLog
	 void                      NormalChatLog ( struct FString cL );              		//  GUIWarfare.BTNetMainMenu.NormalChatLog
	 void                      ClearChatLog (  );                                		//  GUIWarfare.BTNetMainMenu.ClearChatLog
	 int                       GetChatLogTopIndex (  );                          		//  GUIWarfare.BTNetMainMenu.GetChatLogTopIndex
	 void                      AddChatLog ( struct FString chatText, int ChatType, bool bForceUpdateLast );		//  GUIWarfare.BTNetMainMenu.AddChatLog
	 bool                      Exit_OnOK ( class UGUIComponent* Sender );        		//  GUIWarfare.BTNetMainMenu.Exit_OnOK
	 bool                      TcpLogin_rfAckHash ( int Result, struct FString Error );		//  GUIWarfare.BTNetMainMenu.TcpLogin_rfAckHash
	 void                      TcpLogin_OnError ( int ErrCode );                 		//  GUIWarfare.BTNetMainMenu.TcpLogin_OnError
	 void                      TcpLogin_OnClose ( int ErrCode );                 		//  GUIWarfare.BTNetMainMenu.TcpLogin_OnClose
	 void                      TcpLogin_OnConnect ( int ErrCode );               		//  GUIWarfare.BTNetMainMenu.TcpLogin_OnConnect
	 void                      SetPage ( unsigned char PageType, bool closeLastMenu );		//  GUIWarfare.BTNetMainMenu.SetPage
	 void                      HaltNetwork (  );                                 		//  GUIWarfare.BTNetMainMenu.HaltNetwork
	 bool                      eventrfReqForceNatTypeSetting ( int NatType );    		// [ FUNC_Event ] GUIWarfare.BTNetMainMenu.rfReqForceNatTypeSetting
	 void                      CheckNatPhrase2HK (  );                           		//  GUIWarfare.BTNetMainMenu.CheckNatPhrase2HK
	 void                      CheckNatPhrase1HK (  );                           		//  GUIWarfare.BTNetMainMenu.CheckNatPhrase1HK
	 void                      CheckNatPhrase0HK (  );                           		//  GUIWarfare.BTNetMainMenu.CheckNatPhrase0HK
	 void                      StartNatCheck (  );                               		//  GUIWarfare.BTNetMainMenu.StartNatCheck
	 void                      eventrfReqStartNatDiag ( struct FString Server1Addr, int Server1Port, struct FString Server2Addr, int Server2Port );		// [ FUNC_Event ] GUIWarfare.BTNetMainMenu.rfReqStartNatDiag
	 void                      deleOnClose ( bool bCancelled );                  		//  GUIWarfare.BTNetMainMenu.deleOnClose
	 bool                      deleOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  GUIWarfare.BTNetMainMenu.deleOnKeyEvent
	 void                      deleOnOpen (  );                                  		//  GUIWarfare.BTNetMainMenu.deleOnOpen
	 class UBTTcpLink_Login*   GetTcpLogin (  );                                 		//  GUIWarfare.BTNetMainMenu.GetTcpLogin
	 void                      InitializeTcpLogin ( struct FString IP, int Port );		//  GUIWarfare.BTNetMainMenu.InitializeTcpLogin
	 void                      InitializeTcpChannel ( struct FString IP, int Port, int DataPort );		//  GUIWarfare.BTNetMainMenu.InitializeTcpChannel
	 void                      ShowPlayTimePerHour_OnEventTimer ( int Index );   		//  GUIWarfare.BTNetMainMenu.ShowPlayTimePerHour_OnEventTimer
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTNetMainMenu.InitComponent
	 void                      KeepMoving (  );                                  		//  GUIWarfare.BTNetMainMenu.KeepMoving
	 void                      EndAutoMove (  );                                 		//  GUIWarfare.BTNetMainMenu.EndAutoMove
	 void                      StartAutoMove ( int Server, int Channel, int gameroom, struct FString Password, int ClanMatch_EnterState );		//  GUIWarfare.BTNetMainMenu.StartAutoMove
	 struct FString            FindChannelNickName ( int ServerID, int ChannelID );		//  GUIWarfare.BTNetMainMenu.FindChannelNickName
	 struct FString            FindServerShortName ( int ServerID, int ChannelID );		//  GUIWarfare.BTNetMainMenu.FindServerShortName
	 struct FString            FindServerName ( int ServerID );                  		//  GUIWarfare.BTNetMainMenu.FindServerName
	 int                       FindServerConnectionInfoIndex ( int ServerID, int ChannelID );		//  GUIWarfare.BTNetMainMenu.FindServerConnectionInfoIndex
	 int                       FindServerChannelInfoIndexByServerIP ( struct FString ServerIP, int serverPort, int ChannelID );		//  GUIWarfare.BTNetMainMenu.FindServerChannelInfoIndexByServerIP
	 void                      AddServerChannelList ( int ServerID, int ChannelID, struct FString ServerIP, int serverPort, int ServerDataPort, struct FString ServerName, struct FString ServerShortName, struct FString ChannelName, int ServerGroupID, struct FString ServerGroupName, int IsClanChannel, struct FString ChannelNickName, int ChannelType, bool IsDedicatedServer, int nCurUser, int nMaxUser );		//  GUIWarfare.BTNetMainMenu.AddServerChannelList
	 void                      ClearServerChannelList (  );                      		//  GUIWarfare.BTNetMainMenu.ClearServerChannelList
	 void                      CheckItemWarning (  );                            		//  GUIWarfare.BTNetMainMenu.CheckItemWarning
	 bool                      CheckDestroyedDurabilityXItemList (  );           		//  GUIWarfare.BTNetMainMenu.CheckDestroyedDurabilityXItemList
	 bool                      CheckDestroyedDurabilityXItemList_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTNetMainMenu.CheckDestroyedDurabilityXItemList_OnOK
	 bool                      CompleteDestroyedDurabilityXItemList (  );        		//  GUIWarfare.BTNetMainMenu.CompleteDestroyedDurabilityXItemList
	 bool                      CheckDurabilityWarningItemList (  );              		//  GUIWarfare.BTNetMainMenu.CheckDurabilityWarningItemList
	 bool                      CheckExpiredItemList (  );                        		//  GUIWarfare.BTNetMainMenu.CheckExpiredItemList
	 void                      CompleteExpiredItem (  );                         		//  GUIWarfare.BTNetMainMenu.CompleteExpiredItem
	 void                      AddExpiredSkillItem ( int ItemID, int UniqueID, int SlotPos );		//  GUIWarfare.BTNetMainMenu.AddExpiredSkillItem
	 void                      AddExpiredItem ( int ItemID, struct FBtrDouble UniqueID, int SlotPos, int PartID );		//  GUIWarfare.BTNetMainMenu.AddExpiredItem
	 void                      CompleteDurabilityWarningItem (  );               		//  GUIWarfare.BTNetMainMenu.CompleteDurabilityWarningItem
	 void                      AddDurabilityWarningItemRepairCost ( struct FBtrDouble UniqueID, int RepairCost );		//  GUIWarfare.BTNetMainMenu.AddDurabilityWarningItemRepairCost
	 void                      AddDurabilityWarningItem ( struct FBtrDouble UniqueID, int ItemID, int SlotPos, int PartID, int Durability );		//  GUIWarfare.BTNetMainMenu.AddDurabilityWarningItem
	 void                      LoginToChannel ( struct FString IP, int Port, int DataPort );		//  GUIWarfare.BTNetMainMenu.LoginToChannel
	 void                      ChannelToLogin2 ( struct FString IP, int Port );  		//  GUIWarfare.BTNetMainMenu.ChannelToLogin2
	 void                      ChannelToLogin ( struct FString IP, int Port );   		//  GUIWarfare.BTNetMainMenu.ChannelToLogin
	 void                      ChannelToLogin_OnEventTimer ( int Index );        		//  GUIWarfare.BTNetMainMenu.ChannelToLogin_OnEventTimer
	 void                      UpdateWebzenInvenListEnd ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTNetMainMenu.UpdateWebzenInvenListEnd
	 void                      UpdateWebzenInvenList ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTNetMainMenu.UpdateWebzenInvenList
	 void                      StopWebzenInvenList (  );                         		//  GUIWarfare.BTNetMainMenu.StopWebzenInvenList
	 bool                      sfReqWebzenInvenList ( struct FString StorageType );		//  GUIWarfare.BTNetMainMenu.sfReqWebzenInvenList
	 void                      SetNewMailArrived ( bool B );                     		//  GUIWarfare.BTNetMainMenu.SetNewMailArrived
	 void                      UpdateDurabilityWarningItemList ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTNetMainMenu.UpdateDurabilityWarningItemList
	 void                      UpdateExpiredItemList ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTNetMainMenu.UpdateExpiredItemList
	 void                      UpdateRecv_ClanInfo ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTNetMainMenu.UpdateRecv_ClanInfo
	 void                      delegateCheckNat (  );                            		//  GUIWarfare.BTNetMainMenu.delegateCheckNat
}; // Size: 0x0818

// Class GUIWarfare.BTNetGUIPageHK
class DLL_IMPORT UBTNetGUIPageHK : public UBTNetGUIPage
{
public:
	class UwMatchMaker*                                MM;                                               		// 0x041C ( 0x0004 ) 
	class UwGameManager*                               GameMgr;                                          		// 0x0420 ( 0x0004 ) 
	struct FString                                     currentBGM;                                       		// 0x0424 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FFloatBox                                   fbTPTopMenu;                                      		// 0x0430 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPTopMenuHK*                              TPTopMenu;                                        		// 0x0440 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelRoomName;                                  		// 0x0444 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawSourceClipImageHK*               LabelRoomName;                                    		// 0x0454 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelTitle;                                     		// 0x0458 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelTitle;                                       		// 0x0468 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelLeftTopRoll;                               		// 0x046C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbLabelLeftTopRollSource;                         		// 0x047C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawSourceClipImageHK*               LabelLeftTopRoll;                                 		// 0x048C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelTopLine;                                   		// 0x0490 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelTopLine;                                     		// 0x04A0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelBottomLine;                                		// 0x04A4 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTLabelNoticeHK*                            LabelBottomLine;                                  		// 0x04B4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelAAS;                                       		// 0x04B8 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPAASHK*                                  LabelAAS;                                         		// 0x04C8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bSkipInitializeDefaultPage:1;                     		// 0x04CC ( 0x0004 )  [0x00000001]
	unsigned long                                      bFadeTimeTranslate:1;                             		// 0x04CC ( 0x0004 )  [0x00000002]
	unsigned long                                      bUseTranslate:1;                                  		// 0x04CC ( 0x0004 )  [0x00000004]
	unsigned long                                      bCallFadeIn:1;                                    		// 0x04CC ( 0x0004 )  [0x00000008]
	unsigned long                                      bFading:1;                                        		// 0x04CC ( 0x0004 )  [0x00000010]
	unsigned long                                      bClosing:1;                                       		// 0x04CC ( 0x0004 )  [0x00000020]
	float                                              FadeTime;                                         		// 0x04D0 ( 0x0004 ) 
	float                                              CurFadeTime;                                      		// 0x04D4 ( 0x0004 ) 
	unsigned char                                      CurFade;                                          		// 0x04D8 ( 0x0001 ) 
	unsigned char                                      DesiredFade;                                      		// 0x04D9 ( 0x0001 ) 
	unsigned char                                      StartFade;                                        		// 0x04DA ( 0x0001 ) 
	struct FFloatBox                                   fbNewBackground;                                  		// 0x04DC ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         NewBackground;                                    		// 0x04EC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         WeaponListBg;                                     		// 0x04F0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbWeaponListBg;                                   		// 0x04F4 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strWeaponList[ 0x06 ];                            		// 0x0504 ( 0x0048 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class TArray< class UBTOwnerDrawCaptionButtonHK* > WeaponeTypeBtnList;                               		// 0x054C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bShowWeaponeTypeList:1;                           		// 0x0558 ( 0x0004 )  [0x00000001]

	// UScript Functions
	 void                      Default_FadedOut (  );                            		//  GUIWarfare.BTNetGUIPageHK.Default_FadedOut
	 void                      FadeOut ( bool bTranslate, bool bChangeAlpha );   		//  GUIWarfare.BTNetGUIPageHK.FadeOut
	 void                      FadeIn ( bool bTranslate, bool bChangeAlpha );    		//  GUIWarfare.BTNetGUIPageHK.FadeIn
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfare.BTNetGUIPageHK.Internal_OnPreDraw
	 class UBTOwnerDrawCaptionButtonHK* NewButtonComponent ( struct FFloatBox fbNewCompo, float RenderWeight );		//  GUIWarfare.BTNetGUIPageHK.NewButtonComponent
	 class UBTOwnerDrawImageHK* NewLabelComponent ( struct FFloatBox fbNewCompo, struct FImage bgImg, float RenderWeight );		//  GUIWarfare.BTNetGUIPageHK.NewLabelComponent
	 void                      ExitGame (  );                                    		//  GUIWarfare.BTNetGUIPageHK.ExitGame
	 void                      OpenTodayResultPage (  );                         		//  GUIWarfare.BTNetGUIPageHK.OpenTodayResultPage
	 bool                      BTWIndowTodayResultHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTNetGUIPageHK.BTWIndowTodayResultHK_OnOK
	 bool                      WeaponListClick ( class UGUIComponent* Sender );  		//  GUIWarfare.BTNetGUIPageHK.WeaponListClick
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTNetGUIPageHK.InitComponent
	 void                      LabelAAS_OnNextAAS ( struct FString NextAAS );    		//  GUIWarfare.BTNetGUIPageHK.LabelAAS_OnNextAAS
	 void                      LabelBottomLine_OnNextNotice ( struct FString NextNotice );		//  GUIWarfare.BTNetGUIPageHK.LabelBottomLine_OnNextNotice
	 bool                      ButtonTest_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTNetGUIPageHK.ButtonTest_OnClick
	 void                      InitializeDefaultPage (  );                       		//  GUIWarfare.BTNetGUIPageHK.InitializeDefaultPage
	 void                      SetDefaultWeapon ( int SlotIndex );               		//  GUIWarfare.BTNetGUIPageHK.SetDefaultWeapon
	 void                      RefreshPage (  );                                 		//  GUIWarfare.BTNetGUIPageHK.RefreshPage
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUIWarfare.BTNetGUIPageHK.Opened
}; // Size: 0x0140

// Class GUIWarfare.BTNetQuestInfoPageHK
class DLL_IMPORT UBTNetQuestInfoPageHK : public UBTNetGUIPageHK
{
public:
	class UBTTPQuestInfoHK*                            QuestInfo;                                        		// 0x055C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 bool                      TPTopMenu_Quest_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTNetQuestInfoPageHK.TPTopMenu_Quest_OnClick
	 void                      NotifyDailyQuestReset (  );                       		//  GUIWarfare.BTNetQuestInfoPageHK.NotifyDailyQuestReset
	 void                      InternalOnOpen (  );                              		//  GUIWarfare.BTNetQuestInfoPageHK.InternalOnOpen
	 void                      InternalOnReOpen (  );                            		//  GUIWarfare.BTNetQuestInfoPageHK.InternalOnReOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTNetQuestInfoPageHK.InitComponent
}; // Size: 0x0004

// Class GUIWarfare.BTPageRoomLobby
class DLL_IMPORT UBTPageRoomLobby : public UBTNetQuestInfoPageHK
{
public:
	int                                                OutofSeatTime;                                    		// 0x0560 ( 0x0004 ) 
	int                                                OwnerOutofSeatTime;                               		// 0x0564 ( 0x0004 ) 
	float                                              LastKeySleepTime;                                 		// 0x0568 ( 0x0004 ) 
	unsigned long                                      bAllReady:1;                                      		// 0x056C ( 0x0004 )  [0x00000001]
	int                                                PrevGameMode;                                     		// 0x0570 ( 0x0004 ) 
	unsigned long                                      bPrevTeamBalance:1;                               		// 0x0574 ( 0x0004 )  [0x00000001]
	struct FString                                     strTeamBalance[ 0x03 ];                           		// 0x0578 ( 0x0024 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strBotModeWarn[ 0x02 ];                           		// 0x059C ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strNoviceMode;                                    		// 0x05B4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strBotMode;                                       		// 0x05C0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	float                                              TimeAutoStart;                                    		// 0x05CC ( 0x0004 ) 
	float                                              TPMessenger_ACLMsg0_OnHitBottom_LastTime;         		// 0x05D0 ( 0x0004 ) 
	unsigned long                                      bGoToClanPage:1;                                  		// 0x05D4 ( 0x0004 )  [0x00000001]
	float                                              LastRefreshTime[ 0x02 ];                          		// 0x05D8 ( 0x0008 ) 
	float                                              RefreshCycleTime[ 0x02 ];                         		// 0x05E0 ( 0x0008 ) 
	class UBTRefreshTime*                              rfFriendPosTime;                                  		// 0x05E8 ( 0x0004 ) 
	int                                                TotalChannelUserCount;                            		// 0x05EC ( 0x0004 ) 
	int                                                CurrentRoomState;                                 		// 0x05F0 ( 0x0004 ) 
	unsigned long                                      bJoinClanState:1;                                 		// 0x05F4 ( 0x0004 )  [0x00000001]
	unsigned long                                      bClanInviteState:1;                               		// 0x05F4 ( 0x0004 )  [0x00000002]
	unsigned long                                      bSafeLeaveRoom:1;                                 		// 0x05F4 ( 0x0004 )  [0x00000004]
	class UBTOwnerDrawImageHK*                         LabelTeamSelect;                                  		// 0x05F8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelTeam;                                      		// 0x05FC ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelTeam;                                        		// 0x060C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelTeamTopLine;                               		// 0x0610 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelTeamTopLine;                                 		// 0x0620 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbButtonTeam[ 0x02 ];                             		// 0x0624 ( 0x0020 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTeam[ 0x02 ];                               		// 0x0644 ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbTPTeamList[ 0x02 ];                             		// 0x064C ( 0x0020 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPTeamMemberList*                         TPTeamList[ 0x02 ];                               		// 0x066C ( 0x0008 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UBTAutoColumnListDataHK* >     UserListDB;                                       		// 0x0674 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UBTAutoColumnListDataHK* >     GMList;                                           		// 0x0680 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                GMNumAF;                                          		// 0x068C ( 0x0004 ) 
	int                                                GMNumRSA;                                         		// 0x0690 ( 0x0004 ) 
	struct FFloatBox                                   fbTPChat;                                         		// 0x0694 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPChatHK*                                 TPChat;                                           		// 0x06A4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbTPMessenger;                                    		// 0x06A8 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPMessengerHKCN*                          TPMessenger;                                      		// 0x06B8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbTPMyInfo;                                       		// 0x06BC ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPMyInfoHK*                               TPMyInfo;                                         		// 0x06CC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbTPRoomInfo;                                     		// 0x06D0 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPRoomInfoHK*                             TPRoomInfo;                                       		// 0x06E0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strButtonStart[ 0x03 ];                           		// 0x06E4 ( 0x0024 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbButtonStart;                                    		// 0x0708 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonStart;                                      		// 0x0718 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbButtonTemp;                                     		// 0x071C ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTemp;                                       		// 0x072C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UwMatchMaker*                                MatchMaker;                                       		// 0x0730 ( 0x0004 ) [ CPF_Transient ]
	class TArray< struct FGameModeInfo >               GameModes;                                        		// 0x0734 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bReadyToGame:1;                                   		// 0x0740 ( 0x0004 )  [0x00000001]
	unsigned long                                      bNoInitialRoomInfo:1;                             		// 0x0740 ( 0x0004 )  [0x00000002]
	unsigned long                                      bShowHostWarning:1;                               		// 0x0740 ( 0x0004 )  [0x00000004]
	struct FString                                     strExpiredItem;                                   		// 0x0744 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     CannotChangeHostTitle;                            		// 0x0750 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     CannotChangeHostMessage;                          		// 0x075C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     WaitingMessage;                                   		// 0x0768 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     MessageNewHost;                                   		// 0x0774 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     MessageNewGuestPre;                               		// 0x0780 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     MessageNewGuestPost;                              		// 0x078C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     MessageHostChangeEnable[ 0x02 ];                  		// 0x0798 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strLowHostScoreWarning[ 0x02 ];                   		// 0x07B0 ( 0x0018 ) [ CPF_Localized | CPF_NeedCtorLink ]
	int                                                NewOwnerID;                                       		// 0x07C8 ( 0x0004 ) 
	int                                                MinHostPoint;                                     		// 0x07CC ( 0x0004 ) 
	int                                                MinWaringHostPoint;                               		// 0x07D0 ( 0x0004 ) 
	int                                                MaxWaringHostPoint;                               		// 0x07D4 ( 0x0004 ) 
	float                                              SendPingIntervalTime;                             		// 0x07D8 ( 0x0004 ) 
	unsigned char                                      MyAction;                                         		// 0x07DC ( 0x0001 ) 
	class UBTLabelTutorialQuestInfoHK*                 LabelPopupTutorial;                               		// 0x07E0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< int >                                ReceivedPingID;                                   		// 0x07E4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                ReceivedPingValue;                                		// 0x07F0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     DelFriendsList;                                   		// 0x07FC ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FFloatBox                                   fbBGDeco;                                         		// 0x0808 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         BGDeco;                                           		// 0x0818 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 MyInfoBtn;                                        		// 0x081C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FScriptDelegate                             __CurrentButtonClickBehavior__Delegate;           		// 0x0820 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      CheckEnterRoom_InClanChannel ( struct FString szClanName );		//  GUIWarfare.BTPageRoomLobby.CheckEnterRoom_InClanChannel
	 class UBTAutoColumnListDataHK* MakeTeamMemberData ( int UID, int ClanMark, int ClanBG, int ClanBL, int Level, struct FString NickName, struct FString ClanName, int Status, int Host, int Ping, struct FString UserIP, unsigned char LookingFor, int ClanLevel, int LevelMarkID, int TitleMarkID, int TeamNum, int Reserved2, int Reserved3, bool bMe, bool bisGM );		//  GUIWarfare.BTPageRoomLobby.MakeTeamMemberData
	 void                      SaveUserData ( class UBTAutoColumnListDataHK* Item );		//  GUIWarfare.BTPageRoomLobby.SaveUserData
	 bool                      rfNotifyClanLevelup ( struct FString ClanName, int Levelup );		//  GUIWarfare.BTPageRoomLobby.rfNotifyClanLevelup
	 bool                      rfNotifyNewClanName ( struct FString New_NickName );		//  GUIWarfare.BTPageRoomLobby.rfNotifyNewClanName
	 bool                      rfNotifyNewNickName ( int Community_Type, struct FString Old_NickName, struct FString New_NickName );		//  GUIWarfare.BTPageRoomLobby.rfNotifyNewNickName
	 bool                      rfAckGetRankingInfoListEnd (  );                  		//  GUIWarfare.BTPageRoomLobby.rfAckGetRankingInfoListEnd
	 bool                      rfAckGetRankingInfoList ( int Result, unsigned char RankingType, unsigned char CommunityType, class TArray< struct FString > CharName, class TArray< int > CharLevel, class TArray< struct FString > ClanName, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< int > ClanMarkBL, class TArray< int > Ranking_Accum, class TArray< int > Ranking_Accum_Prev, class TArray< int > Ranking_Accum_Exp, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTPageRoomLobby.rfAckGetRankingInfoList
	 bool                      rfAckGetRankingInfoListStart ( int Result, unsigned char RankingType, unsigned char CommunityType, int TotalCount );		//  GUIWarfare.BTPageRoomLobby.rfAckGetRankingInfoListStart
	 bool                      rfAckFriendPosition ( int Result, struct FString TargetCharName, unsigned char ServerType, struct FString fServername, struct FString fServerShortName, struct FString fServerIP, int fServerPort, unsigned char CurPos, unsigned char CurState, int ChannelNum, struct FString ChannelNickName, int GameRoomNum );		//  GUIWarfare.BTPageRoomLobby.rfAckFriendPosition
	 bool                      rfAckNotifyUpdateCharInfo_LevelMark ( struct FString CharName, int LevelMarkID );		//  GUIWarfare.BTPageRoomLobby.rfAckNotifyUpdateCharInfo_LevelMark
	 bool                      rfReqInGameRoomUserClanLevelChanged ( int UserID, int ClanLevel );		//  GUIWarfare.BTPageRoomLobby.rfReqInGameRoomUserClanLevelChanged
	 bool                      rfReqInGameRoomUserInfoChanged (  );              		//  GUIWarfare.BTPageRoomLobby.rfReqInGameRoomUserInfoChanged
	 bool                      rfAckNotifyAdjustClanMemberGrade ( struct FString ClanName, struct FString CharName, unsigned char CharGrade );		//  GUIWarfare.BTPageRoomLobby.rfAckNotifyAdjustClanMemberGrade
	 void                      UserPingRefresh (  );                             		//  GUIWarfare.BTPageRoomLobby.UserPingRefresh
	 void                      SendPingToAll (  );                               		//  GUIWarfare.BTPageRoomLobby.SendPingToAll
	 void                      sfReqRoomUserPingInfo (  );                       		//  GUIWarfare.BTPageRoomLobby.sfReqRoomUserPingInfo
	 void                      OnReceivedPing ( class UwMatchMaker* MM, struct FString fromAddr, int msec );		//  GUIWarfare.BTPageRoomLobby.OnReceivedPing
	 bool                      rfAckRoomUserPingInfo ( class TArray< int > UnqueID, class TArray< int > Ping, int HostScore );		//  GUIWarfare.BTPageRoomLobby.rfAckRoomUserPingInfo
	 bool                      rfAckChangedRoomTitle_FromGM ( int Result, int RoomNumber, struct FString NewRoomTitle );		//  GUIWarfare.BTPageRoomLobby.rfAckChangedRoomTitle_FromGM
	 bool                      rfAckCheckEquipedWeaponDurability ( int Result, class TArray< struct FBtrDouble > ItemUniqueID, class TArray< int > ItemSlotNum );		//  GUIWarfare.BTPageRoomLobby.rfAckCheckEquipedWeaponDurability
	 bool                      ButtonTemp_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ButtonTemp_OnClick
	 bool                      rfAckGetBotID ( int Result, unsigned char RequestedAFCount, unsigned char RequestedRSACount, class TArray< int > AFBotID, class TArray< int > RSABotID );		//  GUIWarfare.BTPageRoomLobby.rfAckGetBotID
	 bool                      rfAckAutoChangedTeamUserList ( class TArray< int > UserID, class TArray< int > TeamNum );		//  GUIWarfare.BTPageRoomLobby.rfAckAutoChangedTeamUserList
	 int                       FindTeamNumInArray ( class TArray< int > UserID, class TArray< int > TeamNum, int FindUserID );		//  GUIWarfare.BTPageRoomLobby.FindTeamNumInArray
	 bool                      rfReqRecvForceFailedClientLoading ( int ErrCode );		//  GUIWarfare.BTPageRoomLobby.rfReqRecvForceFailedClientLoading
	 bool                      rfAckStartHolePunching ( int Result, struct FString ErrMsg, int GameType, int ReqStartUserID );		//  GUIWarfare.BTPageRoomLobby.rfAckStartHolePunching
	 bool                      rfAckRegisterMyUdpInfo ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckRegisterMyUdpInfo
	 bool                      rfAckNotifyMyCharInfoToRoomUser ( int Result, struct FString ErrMsg, int UID, struct FString UserName, int Grade, int TeamNum, unsigned char Statue, unsigned char IsHost, struct FString UserIP, struct FString ClanName, int CM_Pattern, int CM_BG, int CM_BL, unsigned char IsLookFor );		//  GUIWarfare.BTPageRoomLobby.rfAckNotifyMyCharInfoToRoomUser
	 bool                      rfReqNotifyDisconnectHostInLoading ( int Result, struct FString ErrMsg, int HostID );		//  GUIWarfare.BTPageRoomLobby.rfReqNotifyDisconnectHostInLoading
	 bool                      rfReqRecvDeleteFriend ( int Result, struct FString FromCharName );		//  GUIWarfare.BTPageRoomLobby.rfReqRecvDeleteFriend
	 bool                      rfAckDeleteFriend ( int Result, class TArray< struct FString > FailedCharname );		//  GUIWarfare.BTPageRoomLobby.rfAckDeleteFriend
	 bool                      rfAckChannelUserListInGameRoom ( int Result, int TotalCount, int Count, int StartIndex, class TArray< int > UID, class TArray< struct FString > CharName, class TArray< int > UserLevel, class TArray< struct FString > ClanName, class TArray< int > ClanPattern, class TArray< int > ClanBG, class TArray< int > ClanBL, class TArray< unsigned char > IsLookForClan, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTPageRoomLobby.rfAckChannelUserListInGameRoom
	 bool                      rfAckChatWispher ( int Result, struct FString ErrMsg, struct FString ToCharName );		//  GUIWarfare.BTPageRoomLobby.rfAckChatWispher
	 bool                      rfAckAcquirePromotionItems ( int UID, int Result, struct FString ErrMsg, class TArray< struct FBtrDouble > ItemUniqueID, class TArray< int > ItemIDs, class TArray< int > PartIDs );		//  GUIWarfare.BTPageRoomLobby.rfAckAcquirePromotionItems
	 bool                      rfReqNotifyLevelUp ( int LevelUpUserID, int Level, int Exp, class TArray< int > ItemID, class TArray< int > PartID );		//  GUIWarfare.BTPageRoomLobby.rfReqNotifyLevelUp
	 bool                      rfAckRecvJoinClanResult ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckRecvJoinClanResult
	 bool                      rfAckJoinClanResult ( struct FString CharName, unsigned char Permit, struct FString PermitCharName );		//  GUIWarfare.BTPageRoomLobby.rfAckJoinClanResult
	 bool                      BTWindowRequestApprovalClanHK_OnSuspend ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowRequestApprovalClanHK_OnSuspend
	 bool                      BTWindowRequestApprovalClanHK_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowRequestApprovalClanHK_OnCancel
	 bool                      BTWindowRequestApprovalClanHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowRequestApprovalClanHK_OnOK
	 bool                      rfReqRecvJoinClan ( int UserIdx, struct FString CharName, struct FString Message );		//  GUIWarfare.BTPageRoomLobby.rfReqRecvJoinClan
	 bool                      rfAckNotifyClanSecession ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTPageRoomLobby.rfAckNotifyClanSecession
	 bool                      rfAckNotifyNewClanMember ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTPageRoomLobby.rfAckNotifyNewClanMember
	 bool                      rfAckSearchClan ( int Result, struct FString ErrMsg, int TotalPage, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< unsigned char > ClanMarkBL, class TArray< struct FString > ClanName, class TArray< struct FString > ClanMaster, class TArray< int > ClanMember, class TArray< int > ClanMemberMax, class TArray< int > ClanCreateDate, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< int > ClanDraw, class TArray< int > ClanRank, class TArray< unsigned char > ClanRecruit, class TArray< int > ClanLevel );		//  GUIWarfare.BTPageRoomLobby.rfAckSearchClan
	 bool                      rfAckRecvClanInviteResult ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckRecvClanInviteResult
	 bool                      IsGameReadyOrPlaying (  );                        		//  GUIWarfare.BTPageRoomLobby.IsGameReadyOrPlaying
	 bool                      rfAckInviteClanResult ( struct FString CharName, unsigned char Permit, struct FString ClanNm );		//  GUIWarfare.BTPageRoomLobby.rfAckInviteClanResult
	 bool                      BTWindowDefineSelectHK_23_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowDefineSelectHK_23_OnOK
	 bool                      rfReqRecvClanInvite ( int InviterUserDBID, struct FString InviterCharname, struct FString ClanName, struct FString InviteMsg );		//  GUIWarfare.BTPageRoomLobby.rfReqRecvClanInvite
	 bool                      rfAckJoinClan ( int Result, struct FString ErrMsg, struct FString SpecificCharName, struct FString RealRecvCharName, unsigned char RealRecvCharClanGrade );		//  GUIWarfare.BTPageRoomLobby.rfAckJoinClan
	 bool                      rfAckInviteClan ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckInviteClan
	 void                      UpdateRecv_ClanInfo ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTPageRoomLobby.UpdateRecv_ClanInfo
	 bool                      BTWindowUserPersonalInfo_OnClanInfo ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowUserPersonalInfo_OnClanInfo
	 bool                      BTWindowUserDetailInfoHK_OnClanInfo ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowUserDetailInfoHK_OnClanInfo
	 bool                      rfReqClanCharPersonelIntro ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTPageRoomLobby.rfReqClanCharPersonelIntro
	 bool                      rfAckClanCharPersonelIntro ( int Result, struct FString ErrMsg, struct FString PersonelIntro );		//  GUIWarfare.BTPageRoomLobby.rfAckClanCharPersonelIntro
	 bool                      rfAckCharDetailInfo ( int MaxSerial, int MaxScore, int MaxKill, int MaxAssist, int Serial3, int Serial5, int Serial7, int Serial10, int Serial15, int AR, int SMG, int SR, int SW, int Melee, int Grenade, int FlashBang, int Foot, int AT4, int MG, int Fire, int RPG7, int TimeBomb, int IcendiaryBomb, int ClusterBomb, int ByChopper, int Artillery, int KillChopper, int FirstKill, int LastKill, int AllKill, int Dominate, int InstallBomb, int DefuseBomb );		//  GUIWarfare.BTPageRoomLobby.rfAckCharDetailInfo
	 bool                      rfAckDBCharInfo ( int Result, struct FString ErrMsg, struct FString CharName, struct FString ClanName, int CM_Pattern, int CM_BG, int CM_BL, struct FString ClanPersonIntro, int MainWeaponItemID, int MainWeaponPartID, int SubWeaponItemID, int SubWeaponPartID, int AFSpecialCostumeItemID, int RSASpecialCostumeItemID, struct FCharInfo stCharInfo, int ClanLevel );		//  GUIWarfare.BTPageRoomLobby.rfAckDBCharInfo
	 bool                      MoveToClanPage_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.MoveToClanPage_OnOK
	 bool                      rfAckCreateClan ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int StackCount );		//  GUIWarfare.BTPageRoomLobby.rfAckCreateClan
	 bool                      rfAckDupCheckClanName ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckDupCheckClanName
	 bool                      rfAckGetIsHostBlocking ( int Result, unsigned char Blocking );		//  GUIWarfare.BTPageRoomLobby.rfAckGetIsHostBlocking
	 bool                      rfAckNotifyHostBlocking ( int Result, unsigned char Blocking );		//  GUIWarfare.BTPageRoomLobby.rfAckNotifyHostBlocking
	 bool                      rfAckGetHolePunchingResult ( int Result, unsigned char Phrase, int InterventionUserID, unsigned char Intervention, class TArray< int > FailedUserIDs );		//  GUIWarfare.BTPageRoomLobby.rfAckGetHolePunchingResult
	 bool                      rfAckGetUserHostPriorityPoint ( int Result, int UserID, int HostPriorityPoint );		//  GUIWarfare.BTPageRoomLobby.rfAckGetUserHostPriorityPoint
	 bool                      BTWindowChangeHost_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowChangeHost_OnCancel
	 bool                      BTWindowChangeHost_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowChangeHost_OnOK
	 bool                      rfReqRecvForceDisconnectUDPFromHost ( int Result );		//  GUIWarfare.BTPageRoomLobby.rfReqRecvForceDisconnectUDPFromHost
	 bool                      rfAckForceDisconnectUDPFromHost ( int Result );   		//  GUIWarfare.BTPageRoomLobby.rfAckForceDisconnectUDPFromHost
	 bool                      rfReqNotifyChangeRoomState ( unsigned char RoomState );		//  GUIWarfare.BTPageRoomLobby.rfReqNotifyChangeRoomState
	 bool                      rfAckBanUser ( int GameNum, int UID, int BanUID, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckBanUser
	 void                      TPTeamList_OnPopupCheck ( class UBTACLTeamMemberListHK* acl, class UBTCMTeamMemberListHK* cm );		//  GUIWarfare.BTPageRoomLobby.TPTeamList_OnPopupCheck
	 void                      TPTeamList_OnPopup ( int ContextMenuIndex, class UBTACLTeamMemberListHK* acl );		//  GUIWarfare.BTPageRoomLobby.TPTeamList_OnPopup
	 void                      OnPopupBan ( int ContextMenuIndex, class UBTACLMessengerBanHK* acl );		//  GUIWarfare.BTPageRoomLobby.OnPopupBan
	 void                      OnPopupBanCheck ( class UBTACLMessengerBanHK* acl, class UBTCMMessengerBanHK* cm );		//  GUIWarfare.BTPageRoomLobby.OnPopupBanCheck
	 void                      OnPopupPCBang ( int ContextMenuIndex, class UBTACLMessengerPCBangHK* acl );		//  GUIWarfare.BTPageRoomLobby.OnPopupPCBang
	 void                      OnPopupPCBangCheck ( class UBTACLMessengerPCBangHK* acl, class UBTCMMessengerPCBangHK* cm );		//  GUIWarfare.BTPageRoomLobby.OnPopupPCBangCheck
	 void                      OnPopupClan ( int ContextMenuIndex, class UBTACLMessengerClanHK* acl );		//  GUIWarfare.BTPageRoomLobby.OnPopupClan
	 void                      OnPopupClanCheck ( class UBTACLMessengerClanHK* acl, class UBTCMMessengerClanHK* cm );		//  GUIWarfare.BTPageRoomLobby.OnPopupClanCheck
	 void                      OnPopupFriend ( int ContextMenuIndex, class UBTACLMessengerFriendHK* acl );		//  GUIWarfare.BTPageRoomLobby.OnPopupFriend
	 void                      OnPopupFriendCheck ( class UBTACLMessengerFriendHK* acl, class UBTCMMessengerFriendHK* cm );		//  GUIWarfare.BTPageRoomLobby.OnPopupFriendCheck
	 void                      OnPopupChannel ( int ContextMenuIndex, class UBTACLMessengerChannelHK* acl );		//  GUIWarfare.BTPageRoomLobby.OnPopupChannel
	 void                      OnPopupChannelCheck ( class UBTACLMessengerChannelHK* acl, class UBTCMMessengerChannelHK* cm );		//  GUIWarfare.BTPageRoomLobby.OnPopupChannelCheck
	 bool                      rfReqCompleteFriendInvite ( struct FString CharnameToBeInvited, unsigned char IsPermit );		//  GUIWarfare.BTPageRoomLobby.rfReqCompleteFriendInvite
	 bool                      rfAckConfirmFriendInvite ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckConfirmFriendInvite
	 bool                      rfReqRecvFriendInvite ( int ReqUserID, struct FString ReqCharname, struct FString InviteMsg );		//  GUIWarfare.BTPageRoomLobby.rfReqRecvFriendInvite
	 bool                      WindowRequestFriend_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.WindowRequestFriend_OnCancel
	 bool                      WindowRequestFriend_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.WindowRequestFriend_OnOK
	 bool                      rfAckSendFriendInvite ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckSendFriendInvite
	 bool                      rfAckRoomUserList ( class TArray< int > UID, class TArray< struct FString > UserName, class TArray< int > Grade, class TArray< int > TeamNum, class TArray< unsigned char > Statue, class TArray< unsigned char > IsHost, class TArray< struct FString > UserIP, class TArray< struct FString > ClanName, class TArray< int > CM_Pattern, class TArray< int > CM_BG, class TArray< int > CM_BL, class TArray< unsigned char > IsLookingFor, class TArray< int > GMUID, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTPageRoomLobby.rfAckRoomUserList
	 void                      RefreshUserList (  );                             		//  GUIWarfare.BTPageRoomLobby.RefreshUserList
	 void                      RemoveInUserList ( int UID );                     		//  GUIWarfare.BTPageRoomLobby.RemoveInUserList
	 bool                      Exit_OnOK ( class UGUIComponent* Sender );        		//  GUIWarfare.BTPageRoomLobby.Exit_OnOK
	 bool                      rfAckProcessPreLoginUser ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckProcessPreLoginUser
	 bool                      rfAckLoginInHouseTest ( unsigned char Sucess, struct FString CharName, int TimeStamp, int LoginHash1, int LoginHash2, int LoginHash3, int LoginHash4, int LoginHash5, unsigned char NeedChar, struct FString ErrMsg, struct FString BDay, unsigned char Sex, struct FBtrDouble ServerTime );		//  GUIWarfare.BTPageRoomLobby.rfAckLoginInHouseTest
	 void                      TcpLogin_OnConnect ( int ErrCode );               		//  GUIWarfare.BTPageRoomLobby.TcpLogin_OnConnect
	 void                      RoomLobbyToServerSelection (  );                  		//  GUIWarfare.BTPageRoomLobby.RoomLobbyToServerSelection
	 bool                      RoomLobbyToServerSelection_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.RoomLobbyToServerSelection_OnOK
	 bool                      rfAckEnterChannel ( int id, int UID, struct FString UserID, int Level, struct FString ClanName, int ClanMarkPattern, int ClanMarkBG, int ClanMarkBL, int ClanGrade, int ClanWin, int ClanLose, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageRoomLobby.rfAckEnterChannel
	 bool                      rfAckChangeRoomSetting ( int Result, struct FString ErrMsg, struct FGameRoomInfo RoomInfo );		//  GUIWarfare.BTPageRoomLobby.rfAckChangeRoomSetting
	 bool                      rfAckChangeUserState ( int Result, struct FString ErrMsg, class TArray< int > UserIDs, class TArray< unsigned char > Positions, class TArray< int > Numbers, class TArray< unsigned char > OldStates, class TArray< unsigned char > NewStates );		//  GUIWarfare.BTPageRoomLobby.rfAckChangeUserState
	 bool                      rfAckNotifyLoadingState ( int Result, int UserID, unsigned char LoadingState );		//  GUIWarfare.BTPageRoomLobby.rfAckNotifyLoadingState
	 bool                      rfAckFailedStartGame ( int Result, struct FString ErrMsg, unsigned char IsHost, int FailedUserID, int LoadingStep );		//  GUIWarfare.BTPageRoomLobby.rfAckFailedStartGame
	 bool                      rfAckSuccessStartGame ( int Result, struct FString ErrMsg, unsigned char IsHost, struct FString HostIP, int HostPort, int LoadingStep );		//  GUIWarfare.BTPageRoomLobby.rfAckSuccessStartGame
	 bool                      rfReqRelayServerOff (  );                         		//  GUIWarfare.BTPageRoomLobby.rfReqRelayServerOff
	 bool                      rfAckUpdateWeaponDurability ( int Result, struct FString ErrMsg, class TArray< struct FBtrDouble > UniqueItemID, class TArray< int > Durability, class TArray< unsigned char > IsDestroy, class TArray< struct FBtrDouble > FailedWeaponUniqueID );		//  GUIWarfare.BTPageRoomLobby.rfAckUpdateWeaponDurability
	 bool                      rfAckEntryQSlotUniqueIDList ( int UserNum, class TArray< unsigned char > QSlotDispOrder, class TArray< struct FBtrDouble > MWUniqueID, class TArray< struct FBtrDouble > PistolUniqueID, class TArray< struct FBtrDouble > TW1UniqueID, class TArray< struct FBtrDouble > TW2UniqueID );		//  GUIWarfare.BTPageRoomLobby.rfAckEntryQSlotUniqueIDList
	 bool                      rfAckEntryQSlotIDList ( int UserNum, class TArray< unsigned char > QSlotDispOrder, class TArray< int > MWItemID, class TArray< int > MWPartID, class TArray< int > MWPaintID, class TArray< int > PistolItemID, class TArray< int > PistolPartID, class TArray< int > PistolPaintID, class TArray< int > TWItemID1, class TArray< int > TWItemID2, class TArray< int > Skill1ID, class TArray< int > Skill2ID, class TArray< int > Skill3ID, class TArray< int > Skill4ID );		//  GUIWarfare.BTPageRoomLobby.rfAckEntryQSlotIDList
	 bool                      rfAckChangeNewGuest ( struct FString HostIP );    		//  GUIWarfare.BTPageRoomLobby.rfAckChangeNewGuest
	 bool                      rfAckChangeHost ( unsigned char ClientNum );      		//  GUIWarfare.BTPageRoomLobby.rfAckChangeHost
	 bool                      rfAckGetBootyChoose ( int Result, struct FString ErrMsg, unsigned char GiveType, struct FBtrDouble ItemUniqueNumber, int ItemID, int PartID, unsigned char ItemType, struct FBtrDouble UntilTime, int StackCount, int PaintID );		//  GUIWarfare.BTPageRoomLobby.rfAckGetBootyChoose
	 bool                      rfAckEntrySkillList ( class TArray< int > UserIDs, class TArray< int > SkillIDs, class TArray< int > SlotPositions, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckEntrySkillList
	 bool                      rfAckGetBooty ( int Result, struct FString ErrMsg, class TArray< int > PrizeWinUserID, class TArray< int > BootyItemID, class TArray< int > BootyPartsID );		//  GUIWarfare.BTPageRoomLobby.rfAckGetBooty
	 bool                      rfAckForceGameOver ( int UserID, int GameRoomNumber, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckForceGameOver
	 bool                      rfAckChangeRoomOwner ( int GameNum, int OldOwner, int NewOwner, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckChangeRoomOwner
	 bool                      rfAckEntryItemList ( class TArray< int > UserIDs, class TArray< int > ItemIDs, class TArray< int > SlotPositions, class TArray< int > AddPartsID, class TArray< struct FBtrDouble > UniqueID, class TArray< int > PaintID, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckEntryItemList
	 bool                      rfAckUpdateScore ( class TArray< int > UserIDs, class TArray< struct FString > NickNames, class TArray< unsigned char > TeamIDs, class TArray< int > Scores, class TArray< int > Kills, class TArray< int > Assists, class TArray< int > Deaths, class TArray< int > EXPs, class TArray< int > EXPBonuses, class TArray< int > Points, class TArray< int > PointBonuses, class TArray< int > TeamScores, class TArray< int > BonusOwnerID, class TArray< int > BonusID );		//  GUIWarfare.BTPageRoomLobby.rfAckUpdateScore
	 bool                      rfAckConnectGame ( int UserID, int Result );      		//  GUIWarfare.BTPageRoomLobby.rfAckConnectGame
	 bool                      rfAckChangeTeam ( int GameNumber, struct FString UserID, int UID, int TeamNum, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckChangeTeam
	 bool                      rfAckLeaveRoom ( int Num, int UID, struct FString UserID, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckLeaveRoom
	 bool                      rfAckEnterRoom ( int GameNum, int OwnerID, int UID, struct FString UserID, int TeamNum, int Grade, struct FString UserIP, struct FString ClanName, int Clan_Mark_Pattern, int Clan_Mark_BG, int Clan_Mark_BL, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageRoomLobby.rfAckEnterRoom
	 bool                      rfAckGameOverEnd ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckGameOverEnd
	 bool                      rfAckGameOver ( int UID, int GameRoomNumber, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckGameOver
	 bool                      rfAckDisconnectGame ( int Result, int DisconnectUserID, struct FString DisconnectUserName );		//  GUIWarfare.BTPageRoomLobby.rfAckDisconnectGame
	 bool                      rfAckRegisterOtherUdpInfo ( int UID, struct FString IP, int Port, unsigned char NatType, unsigned char Intervention, struct FString HostInnerIP, int HostInnerPort );		//  GUIWarfare.BTPageRoomLobby.rfAckRegisterOtherUdpInfo
	 bool                      rfAckStartGame ( int GameNumber, int ClientsCount, int StartSeed, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckStartGame
	 bool                      rfAckChangeGameMode ( int GameNum, int UID, struct FString GameMode, unsigned char GameModeNum, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckChangeGameMode
	 bool                      rfAckSelectMap ( int GameNum, int UID, struct FString MapName, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckSelectMap
	 bool                      rfAckGameRoomInfo ( int Result, struct FString ErrMsg, struct FGameRoomInfo RoomInfo );		//  GUIWarfare.BTPageRoomLobby.rfAckGameRoomInfo
	 bool                      rfAckIsGameRoomPlaying ( int GameRoomNum, unsigned char IsPlaying );		//  GUIWarfare.BTPageRoomLobby.rfAckIsGameRoomPlaying
	 bool                      rfAckGameHostInfo ( int GameNumber, struct FString UserID, struct FString IP, int Port, int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageRoomLobby.rfAckGameHostInfo
	 void                      TeamChatLog ( struct FString cL );                		//  GUIWarfare.BTPageRoomLobby.TeamChatLog
	 void                      BroadCastItemChatLog ( struct FString cL );       		//  GUIWarfare.BTPageRoomLobby.BroadCastItemChatLog
	 void                      SystemChatLog ( struct FString cL );              		//  GUIWarfare.BTPageRoomLobby.SystemChatLog
	 void                      SelfChatLog ( struct FString cL );                		//  GUIWarfare.BTPageRoomLobby.SelfChatLog
	 void                      WhisperChatLog ( struct FString cL );             		//  GUIWarfare.BTPageRoomLobby.WhisperChatLog
	 void                      ClanChatLog ( struct FString cL );                		//  GUIWarfare.BTPageRoomLobby.ClanChatLog
	 void                      NormalChatLog ( struct FString cL );              		//  GUIWarfare.BTPageRoomLobby.NormalChatLog
	 void                      ClearChatLog (  );                                		//  GUIWarfare.BTPageRoomLobby.ClearChatLog
	 void                      SetMatchBGM (  );                                 		//  GUIWarfare.BTPageRoomLobby.SetMatchBGM
	 void                      GameOver (  );                                    		//  GUIWarfare.BTPageRoomLobby.GameOver
	 void                      StartGame ( struct FString IP, int Port );        		//  GUIWarfare.BTPageRoomLobby.StartGame
	 bool                      IsUserAllReady (  );                              		//  GUIWarfare.BTPageRoomLobby.IsUserAllReady
	 int                       GetReadyAllUserCount (  );                        		//  GUIWarfare.BTPageRoomLobby.GetReadyAllUserCount
	 int                       GetUserCount (  );                                		//  GUIWarfare.BTPageRoomLobby.GetUserCount
	 bool                      IsUserCountFull (  );                             		//  GUIWarfare.BTPageRoomLobby.IsUserCountFull
	 void                      UpdateRoomInfoByMatchMaker (  );                  		//  GUIWarfare.BTPageRoomLobby.UpdateRoomInfoByMatchMaker
	 struct FString            FindFriendlyGameModeByIndex ( int GameModeIndex );		//  GUIWarfare.BTPageRoomLobby.FindFriendlyGameModeByIndex
	 struct FString            FindFriendlyGameMode ( struct FString GameMode ); 		//  GUIWarfare.BTPageRoomLobby.FindFriendlyGameMode
	 void                      InitialRoomInfo (  );                             		//  GUIWarfare.BTPageRoomLobby.InitialRoomInfo
	 class UBTConsole*         GetConsole (  );                                  		//  GUIWarfare.BTPageRoomLobby.GetConsole
	 class UBTTcpLink_Login*   GetTcpLogin (  );                                 		//  GUIWarfare.BTPageRoomLobby.GetTcpLogin
	 class UBTTcpLink_Channel* GetTcpChannel (  );                               		//  GUIWarfare.BTPageRoomLobby.GetTcpChannel
	 bool                      internalKeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfare.BTPageRoomLobby.internalKeyEvent
	 void                      InternalOnClose ( bool bCanceled );               		//  GUIWarfare.BTPageRoomLobby.InternalOnClose
	 void                      SetCharacterInfo ( struct FString ClanName, struct FCharInfo btCharInfo );		//  GUIWarfare.BTPageRoomLobby.SetCharacterInfo
	 void                      QuestLog ( struct FString Msg );                  		//  GUIWarfare.BTPageRoomLobby.QuestLog
	 void                      RefreshPage (  );                                 		//  GUIWarfare.BTPageRoomLobby.RefreshPage
	 void                      UnInitializeDelegate (  );                        		//  GUIWarfare.BTPageRoomLobby.UnInitializeDelegate
	 void                      InitializeDelegate (  );                          		//  GUIWarfare.BTPageRoomLobby.InitializeDelegate
	 void                      UpdateDurabilityWarningItemList ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTPageRoomLobby.UpdateDurabilityWarningItemList
	 void                      UpdateExpiredItemList ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTPageRoomLobby.UpdateExpiredItemList
	 void                      UpdateWebzenItemList ( class UwGameManager* GameMgr );		//  GUIWarfare.BTPageRoomLobby.UpdateWebzenItemList
	 void                      UpdateItemList ( class UwGameManager* GameMgr );  		//  GUIWarfare.BTPageRoomLobby.UpdateItemList
	 void                      UpdateBlockList ( class UwMatchMaker* MM );       		//  GUIWarfare.BTPageRoomLobby.UpdateBlockList
	 void                      SetFriendlyUser ( class UBTAutoColumnListDataHK* ACLData, int UserListIdx );		//  GUIWarfare.BTPageRoomLobby.SetFriendlyUser
	 void                      UpdateFriendlyUser ( int UserListIdx );           		//  GUIWarfare.BTPageRoomLobby.UpdateFriendlyUser
	 void                      UpdatePCBangList ( class UwMatchMaker* MM );      		//  GUIWarfare.BTPageRoomLobby.UpdatePCBangList
	 void                      UpdateClanList ( class UwMatchMaker* MM );        		//  GUIWarfare.BTPageRoomLobby.UpdateClanList
	 void                      UpdateFriendList ( class UwMatchMaker* MM );      		//  GUIWarfare.BTPageRoomLobby.UpdateFriendList
	 void                      UpdateGameRoomInfo ( class UwMatchMaker* MM );    		//  GUIWarfare.BTPageRoomLobby.UpdateGameRoomInfo
	 void                      UpdateRecv_CharInfo ( class UwMatchMaker* MM );   		//  GUIWarfare.BTPageRoomLobby.UpdateRecv_CharInfo
	 void                      UpdateQuestList ( class UwMatchMaker* MM );       		//  GUIWarfare.BTPageRoomLobby.UpdateQuestList
	 void                      UpdatePositionInfo ( class UwMatchMaker* MM );    		//  GUIWarfare.BTPageRoomLobby.UpdatePositionInfo
	 void                      UpdatePCBangInfo ( class UwMatchMaker* MM );      		//  GUIWarfare.BTPageRoomLobby.UpdatePCBangInfo
	 void                      UpdateEquipItemInfo ( class UwMatchMaker* MM );   		//  GUIWarfare.BTPageRoomLobby.UpdateEquipItemInfo
	 void                      UpdateRankingInfo ( class UwMatchMaker* MM );     		//  GUIWarfare.BTPageRoomLobby.UpdateRankingInfo
	 void                      UpdateMoneyInfo ( class UwMatchMaker* MM );       		//  GUIWarfare.BTPageRoomLobby.UpdateMoneyInfo
	 void                      UpdateClanInfo ( class UwMatchMaker* MM );        		//  GUIWarfare.BTPageRoomLobby.UpdateClanInfo
	 void                      UpdateCharInfo ( class UwMatchMaker* MM );        		//  GUIWarfare.BTPageRoomLobby.UpdateCharInfo
	 void                      OnCompleteOpened (  );                            		//  GUIWarfare.BTPageRoomLobby.OnCompleteOpened
	 void                      OnBackToLastPage (  );                            		//  GUIWarfare.BTPageRoomLobby.OnBackToLastPage
	 void                      InternalOnOpen (  );                              		//  GUIWarfare.BTPageRoomLobby.InternalOnOpen
	 void                      InternalOnReOpen (  );                            		//  GUIWarfare.BTPageRoomLobby.InternalOnReOpen
	 void                      CloseNetworkCheckingWindow ( bool bNotInitial );  		//  GUIWarfare.BTPageRoomLobby.CloseNetworkCheckingWindow
	 void                      OpenNetworkCheckingWindow (  );                   		//  GUIWarfare.BTPageRoomLobby.OpenNetworkCheckingWindow
	 void                      FailedNetworkChecking ( struct FString ErrMsg, int Code );		//  GUIWarfare.BTPageRoomLobby.FailedNetworkChecking
	 void                      StartNetworkChecking ( int ClientsCount, bool bConnectGame );		//  GUIWarfare.BTPageRoomLobby.StartNetworkChecking
	 bool                      ButtonStart_OnKeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfare.BTPageRoomLobby.ButtonStart_OnKeyEvent
	 void                      MessageHostUnsuitableness (  );                   		//  GUIWarfare.BTPageRoomLobby.MessageHostUnsuitableness
	 void                      SendPingAndSendHostPoint (  );                    		//  GUIWarfare.BTPageRoomLobby.SendPingAndSendHostPoint
	 bool                      InternalOnPreDraw ( class UCanvas* C );           		//  GUIWarfare.BTPageRoomLobby.InternalOnPreDraw
	 bool                      TPMessenger_ButtonMsg_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.TPMessenger_ButtonMsg_OnClick
	 void                      TPMessenger_ACLMsg0_OnHitBottom ( int Top, int Count, int itemperpage );		//  GUIWarfare.BTPageRoomLobby.TPMessenger_ACLMsg0_OnHitBottom
	 bool                      MyInfo_OnClick ( class UGUIComponent* Sender );   		//  GUIWarfare.BTPageRoomLobby.MyInfo_OnClick
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTPageRoomLobby.InitComponent
	 void                      InitializeTeamList (  );                          		//  GUIWarfare.BTPageRoomLobby.InitializeTeamList
	 bool                      BTWindowCreateClanHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowCreateClanHK_OnOK
	 bool                      BTWindowCreateClanNeedPointHK_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowCreateClanNeedPointHK_OnClick
	 bool                      ClanMenu_ButtonCreateClan_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ClanMenu_ButtonCreateClan_OnClick
	 bool                      BTWindowFindClanHK_OnInfo ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowFindClanHK_OnInfo
	 bool                      BTWindowFindClanHK_OnRequestJoin ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowFindClanHK_OnRequestJoin
	 bool                      ClanMenu_ButtonFindClan_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ClanMenu_ButtonFindClan_OnClick
	 bool                      ClanMenu_ButtonLookingForClan_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ClanMenu_ButtonLookingForClan_OnClick
	 bool                      HeaderButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.HeaderButton_OnClick
	 void                      ChangeButtonStart (  );                           		//  GUIWarfare.BTPageRoomLobby.ChangeButtonStart
	 bool                      ChangeButtonTeam ( int Team );                    		//  GUIWarfare.BTPageRoomLobby.ChangeButtonTeam
	 void                      UpdateRoomOwner ( int UID );                      		//  GUIWarfare.BTPageRoomLobby.UpdateRoomOwner
	 bool                      CheckInviteUser ( int CurPos, int CurState, struct FString szNickName, struct FString szClanName );		//  GUIWarfare.BTPageRoomLobby.CheckInviteUser
	 bool                      CanInviteUser (  );                               		//  GUIWarfare.BTPageRoomLobby.CanInviteUser
	 bool                      ButtonTeam_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ButtonTeam_OnClick
	 bool                      ButtonReady_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ButtonReady_OnClick
	 bool                      ButtonStart_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ButtonStart_OnClick
	 bool                      ButtonStart_OnClick_Before_CheckDurability ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ButtonStart_OnClick_Before_CheckDurability
	 bool                      CurrentButtonClickBehavior ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.CurrentButtonClickBehavior
	 bool                      CheckPrimaryWeaponDurability (  );                		//  GUIWarfare.BTPageRoomLobby.CheckPrimaryWeaponDurability
	 bool                      GotoStartGame_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.GotoStartGame_OnOK
	 bool                      GotoInventory_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.GotoInventory_OnOK
	 bool                      ButtonRoomInfo_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.ButtonRoomInfo_OnClick
	 bool                      BTWindowJoinClan_OK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowJoinClan_OK
	 bool                      BTWindowInviteClan_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowInviteClan_OnOK
	 bool                      WindowInviteFriend_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.WindowInviteFriend_OnOK
	 bool                      BTWindowRoomInfoHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageRoomLobby.BTWindowRoomInfoHK_OnOK
}; // Size: 0x02C8

// Class GUIWarfare.BTTcpHandler
class DLL_IMPORT UBTTcpHandler : public UBTTcpLink_Channel
{
public:
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x002C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0030 ( 0x0004 ) 
	class UBTTcpHandlerMed*                            RealOne;                                          		// 0x0034 ( 0x0004 ) 
	struct FString                                     DisconnectedFromServerMsg;                        		// 0x0038 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     DisconnectedFromServerQuit;                       		// 0x0044 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UwMatchMaker*                                MM;                                               		// 0x0050 ( 0x0004 ) 
	class UwGameManager*                               GameMgr;                                          		// 0x0054 ( 0x0004 ) 
	unsigned long                                      bTutorial:1;                                      		// 0x0058 ( 0x0004 )  [0x00000001]
	unsigned long                                      bTutorialEnteringRoom:1;                          		// 0x0058 ( 0x0004 )  [0x00000002]
	struct FGameRoomInfo                               TutorialRoomInfo;                                 		// 0x005C ( 0x0064 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      rfReqAhnNotifyDisconnct ( int Code );             		//  GUIWarfare.BTTcpHandler.rfReqAhnNotifyDisconnct
	 bool                      rfReqAhnHsObject ( class TArray< unsigned char > Data, int DataSize );		//  GUIWarfare.BTTcpHandler.rfReqAhnHsObject
	 bool                      rfNotifyCouponUseError ( int Time );              		//  GUIWarfare.BTTcpHandler.rfNotifyCouponUseError
	 bool                      rfReqNotifyShopItemDataEnd ( int Ver );           		//  GUIWarfare.BTTcpHandler.rfReqNotifyShopItemDataEnd
	 bool                      rfAckCouponUse ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckCouponUse
	 bool                      rfReqNotifyShopItemData ( class TArray< int > ProductNo, class TArray< struct FString > ProductRowGuid, class TArray< struct FString > ServiceCode, class TArray< struct FString > ProductName, class TArray< struct FString > ProductCode, class TArray< struct FString > ProductType, class TArray< unsigned char > SaleType, class TArray< struct FString > ItemSaleType, class TArray< unsigned char > ISIncludeBonus, class TArray< int > ProductCost, class TArray< int > ProductHour, class TArray< int > ProductQuantity, class TArray< int > TotalQuantity, class TArray< int > ReOrderTerms, class TArray< int > ReorderCount, class TArray< int > PurchaseAvailableQuantity, class TArray< int > AvailableMinLevel, class TArray< int > AvailableMaxLevel, class TArray< unsigned char > AvailableGender, class TArray< int > InventoryKeepDays, class TArray< int > SaleMasterFlag, class TArray< int > SaleStatus, class TArray< struct FString > Description, class TArray< struct FString > Property0, class TArray< struct FString > Property1, class TArray< struct FString > Property2, class TArray< struct FString > Property3, class TArray< struct FString > Property4, class TArray< int > IsGift );		//  GUIWarfare.BTTcpHandler.rfReqNotifyShopItemData
	 bool                      rfAckShopItemData (  );                           		//  GUIWarfare.BTTcpHandler.rfAckShopItemData
	 bool                      rfNotifyClanLevelup ( struct FString ClanName, int Levelup );		//  GUIWarfare.BTTcpHandler.rfNotifyClanLevelup
	 bool                      rfNotifyNewClanName ( struct FString New_NickName );		//  GUIWarfare.BTTcpHandler.rfNotifyNewClanName
	 bool                      rfNotifyNewNickName ( int Community_Type, struct FString Old_NickName, struct FString New_NickName );		//  GUIWarfare.BTTcpHandler.rfNotifyNewNickName
	 bool                      rfAckTencent_StartTenProtect ( int CharDBID );    		//  GUIWarfare.BTTcpHandler.rfAckTencent_StartTenProtect
	 bool                      rfAckMoveToLobby ( unsigned char MessageType );   		//  GUIWarfare.BTTcpHandler.rfAckMoveToLobby
	 bool                      rfAckPopUpMessage ( int MessageType );            		//  GUIWarfare.BTTcpHandler.rfAckPopUpMessage
	 bool                      rfUpdateWebzenShopScriptVersion ( int Year, int YearId, int SalesZoneCode );		//  GUIWarfare.BTTcpHandler.rfUpdateWebzenShopScriptVersion
	 bool                      rfAckFriendPosition ( int Result, struct FString TargetCharName, unsigned char ServerType, struct FString fServername, struct FString fServerShortName, struct FString fServerIP, int fServerPort, unsigned char CurPos, unsigned char CurState, int ChannelNum, struct FString ChannelNickName, int GameRoomNum );		//  GUIWarfare.BTTcpHandler.rfAckFriendPosition
	 bool                      rfAckLogOut ( unsigned char Result, unsigned char Reason );		//  GUIWarfare.BTTcpHandler.rfAckLogOut
	 bool                      rfAckNotifyUpdateCharInfo_LevelMark ( struct FString CharName, int LevelMarkID );		//  GUIWarfare.BTTcpHandler.rfAckNotifyUpdateCharInfo_LevelMark
	 bool                      rfAckGetRankingInfoListEnd (  );                  		//  GUIWarfare.BTTcpHandler.rfAckGetRankingInfoListEnd
	 bool                      rfAckGetRankingInfoList ( int Result, unsigned char RankingType, unsigned char CommunityType, class TArray< struct FString > CharName, class TArray< int > CharLevel, class TArray< struct FString > ClanName, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< int > ClanMarkBL, class TArray< int > Ranking_Accum, class TArray< int > Ranking_Accum_Prev, class TArray< int > Ranking_Accum_Exp, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckGetRankingInfoList
	 bool                      rfAckGetRankingInfoListStart ( int Result, unsigned char RankingType, unsigned char CommunityType, int TotalCount );		//  GUIWarfare.BTTcpHandler.rfAckGetRankingInfoListStart
	 bool                      rfAckCharDetailInfo ( int MaxSerial, int MaxScore, int MaxKill, int MaxAssist, int Serial3, int Serial5, int Serial7, int Serial10, int Serial15, int AR, int SMG, int SR, int SW, int Melee, int Grenade, int FlashBang, int Foot, int AT4, int MG, int Fire, int RPG7, int TimeBomb, int IcendiaryBomb, int ClusterBomb, int ByChopper, int Artillery, int KillChopper, int FirstKill, int LastKill, int AllKill, int Dominate, int InstallBomb, int DefuseBomb );		//  GUIWarfare.BTTcpHandler.rfAckCharDetailInfo
	 bool                      rfReqInGameRoomUserClanLevelChanged ( int UserID, int ClanLevel );		//  GUIWarfare.BTTcpHandler.rfReqInGameRoomUserClanLevelChanged
	 bool                      rfAckClanMatchResultHistory ( class TArray< struct FBtrDouble > MatchDate, class TArray< unsigned char > IsWin, class TArray< struct FString > EnemyClanname );		//  GUIWarfare.BTTcpHandler.rfAckClanMatchResultHistory
	 bool                      rfReqInGameRoomUserInfoChanged (  );              		//  GUIWarfare.BTTcpHandler.rfReqInGameRoomUserInfoChanged
	 bool                      rfAckServerType ( unsigned char Type );           		//  GUIWarfare.BTTcpHandler.rfAckServerType
	 bool                      rfAckClanMatch_ChangeRoomSetting ( int WaitRoomIndex, int Result, struct FString ErrMsg, class TArray< int > MapNumArray, int VersusMode, unsigned char IsPublic );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_ChangeRoomSetting
	 bool                      rfAckClanMatch_PublicWaitRoomChanged ( int WaitRoomIdx, struct FString RoomName, int MapNum, int CurUserCount, int MaxUserCount, unsigned char Status, unsigned char IsPublic );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_PublicWaitRoomChanged
	 bool                      rfAckClanMatch_EndPublicWaitRoomList (  );        		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_EndPublicWaitRoomList
	 bool                      rfAckClanMatch_PublicWaitRoomList ( class TArray< int > WaitRoomIdx, class TArray< struct FString > LeaderName, class TArray< struct FString > RoomName, class TArray< int > MapNum, class TArray< int > CurUserCount, class TArray< int > MaxUserCount, class TArray< unsigned char > Status );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_PublicWaitRoomList
	 bool                      rfAckClanMatch_StartPublicWaitRoomList ( int Result, struct FString ErrMsg, int Count );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_StartPublicWaitRoomList
	 bool                      rfAckPaidItem_NotifyChangeClanname ( struct FString NewClanname );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_NotifyChangeClanname
	 bool                      rfAckPaidItem_ChangeClanname ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int RemainCount, struct FString NewClanname );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_ChangeClanname
	 bool                      rfAckPaidItem_ChangeCharname ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int RemainCount, struct FString NewCharname );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_ChangeCharname
	 bool                      rfAckNotifyEndTutorial ( int UserID, struct FString CharName, int Level, struct FString ClanName, int ClanMarkPattern, int ClanMarkBG, int ClanMarkBL, int ClanGrade, int ClanWin, int ClanLose, unsigned char IsLookFor, int Result, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckNotifyEndTutorial
	 bool                      rfAckNotifyStartTutorial ( int Result, int UserID );		//  GUIWarfare.BTTcpHandler.rfAckNotifyStartTutorial
	 bool                      rfAckGetMyMailBoxState ( int Result, unsigned char IsFull, int NewMailCount );		//  GUIWarfare.BTTcpHandler.rfAckGetMyMailBoxState
	 bool                      rfAckRoomUserPingInfo ( class TArray< int > UnqueID, class TArray< int > Ping, int HostPriorityPoint );		//  GUIWarfare.BTTcpHandler.rfAckRoomUserPingInfo
	 bool                      rfAckSetLookForClan ( int Result, struct FString ErrMsg, unsigned char IsLookingFor );		//  GUIWarfare.BTTcpHandler.rfAckSetLookForClan
	 bool                      rfAckChangedRoomTitle_FromGM ( int Result, int RoomNumber, struct FString NewRoomTitle );		//  GUIWarfare.BTTcpHandler.rfAckChangedRoomTitle_FromGM
	 bool                      rfAckRecvSystemMsg ( unsigned char CommunityType, struct FSystemMsgParam MsgInfo );		//  GUIWarfare.BTTcpHandler.rfAckRecvSystemMsg
	 bool                      rfAckGMLeaveRoom ( int Result, int RoomNumber, int UserID );		//  GUIWarfare.BTTcpHandler.rfAckGMLeaveRoom
	 bool                      rfAckGMEnterRoom ( int Result, int RoomNumber, int UserID );		//  GUIWarfare.BTTcpHandler.rfAckGMEnterRoom
	 bool                      rfAckForceDisconnectUser_GM ( int Result, struct FString ErrMsg, struct FString CharName );		//  GUIWarfare.BTTcpHandler.rfAckForceDisconnectUser_GM
	 bool                      rfAckNotice_GM ( int Result, struct FString ErrMsg, unsigned char NoticeType, int ServerID, int ChannelNum, int GameRoomNum, struct FString Msg );		//  GUIWarfare.BTTcpHandler.rfAckNotice_GM
	 bool                      rfAckChangeRoomTitle_GM ( int Result, int RoomNumber, struct FString NewRoomTitle );		//  GUIWarfare.BTTcpHandler.rfAckChangeRoomTitle_GM
	 bool                      rfReqExteriorRoomOwnerInfo ( int RoomNum, struct FString OwnerName, struct FString OwnerIP );		//  GUIWarfare.BTTcpHandler.rfReqExteriorRoomOwnerInfo
	 bool                      rfAckCharBlockInfo ( int Result, struct FBtrDouble ChatBlockStartTime, struct FBtrDouble ChatBlockEndTime, class TArray< struct FBtrDouble > BlockedItemIdx );		//  GUIWarfare.BTTcpHandler.rfAckCharBlockInfo
	 bool                      rfAckQuestGetAvailableEventList ( int Result, struct FString ErrMsg, class TArray< int > QuestID );		//  GUIWarfare.BTTcpHandler.rfAckQuestGetAvailableEventList
	 bool                      rfAckPaidItem_NotifyChangeClanMark ( struct FString ClanName, int Pattern, int BG, int BL );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_NotifyChangeClanMark
	 bool                      rfAckPaidItem_ChangeClanMark ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int StackCount );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_ChangeClanMark
	 bool                      rfAckPaidItem_ClanMarkDupCheck ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_ClanMarkDupCheck
	 bool                      rfAckWebzenBillingUseStorageItem ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int ItemID, struct FBtrDouble ItemExtra );		//  GUIWarfare.BTTcpHandler.rfAckWebzenBillingUseStorageItem
	 bool                      rfAckPaidItem_RelayBroadcast ( struct FString CharName, struct FString Msg );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_RelayBroadcast
	 bool                      rfAckPaidItem_BroadCast ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int StackCount );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_BroadCast
	 bool                      rfAckPaidItem_EraseRecord ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int Command, int RemainCount );		//  GUIWarfare.BTTcpHandler.rfAckPaidItem_EraseRecord
	 bool                      rfAckWebzenBillingStorageListEnd (  );            		//  GUIWarfare.BTTcpHandler.rfAckWebzenBillingStorageListEnd
	 bool                      rfAckWebzenBillingStorageList ( class TArray< int > Seq, class TArray< int > ItemSeq, class TArray< int > GroupCode, class TArray< int > ShareFlag, class TArray< int > ProductSeq, class TArray< struct FString > CashName, class TArray< struct FBtrDouble > CashPoint, class TArray< struct FString > SendAccountID, class TArray< struct FString > SendMessage, class TArray< unsigned char > ItemType, class TArray< unsigned char > RelationType, class TArray< int > ProductType, class TArray< int > PriceSeq );		//  GUIWarfare.BTTcpHandler.rfAckWebzenBillingStorageList
	 bool                      rfAckWebzenBillingStorageListStart ( int Result, struct FString ErrMsg, int TotalCount, int TotalPage, int CurPage );		//  GUIWarfare.BTTcpHandler.rfAckWebzenBillingStorageListStart
	 bool                      rfAckRandomBox_Use ( int Result, struct FString ErrMsg, struct FBtrDouble RandomBoxItemIdx, int RandomBxoItemCount, class TArray< int > ItemIDChoose, class TArray< int > PartIDChoose, class TArray< int > PeriodOnChoosenItem, class TArray< int > StackCountOnChoosenItem, class TArray< unsigned char > bHave, class TArray< struct FBtrDouble > ItemIdx, class TArray< struct FBtrDouble > UntilTime, class TArray< int > StackCount );		//  GUIWarfare.BTTcpHandler.rfAckRandomBox_Use
	 bool                      rfAckRegisterMainPCBang ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckRegisterMainPCBang
	 bool                      rfReqIsPaidWebzenPCBang ( unsigned char IsPaid ); 		//  GUIWarfare.BTTcpHandler.rfReqIsPaidWebzenPCBang
	 bool                      rfAckPCBangUserListEnd (  );                      		//  GUIWarfare.BTTcpHandler.rfAckPCBangUserListEnd
	 bool                      rfAckPCBangUserList ( class TArray< struct FString > FriendName, class TArray< struct FString > ClanName, class TArray< int > CM_Pattern, class TArray< int > CM_BG, class TArray< int > CM_BL, class TArray< int > Level, class TArray< int > ClanGrade, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< unsigned char > IsLookForClan, class TArray< unsigned char > IsCombat, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckPCBangUserList
	 bool                      rfAckPCBangUserListStart ( int Result, int TotalCount );		//  GUIWarfare.BTTcpHandler.rfAckPCBangUserListStart
	 bool                      rfAckGiftItemByWebzenCash ( int Result, struct FString ErrMsg, int LeftProductCount );		//  GUIWarfare.BTTcpHandler.rfAckGiftItemByWebzenCash
	 bool                      rfAckBuyItemByWebzenCash ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckBuyItemByWebzenCash
	 bool                      rfAckClanMatch_GetClanWaittingRoomInfo ( int WaitRoomIndex, int Result, struct FString ErrMsg, class TArray< int > MapNumArray, int VersusMode, struct FString WaitRoomName );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_GetClanWaittingRoomInfo
	 bool                      rfAckGetBotID ( int Result, unsigned char RequestedAFCount, unsigned char RequestedRSACount, class TArray< int > AFBotID, class TArray< int > RSABotID );		//  GUIWarfare.BTTcpHandler.rfAckGetBotID
	 bool                      rfAckRegisteredPCBangInfo ( int Result, struct FString ErrMsg, unsigned char IsRegisteredPCBang, unsigned char IsMainPCBang, struct FString PCBangName );		//  GUIWarfare.BTTcpHandler.rfAckRegisteredPCBangInfo
	 bool                      rfAckWebzenShopScriptVersion ( int Year, int YearId, int SalesZoneCode );		//  GUIWarfare.BTTcpHandler.rfAckWebzenShopScriptVersion
	 bool                      rfAckWebzenCash ( int Result, struct FString ErrMsg, struct FBtrDouble PCoinCash, struct FBtrDouble CCoinCash );		//  GUIWarfare.BTTcpHandler.rfAckWebzenCash
	 bool                      rfAckCheckEquipedWeaponDurability ( int Result, class TArray< struct FBtrDouble > ItemUniqueID, class TArray< int > ItemSlotNum );		//  GUIWarfare.BTTcpHandler.rfAckCheckEquipedWeaponDurability
	 bool                      rfReqClanMatch_InviteCrewResult ( struct FString Invitee, int Result );		//  GUIWarfare.BTTcpHandler.rfReqClanMatch_InviteCrewResult
	 bool                      rfReqClanMatch_RecvInviteCrew ( struct FString Inviter, struct FString ServerIP, int Port, int WaittingID, struct FString Msg, int MapNum, int InviteUserChannelNum, struct FString LeaderName, struct FString RoomName );		//  GUIWarfare.BTTcpHandler.rfReqClanMatch_RecvInviteCrew
	 bool                      rfAckClanMatch_InviteCrew ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_InviteCrew
	 bool                      rfReqDailyQuestNewAvailable ( class TArray< int > ExpiredQuestID, class TArray< int > NewQuestID );		//  GUIWarfare.BTTcpHandler.rfReqDailyQuestNewAvailable
	 bool                      rfReqQuestNewAvailable ( class TArray< int > AchivedQuestID, class TArray< int > NewQuestID, class TArray< unsigned char > IsDailyQuest, class TArray< int > ExpiredQuest );		//  GUIWarfare.BTTcpHandler.rfReqQuestNewAvailable
	 bool                      rfAckQuestUpdate ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckQuestUpdate
	 bool                      rfAckQuestListEnd (  );                           		//  GUIWarfare.BTTcpHandler.rfAckQuestListEnd
	 bool                      rfAckQuestList ( class TArray< int > QuestID, class TArray< int > CountPrograss, class TArray< unsigned char > IsDailyQuest );		//  GUIWarfare.BTTcpHandler.rfAckQuestList
	 bool                      rfAckQuestListStart ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckQuestListStart
	 bool                      rfAckClanMatch_SetWaitRoomPublic ( int Result, struct FString ErrMsg, unsigned char Set );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_SetWaitRoomPublic
	 bool                      rfAckClanMatch_StopSearching (  );                		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_StopSearching
	 bool                      rfReqClanMatch_FoundMatch ( int ChannelID, int RoomNumber );		//  GUIWarfare.BTTcpHandler.rfReqClanMatch_FoundMatch
	 bool                      rfAckClanMatch_FoundMatch (  );                   		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_FoundMatch
	 bool                      rfAckClanMatch_NotifyStartSearching ( int ShouldWaitMore );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_NotifyStartSearching
	 bool                      rfAckClanMatch_StartSearching ( int Result, struct FString ErrMsg, int ShouldWaitMore );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_StartSearching
	 bool                      rfAckClanMatch_ChangeLeader ( int Result, struct FString ErrMsg, int NewLeader, struct FString NewLeaderName );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_ChangeLeader
	 bool                      rfAckClanMatch_WaittingTeamList ( int TtotlCount, class TArray< int > Grade, class TArray< int > Map, class TArray< int > Versus );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_WaittingTeamList
	 bool                      rfAckClanMatch_Chat ( int Result, struct FString ErrMsg, struct FString CharName, struct FString Msg );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_Chat
	 bool                      rfAckClanMatch_Leave ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_Leave
	 bool                      rfAckClanMatch_MemberList ( class TArray< unsigned char > IsLeader, class TArray< int > ClanMarkPA, class TArray< int > ClanMarkBG, class TArray< int > ClanMarkBL, class TArray< int > Level, class TArray< struct FString > CharName, class TArray< int > ClanGrade, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< struct FString > ClanName, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_MemberList
	 bool                      rfAckClanMatch_LeaveNotify ( struct FString CharName );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_LeaveNotify
	 bool                      rfAckClanMatch_JoinNotify ( unsigned char IsLeader, int ClanMarkPA, int ClanMarkBG, int ClanMarkBL, int Level, struct FString CharName, int ClanGrade, int ClanWin, int ClanLose, struct FString ClanName, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_JoinNotify
	 bool                      rfAckClanMatch_Join ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_Join
	 bool                      rfAckClanMatch_NotifiyStartCombat ( class TArray< int > MapNumArray, int VersusMode );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_NotifiyStartCombat
	 bool                      rfAckClanMatch_StartCombat ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_StartCombat
	 bool                      rfAckClanMatch_GetReady ( int Result, struct FString ErrMsg, int RoomIndex );		//  GUIWarfare.BTTcpHandler.rfAckClanMatch_GetReady
	 bool                      rfAckLimitedListInChannel ( int Result, class TArray< int > LimitedMapID, class TArray< int > LimitedModeID );		//  GUIWarfare.BTTcpHandler.rfAckLimitedListInChannel
	 bool                      rfAckRecvInviteGameRoomResult ( int Result );     		//  GUIWarfare.BTTcpHandler.rfAckRecvInviteGameRoomResult
	 bool                      rfReqRecvInviteGameRoom ( struct FString InviteUserServerName, int InviteUserServerID, int InviteUserChannelNumber, struct FString RoomUniqueID, int RoomNumber, struct FString RoomName, unsigned char RoomState, struct FString MapName, struct FString OwnerName, unsigned char GameMode, unsigned char WeaponLimit, unsigned char IsTeamBalance, struct FString Password, struct FString InviteCharName );		//  GUIWarfare.BTTcpHandler.rfReqRecvInviteGameRoom
	 bool                      rfAckInviteGameRoom ( int Result, unsigned char Answer, struct FString GuestCharName );		//  GUIWarfare.BTTcpHandler.rfAckInviteGameRoom
	 bool                      rfAckAutoChangedTeamUserList ( class TArray< int > UserID, class TArray< int > TeamNum );		//  GUIWarfare.BTTcpHandler.rfAckAutoChangedTeamUserList
	 bool                      rfAckGetItemFromItemBox ( int Result, struct FString ErrMsg, int ItemIDChoose, int PartIDChoose, struct FBtrDouble BoxItemIdx, int BxoItemCount, unsigned char bHave, struct FBtrDouble ItemIdx, struct FBtrDouble UntilTime, int StackCount );		//  GUIWarfare.BTTcpHandler.rfAckGetItemFromItemBox
	 bool                      rfAckItemListInItemBox ( int Result, struct FString ErrMsg, struct FBtrDouble ItemUniqueID, int BoxItemID, class TArray< int > ItemID, class TArray< int > PartID );		//  GUIWarfare.BTTcpHandler.rfAckItemListInItemBox
	 bool                      rfReqRecvForceFailedClientLoading ( int ErrCode );		//  GUIWarfare.BTTcpHandler.rfReqRecvForceFailedClientLoading
	 bool                      rfAckStartHolePunching ( int Result, struct FString ErrMsg, int GameType, int ReqStartUserID );		//  GUIWarfare.BTTcpHandler.rfAckStartHolePunching
	 bool                      eventrfAckRegisterMyUdpInfo ( int Result, struct FString ErrMsg );		// [ FUNC_Event ] GUIWarfare.BTTcpHandler.rfAckRegisterMyUdpInfo
	 bool                      rfAckNotifyMyCharInfoToRoomUser ( int Result, struct FString ErrMsg, int UID, struct FString UserName, int Grade, int TeamNum, unsigned char Statue, unsigned char IsHost, struct FString UserIP, struct FString ClanName, int CM_Pattern, int CM_BG, int CM_BL, unsigned char IsLookFor );		//  GUIWarfare.BTTcpHandler.rfAckNotifyMyCharInfoToRoomUser
	 bool                      rfReqNotifyDisconnectHostInLoading ( int Result, struct FString ErrMsg, int HostID );		//  GUIWarfare.BTTcpHandler.rfReqNotifyDisconnectHostInLoading
	 bool                      rfReqRecvForceDisconnected_FromGM ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfReqRecvForceDisconnected_FromGM
	 bool                      rfReqRecvNotice_FromGM ( int Result, struct FString ErrMsg, class TArray< struct FString > NoticeMsg, unsigned char IsFromDB );		//  GUIWarfare.BTTcpHandler.rfReqRecvNotice_FromGM
	 bool                      rfAckJoinClan ( int Result, struct FString ErrMsg, struct FString SpecificCharName, struct FString RealRecvCharName, unsigned char RealRecvCharClanGrade );		//  GUIWarfare.BTTcpHandler.rfAckJoinClan
	 bool                      rfAckExceedMaxUser (  );                          		//  GUIWarfare.BTTcpHandler.rfAckExceedMaxUser
	 bool                      rfAckChannelUserListInGameRoom ( int Result, int TotalCount, int Count, int StartIndex, class TArray< int > UID, class TArray< struct FString > CharName, class TArray< int > UserLevel, class TArray< struct FString > ClanName, class TArray< int > ClanPattern, class TArray< int > ClanBG, class TArray< int > ClanBL, class TArray< unsigned char > IsLookForClan, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckChannelUserListInGameRoom
	 bool                      rfReqRecvDeleteFriend ( int Result, struct FString FromCharName );		//  GUIWarfare.BTTcpHandler.rfReqRecvDeleteFriend
	 bool                      rfAckDeleteFriend ( int Result, class TArray< struct FString > FailedCharname );		//  GUIWarfare.BTTcpHandler.rfAckDeleteFriend
	 bool                      rfAckChatWispher ( int Result, struct FString ErrMsg, struct FString ToCharName );		//  GUIWarfare.BTTcpHandler.rfAckChatWispher
	 bool                      rfAckNotifyAdjustClanMemberGrade ( struct FString ClanName, struct FString CharName, unsigned char CharGrade );		//  GUIWarfare.BTTcpHandler.rfAckNotifyAdjustClanMemberGrade
	 bool                      rfReqNotifyDurabilityZeroItem ( int Result, struct FString ErrMsg, int UserID, class TArray< struct FBtrDouble > ItemUniqueIDs, class TArray< int > ItemIDs, class TArray< int > ItemPartIDs, class TArray< unsigned char > ItemSlotPos );		//  GUIWarfare.BTTcpHandler.rfReqNotifyDurabilityZeroItem
	 bool                      rfAckAcquirePromotionItems ( int UID, int Result, struct FString ErrMsg, class TArray< struct FBtrDouble > ItemUniqueID, class TArray< int > ItemIDs, class TArray< int > PartIDs );		//  GUIWarfare.BTTcpHandler.rfAckAcquirePromotionItems
	 bool                      rfReqNotifyLevelUp ( int LevelUpUserID, int Level, int Exp, class TArray< int > ItemID, class TArray< int > PartID );		//  GUIWarfare.BTTcpHandler.rfReqNotifyLevelUp
	 bool                      rfAckBlockUserList ( class TArray< struct FString > CharName );		//  GUIWarfare.BTTcpHandler.rfAckBlockUserList
	 bool                      rfAckRemoveBlockUserList ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckRemoveBlockUserList
	 bool                      rfAckBlockUserListEnd (  );                       		//  GUIWarfare.BTTcpHandler.rfAckBlockUserListEnd
	 bool                      rfAckAddBlockUserList ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckAddBlockUserList
	 bool                      rfAckBlockUserListStart ( int Result, int TotalCount );		//  GUIWarfare.BTTcpHandler.rfAckBlockUserListStart
	 bool                      rfAckAdjustClanMemberGrade ( int Result, struct FString ErrMsg, struct FString ClanName, struct FString CharName, unsigned char CharGrade );		//  GUIWarfare.BTTcpHandler.rfAckAdjustClanMemberGrade
	 bool                      rfReqClanCharPersonelIntro ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTTcpHandler.rfReqClanCharPersonelIntro
	 bool                      rfAckRecvJoinClanResult ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckRecvJoinClanResult
	 bool                      rfAckJoinClanResult ( struct FString ClanName, unsigned char Permit, struct FString PermitCharName );		//  GUIWarfare.BTTcpHandler.rfAckJoinClanResult
	 bool                      rfAckNotifyClanSecession ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTTcpHandler.rfAckNotifyClanSecession
	 bool                      rfAckNotifyNewClanMember ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTTcpHandler.rfAckNotifyNewClanMember
	 bool                      rfReqRecvJoinClan ( int UserIdx, struct FString CharName, struct FString Message );		//  GUIWarfare.BTTcpHandler.rfReqRecvJoinClan
	 bool                      rfAckRecvClanInviteResult ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckRecvClanInviteResult
	 bool                      rfAckInviteClanResult ( struct FString CharName, unsigned char Permit, struct FString ClanNm );		//  GUIWarfare.BTTcpHandler.rfAckInviteClanResult
	 bool                      rfAckInviteClan ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckInviteClan
	 bool                      rfReqRecvClanInvite ( int InviterUserDBID, struct FString InviterCharname, struct FString ClanName, struct FString InviteMsg );		//  GUIWarfare.BTTcpHandler.rfReqRecvClanInvite
	 bool                      rfAckGetIsHostBlocking ( int Result, unsigned char Blocking );		//  GUIWarfare.BTTcpHandler.rfAckGetIsHostBlocking
	 bool                      rfAckNotifyHostBlocking ( int Result, unsigned char Blocking );		//  GUIWarfare.BTTcpHandler.rfAckNotifyHostBlocking
	 bool                      rfAckGetHolePunchingResult ( int Result, unsigned char Phrase, int InterventionUserID, unsigned char Intervention, class TArray< int > FailedUserIDs );		//  GUIWarfare.BTTcpHandler.rfAckGetHolePunchingResult
	 bool                      rfAckGetUserHostPriorityPoint ( int Result, int UserID, int HostPriorityPoint );		//  GUIWarfare.BTTcpHandler.rfAckGetUserHostPriorityPoint
	 bool                      rfReqNotifyRelayServerAddr ( struct FString RelayIP, int RelayPort );		//  GUIWarfare.BTTcpHandler.rfReqNotifyRelayServerAddr
	 bool                      rfReqRecvForceDisconnectUDPFromHost ( int Result );		//  GUIWarfare.BTTcpHandler.rfReqRecvForceDisconnectUDPFromHost
	 bool                      rfAckForceDisconnectUDPFromHost ( int Result );   		//  GUIWarfare.BTTcpHandler.rfAckForceDisconnectUDPFromHost
	 bool                      rfReqNotifyChangeRoomState ( unsigned char RoomState );		//  GUIWarfare.BTTcpHandler.rfReqNotifyChangeRoomState
	 bool                      rfAckClanCharPersonelIntro ( int Result, struct FString ErrMsg, struct FString PersonelIntro );		//  GUIWarfare.BTTcpHandler.rfAckClanCharPersonelIntro
	 bool                      rfAckDBCharInfo ( int Result, struct FString ErrMsg, struct FString CharName, struct FString ClanName, int CM_Pattern, int CM_BG, int CM_BL, struct FString ClanPersonIntro, int MainWeaponItemID, int MainWeaponPartID, int SubWeaponItemID, int SubWeaponPartID, int AFSpecialCostumeItemID, int RSASpecialCostumeItemID, struct FCharInfo stCharInfo, int ClanLevel );		//  GUIWarfare.BTTcpHandler.rfAckDBCharInfo
	 bool                      rfAckSearchClan ( int Result, struct FString ErrMsg, int TotalPage, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< unsigned char > ClanMarkBL, class TArray< struct FString > ClanName, class TArray< struct FString > ClanMaster, class TArray< int > ClanMember, class TArray< int > ClanMemberMax, class TArray< int > ClanCreateDate, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< int > ClanDraw, class TArray< int > ClanRank, class TArray< unsigned char > ClanRecruit, class TArray< int > ClanLevel );		//  GUIWarfare.BTTcpHandler.rfAckSearchClan
	 bool                      rfAckClanPersonelIntro ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckClanPersonelIntro
	 bool                      rfAckClanChangeInfo ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckClanChangeInfo
	 bool                      rfAckClanSecession ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckClanSecession
	 bool                      rfAckClanClose ( int Result, struct FString ErrMsg, struct FString ClanName );		//  GUIWarfare.BTTcpHandler.rfAckClanClose
	 bool                      rfAckClanNews ( class TArray< struct FString > IssueDate, class TArray< unsigned char > IssueType, class TArray< struct FString > IssuedClanMember );		//  GUIWarfare.BTTcpHandler.rfAckClanNews
	 bool                      rfAckClanUserListEnd (  );                        		//  GUIWarfare.BTTcpHandler.rfAckClanUserListEnd
	 bool                      rfAckClanUserList ( int Result, struct FString ErrMsg, class TArray< int > Level, class TArray< struct FString > CharName, class TArray< unsigned char > ClanGrade, class TArray< int > ClanWinCnt, class TArray< int > ClanLoseCnt, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > DudeId );		//  GUIWarfare.BTTcpHandler.rfAckClanUserList
	 bool                      rfAckClanUserListStart ( int Result, int TotalCount );		//  GUIWarfare.BTTcpHandler.rfAckClanUserListStart
	 bool                      rfAckClanInfo ( struct FClanInfo stClanInfo );    		//  GUIWarfare.BTTcpHandler.rfAckClanInfo
	 bool                      rfAckDupCheckClanName ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckDupCheckClanName
	 bool                      rfAckCreateClan ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int StackCount );		//  GUIWarfare.BTTcpHandler.rfAckCreateClan
	 bool                      rfAckGetServerTime ( struct FBtrDouble ServerTime, struct FString ClientIP );		//  GUIWarfare.BTTcpHandler.rfAckGetServerTime
	 bool                      rfAckMyMoney ( int Result, struct FString ErrMsg, int Point, int Cash );		//  GUIWarfare.BTTcpHandler.rfAckMyMoney
	 bool                      rfAckBanUser ( int GameNum, int UID, int BanUID, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckBanUser
	 bool                      rfAckNotifyExpiredSkillIDs ( int UserID, class TArray< struct FBtrDouble > ExpiredSkillUniqueIDs, class TArray< int > ExpiredSkillIDs, int Result, struct FString ErrMsg, class TArray< unsigned char > ExpiredSkillSlotPositions );		//  GUIWarfare.BTTcpHandler.rfAckNotifyExpiredSkillIDs
	 bool                      rfAckNotifyExpiredItemIDs ( int UserID, class TArray< struct FBtrDouble > ExpiredItemUniqueIDs, class TArray< int > ExpiredItemIDs, class TArray< int > ExpiredItemPartIDs, class TArray< unsigned char > ExpiredItemSlotPos, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckNotifyExpiredItemIDs
	 bool                      rfAckGetAttachedItemFromMemo ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int ItemID );		//  GUIWarfare.BTTcpHandler.rfAckGetAttachedItemFromMemo
	 bool                      eventrfAckDeleteMailAll ( int Result, unsigned char MailType, int Count );		// [ FUNC_Event ] GUIWarfare.BTTcpHandler.rfAckDeleteMailAll
	 bool                      eventrfAckDelMemo ( int Result, struct FString ErrMsg, class TArray< int > FailedMemoID );		// [ FUNC_Event ] GUIWarfare.BTTcpHandler.rfAckDelMemo
	 bool                      rfAckSendMemo ( class TArray< struct FString > CnamesToFail, class TArray< int > ResultArray );		//  GUIWarfare.BTTcpHandler.rfAckSendMemo
	 bool                      rfAckAuctionBidding ( int Result, struct FString ErrMsg, int PointRemain );		//  GUIWarfare.BTTcpHandler.rfAckAuctionBidding
	 bool                      rfAckAuctionTradeHistory ( int Result, struct FString ErrMsg, int ItemID, int PartID, class TArray< struct FString > SellerCharNm, class TArray< int > DamageDegree, class TArray< int > Price );		//  GUIWarfare.BTTcpHandler.rfAckAuctionTradeHistory
	 bool                      rfAckSendGift ( int Result, struct FString ErrMsg, int PointRemain, int CashRemain );		//  GUIWarfare.BTTcpHandler.rfAckSendGift
	 bool                      rfAckRecvMemo ( struct FString cnameFrom, unsigned char MemoType );		//  GUIWarfare.BTTcpHandler.rfAckRecvMemo
	 bool                      rfAckReadMemo ( struct FString cnameFrom, struct FString Text, struct FString dateRecv, struct FBtrDouble ItemUID );		//  GUIWarfare.BTTcpHandler.rfAckReadMemo
	 bool                      rfAckEndMemoList (  );                            		//  GUIWarfare.BTTcpHandler.rfAckEndMemoList
	 bool                      rfAckTestDouble ( struct FBtrDouble vDouble, class TArray< struct FBtrDouble > vDoubles );		//  GUIWarfare.BTTcpHandler.rfAckTestDouble
	 bool                      rfAckMemoList ( class TArray< int > MemoIdx, class TArray< struct FString > cnameFrom, class TArray< struct FString > dateRecv, class TArray< struct FString > Text, class TArray< unsigned char > Status, class TArray< int > UntilExpire, class TArray< struct FBtrDouble > ItemUID, class TArray< int > ItemID, class TArray< unsigned char > MsgType, class TArray< int > ItemPartID );		//  GUIWarfare.BTTcpHandler.rfAckMemoList
	 bool                      rfAckStartMemoList ( int Result, struct FString ErrMsg, unsigned char Type, int TotalCount );		//  GUIWarfare.BTTcpHandler.rfAckStartMemoList
	 bool                      rfAckFriendListEnd (  );                          		//  GUIWarfare.BTTcpHandler.rfAckFriendListEnd
	 bool                      rfAckFriendList ( class TArray< struct FString > FriendName, class TArray< unsigned char > IsLogOn, class TArray< struct FString > ClanName, class TArray< int > CM_Pattern, class TArray< int > CM_BG, class TArray< int > CM_BL, class TArray< int > LevelMarkID, class TArray< int > ClanLevel, class TArray< int > Level, class TArray< unsigned char > IsLookForClan );		//  GUIWarfare.BTTcpHandler.rfAckFriendList
	 bool                      rfAckFriendListStart ( int Result, int TotalCount );		//  GUIWarfare.BTTcpHandler.rfAckFriendListStart
	 bool                      rfReqCompleteFriendInvite ( struct FString CharnameToBeInvited, unsigned char IsPermit );		//  GUIWarfare.BTTcpHandler.rfReqCompleteFriendInvite
	 bool                      rfAckConfirmFriendInvite ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckConfirmFriendInvite
	 bool                      rfReqRecvFriendInvite ( int ReqUserID, struct FString ReqCharname, struct FString InviteMsg );		//  GUIWarfare.BTTcpHandler.rfReqRecvFriendInvite
	 bool                      rfAckSendFriendInvite ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckSendFriendInvite
	 bool                      rfAckNotifyLoadingState ( int Result, int UserID, unsigned char LoadingState );		//  GUIWarfare.BTTcpHandler.rfAckNotifyLoadingState
	 bool                      rfAckFailedStartGame ( int Result, struct FString ErrMsg, unsigned char IsHost, int FailedUserID, int LoadingStep );		//  GUIWarfare.BTTcpHandler.rfAckFailedStartGame
	 bool                      rfAckSuccessStartGame ( int Result, struct FString ErrMsg, unsigned char IsHost, struct FString HostIP, int HostPort, int LoadingStep );		//  GUIWarfare.BTTcpHandler.rfAckSuccessStartGame
	 bool                      rfAckHash ( int Result, struct FString Error );   		//  GUIWarfare.BTTcpHandler.rfAckHash
	 bool                      rfReqForceLogoutByOwner (  );                     		//  GUIWarfare.BTTcpHandler.rfReqForceLogoutByOwner
	 bool                      ForceLogout_OnOK ( class UGUIComponent* Sender ); 		//  GUIWarfare.BTTcpHandler.ForceLogout_OnOK
	 bool                      rfAckSellShopItemInfo ( int Result, struct FString ErrMsg, struct FBtrDouble UniqueItemID, int SellPoint, int CurPoint, int AfterPoint );		//  GUIWarfare.BTTcpHandler.rfAckSellShopItemInfo
	 bool                      rfReqRecvChatWispher ( struct FString CharnameFrom, struct FString Message );		//  GUIWarfare.BTTcpHandler.rfReqRecvChatWispher
	 bool                      rfAckServerTime ( int Time );                     		//  GUIWarfare.BTTcpHandler.rfAckServerTime
	 bool                      rfAckGameOverEnd ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckGameOverEnd
	 bool                      rfAckRepairItem ( int Result, struct FString ErrMsg, class TArray< struct FBtrDouble > UniqueItemID, int RepairCost, class TArray< int > DamageDegree );		//  GUIWarfare.BTTcpHandler.rfAckRepairItem
	 bool                      rfAckRepairCost ( int Result, struct FString ErrMsg, class TArray< struct FBtrDouble > UniqueItemID, class TArray< int > RepairCost );		//  GUIWarfare.BTTcpHandler.rfAckRepairCost
	 bool                      eventrfAckUpdateWeaponDurability ( int Result, struct FString ErrMsg, class TArray< struct FBtrDouble > UniqueItemID, class TArray< int > Durability, class TArray< unsigned char > IsDestroy, class TArray< struct FBtrDouble > FailedWeaponUniqueID );		// [ FUNC_Event ] GUIWarfare.BTTcpHandler.rfAckUpdateWeaponDurability
	 bool                      rfAckEntryQSlotUniqueIDList ( int UserNum, class TArray< unsigned char > QSlotDispOrder, class TArray< struct FBtrDouble > MWUniqueID, class TArray< struct FBtrDouble > PistolUniqueID, class TArray< struct FBtrDouble > TW1UniqueID, class TArray< struct FBtrDouble > TW2UniqueID );		//  GUIWarfare.BTTcpHandler.rfAckEntryQSlotUniqueIDList
	 bool                      rfAckEntryQSlotIDList ( int UserNum, class TArray< unsigned char > QSlotDispOrder, class TArray< int > MWItemID, class TArray< int > MWPartID, class TArray< int > MWPaintID, class TArray< int > PistolItemID, class TArray< int > PistolPartID, class TArray< int > PistolPaintID, class TArray< int > TWItemID1, class TArray< int > TWItemID2, class TArray< int > Skill1ID, class TArray< int > Skill2ID, class TArray< int > Skill3ID, class TArray< int > Skill4ID );		//  GUIWarfare.BTTcpHandler.rfAckEntryQSlotIDList
	 bool                      rfAckUpdateQSlot ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckUpdateQSlot
	 bool                      rfAckQSlotList ( int Result, struct FString ErrMsg, class TArray< int > QSlotID, class TArray< struct FString > QSlotName, class TArray< unsigned char > QSlotDispOrder, class TArray< struct FBtrDouble > MWItemID, class TArray< struct FBtrDouble > PistolItemID, class TArray< struct FBtrDouble > TWItemID1, class TArray< struct FBtrDouble > TWItemID2, class TArray< int > Skill1, class TArray< int > Skill2, class TArray< int > Skill3, class TArray< int > Skill4 );		//  GUIWarfare.BTTcpHandler.rfAckQSlotList
	 bool                      rfAckModifyWeapon ( int Result, struct FString ErrMsg, struct FBtrDouble UniqueID, int AddPartID, int PaintID, int Point, int Cash );		//  GUIWarfare.BTTcpHandler.rfAckModifyWeapon
	 bool                      rfAckSellShopItem ( int Result, struct FString ErrMsg, int PointRemain, int CashRemain, int Count );		//  GUIWarfare.BTTcpHandler.rfAckSellShopItem
	 bool                      rfAckBuyShopItem ( int ItemCount, class TArray< int > Result, class TArray< int > BoughtItemTypeID, class TArray< struct FBtrDouble > BoughtItemUniqueID, class TArray< int > BoughtPartID, class TArray< struct FBtrDouble > BoughtUntilTIme, class TArray< int > BoughtStackCnt, int PointRemain, int CashRemain );		//  GUIWarfare.BTTcpHandler.rfAckBuyShopItem
	 bool                      rfAckShopItemListEnd (  );                        		//  GUIWarfare.BTTcpHandler.rfAckShopItemListEnd
	 bool                      rfAckShopItemList ( class TArray< int > ItemID ); 		//  GUIWarfare.BTTcpHandler.rfAckShopItemList
	 bool                      rfAckShopItemListStart ( int Count );             		//  GUIWarfare.BTTcpHandler.rfAckShopItemListStart
	 bool                      rfReqConfirmSkillChanged (  );                    		//  GUIWarfare.BTTcpHandler.rfReqConfirmSkillChanged
	 bool                      rfAckEquipSkill ( int ChangedNewSkillID, int ChangedNewSkillUniqueID, unsigned char ChangedNewSlotPosition, int ChangedOldSkillID, int ChangedOldSkillUniqueID, unsigned char ChangedOldSlotPosition, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckEquipSkill
	 bool                      rfAckEntrySkillList ( class TArray< int > UserIDs, class TArray< int > SkillIDs, class TArray< int > SlotPositions, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckEntrySkillList
	 bool                      rfAckUserSkillListEnd (  );                       		//  GUIWarfare.BTTcpHandler.rfAckUserSkillListEnd
	 bool                      rfAckUserSkillList ( class TArray< int > UniqueSkillID, class TArray< int > SkillID, class TArray< struct FBtrDouble > UntilTime, class TArray< unsigned char > SlotPosition );		//  GUIWarfare.BTTcpHandler.rfAckUserSkillList
	 bool                      rfAckUserSkillListStart ( int Count, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckUserSkillListStart
	 bool                      rfAckGetBootyChoose ( int Result, struct FString ErrMsg, unsigned char GiveType, struct FBtrDouble ItemUniqueNumber, int ItemID, int PartID, unsigned char ItemType, struct FBtrDouble UntilTime, int StackCount, int PaintID );		//  GUIWarfare.BTTcpHandler.rfAckGetBootyChoose
	 bool                      rfAckGetBooty ( int Result, struct FString ErrMsg, class TArray< int > PrizeWinUserID, class TArray< int > BootyItemID, class TArray< int > BootyPartsID );		//  GUIWarfare.BTTcpHandler.rfAckGetBooty
	 bool                      rfAckForceGameOver ( int UserID, int GameRoomNumber, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckForceGameOver
	 bool                      rfAckEntryItemList ( class TArray< int > UserIDs, class TArray< int > ItemIDs, class TArray< int > SlotPositions, class TArray< int > AddPartsID, class TArray< struct FBtrDouble > UniqueID, class TArray< int > PaintID, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckEntryItemList
	 bool                      rfAckRegisterOtherUdpInfo ( int UID, struct FString IP, int Port, unsigned char NatType, unsigned char Intervention, struct FString HostInnerIP, int HostInnerPort );		//  GUIWarfare.BTTcpHandler.rfAckRegisterOtherUdpInfo
	 bool                      rfReqForceNatTypeSetting ( int NatType );         		//  GUIWarfare.BTTcpHandler.rfReqForceNatTypeSetting
	 bool                      rfReqStartNatDiag ( struct FString Server1Addr, int Server1Port, struct FString Server2Addr, int Server2Port );		//  GUIWarfare.BTTcpHandler.rfReqStartNatDiag
	 bool                      rfAckChangeUserState ( int Result, struct FString ErrMsg, class TArray< int > UserIDs, class TArray< unsigned char > Positions, class TArray< int > Numbers, class TArray< unsigned char > OldStates, class TArray< unsigned char > NewStates );		//  GUIWarfare.BTTcpHandler.rfAckChangeUserState
	 bool                      rfReqExteriorRoomState ( int RoomNumber, unsigned char RoomState );		//  GUIWarfare.BTTcpHandler.rfReqExteriorRoomState
	 bool                      rfReqExteriorRoomUserCount ( int RoomNumber, int RoomUserCount );		//  GUIWarfare.BTTcpHandler.rfReqExteriorRoomUserCount
	 bool                      rfReqExteriorRoomInfo ( int SP, int RoomNumber, unsigned char IsPW, struct FString RoomName, struct FString MapName, struct FString ModeName, int MapNum, int ModeNum, unsigned char IsTeamBalance, int MaxUserCount, int RoomUserCount, unsigned char RoomState, unsigned char BotDifficult, unsigned char WeaponLimit, unsigned char BotModeUserTeamNum );		//  GUIWarfare.BTTcpHandler.rfReqExteriorRoomInfo
	 bool                      rfAckCharInfo ( int Result, struct FString ErrMsg, int UserID, struct FString CharName, struct FString ClanName, int CM_Pattern, int CM_BG, int CM_BL, struct FCharInfo stCharInfo, unsigned char InClanRank, int ClanLevel );		//  GUIWarfare.BTTcpHandler.rfAckCharInfo
	 bool                      rfAckConfirmItemChanged ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckConfirmItemChanged
	 bool                      rfAckEquipItem ( int ChangedNewItemID, struct FBtrDouble ChangedNewUniqueID, int ChangedNewSlotPosition, int ChangedOldItemID, struct FBtrDouble ChangedOldUniqueID, int ChangedOldSlotPosition, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckEquipItem
	 bool                      rfAckChangeRoomSetting ( int Result, struct FString ErrMsg, struct FGameRoomInfo RoomInfo );		//  GUIWarfare.BTTcpHandler.rfAckChangeRoomSetting
	 bool                      rfAckUpdateScore ( class TArray< int > UserIDs, class TArray< struct FString > NickNames, class TArray< unsigned char > TeamIDs, class TArray< int > Scores, class TArray< int > Kills, class TArray< int > Assists, class TArray< int > Deaths, class TArray< int > EXPs, class TArray< int > EXPBonuses, class TArray< int > Points, class TArray< int > PointBonuses, class TArray< int > TeamScores, class TArray< int > BonusOwnerID, class TArray< int > BonusID );		//  GUIWarfare.BTTcpHandler.rfAckUpdateScore
	 bool                      rfAckConnectGame ( int UserID, int Result );      		//  GUIWarfare.BTTcpHandler.rfAckConnectGame
	 bool                      rfAckChangeNewGuest ( struct FString HostIP );    		//  GUIWarfare.BTTcpHandler.rfAckChangeNewGuest
	 bool                      rfAckChangeHost ( unsigned char ClientNum );      		//  GUIWarfare.BTTcpHandler.rfAckChangeHost
	 bool                      rfAckChangeRoomOwner ( int GameNum, int OldOwner, int NewOwner, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckChangeRoomOwner
	 bool                      rfAckDisconnectGame ( int Result, int DisconnectUserID, struct FString DisconnectUserName );		//  GUIWarfare.BTTcpHandler.rfAckDisconnectGame
	 bool                      rfReqRelayServerOff (  );                         		//  GUIWarfare.BTTcpHandler.rfReqRelayServerOff
	 bool                      rfReqRelayServerOn ( struct FString RelayServerIP, int RelayServerPortNum );		//  GUIWarfare.BTTcpHandler.rfReqRelayServerOn
	 bool                      rfAckGameRoomInfo ( int Result, struct FString ErrMsg, struct FGameRoomInfo RoomInfo );		//  GUIWarfare.BTTcpHandler.rfAckGameRoomInfo
	 bool                      rfAckGameOver ( int UID, int GameRoomNumber, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckGameOver
	 bool                      rfAckChangeGameMode ( int GameNum, int UID, struct FString GameMode, unsigned char GameModeNum, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckChangeGameMode
	 bool                      rfAckSelectMap ( int GameNum, int UID, struct FString MapName, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckSelectMap
	 bool                      rfAckIsGameRoomPlaying ( int GameRoomNum, unsigned char IsPlaying );		//  GUIWarfare.BTTcpHandler.rfAckIsGameRoomPlaying
	 bool                      rfAckGameRoomDestroy ( int GameRoomNum );         		//  GUIWarfare.BTTcpHandler.rfAckGameRoomDestroy
	 bool                      rfAckStartGame ( int GameNumber, int ClientsCount, int StartSeed, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckStartGame
	 bool                      rfAckGameHostInfo ( int GameNumber, struct FString UserID, struct FString IP, int Port, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckGameHostInfo
	 bool                      rfAckChangeTeam ( int GameNumber, struct FString UserID, int UID, int TeamNum, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckChangeTeam
	 bool                      rfAckCreateGameRoom ( int Result, struct FString ErrMsg, int UserID, struct FString RoomOwnerIP, struct FGameRoomInfo NetRoomInfo );		//  GUIWarfare.BTTcpHandler.rfAckCreateGameRoom
	 bool                      rfAckLeaveRoom ( int Num, int UID, struct FString UserID, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckLeaveRoom
	 bool                      rfAckRoomUserList ( class TArray< int > UID, class TArray< struct FString > UserName, class TArray< int > Grade, class TArray< int > TeamNum, class TArray< unsigned char > Statue, class TArray< unsigned char > IsHost, class TArray< struct FString > UserIP, class TArray< struct FString > ClanName, class TArray< int > CM_Pattern, class TArray< int > CM_BG, class TArray< int > CM_BL, class TArray< unsigned char > IsLookingFor, class TArray< int > GMUID, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckRoomUserList
	 bool                      rfAckEnterRoom ( int GameNum, int OwnerID, int UID, struct FString UserID, int TeamNum, int Grade, struct FString UserIP, struct FString ClanName, int Clan_Mark_Pattern, int Clan_Mark_BG, int Clan_Mark_BL, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckEnterRoom
	 bool                      rfAckChatClan ( struct FString CharName, struct FString Message, int Result );		//  GUIWarfare.BTTcpHandler.rfAckChatClan
	 bool                      rfAckChatNormal ( int id, struct FString Sender, struct FString Message, int Result );		//  GUIWarfare.BTTcpHandler.rfAckChatNormal
	 bool                      rfAckRoomListEnd (  );                            		//  GUIWarfare.BTTcpHandler.rfAckRoomListEnd
	 bool                      rfAckRoomList ( class TArray< int > GameNum, class TArray< struct FString > Title, class TArray< struct FString > MapName, class TArray< int > MapNum, class TArray< unsigned char > UserCount, class TArray< unsigned char > MaxCount, class TArray< struct FString > ModeName, class TArray< int > ModeNum, class TArray< unsigned char > WeaponLimit, class TArray< unsigned char > IsTeamBalance, class TArray< unsigned char > Status, class TArray< struct FString > RoomOwnerIP, class TArray< int > GameMinute, class TArray< struct FString > RoomOwnerName, class TArray< unsigned char > IsSpecial, class TArray< unsigned char > IsPassword, class TArray< unsigned char > BotDifficult, class TArray< unsigned char > BotModeUserTeamNum );		//  GUIWarfare.BTTcpHandler.rfAckRoomList
	 bool                      rfAckRoomListStart ( int Result, int TotalCount, int Count, int StartIndex );		//  GUIWarfare.BTTcpHandler.rfAckRoomListStart
	 bool                      rfAckChannelUserList ( int TotalCount, int Count, int StartIndex, class TArray< int > UID, class TArray< struct FString > UserID, class TArray< int > UserLevels, class TArray< struct FString > ClanName, class TArray< int > ClanPattern, class TArray< int > ClanBG, class TArray< int > ClanBL, class TArray< int > ClanGrade, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< unsigned char > IsLookForClan, int Result, struct FString ErrMsg, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckChannelUserList
	 bool                      rfAckLogin2 ( int Result, struct FString ErrMsg, int UserID, struct FString CharName, struct FBtrDouble CurServerTime, int CharDBID, unsigned char IsGM );		//  GUIWarfare.BTTcpHandler.rfAckLogin2
	 bool                      rfAckLeaveChannel ( int Result, struct FString UserID, int UID );		//  GUIWarfare.BTTcpHandler.rfAckLeaveChannel
	 bool                      rfAckEnterChannel ( int id, int UID, struct FString UserID, int Level, struct FString ClanName, int ClanMarkPattern, int ClanMarkBG, int ClanMarkBL, int ClanGrade, int ClanWin, int ClanLose, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTTcpHandler.rfAckEnterChannel
	 bool                      rfAckChannelList ( class TArray< int > id, class TArray< struct FString > Title, class TArray< int > CurUser, class TArray< int > MaxUser );		//  GUIWarfare.BTTcpHandler.rfAckChannelList
	 bool                      rfAckAuctionInstantlyBuying ( int Result, struct FString ErrMsg, int PointRemain );		//  GUIWarfare.BTTcpHandler.rfAckAuctionInstantlyBuying
	 bool                      rfAckAuctionMyItemCancel ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckAuctionMyItemCancel
	 bool                      rfAckAuctionItemListEnd ( unsigned char Section );		//  GUIWarfare.BTTcpHandler.rfAckAuctionItemListEnd
	 bool                      rfAckAuctionItemList ( unsigned char Section, class TArray< int > UniqueIDs, class TArray< int > ItemIDs, class TArray< int > AddPartsIDs, class TArray< struct FBtrDouble > UntilTimes, class TArray< int > BiddingPrices, class TArray< int > InstantlyByuingPrices, class TArray< int > ItemDamageds, class TArray< struct FString > HighestBidderNames, class TArray< struct FString > SellerNames, class TArray< int > ItemCount );		//  GUIWarfare.BTTcpHandler.rfAckAuctionItemList
	 bool                      rfAckAuctionItemListStart ( int Result, struct FString ErrMsg, unsigned char Section, int PageNum, int Count );		//  GUIWarfare.BTTcpHandler.rfAckAuctionItemListStart
	 bool                      rfAckAuctionItemListCount ( int Result, struct FString ErrMsg, unsigned char Section, unsigned char Classfy, int ItemType, int ItemGrade, int Count );		//  GUIWarfare.BTTcpHandler.rfAckAuctionItemListCount
	 bool                      rfAckAuctionMyItemRegister ( int Result, struct FString ErrMsg, int BeginPrice, int BuyPrice, int GuarantyPoint, int PointRemain );		//  GUIWarfare.BTTcpHandler.rfAckAuctionMyItemRegister
	 bool                      rfAckItemListEnd (  );                            		//  GUIWarfare.BTTcpHandler.rfAckItemListEnd
	 bool                      rfAckItemList ( class TArray< struct FBtrDouble > UniqueID, class TArray< int > ItemID, class TArray< int > ItemType, class TArray< int > Durability, class TArray< struct FBtrDouble > UntilTime, class TArray< int > SlotPosition, class TArray< int > AddPartsID, class TArray< int > DamageDegree, class TArray< unsigned char > ItemState, class TArray< int > StackCount, class TArray< int > PaintID, class TArray< int > TradeCount );		//  GUIWarfare.BTTcpHandler.rfAckItemList
	 bool                      rfAckItemListStart ( int Count, int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.rfAckItemListStart
	 bool                      rfAckLogin ( int Result, struct FString ErrMsg, int UserID, struct FString CharName, struct FString ClanName, struct FCharInfo btCharInfo );		//  GUIWarfare.BTTcpHandler.rfAckLogin
	 bool                      sfAckClanMatch_RecvInviteCrew ( int Result, struct FString Inviter );		//  GUIWarfare.BTTcpHandler.sfAckClanMatch_RecvInviteCrew
	 bool                      sfAckRecvInviteGameRoom ( struct FString RoomUniqueID, int RoomNumber, unsigned char Answer, struct FString InviteCharName );		//  GUIWarfare.BTTcpHandler.sfAckRecvInviteGameRoom
	 bool                      sfAckRecvJoinClan ( int UserIdx, struct FString CharName, struct FString ReqMsg, unsigned char Permit );		//  GUIWarfare.BTTcpHandler.sfAckRecvJoinClan
	 bool                      sfAckRecvClanInvite ( int InviterUserDBID, struct FString InviterCharname, struct FString InviterMsg, struct FString ClanName, unsigned char Permit );		//  GUIWarfare.BTTcpHandler.sfAckRecvClanInvite
	 bool                      sfAckStartNatDiag ( int NatType );                		//  GUIWarfare.BTTcpHandler.sfAckStartNatDiag
	 bool                      sfReqMyEquipedQSlotList (  );                     		//  GUIWarfare.BTTcpHandler.sfReqMyEquipedQSlotList
	 bool                      sfReqMyEquipedSkillList (  );                     		//  GUIWarfare.BTTcpHandler.sfReqMyEquipedSkillList
	 bool                      sfReqMyEquipedItemList (  );                      		//  GUIWarfare.BTTcpHandler.sfReqMyEquipedItemList
	 bool                      sfReqGetMyMailBoxState (  );                      		//  GUIWarfare.BTTcpHandler.sfReqGetMyMailBoxState
	 bool                      sfReqSetLookForClan ( unsigned char IsLookingFor );		//  GUIWarfare.BTTcpHandler.sfReqSetLookForClan
	 bool                      sfReqExteriorRoomOwnerInfo ( int RoomNum, struct FString OwnerName, struct FString OwnerIP );		//  GUIWarfare.BTTcpHandler.sfReqExteriorRoomOwnerInfo
	 bool                      sfReqClanMatch_SetWaitRoomPublic ( unsigned char Set );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_SetWaitRoomPublic
	 bool                      sfReqRemoveCheckTeamBalanceList (  );             		//  GUIWarfare.BTTcpHandler.sfReqRemoveCheckTeamBalanceList
	 bool                      sfReqPaidItem_ChangeClanMark ( struct FBtrDouble ItemIdx, unsigned char IsPaid, int Pattern, int BG, int BL );		//  GUIWarfare.BTTcpHandler.sfReqPaidItem_ChangeClanMark
	 bool                      sfReqPaidItem_ClanMarkDupCheck ( unsigned char IsPaid, int Pattern, int BG, int BL );		//  GUIWarfare.BTTcpHandler.sfReqPaidItem_ClanMarkDupCheck
	 bool                      sfReqPaidItem_BroadCast ( struct FBtrDouble ItemIdx, int Command, struct FString Message );		//  GUIWarfare.BTTcpHandler.sfReqPaidItem_BroadCast
	 bool                      sfReqPaidItem_EraseRecord ( struct FBtrDouble ItemIdx, int Command );		//  GUIWarfare.BTTcpHandler.sfReqPaidItem_EraseRecord
	 bool                      sfReqSendSystemMsg ( unsigned char RecvType, struct FString SendCharName, struct FString RecvCharname, struct FSystemMsgParam MsgInfo );		//  GUIWarfare.BTTcpHandler.sfReqSendSystemMsg
	 bool                      sfReqRandomBox_Use ( struct FBtrDouble ItemIdx ); 		//  GUIWarfare.BTTcpHandler.sfReqRandomBox_Use
	 bool                      sfReqChangeRoomTitle_GM ( int RoomNumber, struct FString NewRoomTitle );		//  GUIWarfare.BTTcpHandler.sfReqChangeRoomTitle_GM
	 bool                      sfReqQuestGetAvailableEventList (  );             		//  GUIWarfare.BTTcpHandler.sfReqQuestGetAvailableEventList
	 bool                      sfReqCharBlockInfo (  );                          		//  GUIWarfare.BTTcpHandler.sfReqCharBlockInfo
	 bool                      sfReqIsPaidWebzenPCBang ( unsigned char IsPaid ); 		//  GUIWarfare.BTTcpHandler.sfReqIsPaidWebzenPCBang
	 bool                      sfReqClanMatch_GetClanWaittingRoomInfo (  );      		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_GetClanWaittingRoomInfo
	 bool                      sfReqReturnBotID ( class TArray< int > BotID );   		//  GUIWarfare.BTTcpHandler.sfReqReturnBotID
	 bool                      sfReqGetBotID ( unsigned char AFCount, unsigned char RSACount );		//  GUIWarfare.BTTcpHandler.sfReqGetBotID
	 bool                      sfReqClanMatch_ChangeRoomSetting ( int WaitRoomIndex, class TArray< int > MapNumArray, int VersusMode, unsigned char IsPublic );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_ChangeRoomSetting
	 bool                      sfReqParamCheckSum ( struct FString key, struct FString Value );		//  GUIWarfare.BTTcpHandler.sfReqParamCheckSum
	 bool                      sfReqWebzenBillingUseStorageItem ( int StorageSeq, int StorageItemSeq, unsigned char StorageItemType );		//  GUIWarfare.BTTcpHandler.sfReqWebzenBillingUseStorageItem
	 bool                      sfReqWebzenBillingStorageList ( int Page, int CountForPage, unsigned char Type );		//  GUIWarfare.BTTcpHandler.sfReqWebzenBillingStorageList
	 bool                      sfReqGiftItemByWebzenCash ( struct FString ReceiverCharName, struct FString Message, int PackageProductSeq, int PriceSeq, int ProductDisplaySeq );		//  GUIWarfare.BTTcpHandler.sfReqGiftItemByWebzenCash
	 bool                      sfReqBuyItemByWebzenCash ( int PackageProductSeq, int ProductDisplaySeq, int PriceSeq, class TArray< int > ItemIDs, struct FBtrDouble ItemUniqueID, unsigned char BuyOption1, unsigned char BuyOption2 );		//  GUIWarfare.BTTcpHandler.sfReqBuyItemByWebzenCash
	 bool                      sfReqWebzenShopScriptVersion (  );                		//  GUIWarfare.BTTcpHandler.sfReqWebzenShopScriptVersion
	 bool                      sfReqWebzenCash (  );                             		//  GUIWarfare.BTTcpHandler.sfReqWebzenCash
	 bool                      sfReqRegisteredPCBangInfo (  );                   		//  GUIWarfare.BTTcpHandler.sfReqRegisteredPCBangInfo
	 bool                      sfReqRegisterMainPCBang (  );                     		//  GUIWarfare.BTTcpHandler.sfReqRegisterMainPCBang
	 bool                      sfReqPCBangUserList (  );                         		//  GUIWarfare.BTTcpHandler.sfReqPCBangUserList
	 bool                      sfReqDailyQuestNewAvailable ( class TArray< int > ExpiredQuestID, class TArray< int > NewQuestID );		//  GUIWarfare.BTTcpHandler.sfReqDailyQuestNewAvailable
	 bool                      sfReqQuestNewAvailable ( class TArray< int > AchivedQuestID, class TArray< int > NewQuestID, class TArray< unsigned char > IsDailyQuest, class TArray< int > ExpiredQuest );		//  GUIWarfare.BTTcpHandler.sfReqQuestNewAvailable
	 bool                      sfReqQuestUpdate ( int UniqueID, int GameRoomNum, class TArray< int > QuestID, class TArray< int > CountPrograss );		//  GUIWarfare.BTTcpHandler.sfReqQuestUpdate
	 bool                      sfReqQuestList (  );                              		//  GUIWarfare.BTTcpHandler.sfReqQuestList
	 bool                      sfReqPermanentRoomInfo ( int RoomNum );           		//  GUIWarfare.BTTcpHandler.sfReqPermanentRoomInfo
	 bool                      sfReqClanMatch_FoundMatch ( int ChannelID, int RoomNumber );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_FoundMatch
	 bool                      sfReqClanMatch_StartSearching ( int RequestCount );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_StartSearching
	 bool                      sfReqLimitedListInChannel (  );                   		//  GUIWarfare.BTTcpHandler.sfReqLimitedListInChannel
	 bool                      sfReqRecvInviteGameRoom ( struct FString InviteUserServerName, int InviteUserServerID, int InviteUserChannelNumber, struct FString RoomUniqueID, int RoomNumber, struct FString RoomName, unsigned char RoomState, struct FString MapName, struct FString OwnerName, unsigned char GameMode, unsigned char WeaponLimit, unsigned char IsTeamBalance, struct FString Password, struct FString InviteCharName );		//  GUIWarfare.BTTcpHandler.sfReqRecvInviteGameRoom
	 bool                      sfReqInviteGameRoom ( struct FString GuestCharName );		//  GUIWarfare.BTTcpHandler.sfReqInviteGameRoom
	 bool                      sfReqClanMatch_StopSearching (  );                		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_StopSearching
	 bool                      sfReqClanMatch_ChangeLeader ( int WaitRoomIdx, int NewLeaderID, struct FString NewLeaderName );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_ChangeLeader
	 bool                      sfReqClanMatch_WaittingTeamList ( int StartIndex, int ReturnCount );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_WaittingTeamList
	 bool                      sfReqClanMatch_Chat ( struct FString Msg );       		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_Chat
	 bool                      sfReqClanMatch_Leave ( int WaittingID );          		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_Leave
	 bool                      sfReqClanMatch_MemberList (  );                   		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_MemberList
	 bool                      sfReqClanMatch_Join ( int WaittingID );           		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_Join
	 bool                      sfReqClanMatch_InviteCrewResult ( struct FString Invitee, int Result );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_InviteCrewResult
	 bool                      sfReqClanMatch_RecvInviteCrew ( struct FString Inviter, struct FString ServerIP, int Port, int WaittingID, struct FString Msg, int MapNum, int InviteUserChannelNum, struct FString LeaderName, struct FString RoomName );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_RecvInviteCrew
	 bool                      sfReqClanMatch_InviteCrew ( struct FString Invitee );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_InviteCrew
	 bool                      sfReqClanMatch_StartCombat ( class TArray< int > MapNumArray, int VersusMode );		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_StartCombat
	 bool                      sfReqClanMatch_GetReady (  );                     		//  GUIWarfare.BTTcpHandler.sfReqClanMatch_GetReady
	 bool                      sfReqGetItemFromItemBox ( struct FBtrDouble ItemUniqueID, int ItemID, int ItemIDChoose, int PartIDChoose );		//  GUIWarfare.BTTcpHandler.sfReqGetItemFromItemBox
	 bool                      sfReqItemListInItemBox ( struct FBtrDouble ItemUniqueID, int BoxItemID );		//  GUIWarfare.BTTcpHandler.sfReqItemListInItemBox
	 bool                      sfReqRecvForceFailedClientLoading ( int ErrCode );		//  GUIWarfare.BTTcpHandler.sfReqRecvForceFailedClientLoading
	 bool                      sfReqForceFailedClientLoading ( int FailedUserID, int ErrCode );		//  GUIWarfare.BTTcpHandler.sfReqForceFailedClientLoading
	 bool                      sfReqStartHolePunching ( int GameType, int ReqStartUserID );		//  GUIWarfare.BTTcpHandler.sfReqStartHolePunching
	 bool                      sfReqNotifyMyCharInfoToRoomUser (  );             		//  GUIWarfare.BTTcpHandler.sfReqNotifyMyCharInfoToRoomUser
	 bool                      sfReqNotifyDurabilityZeroItem ( int Result, struct FString ErrMsg, int UserID, class TArray< struct FBtrDouble > ItemUniqueIDs, class TArray< int > ItemIDs, class TArray< int > ItemPartIDs, class TArray< unsigned char > ItemSlotPos );		//  GUIWarfare.BTTcpHandler.sfReqNotifyDurabilityZeroItem
	 bool                      sfReqChatWispherMyCommunity ( struct FString SourceCharName, struct FString SenderName, struct FString Msg );		//  GUIWarfare.BTTcpHandler.sfReqChatWispherMyCommunity
	 bool                      sfReqNotifyDisconnectHostInLoading ( int Result, struct FString ErrMsg, int HostID );		//  GUIWarfare.BTTcpHandler.sfReqNotifyDisconnectHostInLoading
	 bool                      sfReqRecvForceDisconnected_FromGM ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTTcpHandler.sfReqRecvForceDisconnected_FromGM
	 bool                      sfReqForceDisconnectUser_GM ( struct FString CharName );		//  GUIWarfare.BTTcpHandler.sfReqForceDisconnectUser_GM
	 bool                      sfReqRecvNotice_FromGM ( int Result, struct FString ErrMsg, class TArray< struct FString > NoticeMsg, unsigned char IsFromDB );		//  GUIWarfare.BTTcpHandler.sfReqRecvNotice_FromGM
	 bool                      sfReqNotice_GM ( unsigned char NoticeType, int ServerID, int ChannelNum, int GameRoomNum, struct FString Msg );		//  GUIWarfare.BTTcpHandler.sfReqNotice_GM
	 bool                      sfReqSpecificChannelUserInfo ( int UserID );      		//  GUIWarfare.BTTcpHandler.sfReqSpecificChannelUserInfo
	 bool                      sfReqSpecificGameRoomInfo ( int RoomNum );        		//  GUIWarfare.BTTcpHandler.sfReqSpecificGameRoomInfo
	 bool                      sfReqChannelUserListInGameRoom ( int ChannelNum, int StartIndex, int Count );		//  GUIWarfare.BTTcpHandler.sfReqChannelUserListInGameRoom
	 bool                      sfReqRecvDeleteFriend ( int Result, struct FString FromCharName );		//  GUIWarfare.BTTcpHandler.sfReqRecvDeleteFriend
	 bool                      sfReqDeleteFriend ( class TArray< struct FString > DeleteCharName );		//  GUIWarfare.BTTcpHandler.sfReqDeleteFriend
	 bool                      sfReqGameGuardAuthData ( int AuthDataIndex, int AuthDataVal1, int AuthDataVal2, int AuthDataVal3 );		//  GUIWarfare.BTTcpHandler.sfReqGameGuardAuthData
	 bool                      sfReqCheckEquipedWeaponDurability (  );           		//  GUIWarfare.BTTcpHandler.sfReqCheckEquipedWeaponDurability
	 bool                      sfReqGamePlay_GetChopper ( int GetChopperUID, class TArray< int > GetChopperAssistUID, float KillXCoord, float KillYCoord, float KillZCoord, int KillPos, int KillWeaponID, int KillWeaponPartID, int KillRange, int KillDamage, int ChopperCallerID, struct FString ChopperCallerName, float ChopperXCoord, float ChopperYCoord, float ChopperZCoord );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_GetChopper
	 bool                      sfReqIsAvailClanURL ( struct FString ClanURL );   		//  GUIWarfare.BTTcpHandler.sfReqIsAvailClanURL
	 bool                      sfReqGetIsHostBlocking (  );                      		//  GUIWarfare.BTTcpHandler.sfReqGetIsHostBlocking
	 bool                      sfReqNotifyHostBlocking ( unsigned char Blocking );		//  GUIWarfare.BTTcpHandler.sfReqNotifyHostBlocking
	 bool                      sfReqGetHolePunchingResult (  );                  		//  GUIWarfare.BTTcpHandler.sfReqGetHolePunchingResult
	 bool                      sfReqNotifyRecvDummyForHolePunching ( int ClientUserID, unsigned char Phrase );		//  GUIWarfare.BTTcpHandler.sfReqNotifyRecvDummyForHolePunching
	 bool                      sfReqGamePlay_ChangeWeaponSet ( int UID, int SetNumber );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_ChangeWeaponSet
	 bool                      sfReqGamePlay_UpdateDomScore ( int AFScore, int RSAScore );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_UpdateDomScore
	 bool                      sfReqNotifyRelayServerAddr ( struct FString RelayIP, int RelayPort );		//  GUIWarfare.BTTcpHandler.sfReqNotifyRelayServerAddr
	 bool                      sfReqGetUserHostPriorityPoint ( int UserID );     		//  GUIWarfare.BTTcpHandler.sfReqGetUserHostPriorityPoint
	 bool                      sfReqUpdateMyHostPriorityPoint ( int HostPriorityPoint );		//  GUIWarfare.BTTcpHandler.sfReqUpdateMyHostPriorityPoint
	 bool                      sfReqWriteServerLog ( unsigned char Destination, struct FString LogMsg );		//  GUIWarfare.BTTcpHandler.sfReqWriteServerLog
	 bool                      sfReqGamePlay_SetRoundStartTime ( class TArray< int > UID );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_SetRoundStartTime
	 bool                      sfReqGamePlay_SetGameStartTime ( class TArray< int > UID );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_SetGameStartTime
	 bool                      sfReqRecvForceDisconnectUDPFromHost ( int Result );		//  GUIWarfare.BTTcpHandler.sfReqRecvForceDisconnectUDPFromHost
	 bool                      sfReqForceDisconnectUDPFromHost ( int UserID );   		//  GUIWarfare.BTTcpHandler.sfReqForceDisconnectUDPFromHost
	 bool                      sfReqGamePlay_TakeAPoint ( class TArray< int > TakerUID, unsigned char TakePos, class TArray< float > TakerXCoord, class TArray< float > TakerYCoord, class TArray< float > TakerZCoord, class TArray< int > TakerPos, class TArray< int > TakerWeaponID, class TArray< int > TakerWeaponPartID, class TArray< int > TakerRange );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_TakeAPoint
	 bool                      sfReqNotifyChangeRoomState ( unsigned char RoomState );		//  GUIWarfare.BTTcpHandler.sfReqNotifyChangeRoomState
	 bool                      sfReqGamePlay_DefuseBomb ( int DefuserUID, unsigned char DefusePos, float DefuserXCoord, float DefuserYCoord, float DefuserZCoord, int DefuserPos, int DefuserWeaponID, int DefuserWeaponPartID, int DefuserRange );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_DefuseBomb
	 bool                      sfReqGamePlay_InstallBomb ( int InstallerUID, unsigned char InstallPos, float InstallerXCoord, float InstallerYCoord, float InstallerZCoord, int InstallerPos, int InstallerWeaponID, int InstallerWeaponPartID, int InstallerRange );		//  GUIWarfare.BTTcpHandler.sfReqGamePlay_InstallBomb
	 bool                      sfReqDBCharInfo ( struct FString CharName );      		//  GUIWarfare.BTTcpHandler.sfReqDBCharInfo
	 bool                      sfReqForceNatTypeSetting ( int NatType );         		//  GUIWarfare.BTTcpHandler.sfReqForceNatTypeSetting
	 bool                      sfReqGetServerTime (  );                          		//  GUIWarfare.BTTcpHandler.sfReqGetServerTime
	 bool                      sfReqLogEndEachRound ( int StartCnt, int EndCnt, int RoundEndType, int RoundEndTime, unsigned char VTeam, unsigned char VTeamAD, int AFScore, int RSAScore, int Round );		//  GUIWarfare.BTTcpHandler.sfReqLogEndEachRound
	 bool                      sfReqLogGetScore ( struct FKillDeathLog KillDeathLogParam, class TArray< int > AssistUIDs, class TArray< unsigned char > AssistScores );		//  GUIWarfare.BTTcpHandler.sfReqLogGetScore
	 bool                      sfReqAuctionTradeHistory ( int ItemID, int PartID );		//  GUIWarfare.BTTcpHandler.sfReqAuctionTradeHistory
	 bool                      sfReqSendGift ( int ItemID, struct FString RecvCharname, struct FString RecvMessage, unsigned char BuyOption1, unsigned char BuyOption2 );		//  GUIWarfare.BTTcpHandler.sfReqSendGift
	 bool                      sfReqGetAttachedItemFromMemo ( int UserID, int MemoIdx, int ItemID );		//  GUIWarfare.BTTcpHandler.sfReqGetAttachedItemFromMemo
	 bool                      sfReqChatClan ( struct FString Message );         		//  GUIWarfare.BTTcpHandler.sfReqChatClan
	 bool                      sfReqTestDouble ( struct FBtrDouble vDouble, class TArray< struct FBtrDouble > vDoubles );		//  GUIWarfare.BTTcpHandler.sfReqTestDouble
	 bool                      sfReqNotifyLoadingState ( unsigned char LoadingState );		//  GUIWarfare.BTTcpHandler.sfReqNotifyLoadingState
	 bool                      sfReqFailedStartGame ( int LoadingStep );         		//  GUIWarfare.BTTcpHandler.sfReqFailedStartGame
	 bool                      sfReqSuccessStartGame ( int LoadingStep );        		//  GUIWarfare.BTTcpHandler.sfReqSuccessStartGame
	 bool                      sfReqClanCharPersonelIntro ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTTcpHandler.sfReqClanCharPersonelIntro
	 bool                      sfReqClanPersonelIntro ( struct FString ClanName, struct FString CharName, struct FString PersonelIntro );		//  GUIWarfare.BTTcpHandler.sfReqClanPersonelIntro
	 bool                      sfReqClanChangeInfo ( struct FString ClanName, unsigned char IsRecruit, unsigned char Region, struct FString Keyword, struct FString ClanIntro, struct FString Notice );		//  GUIWarfare.BTTcpHandler.sfReqClanChangeInfo
	 bool                      sfReqClanClose ( struct FString ClanName );       		//  GUIWarfare.BTTcpHandler.sfReqClanClose
	 bool                      sfReqClanSecession ( struct FString ClanName );   		//  GUIWarfare.BTTcpHandler.sfReqClanSecession
	 bool                      sfReqClanNews ( struct FString ClanName );        		//  GUIWarfare.BTTcpHandler.sfReqClanNews
	 bool                      sfReqAdjustClanMemberGrade ( struct FString ClanName, struct FString CharName, unsigned char CharGrade );		//  GUIWarfare.BTTcpHandler.sfReqAdjustClanMemberGrade
	 bool                      sfReqClanUserList ( struct FString ClanName );    		//  GUIWarfare.BTTcpHandler.sfReqClanUserList
	 bool                      sfReqSerachClan ( unsigned char SearchType, struct FString Keyword, unsigned char ClanStatus, unsigned char ClanRegion, int ReqPage );		//  GUIWarfare.BTTcpHandler.sfReqSerachClan
	 bool                      sfReqRecvJoinClan ( int UserIdx, struct FString CharName, struct FString Message );		//  GUIWarfare.BTTcpHandler.sfReqRecvJoinClan
	 bool                      sfReqJoinClan ( struct FString ClanName, struct FString ClanManagerName, struct FString Message );		//  GUIWarfare.BTTcpHandler.sfReqJoinClan
	 bool                      sfReqRecvClanInvite ( int InviterUserDBID, struct FString InviterCharname, struct FString ClanName, struct FString InviteMsg );		//  GUIWarfare.BTTcpHandler.sfReqRecvClanInvite
	 bool                      sfReqInviteClan ( struct FString CharName, struct FString InviteMsg );		//  GUIWarfare.BTTcpHandler.sfReqInviteClan
	 bool                      sfReqClanInfo ( struct FString ClanName );        		//  GUIWarfare.BTTcpHandler.sfReqClanInfo
	 bool                      sfReqCreateClan ( struct FString ClanName, struct FString ClanURL, struct FString ClanIntro, struct FString ClanKeyword, unsigned char ClanRegion );		//  GUIWarfare.BTTcpHandler.sfReqCreateClan
	 bool                      sfReqDupCheckClanName ( struct FString ClanNam ); 		//  GUIWarfare.BTTcpHandler.sfReqDupCheckClanName
	 bool                      sfReqSellShopItemInfo ( struct FBtrDouble UniqueItemID, int Count );		//  GUIWarfare.BTTcpHandler.sfReqSellShopItemInfo
	 bool                      sfReqGameOverEnd (  );                            		//  GUIWarfare.BTTcpHandler.sfReqGameOverEnd
	 bool                      sfReqAuctionItemListCount ( unsigned char Section, unsigned char Classfy, int ItemType, int ItemGrade );		//  GUIWarfare.BTTcpHandler.sfReqAuctionItemListCount
	 bool                      sfReqServerTime (  );                             		//  GUIWarfare.BTTcpHandler.sfReqServerTime
	 bool                      sfReqEntryQSlotIDList ( int UserNum );            		//  GUIWarfare.BTTcpHandler.sfReqEntryQSlotIDList
	 bool                      sfReqEntryQSlotUniqueIDList ( int UserNum );      		//  GUIWarfare.BTTcpHandler.sfReqEntryQSlotUniqueIDList
	 bool                      sfReqAuctionBidding ( int UniqueID, int BiddingPrice );		//  GUIWarfare.BTTcpHandler.sfReqAuctionBidding
	 bool                      sfReqAuctionInstantlyBuying ( int UniqueID );     		//  GUIWarfare.BTTcpHandler.sfReqAuctionInstantlyBuying
	 bool                      sfReqAuctionItemList ( unsigned char Section, struct FString Keyword, int ItemRank, unsigned char ItemClassfy, unsigned char IsAvailable, int PageNum, int Count, int SortOpt );		//  GUIWarfare.BTTcpHandler.sfReqAuctionItemList
	 bool                      sfReqAuctionMyItemCancel ( int UniqueID );        		//  GUIWarfare.BTTcpHandler.sfReqAuctionMyItemCancel
	 bool                      sfReqAuctionMyItemRegister ( struct FBtrDouble UniqueID, int ItemCount, int BeginPrice, int PeriodHour, int InstantlyBuyingPrice );		//  GUIWarfare.BTTcpHandler.sfReqAuctionMyItemRegister
	 bool                      sfReqMyMoney (  );                                		//  GUIWarfare.BTTcpHandler.sfReqMyMoney
	 bool                      sfReqUpdateQSlot ( int QSlotID, struct FString QSlotName, struct FBtrDouble MWItemID, struct FBtrDouble PistolItemID, struct FBtrDouble TWItemID1, struct FBtrDouble TWItemID2, int Skill1, int Skill2, int Skill3, int Skill4 );		//  GUIWarfare.BTTcpHandler.sfReqUpdateQSlot
	 bool                      sfReqQSlotList (  );                              		//  GUIWarfare.BTTcpHandler.sfReqQSlotList
	 bool                      sfReqRepairItem ( class TArray< struct FBtrDouble > UniqueItemcID );		//  GUIWarfare.BTTcpHandler.sfReqRepairItem
	 bool                      sfReqRepairCost ( class TArray< struct FBtrDouble > UniqueItemID );		//  GUIWarfare.BTTcpHandler.sfReqRepairCost
	 bool                      sfReqUpdateWeaponDurability ( int TotalPlayTime, class TArray< int > OwnerID, class TArray< int > Number, class TArray< struct FBtrDouble > UniqueItemID, class TArray< int > UsingSec, class TArray< int > UsingRoundInSD );		//  GUIWarfare.BTTcpHandler.sfReqUpdateWeaponDurability
	 bool                      sfReqModifyWeapon ( struct FBtrDouble UniqueID, int AddPartID, int PaintID );		//  GUIWarfare.BTTcpHandler.sfReqModifyWeapon
	 bool                      sfReqSellShopItem ( struct FBtrDouble ItemUniqueID, int Count );		//  GUIWarfare.BTTcpHandler.sfReqSellShopItem
	 bool                      sfReqBuyShopItem ( int ItemID, struct FBtrDouble ItemUniqueID, unsigned char BuyOption1, unsigned char BuyOption2 );		//  GUIWarfare.BTTcpHandler.sfReqBuyShopItem
	 bool                      sfReqShopItemList (  );                           		//  GUIWarfare.BTTcpHandler.sfReqShopItemList
	 bool                      sfReqForceGameOver (  );                          		//  GUIWarfare.BTTcpHandler.sfReqForceGameOver
	 bool                      sfReqGiveSkill (  );                              		//  GUIWarfare.BTTcpHandler.sfReqGiveSkill
	 bool                      sfReqNotifyExpiredItemIDs (  );                   		//  GUIWarfare.BTTcpHandler.sfReqNotifyExpiredItemIDs
	 bool                      sfReqNotifyExpiredSkillIDs (  );                  		//  GUIWarfare.BTTcpHandler.sfReqNotifyExpiredSkillIDs
	 bool                      sfReqNotifyChangedSkillState (  );                		//  GUIWarfare.BTTcpHandler.sfReqNotifyChangedSkillState
	 bool                      sfReqNotifyChangedItemState (  );                 		//  GUIWarfare.BTTcpHandler.sfReqNotifyChangedItemState
	 bool                      sfReqConfirmSkillChanged (  );                    		//  GUIWarfare.BTTcpHandler.sfReqConfirmSkillChanged
	 bool                      sfReqEquipSkill ( int SkillID, int SkillUniqueID, unsigned char NewSlotPosition );		//  GUIWarfare.BTTcpHandler.sfReqEquipSkill
	 bool                      sfReqUserSkillList ( int UserID );                		//  GUIWarfare.BTTcpHandler.sfReqUserSkillList
	 bool                      sfReqDelMemo ( class TArray< int > MemoIdx, unsigned char Type );		//  GUIWarfare.BTTcpHandler.sfReqDelMemo
	 bool                      sfReqReadMemo ( int MemoIdx );                    		//  GUIWarfare.BTTcpHandler.sfReqReadMemo
	 bool                      sfReqMemoList ( unsigned char Type, unsigned char MemoType );		//  GUIWarfare.BTTcpHandler.sfReqMemoList
	 bool                      sfReqRecvMemo ( struct FString cnameFrom, unsigned char MemoType );		//  GUIWarfare.BTTcpHandler.sfReqRecvMemo
	 bool                      sfReqSendMemo ( class TArray< struct FString > cnames, struct FString Msg, int ItemUID );		//  GUIWarfare.BTTcpHandler.sfReqSendMemo
	 bool                      sfReqRecvChatWispher ( struct FString CharnameFrom, struct FString Message );		//  GUIWarfare.BTTcpHandler.sfReqRecvChatWispher
	 bool                      sfReqChatWispher ( struct FString CharName, struct FString Message );		//  GUIWarfare.BTTcpHandler.sfReqChatWispher
	 bool                      sfReqRemoveBlockUserList ( struct FString CharName );		//  GUIWarfare.BTTcpHandler.sfReqRemoveBlockUserList
	 bool                      sfReqAddBlockUserList ( struct FString CharName );		//  GUIWarfare.BTTcpHandler.sfReqAddBlockUserList
	 bool                      sfReqBlockUserList (  );                          		//  GUIWarfare.BTTcpHandler.sfReqBlockUserList
	 bool                      sfReqCompleteFriendInvite ( struct FString CharnameToBeInvited, unsigned char IsPermit );		//  GUIWarfare.BTTcpHandler.sfReqCompleteFriendInvite
	 bool                      sfReqConfirmFriendInvite ( int ReqUserID, struct FString ReqedCharname, unsigned char IsPermit );		//  GUIWarfare.BTTcpHandler.sfReqConfirmFriendInvite
	 bool                      sfReqRecvFriendInvite ( int ReqUserID, struct FString ReqCharname, struct FString InviteMsg );		//  GUIWarfare.BTTcpHandler.sfReqRecvFriendInvite
	 bool                      sfReqSendFriendInvite ( int InviteUserID, struct FString InviteName, struct FString InviteMsg );		//  GUIWarfare.BTTcpHandler.sfReqSendFriendInvite
	 bool                      sfReqChatNormal ( struct FString Message );       		//  GUIWarfare.BTTcpHandler.sfReqChatNormal
	 bool                      sfReqDummy ( int DelayCheck );                    		//  GUIWarfare.BTTcpHandler.sfReqDummy
	 bool                      sfReqConfirmItemChanged (  );                     		//  GUIWarfare.BTTcpHandler.sfReqConfirmItemChanged
	 bool                      sfReqEquipItem ( int ItemID, struct FBtrDouble UniqueID, int SlotPosition );		//  GUIWarfare.BTTcpHandler.sfReqEquipItem
	 bool                      sfReqItemList ( int UID );                        		//  GUIWarfare.BTTcpHandler.sfReqItemList
	 bool                      sfReqEntrySkillList ( int UserID );               		//  GUIWarfare.BTTcpHandler.sfReqEntrySkillList
	 bool                      sfReqEntryItemList ( int UserID );                		//  GUIWarfare.BTTcpHandler.sfReqEntryItemList
	 bool                      sfReqChangeUserState ( unsigned char NewState, unsigned char CheckPlaying );		//  GUIWarfare.BTTcpHandler.sfReqChangeUserState
	 bool                      sfReqExteriorRoomState ( int RoomNumber, unsigned char RoomState );		//  GUIWarfare.BTTcpHandler.sfReqExteriorRoomState
	 bool                      sfReqExteriorRoomUserCount ( int RoomNumber, int RoomUserCount );		//  GUIWarfare.BTTcpHandler.sfReqExteriorRoomUserCount
	 bool                      sfReqExteriorRoomInfo ( int SP, int RoomNumber, unsigned char IsPW, struct FString RoomName, struct FString MapName, struct FString ModeName, int MapNum, int ModeNum, unsigned char IsTeamBalance, int MaxUserCount, int RoomUserCount, unsigned char RoomState, unsigned char BotDifficult, unsigned char WeaponLimit, unsigned char BotModeUserTeamNum );		//  GUIWarfare.BTTcpHandler.sfReqExteriorRoomInfo
	 bool                      sfReqGetBooty ( int RoomNumber );                 		//  GUIWarfare.BTTcpHandler.sfReqGetBooty
	 bool                      sfReqSetUserBootySeedValue ( int UserID, int SeedValue );		//  GUIWarfare.BTTcpHandler.sfReqSetUserBootySeedValue
	 bool                      sfReqChangeRoomSetting ( struct FGameRoomInfo RoomInfo );		//  GUIWarfare.BTTcpHandler.sfReqChangeRoomSetting
	 bool                      sfReqNotifyLevelUp ( int LevelUpUserID, int Level, int Exp, class TArray< int > ItemID, class TArray< int > PartID );		//  GUIWarfare.BTTcpHandler.sfReqNotifyLevelUp
	 bool                      sfReqClientUdpInfoList ( int GameNum );           		//  GUIWarfare.BTTcpHandler.sfReqClientUdpInfoList
	 bool                      sfReqRegisterMyUdpInfo ( unsigned char IsHost, struct FString IP, int Port, unsigned char Intervention, struct FString HostInnerIP, int HostInnerPort );		//  GUIWarfare.BTTcpHandler.sfReqRegisterMyUdpInfo
	 bool                      sfReqNotifyClientJoinTime ( int JoinedClientID ); 		//  GUIWarfare.BTTcpHandler.sfReqNotifyClientJoinTime
	 bool                      sfReqDisconnectGame (  );                         		//  GUIWarfare.BTTcpHandler.sfReqDisconnectGame
	 bool                      sfReqConnectGame (  );                            		//  GUIWarfare.BTTcpHandler.sfReqConnectGame
	 bool                      sfReqRelayServerOff (  );                         		//  GUIWarfare.BTTcpHandler.sfReqRelayServerOff
	 bool                      sfReqRelayServerOn ( struct FString RelayServerIP, int RelayServerPortNum );		//  GUIWarfare.BTTcpHandler.sfReqRelayServerOn
	 bool                      sfReqGameOver ( int UID, int GameRoomNumber );    		//  GUIWarfare.BTTcpHandler.sfReqGameOver
	 bool                      sfReqIsGameRoomPlaying ( int GameRoomNum );       		//  GUIWarfare.BTTcpHandler.sfReqIsGameRoomPlaying
	 bool                      sfReqChangeRoomMaxNum ( int GameNum, int UID, int Number, int TeamNum );		//  GUIWarfare.BTTcpHandler.sfReqChangeRoomMaxNum
	 bool                      sfReqUpdateScore ( int GameNumber, class TArray< int > UserIDs, class TArray< int > Kills, class TArray< int > Assists, class TArray< int > Deaths, class TArray< int > EXPs, class TArray< int > Points, class TArray< int > Scores, class TArray< int > TeamScores, class TArray< int > RoundJoin, class TArray< int > TimeJoin, int Playtime, unsigned char GameEndType, class TArray< struct FString > UserNames );		//  GUIWarfare.BTTcpHandler.sfReqUpdateScore
	 bool                      sfReqStartGame ( int GameNumber );                		//  GUIWarfare.BTTcpHandler.sfReqStartGame
	 bool                      sfReqGameHostInfo ( int GameNumber );             		//  GUIWarfare.BTTcpHandler.sfReqGameHostInfo
	 bool                      sfReqIsHostAvailable ( struct FString MyIp, int CPUGrade, int RamGrade, int VGAGrade, int VGARam );		//  GUIWarfare.BTTcpHandler.sfReqIsHostAvailable
	 bool                      sfReqChangeTeam ( int TeamNum );                  		//  GUIWarfare.BTTcpHandler.sfReqChangeTeam
	 bool                      sfReqChangeRoomOwner ( int GameNum, int UID, int NewOwner );		//  GUIWarfare.BTTcpHandler.sfReqChangeRoomOwner
	 bool                      sfReqChangeGameMode ( int GameNum, int UID, struct FString GameMode, unsigned char GameModeNum );		//  GUIWarfare.BTTcpHandler.sfReqChangeGameMode
	 bool                      sfReqBanUser ( int GameNum, int UID, int BanUID );		//  GUIWarfare.BTTcpHandler.sfReqBanUser
	 bool                      sfReqSelectMap ( int GameNum, int UID, struct FString MapName );		//  GUIWarfare.BTTcpHandler.sfReqSelectMap
	 bool                      sfReqGameRoomInfo ( int GameNum, int UID );       		//  GUIWarfare.BTTcpHandler.sfReqGameRoomInfo
	 bool                      sfReqCreateGameRoom ( struct FGameRoomInfo NetRoomInfo );		//  GUIWarfare.BTTcpHandler.sfReqCreateGameRoom
	 bool                      sfReqLeaveRoom ( int Num );                       		//  GUIWarfare.BTTcpHandler.sfReqLeaveRoom
	 bool                      sfReqRoomUserList ( int GameNum );                		//  GUIWarfare.BTTcpHandler.sfReqRoomUserList
	 bool                      sfReqEnterRoom ( int GameNum, struct FString Password, unsigned char RoomEnterType );		//  GUIWarfare.BTTcpHandler.sfReqEnterRoom
	 bool                      sfReqRoomList ( int id, int StartIndex, int Count );		//  GUIWarfare.BTTcpHandler.sfReqRoomList
	 bool                      sfReqChannelUserList ( int id, int StartIndex, int Count );		//  GUIWarfare.BTTcpHandler.sfReqChannelUserList
	 bool                      sfReqLeaveChannel ( int id );                     		//  GUIWarfare.BTTcpHandler.sfReqLeaveChannel
	 bool                      sfReqEnterChannel ( int id );                     		//  GUIWarfare.BTTcpHandler.sfReqEnterChannel
	 bool                      sfReqChannelList ( int bChannelType );            		//  GUIWarfare.BTTcpHandler.sfReqChannelList
	 bool                      sfReqFriendList (  );                             		//  GUIWarfare.BTTcpHandler.sfReqFriendList
	 bool                      sfReqCharInfo (  );                               		//  GUIWarfare.BTTcpHandler.sfReqCharInfo
	 bool                      sfReqLogin2 ( struct FString CharName, int TimeStamp, int LoginHash1, int LoginHash2, int LoginHash3, int LoginHash4, int LoginHash5, struct FString Guid, int UserType );		//  GUIWarfare.BTTcpHandler.sfReqLogin2
	 bool                      sfReqStartNatDiag ( struct FString Server1Addr, int Server1Port, struct FString Server2Addr, int Server2Port );		//  GUIWarfare.BTTcpHandler.sfReqStartNatDiag
	 bool                      sfReqForceLogoutByOwner (  );                     		//  GUIWarfare.BTTcpHandler.sfReqForceLogoutByOwner
	 bool                      sfReqLogin ( struct FString id );                 		//  GUIWarfare.BTTcpHandler.sfReqLogin
	 bool                      sfReqHash ( int HashField0, int HashField1, int HashField2, int HashField3 );		//  GUIWarfare.BTTcpHandler.sfReqHash
	 bool                      rfAckMyEquipedQSlotList ( class TArray< unsigned char > QSlotDispOrder, class TArray< struct FBtrDouble > MWUniqueID, class TArray< int > MWItemID, class TArray< int > MWPartID, class TArray< int > MWPaintID, class TArray< struct FBtrDouble > PistolUniqueID, class TArray< int > PistolItemID, class TArray< int > PistolPartID, class TArray< int > PistolPaintID, class TArray< struct FBtrDouble > TW1UniqueID, class TArray< int > TWItemID1, class TArray< struct FBtrDouble > TW2UniqueID, class TArray< int > TWItemID2, class TArray< int > Skill1ID, class TArray< int > Skill2ID, class TArray< int > Skill3ID, class TArray< int > Skill4ID, int Result );		//  GUIWarfare.BTTcpHandler.rfAckMyEquipedQSlotList
	 bool                      rfAckMyEquipedSkillList ( class TArray< int > SkillIDs, class TArray< int > SlotPositions, int Result );		//  GUIWarfare.BTTcpHandler.rfAckMyEquipedSkillList
	 bool                      rfAckMyEquipedItemList ( class TArray< int > ItemIDs, class TArray< int > SlotPositions, class TArray< int > AddPartsID, class TArray< int > PaintID, class TArray< struct FBtrDouble > UniqueID, int Result );		//  GUIWarfare.BTTcpHandler.rfAckMyEquipedItemList
	 void                      endTutorial (  );                                 		//  GUIWarfare.BTTcpHandler.endTutorial
	 void                      OnPageRoomLobbyInited (  );                       		//  GUIWarfare.BTTcpHandler.OnPageRoomLobbyInited
	 void                      BeginTutorialCreateRoom (  );                     		//  GUIWarfare.BTTcpHandler.BeginTutorialCreateRoom
	 void                      SetupTutorialRoomInfo ( struct FString MapName ); 		//  GUIWarfare.BTTcpHandler.SetupTutorialRoomInfo
	 void                      BeginTutorial ( struct FString MapName );         		//  GUIWarfare.BTTcpHandler.BeginTutorial
	 void                      OnReqSuccessStartGame ( int Step );               		//  GUIWarfare.BTTcpHandler.OnReqSuccessStartGame
	 void                      OnError ( int ErrCode );                          		//  GUIWarfare.BTTcpHandler.OnError
	 void                      OnClose ( int ErrCode );                          		//  GUIWarfare.BTTcpHandler.OnClose
	 void                      OnConnect ( int ErrCode );                        		//  GUIWarfare.BTTcpHandler.OnConnect
	 void                      eventCreated (  );                                		// [ FUNC_Event ] GUIWarfare.BTTcpHandler.Created
	 bool                      Close (  );                                       		//  GUIWarfare.BTTcpHandler.Close
	 bool                      Connect ( struct FString sIpaddr, int nPort );    		//  GUIWarfare.BTTcpHandler.Connect
	 bool                      InitNetwork (  );                                 		//  GUIWarfare.BTTcpHandler.InitNetwork
}; // Size: 0x0094

// Class GUIWarfare.BTPageLogo
class DLL_IMPORT UBTPageLogo : public UBTNetGUIPage
{
public:
	unsigned long                                      bSaveConnectLoginServer:1;                        		// 0x041C ( 0x0004 )  [0x00000001]
	unsigned char                                      SaveNeedChar;                                     		// 0x0420 ( 0x0001 ) 
	int                                                LogoState;                                        		// 0x0424 ( 0x0004 ) 
	class TArray< struct FImage >                      LogoImg;                                          		// 0x0428 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTOwnerDrawImageHK*                         Background;                                       		// 0x0434 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         LabelLogo;                                        		// 0x0438 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	float                                              Degree;                                           		// 0x043C ( 0x0004 ) 
	float                                              TimeFade;                                         		// 0x0440 ( 0x0004 ) 
	float                                              TimeDelay;                                        		// 0x0444 ( 0x0004 ) 
	unsigned long                                      bFirstRender:1;                                   		// 0x0448 ( 0x0004 )  [0x00000001]
	class ABTROModelNew*                               CharacterModel;                                   		// 0x044C ( 0x0004 ) 
	int                                                EventNotifyType;                                  		// 0x0450 ( 0x0004 ) 
	unsigned long                                      bShowNotice:1;                                    		// 0x0454 ( 0x0004 )  [0x00000001]

	// UScript Functions
	 void                      ShowNotify (  );                                  		//  GUIWarfare.BTPageLogo.ShowNotify
	 bool                      rfAckEventNotify ( int Type );                    		//  GUIWarfare.BTPageLogo.rfAckEventNotify
	 bool                      rfAckClientChecksum ( int Result );               		//  GUIWarfare.BTPageLogo.rfAckClientChecksum
	 bool                      rfAckClientChallenge ( struct FString Key1, struct FBtrDouble Key2 );		//  GUIWarfare.BTPageLogo.rfAckClientChallenge
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfare.BTPageLogo.Internal_OnPreDraw
	 bool                      rfAckProcessPreLoginUser ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLogo.rfAckProcessPreLoginUser
	 bool                      rfAckLoginInHouseTest ( unsigned char Sucess, struct FString CharName, int TimeStamp, int LoginHash1, int LoginHash2, int LoginHash3, int LoginHash4, int LoginHash5, unsigned char NeedChar, struct FString ErrMsg, struct FString BDay, unsigned char Sex, struct FBtrDouble ServerTime );		//  GUIWarfare.BTPageLogo.rfAckLoginInHouseTest
	 bool                      Exit_OnOK ( class UGUIComponent* Sender );        		//  GUIWarfare.BTPageLogo.Exit_OnOK
	 bool                      ForceDisconnect_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogo.ForceDisconnect_OnOK
	 bool                      rfAckLoginWithGlobal ( int Result );              		//  GUIWarfare.BTPageLogo.rfAckLoginWithGlobal
	 bool                      rfAckLoginWithThailand ( int Result );            		//  GUIWarfare.BTPageLogo.rfAckLoginWithThailand
	 bool                      rfAckLoginWithWZAuth ( int Result, unsigned char wzp_AccountType, unsigned char wzp_IsBlock, unsigned char wzp_AuthKeySuccess, unsigned char ChannelType );		//  GUIWarfare.BTPageLogo.rfAckLoginWithWZAuth
	 bool                      rfAckLoginWithTencentAuth ( int Result, unsigned char tc_AccountType, unsigned char tc_IsBlock );		//  GUIWarfare.BTPageLogo.rfAckLoginWithTencentAuth
	 bool                      Exit_OnClick ( class UGUIComponent* Sender );     		//  GUIWarfare.BTPageLogo.Exit_OnClick
	 bool                      Internal_KeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfare.BTPageLogo.Internal_KeyEvent
	 void                      LabelLogo_Decrease_OnTimer ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogo.LabelLogo_Decrease_OnTimer
	 void                      LabelLogo_Delay_OnTimer ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogo.LabelLogo_Delay_OnTimer
	 void                      LabelLogo_Increase_OnTimer ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogo.LabelLogo_Increase_OnTimer
	 void                      SupportResolution (  );                           		//  GUIWarfare.BTPageLogo.SupportResolution
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTPageLogo.InitComponent
	 void                      TcpLogin_OnConnect ( int ErrCode );               		//  GUIWarfare.BTPageLogo.TcpLogin_OnConnect
//	 float                     DegreeToRadian ( float Angle );                   		//  GUIWarfare.BTPageLogo.DegreeToRadian
	 void                      InternalOnClose ( bool bCanceled );               		//  GUIWarfare.BTPageLogo.InternalOnClose
	 void                      InternalOnOpen (  );                              		//  GUIWarfare.BTPageLogo.InternalOnOpen
	 class UBTTcpLink_Login*   GetTcpLogin (  );                                 		//  GUIWarfare.BTPageLogo.GetTcpLogin
}; // Size: 0x003C

// Class GUIWarfare.BTPageLogin
class DLL_IMPORT UBTPageLogin : public UBTNetGUIPageHK
{
public:
	struct FFloatBox                                   fbButtonLogin;                                    		// 0x055C ( 0x0010 ) 
	class UBTOwnerDrawCaptionButtonHK*                 ButtonLogin;                                      		// 0x056C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbButtonBattery;                                  		// 0x0570 ( 0x0010 ) 
	class UBTOwnerDrawCaptionButtonHK*                 ButtonBattery;                                    		// 0x0580 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbButtonQuit;                                     		// 0x0584 ( 0x0010 ) 
	class UBTOwnerDrawCaptionButtonHK*                 ButtonQuit;                                       		// 0x0594 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbEditID;                                         		// 0x0598 ( 0x0010 ) 
	class UBTEditBoxHK*                                EditID;                                           		// 0x05A8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbEditPW;                                         		// 0x05AC ( 0x0010 ) 
	class UBTEditPWHK*                                 EditPW;                                           		// 0x05BC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbComboTest;                                      		// 0x05C0 ( 0x0010 ) 
	class UBTComboBoxHK*                               ComboTest;                                        		// 0x05D0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                RequestProcessPreLoginCount;                      		// 0x05D4 ( 0x0004 ) 
	int                                                MaxRequestProcessPreLogin;                        		// 0x05D8 ( 0x0004 ) 
	struct FString                                     MessageUserWithSameIDConnected;                   		// 0x05DC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     MessageNoID;                                      		// 0x05E8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     MessageWrongPWD;                                  		// 0x05F4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     MessageTypedNoPWD;                                		// 0x0600 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     CaptionLogin;                                     		// 0x060C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     CaptionQuit;                                      		// 0x0618 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTLabelTestHK2*                             ClanMark;                                         		// 0x0624 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonFontTest;                                   		// 0x0628 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTSliderHK*                                 slider;                                           		// 0x062C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 bool                      rfAckLoginWithGlobal ( int Result );              		//  GUIWarfare.BTPageLogin.rfAckLoginWithGlobal
	 bool                      rfAckLoginWithThailand ( int Result );            		//  GUIWarfare.BTPageLogin.rfAckLoginWithThailand
	 bool                      rfAckLoginWithWZAuth ( int Result, unsigned char wzp_AccountType, unsigned char wzp_IsBlock, unsigned char wzp_AuthKeySuccess, unsigned char ChannelType );		//  GUIWarfare.BTPageLogin.rfAckLoginWithWZAuth
	 bool                      rfAckLoginWithTencentAuth ( int Result, unsigned char tc_AccountType, unsigned char tc_IsBlock );		//  GUIWarfare.BTPageLogin.rfAckLoginWithTencentAuth
	 bool                      rfAckCreateChar ( int Success, struct FString ErrMsg );		//  GUIWarfare.BTPageLogin.rfAckCreateChar
	 bool                      Disconnect_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogin.Disconnect_OnCancel
	 bool                      Disconnect_OnOK ( class UGUIComponent* Sender );  		//  GUIWarfare.BTPageLogin.Disconnect_OnOK
	 void                      RequestProcessPreLoginUser (  );                  		//  GUIWarfare.BTPageLogin.RequestProcessPreLoginUser
	 bool                      rfAckProcessPreLoginUser ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLogin.rfAckProcessPreLoginUser
	 bool                      rfAckLoginInHouseTest ( unsigned char Sucess, struct FString CharName, int TimeStamp, int LoginHash1, int LoginHash2, int LoginHash3, int LoginHash4, int LoginHash5, unsigned char NeedChar, struct FString ErrMsg, struct FString BDay, unsigned char Sex, struct FBtrDouble ServerTime );		//  GUIWarfare.BTPageLogin.rfAckLoginInHouseTest
	 bool                      rfAckLogin ( unsigned char Sucess, struct FString CharName, int TimeStamp, int LoginHash1, int LoginHash2, int LoginHash3, int LoginHash4, int LoginHash5, unsigned char NeedChar, struct FString ErrMsg );		//  GUIWarfare.BTPageLogin.rfAckLogin
	 bool                      ButtionSettings_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogin.ButtionSettings_OnClick
	 bool                      ButtonQuit_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogin.ButtonQuit_OnClick
	 bool                      ButtonLogin_Ver1_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogin.ButtonLogin_Ver1_OnClick
	 bool                      ButtonLogin_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogin.ButtonLogin_OnClick
	 bool                      SendLogin_Ver1 (  );                              		//  GUIWarfare.BTPageLogin.SendLogin_Ver1
	 void                      Quit (  );                                        		//  GUIWarfare.BTPageLogin.Quit
	 bool                      internalKeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfare.BTPageLogin.internalKeyEvent
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUIWarfare.BTPageLogin.Opened
	 void                      InternalOnClose ( bool bCanceled );               		//  GUIWarfare.BTPageLogin.InternalOnClose
	 void                      InternalOnOpen (  );                              		//  GUIWarfare.BTPageLogin.InternalOnOpen
	 class UBTTcpLink_Login*   GetTcpLogin (  );                                 		//  GUIWarfare.BTPageLogin.GetTcpLogin
	 bool                      Edit_OnEnter ( class UGUIComponent* Sender, struct FString txt );		//  GUIWarfare.BTPageLogin.Edit_OnEnter
	 bool                      ButtonFontTest_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLogin.ButtonFontTest_OnClick
	 void                      Internal_OnRendered ( class UCanvas* C );         		//  GUIWarfare.BTPageLogin.Internal_OnRendered
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTPageLogin.InitComponent
}; // Size: 0x00D4

// Class GUIWarfare.BTPageCharacterCreation
class DLL_IMPORT UBTPageCharacterCreation : public UBTNetGUIPageHK
{
public:
	class UBTTPTopMenuSCHK*                            TPTopMenu;                                        		// 0x055C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTModelHK*                                  UIModel;                                          		// 0x0560 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class ABTROModelNew*                               CharacterModel;                                   		// 0x0564 ( 0x0004 ) 
	struct FFloatBox                                   fbModelBG;                                        		// 0x0568 ( 0x0010 ) 
	struct FFloatBox                                   fbUIModel;                                        		// 0x0578 ( 0x0010 ) 
	struct FFloatBox                                   fbButtonLR;                                       		// 0x0588 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbButtonRR;                                       		// 0x0598 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonLR;                                         		// 0x05A8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonRR;                                         		// 0x05AC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRRMousePressed:1;                                		// 0x05B0 ( 0x0004 )  [0x00000001]
	unsigned long                                      bLRMousePressed:1;                                		// 0x05B0 ( 0x0004 )  [0x00000002]
	class UBTOwnerDrawImageHK*                         BackgroundDeco;                                   		// 0x05B4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FImage                                      CharacterCreationBgDeco;                          		// 0x05B8 ( 0x0020 ) 
	struct FFloatBox                                   fbBGDeco;                                         		// 0x05D8 ( 0x0010 ) 
	struct FFloatBox                                   fbButtonConfirm;                                  		// 0x05E8 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strButtonConfirm;                                 		// 0x05F8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonConfirm;                                    		// 0x0604 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strEditNickName;                                  		// 0x0608 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strLabelNickName;                                 		// 0x0614 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbEditNickName;                                   		// 0x0620 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbLabelNickName;                                  		// 0x0630 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTEditBoxHK*                                EditNickName;                                     		// 0x0640 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         LabelNickName;                                    		// 0x0644 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbAFTeamBtn;                                      		// 0x0648 ( 0x0010 ) 
	struct FFloatBox                                   fbRSATeamBtn;                                     		// 0x0658 ( 0x0010 ) 
	struct FString                                     strAF;                                            		// 0x0668 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strRSA;                                           		// 0x0674 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonAF;                                         		// 0x0680 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonRSA;                                        		// 0x0684 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FImage                                      NickNameDeco;                                     		// 0x0688 ( 0x0020 ) 
	class UBTRODecorateStringHK*                       NickNameToolTip;                                  		// 0x06A8 ( 0x0004 ) 
	struct FFloatBox                                   fbToolTip;                                        		// 0x06AC ( 0x0010 ) 
	struct FString                                     strNickNameToolTip;                               		// 0x06BC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UwGameManager*                               GameMgr;                                          		// 0x06C8 ( 0x0004 ) 
	struct FString                                     strErrorList[ 0x03 ];                             		// 0x06CC ( 0x0024 ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bVisibleAFModel:1;                                		// 0x06F0 ( 0x0004 )  [0x00000001]
	int                                                nOldMouseX;                                       		// 0x06F4 ( 0x0004 ) 
	int                                                nOffsetMouseDis;                                  		// 0x06F8 ( 0x0004 ) 

	// UScript Functions
	 void                      Internal_OnRendered ( class UCanvas* Canvas );    		//  GUIWarfare.BTPageCharacterCreation.Internal_OnRendered
	 bool                      rfAckProcessPreLoginUser ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageCharacterCreation.rfAckProcessPreLoginUser
	 bool                      rfAckLoginInHouseTest ( unsigned char Sucess, struct FString CharName, int TimeStamp, int LoginHash1, int LoginHash2, int LoginHash3, int LoginHash4, int LoginHash5, unsigned char NeedChar, struct FString ErrMsg, struct FString BDay, unsigned char Sex, struct FBtrDouble ServerTime );		//  GUIWarfare.BTPageCharacterCreation.rfAckLoginInHouseTest
	 bool                      Exit_OnOK ( class UGUIComponent* Sender );        		//  GUIWarfare.BTPageCharacterCreation.Exit_OnOK
	 bool                      ForceDisconnect_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageCharacterCreation.ForceDisconnect_OnOK
	 void                      rfAckCreateChar ( int Success, struct FString ErrMsg );		//  GUIWarfare.BTPageCharacterCreation.rfAckCreateChar
	 bool                      ButtonConfirm_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageCharacterCreation.ButtonConfirm_OnClick
	 bool                      ButtonRSA_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageCharacterCreation.ButtonRSA_OnClick
	 bool                      ButtonAF_OnClick ( class UGUIComponent* Sender ); 		//  GUIWarfare.BTPageCharacterCreation.ButtonAF_OnClick
	 void                      ButtonRR_OnRelease ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageCharacterCreation.ButtonRR_OnRelease
	 void                      ButtonRR_OnPressed ( class UGUIComponent* Sender, bool bRepeat );		//  GUIWarfare.BTPageCharacterCreation.ButtonRR_OnPressed
	 void                      ButtonLR_OnRelease ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageCharacterCreation.ButtonLR_OnRelease
	 void                      ButtonLR_OnPressed ( class UGUIComponent* Sender, bool bRepeat );		//  GUIWarfare.BTPageCharacterCreation.ButtonLR_OnPressed
	 void                      CharRotByDrag (  );                               		//  GUIWarfare.BTPageCharacterCreation.CharRotByDrag
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfare.BTPageCharacterCreation.Internal_OnPreDraw
	 int                       GetStringCount ( struct FString Text );           		//  GUIWarfare.BTPageCharacterCreation.GetStringCount
	 void                      InternalOnClose ( bool bCanceled );               		//  GUIWarfare.BTPageCharacterCreation.InternalOnClose
	 void                      InternalOnOpen (  );                              		//  GUIWarfare.BTPageCharacterCreation.InternalOnOpen
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTPageCharacterCreation.InitComponent
	 class UBTTcpLink_Login*   GetTcpLogin (  );                                 		//  GUIWarfare.BTPageCharacterCreation.GetTcpLogin
	 bool                      HeaderButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageCharacterCreation.HeaderButton_OnClick
}; // Size: 0x01A0

// Class GUIWarfare.BTPageLobby
class DLL_IMPORT UBTPageLobby : public UBTNetQuestInfoPageHK
{
public:
	float                                              ACLLobby_OnHitBottom_LastTime;                    		// 0x0560 ( 0x0004 ) 
	float                                              TPMessenger_ACLMsg0_OnHitBottom_LastTime;         		// 0x0564 ( 0x0004 ) 
	struct FString                                     strEnterRoomMessage;                              		// 0x0568 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strConnectingLogin;                               		// 0x0574 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bStopRefresh:1;                                   		// 0x0580 ( 0x0004 )  [0x00000001]
	float                                              LastRefreshTime[ 0x02 ];                          		// 0x0584 ( 0x0008 ) 
	float                                              RefreshCycleTime[ 0x02 ];                         		// 0x058C ( 0x0008 ) 
	class UBTRefreshTime*                              rfFriendPosTime;                                  		// 0x0594 ( 0x0004 ) 
	int                                                TotalChannelUserCount;                            		// 0x0598 ( 0x0004 ) 
	int                                                TotalRoomCount;                                   		// 0x059C ( 0x0004 ) 
	int                                                RoomStartIndex;                                   		// 0x05A0 ( 0x0004 ) 
	int                                                RoomPingIndex;                                    		// 0x05A4 ( 0x0004 ) 
	unsigned long                                      bJoinClanState:1;                                 		// 0x05A8 ( 0x0004 )  [0x00000001]
	unsigned long                                      bClanInviteState:1;                               		// 0x05A8 ( 0x0004 )  [0x00000002]
	unsigned long                                      bGoBack:1;                                        		// 0x05A8 ( 0x0004 )  [0x00000004]
	unsigned long                                      bGoTutorial:1;                                    		// 0x05A8 ( 0x0004 )  [0x00000008]
	struct FString                                     SaveRoomPassword;                                 		// 0x05AC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTOwnerDrawImageHK*                         BGRoomList;                                       		// 0x05B8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         BGImageAD2;                                       		// 0x05BC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UTabControlMocker*                           TabControl;                                       		// 0x05C0 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTACLLobbyHK*                               ACLLobby;                                         		// 0x05C4 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTACLLobbyHK*                               ACLLobbyEnterable;                                		// 0x05C8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned long                                      bAllRoomList:1;                                   		// 0x05CC ( 0x0004 )  [0x00000001]
	class UBTTPChatHK*                                 TPChat;                                           		// 0x05D0 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPMessengerHK*                            TPMessenger;                                      		// 0x05D4 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPMyInfoHK*                               TPMyInfo;                                         		// 0x05D8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strDisconnectedChannel;                           		// 0x05DC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strListTop[ 0x0A ];                               		// 0x05E8 ( 0x0078 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strListBottom[ 0x05 ];                            		// 0x0660 ( 0x003C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strAllRoomList;                                   		// 0x069C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ListTopButton[ 0x0A ];                            		// 0x06A8 ( 0x0028 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ListBottomButton[ 0x05 ];                         		// 0x06D0 ( 0x0014 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         ListTopImage[ 0x0A ];                             		// 0x06E4 ( 0x0028 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   ListTopButtonPosition[ 0x0A ];                    		// 0x070C ( 0x00A0 ) 
	struct FFloatBox                                   ListBottomButtonPosition[ 0x05 ];                 		// 0x07AC ( 0x0050 ) 
	class UBTOwnerDrawCaptionButtonHK*                 ButtonAD;                                         		// 0x07FC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strMakeClanWarRoom;                               		// 0x0800 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strRegularClanWar;                                		// 0x080C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strFriendlyClanWar;                               		// 0x0818 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strButtonRegularClanWar;                          		// 0x0824 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strButtonFriendlyClanWar;                         		// 0x0830 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbButtonRegularClanWar;                           		// 0x083C ( 0x0010 ) 
	struct FFloatBox                                   fbButtonFriendlyClanWar;                          		// 0x084C ( 0x0010 ) 
	class UBTOwnerDrawCaptionButtonHK*                 ButtonRegularClanWar;                             		// 0x085C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonFriendlyClanWar;                            		// 0x0860 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UwMatchMaker*                                MatchMaker;                                       		// 0x0864 ( 0x0004 ) [ CPF_Transient ]
	struct FFloatBox                                   fbTestButton;                                     		// 0x0868 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTNuclearButtonHK*                          TestButton;                                       		// 0x0878 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< struct FString >                     DelFriendsList;                                   		// 0x087C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      bQuickJoin;                                       		// 0x0888 ( 0x0001 ) 
	int                                                MapIndex;                                         		// 0x088C ( 0x0004 ) 
	int                                                GameMode;                                         		// 0x0890 ( 0x0004 ) 
	int                                                WRestrict;                                        		// 0x0894 ( 0x0004 ) 
	struct FScriptDelegate                             __delegateAckEnterRoom__Delegate;                 		// 0x0898 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      rfNotifyClanLevelup ( struct FString ClanName, int Levelup );		//  GUIWarfare.BTPageLobby.rfNotifyClanLevelup
	 bool                      rfNotifyNewClanName ( struct FString New_NickName );		//  GUIWarfare.BTPageLobby.rfNotifyNewClanName
	 bool                      rfReqRecvClanInvite ( int InviterUserDBID, struct FString InviterCharname, struct FString ClanName, struct FString InviteMsg );		//  GUIWarfare.BTPageLobby.rfReqRecvClanInvite
	 bool                      rfNotifyNewNickName ( int Community_Type, struct FString Old_NickName, struct FString New_NickName );		//  GUIWarfare.BTPageLobby.rfNotifyNewNickName
	 bool                      rfAckGetRankingInfoListEnd (  );                  		//  GUIWarfare.BTPageLobby.rfAckGetRankingInfoListEnd
	 bool                      rfAckGetRankingInfoList ( int Result, unsigned char RankingType, unsigned char CommunityType, class TArray< struct FString > CharName, class TArray< int > CharLevel, class TArray< struct FString > ClanName, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< int > ClanMarkBL, class TArray< int > Ranking_Accum, class TArray< int > Ranking_Accum_Prev, class TArray< int > Ranking_Accum_Exp, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTPageLobby.rfAckGetRankingInfoList
	 bool                      rfAckGetRankingInfoListStart ( int Result, unsigned char RankingType, unsigned char CommunityType, int TotalCount );		//  GUIWarfare.BTPageLobby.rfAckGetRankingInfoListStart
	 bool                      rfAckCharDetailInfo ( int MaxSerial, int MaxScore, int MaxKill, int MaxAssist, int Serial3, int Serial5, int Serial7, int Serial10, int Serial15, int AR, int SMG, int SR, int SW, int Melee, int Grenade, int FlashBang, int Foot, int AT4, int MG, int Fire, int RPG7, int TimeBomb, int IcendiaryBomb, int ClusterBomb, int ByChopper, int Artillery, int KillChopper, int FirstKill, int LastKill, int AllKill, int Dominate, int InstallBomb, int DefuseBomb );		//  GUIWarfare.BTPageLobby.rfAckCharDetailInfo
	 bool                      rfAckFriendPosition ( int Result, struct FString TargetCharName, unsigned char ServerType, struct FString fServername, struct FString fServerShortName, struct FString fServerIP, int fServerPort, unsigned char CurPos, unsigned char CurState, int ChannelNum, struct FString ChannelNickName, int GameRoomNum );		//  GUIWarfare.BTPageLobby.rfAckFriendPosition
	 bool                      rfAckMoveToLobby ( unsigned char MessageType );   		//  GUIWarfare.BTPageLobby.rfAckMoveToLobby
	 bool                      rfAckLogOut ( unsigned char Result, unsigned char Reason );		//  GUIWarfare.BTPageLobby.rfAckLogOut
	 bool                      rfAckClanMatch_PublicWaitRoomChanged ( int WaitRoomIdx, struct FString RoomName, int MapNum, int CurUserCount, int MaxUserCount, unsigned char Status, unsigned char IsPublic );		//  GUIWarfare.BTPageLobby.rfAckClanMatch_PublicWaitRoomChanged
	 bool                      rfAckClanMatch_EndPublicWaitRoomList (  );        		//  GUIWarfare.BTPageLobby.rfAckClanMatch_EndPublicWaitRoomList
	 bool                      rfAckClanMatch_PublicWaitRoomList ( class TArray< int > WaitRoomIdx, class TArray< struct FString > LeaderName, class TArray< struct FString > RoomName, class TArray< int > MapNum, class TArray< int > CurUserCount, class TArray< int > MaxUserCount, class TArray< unsigned char > Status );		//  GUIWarfare.BTPageLobby.rfAckClanMatch_PublicWaitRoomList
	 bool                      rfAckClanMatch_StartPublicWaitRoomList ( int Result, struct FString ErrMsg, int Count );		//  GUIWarfare.BTPageLobby.rfAckClanMatch_StartPublicWaitRoomList
	 bool                      rfAckNotifyEndTutorial ( int UserID, struct FString CharName, int Level, struct FString ClanName, int ClanMarkPattern, int ClanMarkBG, int ClanMarkBL, int ClanGrade, int ClanWin, int ClanLose, unsigned char IsLookFor, int Result, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageLobby.rfAckNotifyEndTutorial
	 bool                      rfAckNotifyStartTutorial ( int Result, int UserID );		//  GUIWarfare.BTPageLobby.rfAckNotifyStartTutorial
	 void                      RoomPingRefresh (  );                             		//  GUIWarfare.BTPageLobby.RoomPingRefresh
	 bool                      rfAckChangedRoomTitle_FromGM ( int Result, int RoomNumber, struct FString NewRoomTitle );		//  GUIWarfare.BTPageLobby.rfAckChangedRoomTitle_FromGM
	 bool                      IsEnterableRoom ( bool bPass, int nUser, int nMaxUser );		//  GUIWarfare.BTPageLobby.IsEnterableRoom
	 bool                      rfAckQuestGetAvailableEventList ( int Result, struct FString ErrMsg, class TArray< int > QuestID );		//  GUIWarfare.BTPageLobby.rfAckQuestGetAvailableEventList
	 void                      UpdateRecv_ClanInfo ( class UBTNetMainMenu* MainMenu );		//  GUIWarfare.BTPageLobby.UpdateRecv_ClanInfo
	 bool                      rfAckNotifyAdjustClanMemberGrade ( struct FString ClanName, struct FString CharName, unsigned char CharGrade );		//  GUIWarfare.BTPageLobby.rfAckNotifyAdjustClanMemberGrade
	 bool                      rfAckAdjustClanMemberGrade ( int Result, struct FString ErrMsg, struct FString ClanName, struct FString CharName, unsigned char CharGrade );		//  GUIWarfare.BTPageLobby.rfAckAdjustClanMemberGrade
	 bool                      rfReqRecvDeleteFriend ( int Result, struct FString FromCharName );		//  GUIWarfare.BTPageLobby.rfReqRecvDeleteFriend
	 bool                      rfAckDeleteFriend ( int Result, class TArray< struct FString > FailedCharname );		//  GUIWarfare.BTPageLobby.rfAckDeleteFriend
	 bool                      rfAckChatWispher ( int Result, struct FString ErrMsg, struct FString ToCharName );		//  GUIWarfare.BTPageLobby.rfAckChatWispher
	 bool                      rfAckRecvJoinClanResult ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLobby.rfAckRecvJoinClanResult
	 bool                      rfAckJoinClanResult ( struct FString ClanName, unsigned char Permit, struct FString PermitCharName );		//  GUIWarfare.BTPageLobby.rfAckJoinClanResult
	 bool                      RefreshPage_OnOK ( class UGUIComponent* Sender ); 		//  GUIWarfare.BTPageLobby.RefreshPage_OnOK
	 bool                      BTWindowRequestApprovalClanHK_OnSuspend ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowRequestApprovalClanHK_OnSuspend
	 bool                      BTWindowRequestApprovalClanHK_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowRequestApprovalClanHK_OnCancel
	 bool                      BTWindowRequestApprovalClanHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowRequestApprovalClanHK_OnOK
	 bool                      rfReqRecvJoinClan ( int UserIdx, struct FString CharName, struct FString Message );		//  GUIWarfare.BTPageLobby.rfReqRecvJoinClan
	 bool                      rfAckNotifyClanSecession ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTPageLobby.rfAckNotifyClanSecession
	 bool                      rfAckNotifyNewClanMember ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTPageLobby.rfAckNotifyNewClanMember
	 bool                      rfAckSearchClan ( int Result, struct FString ErrMsg, int TotalPage, class TArray< int > ClanMarkPattern, class TArray< int > ClanMarkBG, class TArray< unsigned char > ClanMarkBL, class TArray< struct FString > ClanName, class TArray< struct FString > ClanMaster, class TArray< int > ClanMember, class TArray< int > ClanMemberMax, class TArray< int > ClanCreateDate, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< int > ClanDraw, class TArray< int > ClanRank, class TArray< unsigned char > ClanRecruit, class TArray< int > ClanLevel );		//  GUIWarfare.BTPageLobby.rfAckSearchClan
	 bool                      rfAckInviteClanResult ( struct FString CharName, unsigned char Permit, struct FString ClanNm );		//  GUIWarfare.BTPageLobby.rfAckInviteClanResult
	 bool                      rfAckJoinClan ( int Result, struct FString ErrMsg, struct FString SpecificCharName, struct FString RealRecvCharName, unsigned char RealRecvCharClanGrade );		//  GUIWarfare.BTPageLobby.rfAckJoinClan
	 bool                      rfAckInviteClan ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLobby.rfAckInviteClan
	 bool                      BTWindowUserPersonalInfo_OnClanInfo ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowUserPersonalInfo_OnClanInfo
	 bool                      BTWindowUserDetailInfoHK_OnClanInfo ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowUserDetailInfoHK_OnClanInfo
	 bool                      rfReqClanCharPersonelIntro ( struct FString ClanName, struct FString CharName );		//  GUIWarfare.BTPageLobby.rfReqClanCharPersonelIntro
	 bool                      rfAckClanCharPersonelIntro ( int Result, struct FString ErrMsg, struct FString PersonelIntro );		//  GUIWarfare.BTPageLobby.rfAckClanCharPersonelIntro
	 bool                      rfAckDBCharInfo ( int Result, struct FString ErrMsg, struct FString CharName, struct FString ClanName, int CM_Pattern, int CM_BG, int CM_BL, struct FString ClanPersonIntro, int MainWeaponItemID, int MainWeaponPartID, int SubWeaponItemID, int SubWeaponPartID, int AFSpecialCostumeItemID, int RSASpecialCostumeItemID, struct FCharInfo stCharInfo, int ClanLevel );		//  GUIWarfare.BTPageLobby.rfAckDBCharInfo
	 bool                      MoveToClanPage_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.MoveToClanPage_OnOK
	 bool                      rfAckCreateClan ( int Result, struct FString ErrMsg, struct FBtrDouble ItemIdx, int StackCount );		//  GUIWarfare.BTPageLobby.rfAckCreateClan
	 bool                      rfAckDupCheckClanName ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLobby.rfAckDupCheckClanName
	 bool                      rfAckGameRoomInfo ( int Result, struct FString ErrMsg, struct FGameRoomInfo RoomInfo );		//  GUIWarfare.BTPageLobby.rfAckGameRoomInfo
	 bool                      rfReqCompleteFriendInvite ( struct FString CharnameToBeInvited, unsigned char IsPermit );		//  GUIWarfare.BTPageLobby.rfReqCompleteFriendInvite
	 bool                      rfAckConfirmFriendInvite ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLobby.rfAckConfirmFriendInvite
	 bool                      rfReqRecvFriendInvite ( int ReqUserID, struct FString ReqCharname, struct FString InviteMsg );		//  GUIWarfare.BTPageLobby.rfReqRecvFriendInvite
	 bool                      rfAckSendFriendInvite ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLobby.rfAckSendFriendInvite
	 bool                      rfReqExteriorRoomOwnerInfo ( int RoomNum, struct FString OwnerName, struct FString OwnerIP );		//  GUIWarfare.BTPageLobby.rfReqExteriorRoomOwnerInfo
	 bool                      rfReqExteriorRoomState ( int RoomNumber, unsigned char RoomState );		//  GUIWarfare.BTPageLobby.rfReqExteriorRoomState
	 bool                      rfReqExteriorRoomUserCount ( int RoomNumber, int RoomUserCount );		//  GUIWarfare.BTPageLobby.rfReqExteriorRoomUserCount
	 bool                      rfReqExteriorRoomInfo ( int SP, int RoomNumber, unsigned char IsPW, struct FString RoomName, struct FString MapName, struct FString ModeName, int MapNum, int ModeNum, unsigned char IsTeamBalance, int MaxUserCount, int RoomUserCount, unsigned char RoomState, unsigned char BotDifficult, unsigned char WeaponLimit, unsigned char BotModeUserTeamNum );		//  GUIWarfare.BTPageLobby.rfReqExteriorRoomInfo
	 void                      SetCharacterInfo ( struct FString ClanName, struct FCharInfo btCharInfo );		//  GUIWarfare.BTPageLobby.SetCharacterInfo
	 bool                      rfAckGameRoomDestroy ( int GameRoomNum );         		//  GUIWarfare.BTPageLobby.rfAckGameRoomDestroy
	 bool                      rfAckChannelUserList ( int TotalCount, int Count, int StartIndex, class TArray< int > UID, class TArray< struct FString > UserID, class TArray< int > UserLevels, class TArray< struct FString > ClanName, class TArray< int > ClanPattern, class TArray< int > ClanBG, class TArray< int > ClanBL, class TArray< int > ClanGrade, class TArray< int > ClanWin, class TArray< int > ClanLose, class TArray< unsigned char > IsLookForClan, int Result, struct FString ErrMsg, class TArray< int > ClanLevel, class TArray< int > LevelMarkID, class TArray< int > TitleMarkID, class TArray< int > Reserved1, class TArray< int > Reserved2, class TArray< int > Reserved3 );		//  GUIWarfare.BTPageLobby.rfAckChannelUserList
	 void                      TryEnterBotMode (  );                             		//  GUIWarfare.BTPageLobby.TryEnterBotMode
	 bool                      rfAckRoomList ( class TArray< int > GameNum, class TArray< struct FString > Title, class TArray< struct FString > MapName, class TArray< int > MapNum, class TArray< unsigned char > UserCount, class TArray< unsigned char > MaxCount, class TArray< struct FString > ModeName, class TArray< int > ModeNum, class TArray< unsigned char > WeaponLimit, class TArray< unsigned char > IsTeamBalance, class TArray< unsigned char > Status, class TArray< struct FString > RoomOwnerIP, class TArray< int > GameMinute, class TArray< struct FString > RoomOwnerName, class TArray< unsigned char > IsSpecial, class TArray< unsigned char > IsPassword, class TArray< unsigned char > BotDifficult, class TArray< unsigned char > BotModeUserTeamNum );		//  GUIWarfare.BTPageLobby.rfAckRoomList
	 bool                      rfAckRoomListStart ( int Result, int TotalCount, int Count, int StartIndex );		//  GUIWarfare.BTPageLobby.rfAckRoomListStart
	 bool                      rfAckEnterRoom ( int GameNum, int OwnerID, int UID, struct FString UserID, int TeamNum, int Grade, struct FString UserIP, struct FString ClanName, int Clan_Mark_Pattern, int Clan_Mark_BG, int Clan_Mark_BL, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageLobby.rfAckEnterRoom
	 bool                      rfAckLeaveChannel ( int Result, struct FString UserID, int UID );		//  GUIWarfare.BTPageLobby.rfAckLeaveChannel
	 bool                      LobbyToServerSelection (  );                      		//  GUIWarfare.BTPageLobby.LobbyToServerSelection
	 bool                      LobbyToServerSelection_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.LobbyToServerSelection_OnOK
	 bool                      rfAckEnterChannel ( int id, int UID, struct FString UserID, int Level, struct FString ClanName, int ClanMarkPattern, int ClanMarkBG, int ClanMarkBL, int ClanGrade, int ClanWin, int ClanLose, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageLobby.rfAckEnterChannel
	 bool                      rfAckCreateGameRoom ( int Result, struct FString ErrMsg, int UserID, struct FString RoomOwnerIP, struct FGameRoomInfo NetRoomInfo );		//  GUIWarfare.BTPageLobby.rfAckCreateGameRoom
	 void                      TeamChatLog ( struct FString cL );                		//  GUIWarfare.BTPageLobby.TeamChatLog
	 void                      BroadCastItemChatLog ( struct FString cL );       		//  GUIWarfare.BTPageLobby.BroadCastItemChatLog
	 void                      SystemChatLog ( struct FString cL );              		//  GUIWarfare.BTPageLobby.SystemChatLog
	 void                      SelfChatLog ( struct FString cL );                		//  GUIWarfare.BTPageLobby.SelfChatLog
	 void                      WhisperChatLog ( struct FString cL );             		//  GUIWarfare.BTPageLobby.WhisperChatLog
	 void                      ClanChatLog ( struct FString cL );                		//  GUIWarfare.BTPageLobby.ClanChatLog
	 void                      NormalChatLog ( struct FString cL );              		//  GUIWarfare.BTPageLobby.NormalChatLog
	 void                      ClearChatLog (  );                                		//  GUIWarfare.BTPageLobby.ClearChatLog
	 void                      OnVisibleChannelListChanged ( int Index );        		//  GUIWarfare.BTPageLobby.OnVisibleChannelListChanged
	 bool                      InternalKeyType ( struct FString Unicode, unsigned char* key );		//  GUIWarfare.BTPageLobby.InternalKeyType
	 bool                      internalKeyEvent ( float Delta, unsigned char* key, unsigned char* Action );		//  GUIWarfare.BTPageLobby.internalKeyEvent
	 void                      InternalOnClose ( bool bCanceled );               		//  GUIWarfare.BTPageLobby.InternalOnClose
	 void                      BTPageLobby_OnReceivedPing ( class UwMatchMaker* MM, struct FString fromAddr, int msec );		//  GUIWarfare.BTPageLobby.BTPageLobby_OnReceivedPing
	 void                      RefreshPage (  );                                 		//  GUIWarfare.BTPageLobby.RefreshPage
	 void                      UnInitializeDelegate (  );                        		//  GUIWarfare.BTPageLobby.UnInitializeDelegate
	 void                      InitializeDelegate (  );                          		//  GUIWarfare.BTPageLobby.InitializeDelegate
	 void                      UpdateWebzenItemList ( class UwGameManager* GameMgr );		//  GUIWarfare.BTPageLobby.UpdateWebzenItemList
	 void                      UpdateItemList ( class UwGameManager* GameMgr );  		//  GUIWarfare.BTPageLobby.UpdateItemList
	 void                      UpdateBlockList ( class UwMatchMaker* MM );       		//  GUIWarfare.BTPageLobby.UpdateBlockList
	 void                      UpdatePCBangList ( class UwMatchMaker* MM );      		//  GUIWarfare.BTPageLobby.UpdatePCBangList
	 void                      UpdateClanList ( class UwMatchMaker* MM );        		//  GUIWarfare.BTPageLobby.UpdateClanList
	 void                      UpdateFriendList ( class UwMatchMaker* MM );      		//  GUIWarfare.BTPageLobby.UpdateFriendList
	 void                      UpdateQuestList ( class UwMatchMaker* MM );       		//  GUIWarfare.BTPageLobby.UpdateQuestList
	 void                      UpdatePositionInfo ( class UwMatchMaker* MM );    		//  GUIWarfare.BTPageLobby.UpdatePositionInfo
	 void                      UpdatePCBangInfo ( class UwMatchMaker* MM );      		//  GUIWarfare.BTPageLobby.UpdatePCBangInfo
	 void                      UpdateRecv_CharInfo ( class UwMatchMaker* MM );   		//  GUIWarfare.BTPageLobby.UpdateRecv_CharInfo
	 void                      UpdateMoneyInfo ( class UwMatchMaker* MM );       		//  GUIWarfare.BTPageLobby.UpdateMoneyInfo
	 void                      UpdateEquipItemInfo ( class UwMatchMaker* MM );   		//  GUIWarfare.BTPageLobby.UpdateEquipItemInfo
	 void                      UpdateRankingInfo ( class UwMatchMaker* MM );     		//  GUIWarfare.BTPageLobby.UpdateRankingInfo
	 void                      UpdateClanInfo ( class UwMatchMaker* MM );        		//  GUIWarfare.BTPageLobby.UpdateClanInfo
	 void                      UpdateCharInfo ( class UwMatchMaker* MM );        		//  GUIWarfare.BTPageLobby.UpdateCharInfo
	 void                      OnCompleteOpened (  );                            		//  GUIWarfare.BTPageLobby.OnCompleteOpened
	 void                      OnBackToLastPage (  );                            		//  GUIWarfare.BTPageLobby.OnBackToLastPage
	 void                      InternalOnOpen (  );                              		//  GUIWarfare.BTPageLobby.InternalOnOpen
	 bool                      BTWindowDefineARHK_46_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineARHK_46_OnCancel
	 bool                      BTWindowDefineARHK_46_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineARHK_46_OnOK
	 bool                      BTWindowDefineARHK_45_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineARHK_45_OnCancel
	 bool                      BTWindowDefineARHK_45_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineARHK_45_OnOK
	 bool                      BTWindowDefineARHK_22_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineARHK_22_OnCancel
	 bool                      BTWindowDefineARHK_22_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineARHK_22_OnOK
	 void                      StartTutorial ( struct FString Map );             		//  GUIWarfare.BTPageLobby.StartTutorial
	 bool                      BTWindowDefineARHK_43 ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineARHK_43
	 void                      ShowTutorialWindow (  );                          		//  GUIWarfare.BTPageLobby.ShowTutorialWindow
	 void                      InternalOnReOpen (  );                            		//  GUIWarfare.BTPageLobby.InternalOnReOpen
	 bool                      rfAckProcessPreLoginUser ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLobby.rfAckProcessPreLoginUser
	 bool                      rfAckLoginInHouseTest ( unsigned char Sucess, struct FString CharName, int TimeStamp, int LoginHash1, int LoginHash2, int LoginHash3, int LoginHash4, int LoginHash5, unsigned char NeedChar, struct FString ErrMsg, struct FString BDay, unsigned char Sex, struct FBtrDouble ServerTime );		//  GUIWarfare.BTPageLobby.rfAckLoginInHouseTest
	 bool                      Exit_OnOK ( class UGUIComponent* Sender );        		//  GUIWarfare.BTPageLobby.Exit_OnOK
	 bool                      ForceDisconnect_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.ForceDisconnect_OnOK
	 void                      TcpLogin_OnConnect ( int ErrCode );               		//  GUIWarfare.BTPageLobby.TcpLogin_OnConnect
	 class UBTTcpLink_Login*   GetTcpLogin (  );                                 		//  GUIWarfare.BTPageLobby.GetTcpLogin
	 class UBTTcpLink_Channel* GetTcpChannel (  );                               		//  GUIWarfare.BTPageLobby.GetTcpChannel
	 bool                      Internal_OnPreDraw ( class UCanvas* C );          		//  GUIWarfare.BTPageLobby.Internal_OnPreDraw
	 bool                      TPMessenger_ButtonMsg_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.TPMessenger_ButtonMsg_OnClick
	 void                      TPMessenger_ACLMsg0_OnHitBottom ( int Top, int Count, int itemperpage );		//  GUIWarfare.BTPageLobby.TPMessenger_ACLMsg0_OnHitBottom
	 void                      ACLLobby_OnHitBottom ( int Top, int Count, int itemperpage );		//  GUIWarfare.BTPageLobby.ACLLobby_OnHitBottom
	 bool                      TestButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.TestButton_OnClick
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUIWarfare.BTPageLobby.InitComponent
	 bool                      MoveToRoom ( int Index );                         		//  GUIWarfare.BTPageLobby.MoveToRoom
	 bool                      AutoMoveReturnClanReadyRoom ( int RoomNum, struct FString Password );		//  GUIWarfare.BTPageLobby.AutoMoveReturnClanReadyRoom
	 bool                      AutoMoveToClanReadyRoom ( int RoomNum, struct FString Password );		//  GUIWarfare.BTPageLobby.AutoMoveToClanReadyRoom
	 bool                      AutoMoveToRoom ( int RoomNum, struct FString Password );		//  GUIWarfare.BTPageLobby.AutoMoveToRoom
	 bool                      OnLobby_DblClick ( class UGUIComponent* Sender ); 		//  GUIWarfare.BTPageLobby.OnLobby_DblClick
	 bool                      BTWindowPasswordHK_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowPasswordHK_OnCancel
	 bool                      BTWindowPasswordHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowPasswordHK_OnOK
	 bool                      rfAckEnterRoom_AfterJoinRoom ( int GameNum, int OwnerID, int UID, struct FString UserID, int TeamNum, int Grade, struct FString UserIP, struct FString ClanName, int Clan_Mark_Pattern, int Clan_Mark_BG, int Clan_Mark_BL, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageLobby.rfAckEnterRoom_AfterJoinRoom
	 bool                      rfAckEnterRoom_AfterCreateRoom ( int GameNum, int OwnerID, int UID, struct FString UserID, int TeamNum, int Grade, struct FString UserIP, struct FString ClanName, int Clan_Mark_Pattern, int Clan_Mark_BG, int Clan_Mark_BL, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageLobby.rfAckEnterRoom_AfterCreateRoom
	 bool                      rfAckClanMatch_Join ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageLobby.rfAckClanMatch_Join
	 bool                      rfAckClanMatch_GetReady ( int Result, struct FString ErrMsg, int RoomIndex );		//  GUIWarfare.BTPageLobby.rfAckClanMatch_GetReady
	 bool                      BTWindowDefineSelectHK_23_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowDefineSelectHK_23_OnOK
	 bool                      ButtonRegularClanWar_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.ButtonRegularClanWar_OnClick
	 bool                      ButtonFriendlyClanWar_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.ButtonFriendlyClanWar_OnClick
	 void                      OpenBTWindowCreateRoom (  );                      		//  GUIWarfare.BTPageLobby.OpenBTWindowCreateRoom
	 bool                      OnBottomButton_Click ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.OnBottomButton_Click
	 void                      OnPopupPCBang ( int ContextMenuIndex, class UBTACLMessengerPCBangHK* acl );		//  GUIWarfare.BTPageLobby.OnPopupPCBang
	 void                      OnPopupPCBangCheck ( class UBTACLMessengerPCBangHK* acl, class UBTCMMessengerPCBangHK* cm );		//  GUIWarfare.BTPageLobby.OnPopupPCBangCheck
	 void                      OnPopupBan ( int ContextMenuIndex, class UBTACLMessengerBanHK* acl );		//  GUIWarfare.BTPageLobby.OnPopupBan
	 void                      OnPopupBanCheck ( class UBTACLMessengerBanHK* acl, class UBTCMMessengerBanHK* cm );		//  GUIWarfare.BTPageLobby.OnPopupBanCheck
	 void                      OnPopupClan ( int ContextMenuIndex, class UBTACLMessengerClanHK* acl );		//  GUIWarfare.BTPageLobby.OnPopupClan
	 void                      OnPopupClanCheck ( class UBTACLMessengerClanHK* acl, class UBTCMMessengerClanHK* cm );		//  GUIWarfare.BTPageLobby.OnPopupClanCheck
	 void                      OnPopupFriend ( int ContextMenuIndex, class UBTACLMessengerFriendHK* acl );		//  GUIWarfare.BTPageLobby.OnPopupFriend
	 void                      OnPopupFriendCheck ( class UBTACLMessengerFriendHK* acl, class UBTCMMessengerFriendHK* cm );		//  GUIWarfare.BTPageLobby.OnPopupFriendCheck
	 void                      OnPopupChannel ( int ContextMenuIndex, class UBTACLMessengerChannelHK* acl );		//  GUIWarfare.BTPageLobby.OnPopupChannel
	 void                      OnPopupChannelCheck ( class UBTACLMessengerChannelHK* acl, class UBTCMMessengerChannelHK* cm );		//  GUIWarfare.BTPageLobby.OnPopupChannelCheck
	 bool                      ProcessQuickEnter ( int MapIndex, int GameMode, int WRestrict, int botLevel );		//  GUIWarfare.BTPageLobby.ProcessQuickEnter
	 bool                      QuickEnter_OnOK (  );                             		//  GUIWarfare.BTPageLobby.QuickEnter_OnOK
	 bool                      BTWindowInviteClan_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowInviteClan_OnOK
	 bool                      WindowRequestFriend_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.WindowRequestFriend_OnCancel
	 bool                      WindowRequestFriend_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.WindowRequestFriend_OnOK
	 bool                      WindowInviteFriend_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.WindowInviteFriend_OnOK
	 bool                      BTWindowCreateRoom_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowCreateRoom_OnOK
	 bool                      BTWindowJoinClan_OK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowJoinClan_OK
	 bool                      BTWindowCreateClanHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowCreateClanHK_OnOK
	 bool                      BTWindowCreateClanNeedPointHK_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowCreateClanNeedPointHK_OnClick
	 bool                      ClanMenu_ButtonCreateClan_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.ClanMenu_ButtonCreateClan_OnClick
	 bool                      BTWindowFindClanHK_OnInfo ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowFindClanHK_OnInfo
	 bool                      BTWindowFindClanHK_OnRequestJoin ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.BTWindowFindClanHK_OnRequestJoin
	 bool                      ClanMenu_ButtonFindClan_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.ClanMenu_ButtonFindClan_OnClick
	 bool                      ClanMenu_ButtonLookingForClan_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.ClanMenu_ButtonLookingForClan_OnClick
	 class UBTWindowCreateRoom* GetWindowCreateRoom (  );                         		//  GUIWarfare.BTPageLobby.GetWindowCreateRoom
	 bool                      TopButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.TopButton_OnClick
	 bool                      HeaderButton_OnClick ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageLobby.HeaderButton_OnClick
	 bool                      delegateAckEnterRoom ( int GameNum, int OwnerID, int UID, struct FString UserID, int TeamNum, int Grade, struct FString UserIP, struct FString ClanName, int Clan_Mark_Pattern, int Clan_Mark_BG, int Clan_Mark_BL, unsigned char IsLookFor, int Result, struct FString ErrMsg, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  GUIWarfare.BTPageLobby.delegateAckEnterRoom
}; // Size: 0x0340

// Class GUIWarfare.BTPageServerSelection
class DLL_IMPORT UBTPageServerSelection : public UBTNetGUIPageHK
{
public:
	class TArray< class UClanNameAndMark* >            ClanMarkList;                                     		// 0x055C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UGUIPage*                                    SavePg;                                           		// 0x0568 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UCanvas*                                     SaveCanvas;                                       		// 0x056C ( 0x0004 ) 
	unsigned long                                      bButtonRefresh:1;                                 		// 0x0570 ( 0x0004 )  [0x00000001]
	int                                                SaveServerListIndex;                              		// 0x0574 ( 0x0004 ) 
	int                                                ToggleButCredit;                                  		// 0x0578 ( 0x0004 ) 
	float                                              CurrentTime;                                      		// 0x057C ( 0x0004 ) 
	float                                              LastRefreshTime;                                  		// 0x0580 ( 0x0004 ) 
	float                                              RefreshCycleTime;                                 		// 0x0584 ( 0x0004 ) 
	struct FString                                     currentBGM;                                       		// 0x0588 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FConnectingInfo                             ConnectingChannel;                                		// 0x0594 ( 0x001C ) [ CPF_NeedCtorLink ]
	struct FFloatBox                                   fbLabelBackground;                                		// 0x05B0 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelBackground;                                  		// 0x05C0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelBackgrounddeco;                            		// 0x05C4 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelBackgrounddeco;                              		// 0x05D4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelTopLine;                                   		// 0x05D8 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawImageHK*                         LabelTopLine;                                     		// 0x05E8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelLeftTopRoll;                               		// 0x05EC ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	struct FFloatBox                                   fbLabelLeftTopRollSource;                         		// 0x05FC ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTOwnerDrawSourceClipImageHK*               LabelLeftTopRoll;                                 		// 0x060C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbLabelBottomLine;                                		// 0x0610 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTLabelNoticeHK*                            LabelBottomLine;                                  		// 0x0620 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonServerList[ 0x07 ];                         		// 0x0624 ( 0x001C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTACLServerSelectionHK*                     ACLServerList[ 0x07 ];                            		// 0x0640 ( 0x001C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UTabControlMocker*                           TabControl;                                       		// 0x065C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UBTTPTopMenuSCHK*                            TPTopMenu;                                        		// 0x0660 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	struct FString                                     strButtonCredit;                                  		// 0x0664 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonCredit;                                     		// 0x0670 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ChannelADSmall;                                   		// 0x0674 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ChannelADLarge;                                   		// 0x0678 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTemp;                                       		// 0x067C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonTemp2;                                      		// 0x0680 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTOwnerDrawImageHK*                         BGImageTotalServer;                               		// 0x0684 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FCheckToReceivedPacket                      CTRP;                                             		// 0x0688 ( 0x0004 ) 
	struct FString                                     strPCBangFriend;                                  		// 0x068C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     HashMessage;                                      		// 0x0698 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strCW_GameMode;                                   		// 0x06A4 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UBTOwnerDrawCaptionButtonHK*                 ButtonEnterCh;                                    		// 0x06B0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTACLGroutSelection*                        ServerList;                                       		// 0x06B4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTACLServerSelectionHK*                     ChannelList;                                      		// 0x06B8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bDefaultServnChannel:1;                           		// 0x06BC ( 0x0004 )  [0x00000001]
	class UBTOwnerDrawImageHK*                         ChannelBg;                                        		// 0x06C0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FFloatBox                                   fbChannelBg;                                      		// 0x06C4 ( 0x0010 ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]
	int                                                nIndexDefSrv;                                     		// 0x06D4 ( 0x0004 ) 
	int                                                nIndexDefCh;                                      		// 0x06D8 ( 0x0004 ) 
	unsigned char                                      iProcessExpiredStep;                              		// 0x06DC ( 0x0001 ) 

	// UScript Functions
	 bool                      rfNotifyCouponUseError ( int Time );              		//  GUIWarfare.BTPageServerSelection.rfNotifyCouponUseError
	 bool                      rfAckRecvClanInviteResult ( int Result, struct FString ErrMsg );		//  GUIWarfare.BTPageServerSelection.rfAckRecvClanInviteResult
	 bool                      BTWindowRequestClanHK_OnSuspend ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageServerSelection.BTWindowRequestClanHK_OnSuspend
	 bool                      BTWindowRequestClanHK_OnCancel ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageServerSelection.BTWindowRequestClanHK_OnCancel
	 bool                      BTWindowRequestClanHK_OnOK ( class UGUIComponent* Sender );		//  GUIWarfare.BTPageServerSelection.BTWindowRequestClanHK_OnOK
	 bool                      rfReqRecvClanInvite ( int InviterUserDBID, struct FString InviterCharname, struct FString ClanName, struct FString InviteMsg );		//  GUIWarfare.BTPageServerSelection.rfReqRecvClanInvite
	 bool                      rfReqNotifyShopItemDataEnd ( int Ver );           		//  GUIWarfare.BTPageServerSelection.rfReqNotifyShopItemDataEnd
