#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : GUIWarfare
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function GUIWarfare.BTConsole.ConsoleCMD
// Flags: [ FUNC_Exec ]
struct UBTConsole_execConsoleCMD_Parms
{
	struct FString                                     Line;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.SendQuestUpdate
// Flags: [ FUNC_Exec ]
struct UBTConsole_execSendQuestUpdate_Parms
{
};

// Function GUIWarfare.BTConsole.ShowTutorialEndWindow
// Flags: [ FUNC_Exec ]
struct UBTConsole_execShowTutorialEndWindow_Parms
{
};

// Function GUIWarfare.BTConsole.CheckTurorial_OnOK
// Flags: 
struct UBTConsole_execCheckTurorial_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTConsole.SetAdminSpec
// Flags: [ FUNC_Exec ]
struct UBTConsole_execSetAdminSpec_Parms
{
	int                                                B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.GetBot
// Flags: [ FUNC_Exec ]
struct UBTConsole_execGetBot_Parms
{
};

// Function GUIWarfare.BTConsole.SetBot
// Flags: [ FUNC_Exec ]
struct UBTConsole_execSetBot_Parms
{
	int                                                withBot;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                num0;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                num1;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Grade;                                            		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.LogBot
// Flags: [ FUNC_Exec ]
struct UBTConsole_execLogBot_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTConsole.UpdateAAS
// Flags: 
struct UBTConsole_execUpdateAAS_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTConsole.UpdateGameNotice
// Flags: 
struct UBTConsole_execUpdateGameNotice_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTConsole.UpdateConnection
// Flags: 
struct UBTConsole_execUpdateConnection_Parms
{
	float                                              Delta;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwGameManager*                               GameMgr;                                          		// 0x0004 ( 0x0004
	struct FBtrDouble                                  NextEventDouble;                                  		// 0x0008 ( 0x0008
	struct FBtrTime                                    NextEventTime;                                    		// 0x0010 ( 0x0020
	float                                              AppDelta;                                         		// 0x0030 ( 0x0004
};

// Function GUIWarfare.BTConsole.ProcessChatBan
// Flags: 
struct UBTConsole_execProcessChatBan_Parms
{
	float                                              Delta;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.ProcessOutOfSleep_InRoomLobby
// Flags: 
struct UBTConsole_execProcessOutOfSleep_InRoomLobby_Parms
{
	float                                              CurrKeySleepTime;                                 		// 0x0000 ( 0x0004
	int                                                iLKST;                                            		// 0x0004 ( 0x0004
	int                                                iCKST;                                            		// 0x0008 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x000C ( 0x0004
	class UwMatchMaker*                                MM;                                               		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTConsole.ProcessOutOfDoing_InRoomLobby
// Flags: 
struct UBTConsole_execProcessOutOfDoing_InRoomLobby_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTConsole.ProcessOutOfCounting
// Flags: 
struct UBTConsole_execProcessOutOfCounting_Parms
{
	int                                                MaxTime;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                CountTime;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                CountingMsgCode;                                  		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                OutMsgCode;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0010 ( 0x0004
	class UwMatchMaker*                                MM;                                               		// 0x0014 ( 0x0004
};

// Function GUIWarfare.BTConsole.IsInRoomLobby
// Flags: 
struct UBTConsole_execIsInRoomLobby_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.ProcessOutOfSeat
// Flags: 
struct UBTConsole_execProcessOutOfSeat_Parms
{
	float                                              Delta;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FMessageItem                                msgItem;                                          		// 0x0004 ( 0x0020[ CPF_NeedCtorLink ]
	float                                              CurrKeySleepTime;                                 		// 0x0024 ( 0x0004
	int                                                iLKST;                                            		// 0x0028 ( 0x0004
	int                                                iCKST;                                            		// 0x002C ( 0x0004
	class UwMatchMaker*                                MM;                                               		// 0x0030 ( 0x0004
};

// Function GUIWarfare.BTConsole.IsExceptionOutOfSeat
// Flags: 
struct UBTConsole_execIsExceptionOutOfSeat_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTConsole.Tick
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct UBTConsole_eventTick_Parms
{
	float                                              Delta;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.SetTermBetweenBGM
// Flags: 
struct UBTConsole_execSetTermBetweenBGM_Parms
{
	float                                              val;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.UpdateBGM
// Flags: 
struct UBTConsole_execUpdateBGM_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                elapsed;                                          		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.IsBGMPlaying
// Flags: 
struct UBTConsole_execIsBGMPlaying_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTConsole.StopBGM
// Flags: 
struct UBTConsole_execStopBGM_Parms
{
};

// Function GUIWarfare.BTConsole.NextBGM
// Flags: 
struct UBTConsole_execNextBGM_Parms
{
	int                                                InitialSeekTime;                                  		// 0x0000 ( 0x0004
	int                                                initialSeekIdx;                                   		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.SetBGMAdvanced
// Flags: 
struct UBTConsole_execSetBGMAdvanced_Parms
{
	class TArray< struct FString >                     List;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      partialPlay:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                partialDuration;                                  		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class TArray< struct FIntArray >                   initialSeeks;                                     		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x0020 ( 0x0004
};

// Function GUIWarfare.BTConsole.SetBGM
// Flags: 
struct UBTConsole_execSetBGM_Parms
{
	class TArray< struct FString >                     List;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.SetOneBGM
// Flags: 
struct UBTConsole_execSetOneBGM_Parms
{
	struct FString                                     List;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Arr;                                              		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.GetCurrentBGM
// Flags: 
struct UBTConsole_execGetCurrentBGM_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.SwitchChatMessageType
// Flags: 
struct UBTConsole_execSwitchChatMessageType_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.CallChatWhisper
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCallChatWhisper_Parms
{
};

// Function GUIWarfare.BTConsole.CallChatClan
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCallChatClan_Parms
{
};

// Function GUIWarfare.BTConsole.CallChatTeam
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCallChatTeam_Parms
{
};

// Function GUIWarfare.BTConsole.CallChatAll
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCallChatAll_Parms
{
};

// Function GUIWarfare.BTConsole.CallChatMode
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCallChatMode_Parms
{
};

// Function GUIWarfare.BTConsole.SetChatHelpString
// Flags: 
struct UBTConsole_execSetChatHelpString_Parms
{
	struct FString                                     F2;                                               		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     F3;                                               		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     F4;                                               		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     F5;                                               		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< struct FString >                     arrStr;                                           		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< struct FString >                     arrStr2;                                          		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
	class UGUIController*                              C;                                                		// 0x0048 ( 0x0004
};

// Function GUIWarfare.BTConsole.OnIME_Notify
// Flags: [ FUNC_Event ]
struct UBTConsole_eventOnIME_Notify_Parms
{
	int                                                Type;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                LangID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     strText;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                StartPos;                                         		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Size;                                             		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTConsole.NeedToOffIME
// Flags: [ FUNC_Event ]
struct UBTConsole_eventNeedToOffIME_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTConsole.DownloadWebzenShop
// Flags: [ FUNC_Exec ]
struct UBTConsole_execDownloadWebzenShop_Parms
{
	class UwGameManager*                               GameMgr;                                          		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTConsole.CompletedQuest
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCompletedQuest_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.SendMessage
// Flags: 
struct UBTConsole_execSendMessage_Parms
{
	struct FMessageItem                                msgItem;                                          		// 0x0000 ( 0x0020[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     RecvMsg;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     TeamName;                                         		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0038 ( 0x0004
	class AGameReplicationInfo*                        GRI;                                              		// 0x003C ( 0x0004
	unsigned long                                      bGhostChatting:1;                                 		// 0x0040 ( 0x0004 [0x00000001]
	class UwMatchMaker*                                MM;                                               		// 0x0044 ( 0x0004
};

// Function GUIWarfare.BTConsole.ClearMessageItems
// Flags: 
struct UBTConsole_execClearMessageItems_Parms
{
};

// Function GUIWarfare.BTConsole.AddMessageItem
// Flags: 
struct UBTConsole_execAddMessageItem_Parms
{
	struct FMessageItem                                Item;                                             		// 0x0000 ( 0x0020[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.ConstructMessageItem
// Flags: 
struct UBTConsole_execConstructMessageItem_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      MessageType;                                      		// 0x000C ( 0x0001[ CPF_Parm ]
	struct FMessageItem                                ReturnValue;                                      		// 0x0010 ( 0x0020[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class FColor                                       TranslateColor;                                   		// 0x0030 ( 0x0004
//	struct FMessageItem                                Item;                                             		// 0x0034 ( 0x0020[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.ProhibitAltTab
// Flags: [ FUNC_Exec ]
struct UBTConsole_execProhibitAltTab_Parms
{
};

// Function GUIWarfare.BTConsole.AddSystemMessageSaveShot
// Flags: [ FUNC_Exec ]
struct UBTConsole_execAddSystemMessageSaveShot_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.AddSystemMessageRegulateShot
// Flags: [ FUNC_Exec ]
struct UBTConsole_execAddSystemMessageRegulateShot_Parms
{
};

// Function GUIWarfare.BTConsole.DrawMessageItems
// Flags: 
struct UBTConsole_execDrawMessageItems_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ratioX;                                           		// 0x0004 ( 0x0004
	float                                              ratioY;                                           		// 0x0008 ( 0x0004
	int                                                i;                                                		// 0x000C ( 0x0004
	int                                                Index;                                            		// 0x0010 ( 0x0004
	struct FMessageItem                                Item;                                             		// 0x0014 ( 0x0020[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.DrawTextChattingHelp
// Flags: 
struct UBTConsole_execDrawTextChattingHelp_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                X1;                                               		// 0x0004 ( 0x0004
	int                                                X2;                                               		// 0x0008 ( 0x0004
	int                                                Y1;                                               		// 0x000C ( 0x0004
	int                                                Y2;                                               		// 0x0010 ( 0x0004
	class FColor                                       color_Shadow;                                     		// 0x0014 ( 0x0004
	float                                              _reX;                                             		// 0x0018 ( 0x0004
	float                                              _reY;                                             		// 0x001C ( 0x0004
};

// Function GUIWarfare.BTConsole.DrawChatEditBox
// Flags: 
struct UBTConsole_execDrawChatEditBox_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                CurrentChatMode;                                  		// 0x0004 ( 0x0004
	int                                                TextSize;                                         		// 0x0008 ( 0x0004
	int                                                CompSize;                                         		// 0x000C ( 0x0004
	int                                                SelectSize;                                       		// 0x0010 ( 0x0004
	int                                                SelPosStart;                                      		// 0x0014 ( 0x0004
	struct FFloatBox                                   fbCursorBox;                                      		// 0x0018 ( 0x0010
	struct FFloatBox                                   fbSelection;                                      		// 0x0028 ( 0x0010
	struct FFloatBox                                   fbBox;                                            		// 0x0038 ( 0x0010
	struct FFloatBox                                   fbTemp;                                           		// 0x0048 ( 0x0010
	float                                              ratioX;                                           		// 0x0058 ( 0x0004
	float                                              ratioY;                                           		// 0x005C ( 0x0004
	struct FString                                     chatString;                                       		// 0x0060 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     tempString;                                       		// 0x006C ( 0x000C[ CPF_NeedCtorLink ]
	class FColor                                       clr;                                              		// 0x0078 ( 0x0004
};

// Function GUIWarfare.BTConsole.PostRender
// Flags: 
struct UBTConsole_execPostRender_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.PreRender
// Flags: 
struct UBTConsole_execPreRender_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.FontReset
// Flags: 
struct UBTConsole_execFontReset_Parms
{
};

// Function GUIWarfare.BTConsole.CallBattleHelp
// Flags: 
struct UBTConsole_execCallBattleHelp_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTConsole.CallSelectRadioMessage
// Flags: 
struct UBTConsole_execCallSelectRadioMessage_Parms
{
	int                                                iIndex;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.CallSelectQuickSlot
// Flags: 
struct UBTConsole_execCallSelectQuickSlot_Parms
{
	int                                                iIndex;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.CallToggleQuickSlot
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCallToggleQuickSlot_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTConsole.SetLoadingTime
// Flags: [ FUNC_Exec ]
struct UBTConsole_execSetLoadingTime_Parms
{
	int                                                L;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                P;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwMatchMaker*                                MM;                                               		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTConsole.CMDHK
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCMDHK_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     Param1;                                           		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     param3;                                           		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.StopQuestLog
// Flags: [ FUNC_Exec ]
struct UBTConsole_execStopQuestLog_Parms
{
};

// Function GUIWarfare.BTConsole.CloseWindow
// Flags: [ FUNC_Exec ]
struct UBTConsole_execCloseWindow_Parms
{
	int                                                Count;                                            		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTConsole.RecordOn_Exception
// Flags: 
struct UBTConsole_execRecordOn_Exception_Parms
{
	int                                                retCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.RecordOn_FnRun
// Flags: 
struct UBTConsole_execRecordOn_FnRun_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.RecordOn_OnOK
// Flags: 
struct UBTConsole_execRecordOn_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UDelegateEventTimer*                         det;                                              		// 0x0008 ( 0x0004
//	class UwGameManager*                               GameMgr;                                          		// 0x000C ( 0x0004
};

// Function GUIWarfare.BTConsole.RecordOn
// Flags: [ FUNC_Exec ]
struct UBTConsole_execRecordOn_Parms
{
	unsigned long                                      bCapture:1;                                       		// 0x0000 ( 0x0004 [0x00000001]
	unsigned long                                      bInGame:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
	unsigned long                                      bEnableRecord:1;                                  		// 0x0008 ( 0x0004 [0x00000001]
	class UGUIPage*                                    Page;                                             		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTConsole.ShowWindow
// Flags: [ FUNC_Exec ]
struct UBTConsole_execShowWindow_Parms
{
	struct FString                                     windowclassname;                                  		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.StartAutoMove
// Flags: [ FUNC_Exec ]
struct UBTConsole_execStartAutoMove_Parms
{
	int                                                Server;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Channel;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                gameroom;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.endTutorial
// Flags: [ FUNC_Exec ]
struct UBTConsole_execendTutorial_Parms
{
};

// Function GUIWarfare.BTConsole.tutorial
// Flags: [ FUNC_Exec ]
struct UBTConsole_exectutorial_Parms
{
	struct FString                                     Map;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.stopoos
// Flags: [ FUNC_Exec ]
struct UBTConsole_execstopoos_Parms
{
};

// Function GUIWarfare.BTConsole.BlockChangeWeapon
// Flags: 
struct UBTConsole_execBlockChangeWeapon_Parms
{
	int                                                nIndex;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0008 ( 0x0004
//	class UwWeaponBaseParams*                          WBP;                                              		// 0x000C ( 0x0004
//	class UwMyPlayerStatus*                            MyStatus;                                         		// 0x0010 ( 0x0004
//	int                                                iItemID;                                          		// 0x0014 ( 0x0004
//	class UwMatchMaker*                                kMM;                                              		// 0x0018 ( 0x0004
};

// Function GUIWarfare.BTConsole.IsHaveMainWeapon
// Flags: 
struct UBTConsole_execIsHaveMainWeapon_Parms
{
	int                                                nIndex;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0008 ( 0x0004
//	class UwMyPlayerStatus*                            MyStatus;                                         		// 0x000C ( 0x0004
//	int                                                iItemID;                                          		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTConsole.KeyEvent
// Flags: 
struct UBTConsole_execKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Action;                                           		// 0x0001 ( 0x0001[ CPF_Parm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FString >                     Bind_Fire;                                        		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     LocBind_Fire;                                     		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     Bind_QGr;                                         		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     LocBind_QGr;                                      		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     Bind_QSub;                                        		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     LocBind_QSub;                                     		// 0x0048 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                iFire;                                            		// 0x0054 ( 0x0004
//	int                                                iQGr;                                             		// 0x0058 ( 0x0004
//	int                                                iQSub;                                            		// 0x005C ( 0x0004
//	int                                                RandQSlot;                                        		// 0x0060 ( 0x0004
};

// Function GUIWarfare.BTConsole.KeyType
// Flags: 
struct UBTConsole_execKeyType_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     Unicode;                                          		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTConsole.GetChatEnabled
// Flags: 
struct UBTConsole_execGetChatEnabled_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTConsole.SetChatEnabled
// Flags: 
struct UBTConsole_execSetChatEnabled_Parms
{
	unsigned long                                      Value:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfare.BTConsole.ChatEditBox_OnInputSpace
// Flags: 
struct UBTConsole_execChatEditBox_OnInputSpace_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FChatInfo                                   ci;                                               		// 0x0010 ( 0x001C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTConsole.ChatEditBox_OnInputTab
// Flags: 
struct UBTConsole_execChatEditBox_OnInputTab_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.SendLogin
// Flags: 
struct UBTNetMainMenu_execSendLogin_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.OnAppExit
// Flags: 
struct UBTNetMainMenu_execOnAppExit_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithGlobal_Test
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithGlobal_Test_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithGlobal_Live
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithGlobal_Live_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                webLogFailCode;                                   		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithThailand_Test
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithThailand_Test_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithThailand_Live
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithThailand_Live_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithWZAuth_Test
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithWZAuth_Test_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      wzp_AccountType;                                  		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      wzp_IsBlock;                                      		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned char                                      wzp_AuthKeySuccess;                               		// 0x0006 ( 0x0001[ CPF_Parm ]
	unsigned char                                      ChannelType;                                      		// 0x0007 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithWZAuth_Live
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithWZAuth_Live_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      wzp_AccountType;                                  		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      wzp_IsBlock;                                      		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned char                                      wzp_AuthKeySuccess;                               		// 0x0006 ( 0x0001[ CPF_Parm ]
	unsigned char                                      ChannelType;                                      		// 0x0007 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithTencentAuth_Test
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithTencentAuth_Test_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      tc_AccountType;                                   		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      tc_IsBlock;                                       		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckLoginWithTencentAuth_Live
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckLoginWithTencentAuth_Live_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      tc_AccountType;                                   		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      tc_IsBlock;                                       		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.RequestUpdateQuickSlot
// Flags: 
struct UBTNetMainMenu_execRequestUpdateQuickSlot_Parms
{
	int                                                iQuickSlotIdx;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                arQslotID;                                        		// 0x0004 ( 0x0004
	int                                                arSkill1;                                         		// 0x0008 ( 0x0004
	int                                                arSkill2;                                         		// 0x000C ( 0x0004
	int                                                arSkill3;                                         		// 0x0010 ( 0x0004
	int                                                arSkill4;                                         		// 0x0014 ( 0x0004
	struct FBtrDouble                                  arMWItemID;                                       		// 0x0018 ( 0x0008
	struct FBtrDouble                                  arPistolItemID;                                   		// 0x0020 ( 0x0008
	struct FBtrDouble                                  arTWItemID1;                                      		// 0x0028 ( 0x0008
	struct FBtrDouble                                  arTWItemID2;                                      		// 0x0030 ( 0x0008
	struct FString                                     arQslotName;                                      		// 0x0038 ( 0x000C[ CPF_NeedCtorLink ]
	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0044 ( 0x0004
	class UwGameManager*                               GameMgr;                                          		// 0x0048 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.UpdateSendQuickSlotIndex
// Flags: 
struct UBTNetMainMenu_execUpdateSendQuickSlotIndex_Parms
{
	int                                                iQuickSlotIndex;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.CheckMoveToChannel
// Flags: 
struct UBTNetMainMenu_execCheckMoveToChannel_Parms
{
	int                                                iServerIndex;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.CheckWebzenShopItemList
// Flags: 
struct UBTNetMainMenu_execCheckWebzenShopItemList_Parms
{
	class UwGameManager*                               GameMgr;                                          		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.UpdateWebzenShopItemList
// Flags: 
struct UBTNetMainMenu_execUpdateWebzenShopItemList_Parms
{
	int                                                Year;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                YearId;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                SalesZoneCode;                                    		// 0x0008 ( 0x0004[ CPF_Parm ]
	class UwGameManager*                               GameMgr;                                          		// 0x000C ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.ShowHelpWindow_OnOK
// Flags: 
struct UBTNetMainMenu_execShowHelpWindow_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.ShowHelpWindow
// Flags: 
struct UBTNetMainMenu_execShowHelpWindow_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.ShowReqCashWindow_OnOK
// Flags: 
struct UBTNetMainMenu_execShowReqCashWindow_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.ShowCashChargeWindow_OnOK
// Flags: 
struct UBTNetMainMenu_execShowCashChargeWindow_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.ShowCashChargeWindow
// Flags: 
struct UBTNetMainMenu_execShowCashChargeWindow_Parms
{
	struct FString                                     payURL;                                           		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.Internal_OnFunctionKey
// Flags: 
struct UBTNetMainMenu_execInternal_OnFunctionKey_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned char                                      FunctionKey;                                      		// 0x0004 ( 0x0001[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TPChat_ChangeTab_OnClickTemp
// Flags: 
struct UBTNetMainMenu_execTPChat_ChangeTab_OnClickTemp_Parms
{
	int                                                TabIndex;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.TPChat_ChangeTab_OnClick
// Flags: 
struct UBTNetMainMenu_execTPChat_ChangeTab_OnClick_Parms
{
	int                                                TabIndex;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.TPChat_OnChageChatMode
// Flags: 
struct UBTNetMainMenu_execTPChat_OnChageChatMode_Parms
{
	int                                                ChatMode;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.TPChat_OnInputTab
// Flags: 
struct UBTNetMainMenu_execTPChat_OnInputTab_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.TPChat_OnInputSpace
// Flags: 
struct UBTNetMainMenu_execTPChat_OnInputSpace_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FChatInfo                                   ci;                                               		// 0x0010 ( 0x001C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.Internal_OnChat
// Flags: 
struct UBTNetMainMenu_execInternal_OnChat_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FChatInfo                                   ci;                                               		// 0x0014 ( 0x001C[ CPF_NeedCtorLink ]
//	struct FString                                     SendWhisperMsg;                                   		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     filter;                                           		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.ChatBanEnd_OnTimer
// Flags: 
struct UBTNetMainMenu_execChatBanEnd_OnTimer_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.CheckChatBan
// Flags: 
struct UBTNetMainMenu_execCheckChatBan_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	float                                              sum;                                              		// 0x0008 ( 0x0004
//	class UwGameManager*                               GameMgr;                                          		// 0x000C ( 0x0004
//	class UDelegateEventTimer*                         det;                                              		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.UpdateChatBan
// Flags: 
struct UBTNetMainMenu_execUpdateChatBan_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FBtrDouble                                  D;                                                		// 0x0004 ( 0x0008
//	struct FBtrTime                                    t;                                                		// 0x000C ( 0x0020
//	class UwGameManager*                               GameMgr;                                          		// 0x002C ( 0x0004
//	int                                                i;                                                		// 0x0030 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.IsInClanChannel
// Flags: 
struct UBTNetMainMenu_execIsInClanChannel_Parms
{
	struct FString                                     ServerIP;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                serverPort;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ChannelID;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.IsInPageLobby
// Flags: 
struct UBTNetMainMenu_execIsInPageLobby_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.IsInPageServerSelection
// Flags: 
struct UBTNetMainMenu_execIsInPageServerSelection_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.IsGameReadyOrPlaying
// Flags: 
struct UBTNetMainMenu_execIsGameReadyOrPlaying_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.IsInRangeDate
// Flags: 
struct UBTNetMainMenu_execIsInRangeDate_Parms
{
	struct FBtrDouble                                  ServerTime;                                       		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                syear;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                smonth;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                sday;                                             		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                shour;                                            		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                smin;                                             		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                eyear;                                            		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                emonth;                                           		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                eday;                                             		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                ehour;                                            		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                emin;                                             		// 0x002C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0030 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FBtrTime                                    Time;                                             		// 0x0034 ( 0x0020
//	float                                              ssum;                                             		// 0x0054 ( 0x0004
//	float                                              esum;                                             		// 0x0058 ( 0x0004
//	float                                              sum;                                              		// 0x005C ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.Is18YearsOld
// Flags: 
struct UBTNetMainMenu_execIs18YearsOld_Parms
{
	struct FBtrDouble                                  ServerTime;                                       		// 0x0000 ( 0x0008[ CPF_Parm ]
	struct FString                                     BirthDay;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FBtrTime                                    Time;                                             		// 0x0018 ( 0x0020
//	int                                                cyear;                                            		// 0x0038 ( 0x0004
//	int                                                cmonth;                                           		// 0x003C ( 0x0004
//	int                                                cday;                                             		// 0x0040 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.UpdateTimeBatteryAAS
// Flags: 
struct UBTNetMainMenu_execUpdateTimeBatteryAAS_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.PopAASQueue
// Flags: 
struct UBTNetMainMenu_execPopAASQueue_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.GetAASFirstTime
// Flags: 
struct UBTNetMainMenu_execGetAASFirstTime_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.GetAASFirst
// Flags: 
struct UBTNetMainMenu_execGetAASFirst_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.PushAASQueue
// Flags: 
struct UBTNetMainMenu_execPushAASQueue_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              Time;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned char                                      AASLevel;                                         		// 0x0010 ( 0x0001[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.GetAASBeginTime
// Flags: 
struct UBTNetMainMenu_execGetAASBeginTime_Parms
{
	unsigned char                                      byLevel;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              DeltaTime;                                        		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.GetAASLevel
// Flags: 
struct UBTNetMainMenu_execGetAASLevel_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.SetAASMessage
// Flags: 
struct UBTNetMainMenu_execSetAASMessage_Parms
{
	unsigned char                                      byType;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                AccumTime;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      AASLevel;                                         		// 0x0008 ( 0x0001
	unsigned char                                      PreLevel;                                         		// 0x0009 ( 0x0001
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.ResetBatteryAAS
// Flags: 
struct UBTNetMainMenu_execResetBatteryAAS_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.UpdateTimeBatteryNotice
// Flags: 
struct UBTNetMainMenu_execUpdateTimeBatteryNotice_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.PopNoticeQueue
// Flags: 
struct UBTNetMainMenu_execPopNoticeQueue_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.GetNoticeFirst
// Flags: 
struct UBTNetMainMenu_execGetNoticeFirst_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.PushNoticeQueue
// Flags: 
struct UBTNetMainMenu_execPushNoticeQueue_Parms
{
	struct FString                                     Notice;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.ResetBatteryNotice
// Flags: 
struct UBTNetMainMenu_execResetBatteryNotice_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.TextToGMCommand
// Flags: 
struct UBTNetMainMenu_execTextToGMCommand_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FString >                     arrText;                                          		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     Content;                                          		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     content2;                                         		// 0x0028 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.TextToCommand
// Flags: 
struct UBTNetMainMenu_execTextToCommand_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FString >                     arrText;                                          		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     Content;                                          		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.UpdateChatLog
// Flags: 
struct UBTNetMainMenu_execUpdateChatLog_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                GCLTI;                                            		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.ResetChatLog
// Flags: 
struct UBTNetMainMenu_execResetChatLog_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.SelectChatLog
// Flags: 
struct UBTNetMainMenu_execSelectChatLog_Parms
{
	int                                                ChatType;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     chatText;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.BroadCastItemChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execBroadCastItemChatLog_Extra_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.TeamChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execTeamChatLog_Extra_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.SystemChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execSystemChatLog_Extra_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.SelfChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execSelfChatLog_Extra_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.WhisperChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execWhisperChatLog_Extra_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.ClanChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execClanChatLog_Extra_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.NormalChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execNormalChatLog_Extra_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.ClearChatLog_Extra
// Flags: 
struct UBTNetMainMenu_execClearChatLog_Extra_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.BroadCastItemChatLog
// Flags: 
struct UBTNetMainMenu_execBroadCastItemChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.TeamChatLog
// Flags: 
struct UBTNetMainMenu_execTeamChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.SystemChatLog
// Flags: 
struct UBTNetMainMenu_execSystemChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.SelfChatLog
// Flags: 
struct UBTNetMainMenu_execSelfChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.WhisperChatLog
// Flags: 
struct UBTNetMainMenu_execWhisperChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.ClanChatLog
// Flags: 
struct UBTNetMainMenu_execClanChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.NormalChatLog
// Flags: 
struct UBTNetMainMenu_execNormalChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.ClearChatLog
// Flags: 
struct UBTNetMainMenu_execClearChatLog_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.GetChatLogTopIndex
// Flags: 
struct UBTNetMainMenu_execGetChatLogTopIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.AddChatLog
// Flags: 
struct UBTNetMainMenu_execAddChatLog_Parms
{
	struct FString                                     chatText;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ChatType;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      bForceUpdateLast:1;                               		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.Exit_OnOK
// Flags: 
struct UBTNetMainMenu_execExit_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_rfAckHash
// Flags: 
struct UBTNetMainMenu_execTcpLogin_rfAckHash_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Error;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_OnError
// Flags: 
struct UBTNetMainMenu_execTcpLogin_OnError_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_OnClose
// Flags: 
struct UBTNetMainMenu_execTcpLogin_OnClose_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.TcpLogin_OnConnect
// Flags: 
struct UBTNetMainMenu_execTcpLogin_OnConnect_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.SetPage
// Flags: 
struct UBTNetMainMenu_execSetPage_Parms
{
	unsigned char                                      PageType;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      closeLastMenu:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	unsigned long                                      bExistPage:1;                                     		// 0x000C ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTNetMainMenu.HaltNetwork
// Flags: 
struct UBTNetMainMenu_execHaltNetwork_Parms
{
	unsigned long                                      resultChannel:1;                                  		// 0x0000 ( 0x0004 [0x00000001]
	unsigned long                                      resultLogin:1;                                    		// 0x0004 ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTNetMainMenu.rfReqForceNatTypeSetting
// Flags: [ FUNC_Event ]
struct UBTNetMainMenu_eventrfReqForceNatTypeSetting_Parms
{
	int                                                NatType;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.CheckNatPhrase2HK
// Flags: 
struct UBTNetMainMenu_execCheckNatPhrase2HK_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.CheckNatPhrase1HK
// Flags: 
struct UBTNetMainMenu_execCheckNatPhrase1HK_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.CheckNatPhrase0HK
// Flags: 
struct UBTNetMainMenu_execCheckNatPhrase0HK_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.StartNatCheck
// Flags: 
struct UBTNetMainMenu_execStartNatCheck_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.rfReqStartNatDiag
// Flags: [ FUNC_Event ]
struct UBTNetMainMenu_eventrfReqStartNatDiag_Parms
{
	struct FString                                     Server1Addr;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Server1Port;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     Server2Addr;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Server2Port;                                      		// 0x001C ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.deleOnClose
// Flags: 
struct UBTNetMainMenu_execdeleOnClose_Parms
{
	unsigned long                                      bCancelled:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.deleOnKeyEvent
// Flags: 
struct UBTNetMainMenu_execdeleOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.deleOnOpen
// Flags: 
struct UBTNetMainMenu_execdeleOnOpen_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.GetTcpLogin
// Flags: 
struct UBTNetMainMenu_execGetTcpLogin_Parms
{
	class UBTTcpLink_Login*                            ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTTcpLoginHandler*                          Login;                                            		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.InitializeTcpLogin
// Flags: 
struct UBTNetMainMenu_execInitializeTcpLogin_Parms
{
	struct FString                                     IP;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.InitializeTcpChannel
// Flags: 
struct UBTNetMainMenu_execInitializeTcpChannel_Parms
{
	struct FString                                     IP;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                DataPort;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.ShowPlayTimePerHour_OnEventTimer
// Flags: 
struct UBTNetMainMenu_execShowPlayTimePerHour_OnEventTimer_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.InitComponent
// Flags: 
struct UBTNetMainMenu_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     strTemp;                                          		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	unsigned long                                      bFind:1;                                          		// 0x0014 ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTNetMainMenu.KeepMoving
// Flags: 
struct UBTNetMainMenu_execKeepMoving_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.EndAutoMove
// Flags: 
struct UBTNetMainMenu_execEndAutoMove_Parms
{
	class UBTWindowHK*                                 BTWindow;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetMainMenu.StartAutoMove
// Flags: 
struct UBTNetMainMenu_execStartAutoMove_Parms
{
	int                                                Server;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Channel;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                gameroom;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     Password;                                         		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanMatch_EnterState;                             		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTNetGUIPageHK*                             currp;                                            		// 0x001C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetMainMenu.FindChannelNickName
// Flags: 
struct UBTNetMainMenu_execFindChannelNickName_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelID;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.FindServerShortName
// Flags: 
struct UBTNetMainMenu_execFindServerShortName_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelID;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.FindServerName
// Flags: 
struct UBTNetMainMenu_execFindServerName_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.FindServerConnectionInfoIndex
// Flags: 
struct UBTNetMainMenu_execFindServerConnectionInfoIndex_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelID;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.FindServerChannelInfoIndexByServerIP
// Flags: 
struct UBTNetMainMenu_execFindServerChannelInfoIndexByServerIP_Parms
{
	struct FString                                     ServerIP;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                serverPort;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ChannelID;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.AddServerChannelList
// Flags: 
struct UBTNetMainMenu_execAddServerChannelList_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelID;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ServerIP;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                serverPort;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ServerDataPort;                                   		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     ServerName;                                       		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ServerShortName;                                  		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ChannelName;                                      		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ServerGroupID;                                    		// 0x0040 ( 0x0004[ CPF_Parm ]
	struct FString                                     ServerGroupName;                                  		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                IsClanChannel;                                    		// 0x0050 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelNickName;                                  		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ChannelType;                                      		// 0x0060 ( 0x0004[ CPF_Parm ]
	unsigned long                                      IsDedicatedServer:1;                              		// 0x0064 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                nCurUser;                                         		// 0x0068 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                nMaxUser;                                         		// 0x006C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                AddIdx;                                           		// 0x0070 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.ClearServerChannelList
// Flags: 
struct UBTNetMainMenu_execClearServerChannelList_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.CheckItemWarning
// Flags: 
struct UBTNetMainMenu_execCheckItemWarning_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.CheckDestroyedDurabilityXItemList
// Flags: 
struct UBTNetMainMenu_execCheckDestroyedDurabilityXItemList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	struct FString                                     ddx;                                              		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.CheckDestroyedDurabilityXItemList_OnOK
// Flags: 
struct UBTNetMainMenu_execCheckDestroyedDurabilityXItemList_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.CompleteDestroyedDurabilityXItemList
// Flags: 
struct UBTNetMainMenu_execCompleteDestroyedDurabilityXItemList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.CheckDurabilityWarningItemList
// Flags: 
struct UBTNetMainMenu_execCheckDurabilityWarningItemList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0008 ( 0x0004
//	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x000C ( 0x0004
//	class TArray< struct FBtrDouble >                  repairuid;                                        		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	class UwGameManager*                               GameMgr;                                          		// 0x001C ( 0x0004
//	class TArray< struct FBtrDouble >                  A;                                                		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< int >                                B;                                                		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTNetMainMenu.CheckExpiredItemList
// Flags: 
struct UBTNetMainMenu_execCheckExpiredItemList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	class UBTWindowItemExpiredHK*                      BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	class UwMatchMaker*                                MM;                                               		// 0x000C ( 0x0004
//	unsigned char                                      Dest;                                             		// 0x0010 ( 0x0001
//	class UwGameManager*                               GameMgr;                                          		// 0x0014 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.CompleteExpiredItem
// Flags: 
struct UBTNetMainMenu_execCompleteExpiredItem_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.AddExpiredSkillItem
// Flags: 
struct UBTNetMainMenu_execAddExpiredSkillItem_Parms
{
	int                                                ItemID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UniqueID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                SlotPos;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.AddExpiredItem
// Flags: 
struct UBTNetMainMenu_execAddExpiredItem_Parms
{
	int                                                ItemID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FBtrDouble                                  UniqueID;                                         		// 0x0004 ( 0x0008[ CPF_Parm ]
	int                                                SlotPos;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                PartID;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.CompleteDurabilityWarningItem
// Flags: 
struct UBTNetMainMenu_execCompleteDurabilityWarningItem_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.AddDurabilityWarningItemRepairCost
// Flags: 
struct UBTNetMainMenu_execAddDurabilityWarningItemRepairCost_Parms
{
	struct FBtrDouble                                  UniqueID;                                         		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                RepairCost;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x000C ( 0x0004
	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.AddDurabilityWarningItem
// Flags: 
struct UBTNetMainMenu_execAddDurabilityWarningItem_Parms
{
	struct FBtrDouble                                  UniqueID;                                         		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                ItemID;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                SlotPos;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                PartID;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                Durability;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.LoginToChannel
// Flags: 
struct UBTNetMainMenu_execLoginToChannel_Parms
{
	struct FString                                     IP;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                DataPort;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.ChannelToLogin2
// Flags: 
struct UBTNetMainMenu_execChannelToLogin2_Parms
{
	struct FString                                     IP;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.ChannelToLogin
// Flags: 
struct UBTNetMainMenu_execChannelToLogin_Parms
{
	struct FString                                     IP;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	class UDelegateEventTimer*                         det;                                              		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTNetMainMenu.ChannelToLogin_OnEventTimer
// Flags: 
struct UBTNetMainMenu_execChannelToLogin_OnEventTimer_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.UpdateWebzenInvenListEnd
// Flags: 
struct UBTNetMainMenu_execUpdateWebzenInvenListEnd_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetMainMenu.UpdateWebzenInvenList
// Flags: 
struct UBTNetMainMenu_execUpdateWebzenInvenList_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetMainMenu.StopWebzenInvenList
// Flags: 
struct UBTNetMainMenu_execStopWebzenInvenList_Parms
{
};

// Function GUIWarfare.BTNetMainMenu.sfReqWebzenInvenList
// Flags: 
struct UBTNetMainMenu_execsfReqWebzenInvenList_Parms
{
	struct FString                                     StorageType;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetMainMenu.SetNewMailArrived
// Flags: 
struct UBTNetMainMenu_execSetNewMailArrived_Parms
{
	unsigned long                                      B:1;                                              		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function GUIWarfare.BTNetMainMenu.UpdateDurabilityWarningItemList
// Flags: 
struct UBTNetMainMenu_execUpdateDurabilityWarningItemList_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetMainMenu.UpdateExpiredItemList
// Flags: 
struct UBTNetMainMenu_execUpdateExpiredItemList_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetMainMenu.UpdateRecv_ClanInfo
// Flags: 
struct UBTNetMainMenu_execUpdateRecv_ClanInfo_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetMainMenu.delegateCheckNat
// Flags: 
struct UBTNetMainMenu_execdelegateCheckNat_Parms
{
};

// Function GUIWarfare.BTNetGUIPage.OnCompleteOpened
// Flags: 
struct UBTNetGUIPage_execOnCompleteOpened_Parms
{
};

// Function GUIWarfare.BTNetGUIPage.OnBackToLastPage
// Flags: 
struct UBTNetGUIPage_execOnBackToLastPage_Parms
{
};

// Function GUIWarfare.BTNetGUIPage.ProcessNat
// Flags: 
struct UBTNetGUIPage_execProcessNat_Parms
{
};

// Function GUIWarfare.BTNetGUIPage.InternalOnPreDraw
// Flags: 
struct UBTNetGUIPage_execInternalOnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetGUIPage.MyCanClose
// Flags: 
struct UBTNetGUIPage_execMyCanClose_Parms
{
	unsigned long                                      bCanceled:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetGUIPage.Opened
// Flags: [ FUNC_Event ]
struct UBTNetGUIPage_eventOpened_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetGUIPage.GetTcpLogin
// Flags: 
struct UBTNetGUIPage_execGetTcpLogin_Parms
{
	class UBTTcpLink_Login*                            ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetGUIPage.GetTcpChannel
// Flags: 
struct UBTNetGUIPage_execGetTcpChannel_Parms
{
	class UBTTcpLink_Channel*                          ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetGUIPage.InitComponent
// Flags: 
struct UBTNetGUIPage_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetGUIPage.TextToChatInfo
// Flags: 
struct UBTNetGUIPage_execTextToChatInfo_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FChatInfo                                   ReturnValue;                                      		// 0x000C ( 0x001C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FChatInfo                                   ci;                                               		// 0x0028 ( 0x001C[ CPF_NeedCtorLink ]
//	class TArray< struct FString >                     FormatString;                                     		// 0x0044 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0050 ( 0x0004
//	int                                                j;                                                		// 0x0054 ( 0x0004
};

// Function GUIWarfare.BTNetGUIPage.RefreshPage
// Flags: 
struct UBTNetGUIPage_execRefreshPage_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.CheckEnterRoom_InClanChannel
// Flags: 
struct UBTPageRoomLobby_execCheckEnterRoom_InClanChannel_Parms
{
	struct FString                                     szClanName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0010 ( 0x0004
//	struct FString                                     szInRoomClanName[ 0x02 ];                         		// 0x0014 ( 0x0018[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.MakeTeamMemberData
// Flags: 
struct UBTPageRoomLobby_execMakeTeamMemberData_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ClanMark;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Level;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     NickName;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Status;                                           		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                Host;                                             		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                Ping;                                             		// 0x0034 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserIP;                                           		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      LookingFor;                                       		// 0x0044 ( 0x0001[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                TeamNum;                                          		// 0x0054 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0058 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x005C ( 0x0004[ CPF_Parm ]
	unsigned long                                      bMe:1;                                            		// 0x0060 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bisGM:1;                                          		// 0x0064 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UBTAutoColumnListDataHK*                     ReturnValue;                                      		// 0x0068 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTAutoColumnListDataHK*                     Data;                                             		// 0x006C ( 0x0004
//	int                                                i;                                                		// 0x0070 ( 0x0004
//	class UwGameManager*                               GameMgr;                                          		// 0x0074 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.SaveUserData
// Flags: 
struct UBTPageRoomLobby_execSaveUserData_Parms
{
	class UBTAutoColumnListDataHK*                     Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                idx;                                              		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfNotifyClanLevelup
// Flags: 
struct UBTPageRoomLobby_execrfNotifyClanLevelup_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Levelup;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfNotifyNewClanName
// Flags: 
struct UBTPageRoomLobby_execrfNotifyNewClanName_Parms
{
	struct FString                                     New_NickName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfNotifyNewNickName
// Flags: 
struct UBTPageRoomLobby_execrfNotifyNewNickName_Parms
{
	int                                                Community_Type;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Old_NickName;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     New_NickName;                                     		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetRankingInfoListEnd
// Flags: 
struct UBTPageRoomLobby_execrfAckGetRankingInfoListEnd_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetRankingInfoList
// Flags: 
struct UBTPageRoomLobby_execrfAckGetRankingInfoList_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RankingType;                                      		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CommunityType;                                    		// 0x0005 ( 0x0001[ CPF_Parm ]
	class TArray< struct FString >                     CharName;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CharLevel;                                        		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkPattern;                                  		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBG;                                       		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBL;                                       		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum;                                    		// 0x0050 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum_Prev;                               		// 0x005C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum_Exp;                                		// 0x0068 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x0074 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x0080 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x008C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x0098 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00A4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00B0 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetRankingInfoListStart
// Flags: 
struct UBTPageRoomLobby_execrfAckGetRankingInfoListStart_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RankingType;                                      		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CommunityType;                                    		// 0x0005 ( 0x0001[ CPF_Parm ]
	int                                                TotalCount;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckFriendPosition
// Flags: 
struct UBTPageRoomLobby_execrfAckFriendPosition_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     TargetCharName;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ServerType;                                       		// 0x0010 ( 0x0001[ CPF_Parm ]
	struct FString                                     fServername;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fServerShortName;                                 		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fServerIP;                                        		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                fServerPort;                                      		// 0x0038 ( 0x0004[ CPF_Parm ]
	unsigned char                                      CurPos;                                           		// 0x003C ( 0x0001[ CPF_Parm ]
	unsigned char                                      CurState;                                         		// 0x003D ( 0x0001[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0040 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelNickName;                                  		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameRoomNum;                                      		// 0x0050 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0054 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTCMMessengerOnOffline*                     CCM;                                              		// 0x0058 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTACLMessengerCommon*                       acl;                                              		// 0x005C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckNotifyUpdateCharInfo_LevelMark
// Flags: 
struct UBTPageRoomLobby_execrfAckNotifyUpdateCharInfo_LevelMark_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                LevelMarkID;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfReqInGameRoomUserClanLevelChanged
// Flags: 
struct UBTPageRoomLobby_execrfReqInGameRoomUserClanLevelChanged_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfReqInGameRoomUserInfoChanged
// Flags: 
struct UBTPageRoomLobby_execrfReqInGameRoomUserInfoChanged_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckNotifyAdjustClanMemberGrade
// Flags: 
struct UBTPageRoomLobby_execrfAckNotifyAdjustClanMemberGrade_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      CharGrade;                                        		// 0x0018 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.UserPingRefresh
// Flags: 
struct UBTPageRoomLobby_execUserPingRefresh_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.SendPingToAll
// Flags: 
struct UBTPageRoomLobby_execSendPingToAll_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.sfReqRoomUserPingInfo
// Flags: 
struct UBTPageRoomLobby_execsfReqRoomUserPingInfo_Parms
{
	int                                                HostScore;                                        		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.OnReceivedPing
// Flags: 
struct UBTPageRoomLobby_execOnReceivedPing_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     fromAddr;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                msec;                                             		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                nIdx;                                             		// 0x0014 ( 0x0004
	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckRoomUserPingInfo
// Flags: 
struct UBTPageRoomLobby_execrfAckRoomUserPingInfo_Parms
{
	class TArray< int >                                UnqueID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ping;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostScore;                                        		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0020 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangedRoomTitle_FromGM
// Flags: 
struct UBTPageRoomLobby_execrfAckChangedRoomTitle_FromGM_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RoomNumber;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewRoomTitle;                                     		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckCheckEquipedWeaponDurability
// Flags: 
struct UBTPageRoomLobby_execrfAckCheckEquipedWeaponDurability_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< struct FBtrDouble >                  ItemUniqueID;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemSlotNum;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0020 ( 0x0004
//	int                                                Priority;                                         		// 0x0024 ( 0x0004
//	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0028 ( 0x0004
//	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x002C ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.ButtonTemp_OnClick
// Flags: 
struct UBTPageRoomLobby_execButtonTemp_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetBotID
// Flags: 
struct UBTPageRoomLobby_execrfAckGetBotID_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RequestedAFCount;                                 		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      RequestedRSACount;                                		// 0x0005 ( 0x0001[ CPF_Parm ]
	class TArray< int >                                AFBotID;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                RSABotID;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckAutoChangedTeamUserList
// Flags: 
struct UBTPageRoomLobby_execrfAckAutoChangedTeamUserList_Parms
{
	class TArray< int >                                UserID;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TeamNum;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x001C ( 0x0004
//	int                                                j;                                                		// 0x0020 ( 0x0004
//	int                                                PrevTeam;                                         		// 0x0024 ( 0x0004
//	class UwMatchUserInfo*                             mui;                                              		// 0x0028 ( 0x0004
//	class UBTAutoColumnListDataHK*                     Data;                                             		// 0x002C ( 0x0004
//	unsigned long                                      IsGM:1;                                           		// 0x0030 ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTPageRoomLobby.FindTeamNumInArray
// Flags: 
struct UBTPageRoomLobby_execFindTeamNumInArray_Parms
{
	class TArray< int >                                UserID;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TeamNum;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                FindUserID;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x001C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0020 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfReqRecvForceFailedClientLoading
// Flags: 
struct UBTPageRoomLobby_execrfReqRecvForceFailedClientLoading_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckStartHolePunching
// Flags: 
struct UBTPageRoomLobby_execrfAckStartHolePunching_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameType;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ReqStartUserID;                                   		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckRegisterMyUdpInfo
// Flags: 
struct UBTPageRoomLobby_execrfAckRegisterMyUdpInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckNotifyMyCharInfoToRoomUser
// Flags: 
struct UBTPageRoomLobby_execrfAckNotifyMyCharInfoToRoomUser_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                UID;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserName;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Grade;                                            		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                TeamNum;                                          		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Statue;                                           		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsHost;                                           		// 0x0029 ( 0x0001[ CPF_Parm ]
	struct FString                                     UserIP;                                           		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                CM_Pattern;                                       		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                CM_BG;                                            		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                CM_BL;                                            		// 0x004C ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookFor;                                        		// 0x0050 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0054 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0058 ( 0x0004
//	int                                                Index;                                            		// 0x005C ( 0x0004
//	struct FString                                     RecvClanName;                                     		// 0x0060 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqNotifyDisconnectHostInLoading
// Flags: 
struct UBTPageRoomLobby_execrfReqNotifyDisconnectHostInLoading_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostID;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqRecvDeleteFriend
// Flags: 
struct UBTPageRoomLobby_execrfReqRecvDeleteFriend_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     FromCharName;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     RecvMsg;                                          		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckDeleteFriend
// Flags: 
struct UBTPageRoomLobby_execrfAckDeleteFriend_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< struct FString >                     FailedCharname;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChannelUserListInGameRoom
// Flags: 
struct UBTPageRoomLobby_execrfAckChannelUserListInGameRoom_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                TotalCount;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                StartIndex;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	class TArray< int >                                UID;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     CharName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                UserLevel;                                        		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanPattern;                                      		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanBG;                                           		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanBL;                                           		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsLookForClan;                                    		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x0070 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x007C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x0088 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x0094 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x00A0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00AC ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00B8 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x00BC ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChatWispher
// Flags: 
struct UBTPageRoomLobby_execrfAckChatWispher_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ToCharName;                                       		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     RecvMsg;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckAcquirePromotionItems
// Flags: 
struct UBTPageRoomLobby_execrfAckAcquirePromotionItems_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  ItemUniqueID;                                     		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemIDs;                                          		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PartIDs;                                          		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0038 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x003C ( 0x0004
//	unsigned long                                      bRecvPoint:1;                                     		// 0x0040 ( 0x0004 [0x00000001]
//	unsigned long                                      bRecvItem:1;                                      		// 0x0044 ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqNotifyLevelUp
// Flags: 
struct UBTPageRoomLobby_execrfReqNotifyLevelUp_Parms
{
	int                                                LevelUpUserID;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Level;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Exp;                                              		// 0x0008 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ItemID;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PartID;                                           		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0028 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckRecvJoinClanResult
// Flags: 
struct UBTPageRoomLobby_execrfAckRecvJoinClanResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckJoinClanResult
// Flags: 
struct UBTPageRoomLobby_execrfAckJoinClanResult_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Permit;                                           		// 0x000C ( 0x0001[ CPF_Parm ]
	struct FString                                     PermitCharName;                                   		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     Message;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowRequestApprovalClanHK_OnSuspend
// Flags: 
struct UBTPageRoomLobby_execBTWindowRequestApprovalClanHK_OnSuspend_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowRequestApprovalClanHK*              BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowRequestApprovalClanHK_OnCancel
// Flags: 
struct UBTPageRoomLobby_execBTWindowRequestApprovalClanHK_OnCancel_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowRequestApprovalClanHK*              BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowRequestApprovalClanHK_OnOK
// Flags: 
struct UBTPageRoomLobby_execBTWindowRequestApprovalClanHK_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowRequestApprovalClanHK*              BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqRecvJoinClan
// Flags: 
struct UBTPageRoomLobby_execrfReqRecvJoinClan_Parms
{
	int                                                UserIdx;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     CharName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Message;                                          		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     RecvMsg;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	class UBTWindowRequestApprovalClanHK*              BTWindow;                                         		// 0x002C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckNotifyClanSecession
// Flags: 
struct UBTPageRoomLobby_execrfAckNotifyClanSecession_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FMessageItem                                msgItem;                                          		// 0x001C ( 0x0020[ CPF_NeedCtorLink ]
//	struct FString                                     Message;                                          		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckNotifyNewClanMember
// Flags: 
struct UBTPageRoomLobby_execrfAckNotifyNewClanMember_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     Message;                                          		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckSearchClan
// Flags: 
struct UBTPageRoomLobby_execrfAckSearchClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TotalPage;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ClanMarkPattern;                                  		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBG;                                       		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ClanMarkBL;                                       		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanMaster;                                       		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMember;                                       		// 0x0050 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMemberMax;                                    		// 0x005C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanCreateDate;                                   		// 0x0068 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanWin;                                          		// 0x0074 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLose;                                         		// 0x0080 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanDraw;                                         		// 0x008C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanRank;                                         		// 0x0098 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ClanRecruit;                                      		// 0x00A4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x00B0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00BC ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowFindClanHK*                         BTWindow;                                         		// 0x00C0 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckRecvClanInviteResult
// Flags: 
struct UBTPageRoomLobby_execrfAckRecvClanInviteResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.IsGameReadyOrPlaying
// Flags: 
struct UBTPageRoomLobby_execIsGameReadyOrPlaying_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckInviteClanResult
// Flags: 
struct UBTPageRoomLobby_execrfAckInviteClanResult_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Permit;                                           		// 0x000C ( 0x0001[ CPF_Parm ]
	struct FString                                     ClanNm;                                           		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     Message;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowDefineSelectHK_23_OnOK
// Flags: 
struct UBTPageRoomLobby_execBTWindowDefineSelectHK_23_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqRecvClanInvite
// Flags: 
struct UBTPageRoomLobby_execrfReqRecvClanInvite_Parms
{
	int                                                InviterUserDBID;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     InviterCharname;                                  		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InviteMsg;                                        		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     RecvMsg;                                          		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckJoinClan
// Flags: 
struct UBTPageRoomLobby_execrfAckJoinClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     SpecificCharName;                                 		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     RealRecvCharName;                                 		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      RealRecvCharClanGrade;                            		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckInviteClan
// Flags: 
struct UBTPageRoomLobby_execrfAckInviteClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateRecv_ClanInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateRecv_ClanInfo_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTWindowRequestClanHK*                      BTWindow;                                         		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowUserPersonalInfo_OnClanInfo
// Flags: 
struct UBTPageRoomLobby_execBTWindowUserPersonalInfo_OnClanInfo_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowUserDetailInfoHK_OnClanInfo
// Flags: 
struct UBTPageRoomLobby_execBTWindowUserDetailInfoHK_OnClanInfo_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     ClanName;                                         		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqClanCharPersonelIntro
// Flags: 
struct UBTPageRoomLobby_execrfReqClanCharPersonelIntro_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckClanCharPersonelIntro
// Flags: 
struct UBTPageRoomLobby_execrfAckClanCharPersonelIntro_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     PersonelIntro;                                    		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckCharDetailInfo
// Flags: 
struct UBTPageRoomLobby_execrfAckCharDetailInfo_Parms
{
	int                                                MaxSerial;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MaxScore;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MaxKill;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                MaxAssist;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Serial3;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                Serial5;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Serial7;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                Serial10;                                         		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                Serial15;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                AR;                                               		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                SMG;                                              		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                SR;                                               		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                SW;                                               		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                Melee;                                            		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                Grenade;                                          		// 0x0038 ( 0x0004[ CPF_Parm ]
	int                                                FlashBang;                                        		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                Foot;                                             		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                AT4;                                              		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                MG;                                               		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Fire;                                             		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                RPG7;                                             		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                TimeBomb;                                         		// 0x0054 ( 0x0004[ CPF_Parm ]
	int                                                IcendiaryBomb;                                    		// 0x0058 ( 0x0004[ CPF_Parm ]
	int                                                ClusterBomb;                                      		// 0x005C ( 0x0004[ CPF_Parm ]
	int                                                ByChopper;                                        		// 0x0060 ( 0x0004[ CPF_Parm ]
	int                                                Artillery;                                        		// 0x0064 ( 0x0004[ CPF_Parm ]
	int                                                KillChopper;                                      		// 0x0068 ( 0x0004[ CPF_Parm ]
	int                                                FirstKill;                                        		// 0x006C ( 0x0004[ CPF_Parm ]
	int                                                LastKill;                                         		// 0x0070 ( 0x0004[ CPF_Parm ]
	int                                                AllKill;                                          		// 0x0074 ( 0x0004[ CPF_Parm ]
	int                                                Dominate;                                         		// 0x0078 ( 0x0004[ CPF_Parm ]
	int                                                InstallBomb;                                      		// 0x007C ( 0x0004[ CPF_Parm ]
	int                                                DefuseBomb;                                       		// 0x0080 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0084 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckDBCharInfo
// Flags: 
struct UBTPageRoomLobby_execrfAckDBCharInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                CM_Pattern;                                       		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                CM_BG;                                            		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                CM_BL;                                            		// 0x0030 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanPersonIntro;                                  		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                MainWeaponItemID;                                 		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                MainWeaponPartID;                                 		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponItemID;                                  		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponPartID;                                  		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                AFSpecialCostumeItemID;                           		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                RSASpecialCostumeItemID;                          		// 0x0054 ( 0x0004[ CPF_Parm ]
	struct FCharInfo                                   stCharInfo;                                       		// 0x0058 ( 0x00C0[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0118 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x011C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowRequestApprovalClanHK*              BTWindow;                                         		// 0x0120 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.MoveToClanPage_OnOK
// Flags: 
struct UBTPageRoomLobby_execMoveToClanPage_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckCreateClan
// Flags: 
struct UBTPageRoomLobby_execrfAckCreateClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                StackCount;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckDupCheckClanName
// Flags: 
struct UBTPageRoomLobby_execrfAckDupCheckClanName_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetIsHostBlocking
// Flags: 
struct UBTPageRoomLobby_execrfAckGetIsHostBlocking_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Blocking;                                         		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckNotifyHostBlocking
// Flags: 
struct UBTPageRoomLobby_execrfAckNotifyHostBlocking_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Blocking;                                         		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetHolePunchingResult
// Flags: 
struct UBTPageRoomLobby_execrfAckGetHolePunchingResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Phrase;                                           		// 0x0004 ( 0x0001[ CPF_Parm ]
	int                                                InterventionUserID;                               		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Intervention;                                     		// 0x000C ( 0x0001[ CPF_Parm ]
	class TArray< int >                                FailedUserIDs;                                    		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetUserHostPriorityPoint
// Flags: 
struct UBTPageRoomLobby_execrfAckGetUserHostPriorityPoint_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                HostPriorityPoint;                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwMatchUserInfo*                             UserInfo;                                         		// 0x0010 ( 0x0004
//	struct FString                                     UserName;                                         		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowChangeHost_OnCancel
// Flags: 
struct UBTPageRoomLobby_execBTWindowChangeHost_OnCancel_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowChangeHost_OnOK
// Flags: 
struct UBTPageRoomLobby_execBTWindowChangeHost_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqRecvForceDisconnectUDPFromHost
// Flags: 
struct UBTPageRoomLobby_execrfReqRecvForceDisconnectUDPFromHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckForceDisconnectUDPFromHost
// Flags: 
struct UBTPageRoomLobby_execrfAckForceDisconnectUDPFromHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqNotifyChangeRoomState
// Flags: 
struct UBTPageRoomLobby_execrfReqNotifyChangeRoomState_Parms
{
	unsigned char                                      RoomState;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckBanUser
// Flags: 
struct UBTPageRoomLobby_execrfAckBanUser_Parms
{
	int                                                GameNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UID;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                BanUID;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.TPTeamList_OnPopupCheck
// Flags: 
struct UBTPageRoomLobby_execTPTeamList_OnPopupCheck_Parms
{
	class UBTACLTeamMemberListHK*                      acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMTeamMemberListHK*                       cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.TPTeamList_OnPopup
// Flags: 
struct UBTPageRoomLobby_execTPTeamList_OnPopup_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLTeamMemberListHK*                      acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupBan
// Flags: 
struct UBTPageRoomLobby_execOnPopupBan_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerBanHK*                        acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupBanCheck
// Flags: 
struct UBTPageRoomLobby_execOnPopupBanCheck_Parms
{
	class UBTACLMessengerBanHK*                        acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerBanHK*                         cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupPCBang
// Flags: 
struct UBTPageRoomLobby_execOnPopupPCBang_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerPCBangHK*                     acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupPCBangCheck
// Flags: 
struct UBTPageRoomLobby_execOnPopupPCBangCheck_Parms
{
	class UBTACLMessengerPCBangHK*                     acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerPCBangHK*                      cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupClan
// Flags: 
struct UBTPageRoomLobby_execOnPopupClan_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerClanHK*                       acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupClanCheck
// Flags: 
struct UBTPageRoomLobby_execOnPopupClanCheck_Parms
{
	class UBTACLMessengerClanHK*                       acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerClanHK*                        cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupFriend
// Flags: 
struct UBTPageRoomLobby_execOnPopupFriend_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerFriendHK*                     acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupFriendCheck
// Flags: 
struct UBTPageRoomLobby_execOnPopupFriendCheck_Parms
{
	class UBTACLMessengerFriendHK*                     acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerFriendHK*                      cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupChannel
// Flags: 
struct UBTPageRoomLobby_execOnPopupChannel_Parms
{
	int                                                ContextMenuIndex;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UBTACLMessengerChannelHK*                    acl;                                              		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OnPopupChannelCheck
// Flags: 
struct UBTPageRoomLobby_execOnPopupChannelCheck_Parms
{
	class UBTACLMessengerChannelHK*                    acl;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UBTCMMessengerChannelHK*                     cm;                                               		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FString                                     TargetUser;                                       		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqCompleteFriendInvite
// Flags: 
struct UBTPageRoomLobby_execrfReqCompleteFriendInvite_Parms
{
	struct FString                                     CharnameToBeInvited;                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsPermit;                                         		// 0x000C ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     RecvMsg;                                          		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckConfirmFriendInvite
// Flags: 
struct UBTPageRoomLobby_execrfAckConfirmFriendInvite_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     RecvMsg;                                          		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqRecvFriendInvite
// Flags: 
struct UBTPageRoomLobby_execrfReqRecvFriendInvite_Parms
{
	int                                                ReqUserID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReqCharname;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InviteMsg;                                        		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     RecvMsg;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.WindowRequestFriend_OnCancel
// Flags: 
struct UBTPageRoomLobby_execWindowRequestFriend_OnCancel_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowRequestFriendHK*                    Window;                                           		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	struct FString                                     friName;                                          		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                friID;                                            		// 0x0018 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.WindowRequestFriend_OnOK
// Flags: 
struct UBTPageRoomLobby_execWindowRequestFriend_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowRequestFriendHK*                    Window;                                           		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	struct FString                                     friName;                                          		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                friID;                                            		// 0x0018 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckSendFriendInvite
// Flags: 
struct UBTPageRoomLobby_execrfAckSendFriendInvite_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckRoomUserList
// Flags: 
struct UBTPageRoomLobby_execrfAckRoomUserList_Parms
{
	class TArray< int >                                UID;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     UserName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Grade;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TeamNum;                                          		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      Statue;                                           		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsHost;                                           		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     UserIP;                                           		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CM_Pattern;                                       		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CM_BG;                                            		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CM_BL;                                            		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsLookingFor;                                     		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                GMUID;                                            		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x00A8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x00B4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x00CC ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00D8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00E4 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x00E8 ( 0x0004
//	int                                                lp2;                                              		// 0x00EC ( 0x0004
//	class UwMatchUserInfo*                             UserInfo;                                         		// 0x00F0 ( 0x0004
//	struct FString                                     RecvClanName;                                     		// 0x00F4 ( 0x000C[ CPF_NeedCtorLink ]
//	unsigned long                                      bisGM:1;                                          		// 0x0100 ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTPageRoomLobby.RefreshUserList
// Flags: 
struct UBTPageRoomLobby_execRefreshUserList_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                GMListIndex;                                      		// 0x0004 ( 0x0004
	int                                                addACLRowIdx;                                     		// 0x0008 ( 0x0004
	int                                                TeamNum;                                          		// 0x000C ( 0x0004
	int                                                GMIndex;                                          		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.RemoveInUserList
// Flags: 
struct UBTPageRoomLobby_execRemoveInUserList_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.Exit_OnOK
// Flags: 
struct UBTPageRoomLobby_execExit_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckProcessPreLoginUser
// Flags: 
struct UBTPageRoomLobby_execrfAckProcessPreLoginUser_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckLoginInHouseTest
// Flags: 
struct UBTPageRoomLobby_execrfAckLoginInHouseTest_Parms
{
	unsigned char                                      Sucess;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     CharName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TimeStamp;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                LoginHash1;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                LoginHash2;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                LoginHash3;                                       		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                LoginHash4;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                LoginHash5;                                       		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned char                                      NeedChar;                                         		// 0x0028 ( 0x0001[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     BDay;                                             		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Sex;                                              		// 0x0044 ( 0x0001[ CPF_Parm ]
	struct FBtrDouble                                  ServerTime;                                       		// 0x0048 ( 0x0008[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0050 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.TcpLogin_OnConnect
// Flags: 
struct UBTPageRoomLobby_execTcpLogin_OnConnect_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.RoomLobbyToServerSelection
// Flags: 
struct UBTPageRoomLobby_execRoomLobbyToServerSelection_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.RoomLobbyToServerSelection_OnOK
// Flags: 
struct UBTPageRoomLobby_execRoomLobbyToServerSelection_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckEnterChannel
// Flags: 
struct UBTPageRoomLobby_execrfAckEnterChannel_Parms
{
	int                                                id;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UID;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserID;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanMarkPattern;                                  		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                ClanMarkBG;                                       		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                ClanMarkBL;                                       		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                ClanWin;                                          		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                ClanLose;                                         		// 0x0038 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookFor;                                        		// 0x003C ( 0x0001[ CPF_Parm ]
	int                                                Result;                                           		// 0x0040 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanLevel;                                        		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0054 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0058 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x005C ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0060 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x0064 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0068 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangeRoomSetting
// Flags: 
struct UBTPageRoomLobby_execrfAckChangeRoomSetting_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FGameRoomInfo                               RoomInfo;                                         		// 0x0010 ( 0x0064[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0074 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangeUserState
// Flags: 
struct UBTPageRoomLobby_execrfAckChangeUserState_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                UserIDs;                                          		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      Positions;                                        		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Numbers;                                          		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      OldStates;                                        		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      NewStates;                                        		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x004C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0050 ( 0x0004
//	int                                                j;                                                		// 0x0054 ( 0x0004
//	int                                                UserID;                                           		// 0x0058 ( 0x0004
//	int                                                Number;                                           		// 0x005C ( 0x0004
//	unsigned char                                      Position;                                         		// 0x0060 ( 0x0001
//	unsigned char                                      oldstate;                                         		// 0x0061 ( 0x0001
//	unsigned char                                      NewState;                                         		// 0x0062 ( 0x0001
//	unsigned long                                      ImGM:1;                                           		// 0x0064 ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckNotifyLoadingState
// Flags: 
struct UBTPageRoomLobby_execrfAckNotifyLoadingState_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      LoadingState;                                     		// 0x0008 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckFailedStartGame
// Flags: 
struct UBTPageRoomLobby_execrfAckFailedStartGame_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsHost;                                           		// 0x0010 ( 0x0001[ CPF_Parm ]
	int                                                FailedUserID;                                     		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                LoadingStep;                                      		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckSuccessStartGame
// Flags: 
struct UBTPageRoomLobby_execrfAckSuccessStartGame_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsHost;                                           		// 0x0010 ( 0x0001[ CPF_Parm ]
	struct FString                                     HostIP;                                           		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostPort;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                LoadingStep;                                      		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfReqRelayServerOff
// Flags: 
struct UBTPageRoomLobby_execrfReqRelayServerOff_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckUpdateWeaponDurability
// Flags: 
struct UBTPageRoomLobby_execrfAckUpdateWeaponDurability_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  UniqueItemID;                                     		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Durability;                                       		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsDestroy;                                        		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  FailedWeaponUniqueID;                             		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0040 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0044 ( 0x0004
//	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0048 ( 0x0004
//	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x004C ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckEntryQSlotUniqueIDList
// Flags: 
struct UBTPageRoomLobby_execrfAckEntryQSlotUniqueIDList_Parms
{
	int                                                UserNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< unsigned char >                      QSlotDispOrder;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  MWUniqueID;                                       		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  PistolUniqueID;                                   		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  TW1UniqueID;                                      		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  TW2UniqueID;                                      		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0040 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0044 ( 0x0004
//	int                                                lp2;                                              		// 0x0048 ( 0x0004
//	int                                                lp3;                                              		// 0x004C ( 0x0004
//	int                                                idx;                                              		// 0x0050 ( 0x0004
//	struct FEquippedQSlotInfo                          tmSlot;                                           		// 0x0054 ( 0x0084
};

// Function GUIWarfare.BTPageRoomLobby.rfAckEntryQSlotIDList
// Flags: 
struct UBTPageRoomLobby_execrfAckEntryQSlotIDList_Parms
{
	int                                                UserNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< unsigned char >                      QSlotDispOrder;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWItemID;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWPartID;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWPaintID;                                        		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolItemID;                                     		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolPartID;                                     		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolPaintID;                                    		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TWItemID1;                                        		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TWItemID2;                                        		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill1ID;                                         		// 0x0070 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill2ID;                                         		// 0x007C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill3ID;                                         		// 0x0088 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill4ID;                                         		// 0x0094 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00A0 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x00A4 ( 0x0004
//	int                                                lp2;                                              		// 0x00A8 ( 0x0004
//	int                                                lp3;                                              		// 0x00AC ( 0x0004
//	int                                                idx;                                              		// 0x00B0 ( 0x0004
//	struct FEquippedQSlotInfo                          tmSlot;                                           		// 0x00B4 ( 0x0084
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangeNewGuest
// Flags: 
struct UBTPageRoomLobby_execrfAckChangeNewGuest_Parms
{
	struct FString                                     HostIP;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangeHost
// Flags: 
struct UBTPageRoomLobby_execrfAckChangeHost_Parms
{
	unsigned char                                      ClientNum;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetBootyChoose
// Flags: 
struct UBTPageRoomLobby_execrfAckGetBootyChoose_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      GiveType;                                         		// 0x0010 ( 0x0001[ CPF_Parm ]
	struct FBtrDouble                                  ItemUniqueNumber;                                 		// 0x0014 ( 0x0008[ CPF_Parm ]
	int                                                ItemID;                                           		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                PartID;                                           		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ItemType;                                         		// 0x0024 ( 0x0001[ CPF_Parm ]
	struct FBtrDouble                                  UntilTime;                                        		// 0x0028 ( 0x0008[ CPF_Parm ]
	int                                                StackCount;                                       		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                PaintID;                                          		// 0x0034 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0038 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwItemBoxHK*                                 itemBox;                                          		// 0x003C ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckEntrySkillList
// Flags: 
struct UBTPageRoomLobby_execrfAckEntrySkillList_Parms
{
	class TArray< int >                                UserIDs;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SkillIDs;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SlotPositions;                                    		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x0024 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0038 ( 0x0004
//	int                                                lp2;                                              		// 0x003C ( 0x0004
//	int                                                idx;                                              		// 0x0040 ( 0x0004
//	struct FEquippedSkillInfo                          SkillInfo;                                        		// 0x0044 ( 0x0008
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGetBooty
// Flags: 
struct UBTPageRoomLobby_execrfAckGetBooty_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PrizeWinUserID;                                   		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                BootyItemID;                                      		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                BootyPartsID;                                     		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0038 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckForceGameOver
// Flags: 
struct UBTPageRoomLobby_execrfAckForceGameOver_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                GameRoomNumber;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangeRoomOwner
// Flags: 
struct UBTPageRoomLobby_execrfAckChangeRoomOwner_Parms
{
	int                                                GameNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                OldOwner;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                NewOwner;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0020 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckEntryItemList
// Flags: 
struct UBTPageRoomLobby_execrfAckEntryItemList_Parms
{
	class TArray< int >                                UserIDs;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemIDs;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SlotPositions;                                    		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                AddPartsID;                                       		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  UniqueID;                                         		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PaintID;                                          		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x0048 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0058 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x005C ( 0x0004
//	int                                                lp2;                                              		// 0x0060 ( 0x0004
//	int                                                idx;                                              		// 0x0064 ( 0x0004
//	struct FEquippedItemInfo                           ItemInfo;                                         		// 0x0068 ( 0x0024
};

// Function GUIWarfare.BTPageRoomLobby.rfAckUpdateScore
// Flags: 
struct UBTPageRoomLobby_execrfAckUpdateScore_Parms
{
	class TArray< int >                                UserIDs;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     NickNames;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      TeamIDs;                                          		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Scores;                                           		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Kills;                                            		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Assists;                                          		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Deaths;                                           		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                EXPs;                                             		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                EXPBonuses;                                       		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Points;                                           		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PointBonuses;                                     		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TeamScores;                                       		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                BonusOwnerID;                                     		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                BonusID;                                          		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00A8 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x00AC ( 0x0004
//	int                                                lp2;                                              		// 0x00B0 ( 0x0004
//	int                                                k;                                                		// 0x00B4 ( 0x0004
//	int                                                i;                                                		// 0x00B8 ( 0x0004
//	int                                                SortOrder[ 0x04 ];                                		// 0x00BC ( 0x0010
//	unsigned long                                      bSwap:1;                                          		// 0x00CC ( 0x0004 [0x00000001]
//	struct FResultInfo                                 Result;                                           		// 0x00D0 ( 0x005C[ CPF_NeedCtorLink ]
//	struct FResultInfo                                 tmp;                                              		// 0x012C ( 0x005C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckConnectGame
// Flags: 
struct UBTPageRoomLobby_execrfAckConnectGame_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangeTeam
// Flags: 
struct UBTPageRoomLobby_execrfAckChangeTeam_Parms
{
	int                                                GameNumber;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserID;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                UID;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                TeamNum;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                PrevTeam;                                         		// 0x002C ( 0x0004
//	class UwMatchUserInfo*                             mui;                                              		// 0x0030 ( 0x0004
//	class UBTAutoColumnListDataHK*                     Data;                                             		// 0x0034 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckLeaveRoom
// Flags: 
struct UBTPageRoomLobby_execrfAckLeaveRoom_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UID;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserID;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0028 ( 0x0004
//	int                                                i2;                                               		// 0x002C ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.rfAckEnterRoom
// Flags: 
struct UBTPageRoomLobby_execrfAckEnterRoom_Parms
{
	int                                                GameNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                OwnerID;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                UID;                                              		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserID;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TeamNum;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                Grade;                                            		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FString                                     UserIP;                                           		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Clan_Mark_Pattern;                                		// 0x0038 ( 0x0004[ CPF_Parm ]
	int                                                Clan_Mark_BG;                                     		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                Clan_Mark_BL;                                     		// 0x0040 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookFor;                                        		// 0x0044 ( 0x0001[ CPF_Parm ]
	int                                                Result;                                           		// 0x0048 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanLevel;                                        		// 0x0058 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x005C ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0060 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x0064 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0068 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x006C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0070 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwMatchUserInfo*                             UserInfo;                                         		// 0x0074 ( 0x0004
//	int                                                NewIndex;                                         		// 0x0078 ( 0x0004
//	struct FString                                     RecvClanName;                                     		// 0x007C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGameOverEnd
// Flags: 
struct UBTPageRoomLobby_execrfAckGameOverEnd_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGameOver
// Flags: 
struct UBTPageRoomLobby_execrfAckGameOver_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                GameRoomNumber;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckDisconnectGame
// Flags: 
struct UBTPageRoomLobby_execrfAckDisconnectGame_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                DisconnectUserID;                                 		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     DisconnectUserName;                               		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckRegisterOtherUdpInfo
// Flags: 
struct UBTPageRoomLobby_execrfAckRegisterOtherUdpInfo_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     IP;                                               		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned char                                      NatType;                                          		// 0x0014 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Intervention;                                     		// 0x0015 ( 0x0001[ CPF_Parm ]
	struct FString                                     HostInnerIP;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostInnerPort;                                    		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     strInterventionErrLog;                            		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckStartGame
// Flags: 
struct UBTPageRoomLobby_execrfAckStartGame_Parms
{
	int                                                GameNumber;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ClientsCount;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                StartSeed;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckChangeGameMode
// Flags: 
struct UBTPageRoomLobby_execrfAckChangeGameMode_Parms
{
	int                                                GameNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UID;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     GameMode;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      GameModeNum;                                      		// 0x0014 ( 0x0001[ CPF_Parm ]
	int                                                Result;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckSelectMap
// Flags: 
struct UBTPageRoomLobby_execrfAckSelectMap_Parms
{
	int                                                GameNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UID;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     MapName;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGameRoomInfo
// Flags: 
struct UBTPageRoomLobby_execrfAckGameRoomInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FGameRoomInfo                               RoomInfo;                                         		// 0x0010 ( 0x0064[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0074 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckIsGameRoomPlaying
// Flags: 
struct UBTPageRoomLobby_execrfAckIsGameRoomPlaying_Parms
{
	int                                                GameRoomNum;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsPlaying;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.rfAckGameHostInfo
// Flags: 
struct UBTPageRoomLobby_execrfAckGameHostInfo_Parms
{
	int                                                GameNumber;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserID;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     IP;                                               		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0030 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.TeamChatLog
// Flags: 
struct UBTPageRoomLobby_execTeamChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.BroadCastItemChatLog
// Flags: 
struct UBTPageRoomLobby_execBroadCastItemChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FMessageItem                                msgItem;                                          		// 0x000C ( 0x0020[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.SystemChatLog
// Flags: 
struct UBTPageRoomLobby_execSystemChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FMessageItem                                msgItem;                                          		// 0x000C ( 0x0020[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.SelfChatLog
// Flags: 
struct UBTPageRoomLobby_execSelfChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.WhisperChatLog
// Flags: 
struct UBTPageRoomLobby_execWhisperChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FMessageItem                                msgItem;                                          		// 0x000C ( 0x0020[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.ClanChatLog
// Flags: 
struct UBTPageRoomLobby_execClanChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FMessageItem                                msgItem;                                          		// 0x000C ( 0x0020[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.NormalChatLog
// Flags: 
struct UBTPageRoomLobby_execNormalChatLog_Parms
{
	struct FString                                     cL;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.ClearChatLog
// Flags: 
struct UBTPageRoomLobby_execClearChatLog_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.SetMatchBGM
// Flags: 
struct UBTPageRoomLobby_execSetMatchBGM_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.GameOver
// Flags: 
struct UBTPageRoomLobby_execGameOver_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.StartGame
// Flags: 
struct UBTPageRoomLobby_execStartGame_Parms
{
	struct FString                                     IP;                                               		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0010 ( 0x0004
	int                                                j;                                                		// 0x0014 ( 0x0004
	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0018 ( 0x0004
	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x001C ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0020 ( 0x0004
	struct FOptionGraphicAdvanceInfo                   Settings;                                         		// 0x0024 ( 0x0028
	unsigned long                                      bSuccessStartMatch:1;                             		// 0x004C ( 0x0004 [0x00000001]
	class UwMyPlayerStatus*                            MyStatus;                                         		// 0x0050 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.IsUserAllReady
// Flags: 
struct UBTPageRoomLobby_execIsUserAllReady_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.GetReadyAllUserCount
// Flags: 
struct UBTPageRoomLobby_execGetReadyAllUserCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.GetUserCount
// Flags: 
struct UBTPageRoomLobby_execGetUserCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.IsUserCountFull
// Flags: 
struct UBTPageRoomLobby_execIsUserCountFull_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateRoomInfoByMatchMaker
// Flags: 
struct UBTPageRoomLobby_execUpdateRoomInfoByMatchMaker_Parms
{
	struct FString                                     UserCountString;                                  		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     strGameTime;                                      		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.FindFriendlyGameModeByIndex
// Flags: 
struct UBTPageRoomLobby_execFindFriendlyGameModeByIndex_Parms
{
	int                                                GameModeIndex;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.FindFriendlyGameMode
// Flags: 
struct UBTPageRoomLobby_execFindFriendlyGameMode_Parms
{
	struct FString                                     GameMode;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.InitialRoomInfo
// Flags: 
struct UBTPageRoomLobby_execInitialRoomInfo_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.GetConsole
// Flags: 
struct UBTPageRoomLobby_execGetConsole_Parms
{
	class UBTConsole*                                  ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.GetTcpLogin
// Flags: 
struct UBTPageRoomLobby_execGetTcpLogin_Parms
{
	class UBTTcpLink_Login*                            ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTPageRoomLobby_TcpLogin*                   TCP;                                              		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.GetTcpChannel
// Flags: 
struct UBTPageRoomLobby_execGetTcpChannel_Parms
{
	class UBTTcpLink_Channel*                          ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTPageRoomLobby_TCP*                        TCP;                                              		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.internalKeyEvent
// Flags: 
struct UBTPageRoomLobby_execinternalKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      Action;                                           		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      iKey;                                             		// 0x000C ( 0x0001
//	unsigned char                                      iAction;                                          		// 0x000D ( 0x0001
};

// Function GUIWarfare.BTPageRoomLobby.InternalOnClose
// Flags: 
struct UBTPageRoomLobby_execInternalOnClose_Parms
{
	unsigned long                                      bCanceled:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.SetCharacterInfo
// Flags: 
struct UBTPageRoomLobby_execSetCharacterInfo_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FCharInfo                                   btCharInfo;                                       		// 0x000C ( 0x00C0[ CPF_Parm ]
	class UwMyPlayerStatus*                            MyStatus;                                         		// 0x00CC ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.QuestLog
// Flags: 
struct UBTPageRoomLobby_execQuestLog_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.RefreshPage
// Flags: 
struct UBTPageRoomLobby_execRefreshPage_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.UnInitializeDelegate
// Flags: 
struct UBTPageRoomLobby_execUnInitializeDelegate_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.InitializeDelegate
// Flags: 
struct UBTPageRoomLobby_execInitializeDelegate_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.UpdateDurabilityWarningItemList
// Flags: 
struct UBTPageRoomLobby_execUpdateDurabilityWarningItemList_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateExpiredItemList
// Flags: 
struct UBTPageRoomLobby_execUpdateExpiredItemList_Parms
{
	class UBTNetMainMenu*                              MainMenu;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateWebzenItemList
// Flags: 
struct UBTPageRoomLobby_execUpdateWebzenItemList_Parms
{
	class UwGameManager*                               GameMgr;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateItemList
// Flags: 
struct UBTPageRoomLobby_execUpdateItemList_Parms
{
	class UwGameManager*                               GameMgr;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateBlockList
// Flags: 
struct UBTPageRoomLobby_execUpdateBlockList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.SetFriendlyUser
// Flags: 
struct UBTPageRoomLobby_execSetFriendlyUser_Parms
{
	class UBTAutoColumnListDataHK*                     ACLData;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UserListIdx;                                      		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateFriendlyUser
// Flags: 
struct UBTPageRoomLobby_execUpdateFriendlyUser_Parms
{
	int                                                UserListIdx;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                j;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.UpdatePCBangList
// Flags: 
struct UBTPageRoomLobby_execUpdatePCBangList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.UpdateClanList
// Flags: 
struct UBTPageRoomLobby_execUpdateClanList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.UpdateFriendList
// Flags: 
struct UBTPageRoomLobby_execUpdateFriendList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.UpdateGameRoomInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateGameRoomInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateRecv_CharInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateRecv_CharInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateQuestList
// Flags: 
struct UBTPageRoomLobby_execUpdateQuestList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdatePositionInfo
// Flags: 
struct UBTPageRoomLobby_execUpdatePositionInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdatePCBangInfo
// Flags: 
struct UBTPageRoomLobby_execUpdatePCBangInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateEquipItemInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateEquipItemInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateRankingInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateRankingInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateMoneyInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateMoneyInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateClanInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateClanInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateCharInfo
// Flags: 
struct UBTPageRoomLobby_execUpdateCharInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.OnCompleteOpened
// Flags: 
struct UBTPageRoomLobby_execOnCompleteOpened_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.OnBackToLastPage
// Flags: 
struct UBTPageRoomLobby_execOnBackToLastPage_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.InternalOnOpen
// Flags: 
struct UBTPageRoomLobby_execInternalOnOpen_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.InternalOnReOpen
// Flags: 
struct UBTPageRoomLobby_execInternalOnReOpen_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.CloseNetworkCheckingWindow
// Flags: 
struct UBTPageRoomLobby_execCloseNetworkCheckingWindow_Parms
{
	unsigned long                                      bNotInitial:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UGUIPage*                                    LastMenu;                                         		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.OpenNetworkCheckingWindow
// Flags: 
struct UBTPageRoomLobby_execOpenNetworkCheckingWindow_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.FailedNetworkChecking
// Flags: 
struct UBTPageRoomLobby_execFailedNetworkChecking_Parms
{
	struct FString                                     ErrMsg;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Code;                                             		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.StartNetworkChecking
// Flags: 
struct UBTPageRoomLobby_execStartNetworkChecking_Parms
{
	int                                                ClientsCount;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bConnectGame:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.ButtonStart_OnKeyEvent
// Flags: 
struct UBTPageRoomLobby_execButtonStart_OnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      Action;                                           		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      iKey;                                             		// 0x000C ( 0x0001
//	unsigned char                                      iAction;                                          		// 0x000D ( 0x0001
};

// Function GUIWarfare.BTPageRoomLobby.MessageHostUnsuitableness
// Flags: 
struct UBTPageRoomLobby_execMessageHostUnsuitableness_Parms
{
	int                                                iPoint;                                           		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.SendPingAndSendHostPoint
// Flags: 
struct UBTPageRoomLobby_execSendPingAndSendHostPoint_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.InternalOnPreDraw
// Flags: 
struct UBTPageRoomLobby_execInternalOnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowHK*                                 BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	float                                              CurrentTime;                                      		// 0x000C ( 0x0004
//	int                                                StartTop;                                         		// 0x0010 ( 0x0004
//	int                                                Count;                                            		// 0x0014 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.TPMessenger_ButtonMsg_OnClick
// Flags: 
struct UBTPageRoomLobby_execTPMessenger_ButtonMsg_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                StartTop;                                         		// 0x0008 ( 0x0004
//	int                                                Count;                                            		// 0x000C ( 0x0004
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0010 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.TPMessenger_ACLMsg0_OnHitBottom
// Flags: 
struct UBTPageRoomLobby_execTPMessenger_ACLMsg0_OnHitBottom_Parms
{
	int                                                Top;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                itemperpage;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTPageRoomLobby.MyInfo_OnClick
// Flags: 
struct UBTPageRoomLobby_execMyInfo_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.InitComponent
// Flags: 
struct UBTPageRoomLobby_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.InitializeTeamList
// Flags: 
struct UBTPageRoomLobby_execInitializeTeamList_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowCreateClanHK_OnOK
// Flags: 
struct UBTPageRoomLobby_execBTWindowCreateClanHK_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     ClanName;                                         		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     URL;                                              		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     Intro;                                            		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     Keyword;                                          		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                Region;                                           		// 0x0038 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowCreateClanNeedPointHK_OnClick
// Flags: 
struct UBTPageRoomLobby_execBTWindowCreateClanNeedPointHK_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.ClanMenu_ButtonCreateClan_OnClick
// Flags: 
struct UBTPageRoomLobby_execClanMenu_ButtonCreateClan_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowFindClanHK_OnInfo
// Flags: 
struct UBTPageRoomLobby_execBTWindowFindClanHK_OnInfo_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     ClanName;                                         		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowFindClanHK_OnRequestJoin
// Flags: 
struct UBTPageRoomLobby_execBTWindowFindClanHK_OnRequestJoin_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     ClanName;                                         		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function GUIWarfare.BTPageRoomLobby.ClanMenu_ButtonFindClan_OnClick
// Flags: 
struct UBTPageRoomLobby_execClanMenu_ButtonFindClan_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTWindowFindClanHK*                         BTWindow;                                         		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.ClanMenu_ButtonLookingForClan_OnClick
// Flags: 
struct UBTPageRoomLobby_execClanMenu_ButtonLookingForClan_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      bCurLookingFor:1;                                 		// 0x0008 ( 0x0004 [0x00000001]
};

// Function GUIWarfare.BTPageRoomLobby.HeaderButton_OnClick
// Flags: 
struct UBTPageRoomLobby_execHeaderButton_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.ChangeButtonStart
// Flags: 
struct UBTPageRoomLobby_execChangeButtonStart_Parms
{
};

// Function GUIWarfare.BTPageRoomLobby.ChangeButtonTeam
// Flags: 
struct UBTPageRoomLobby_execChangeButtonTeam_Parms
{
	int                                                Team;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.UpdateRoomOwner
// Flags: 
struct UBTPageRoomLobby_execUpdateRoomOwner_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.CheckInviteUser
// Flags: 
struct UBTPageRoomLobby_execCheckInviteUser_Parms
{
	int                                                CurPos;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                CurState;                                         		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     szNickName;                                       		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szClanName;                                       		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.CanInviteUser
// Flags: 
struct UBTPageRoomLobby_execCanInviteUser_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.ButtonTeam_OnClick
// Flags: 
struct UBTPageRoomLobby_execButtonTeam_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                GMNum;                                            		// 0x000C ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.ButtonReady_OnClick
// Flags: 
struct UBTPageRoomLobby_execButtonReady_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      ustate;                                           		// 0x0008 ( 0x0001
};

// Function GUIWarfare.BTPageRoomLobby.ButtonStart_OnClick
// Flags: 
struct UBTPageRoomLobby_execButtonStart_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                LimitCount;                                       		// 0x0008 ( 0x0004
//	int                                                GameUserCount;                                    		// 0x000C ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.ButtonStart_OnClick_Before_CheckDurability
// Flags: 
struct UBTPageRoomLobby_execButtonStart_OnClick_Before_CheckDurability_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.CurrentButtonClickBehavior
// Flags: 
struct UBTPageRoomLobby_execCurrentButtonClickBehavior_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.CheckPrimaryWeaponDurability
// Flags: 
struct UBTPageRoomLobby_execCheckPrimaryWeaponDurability_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	int                                                j;                                                		// 0x0008 ( 0x0004
//	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x000C ( 0x0004
//	class UwItemBoxInstanceHK*                         instanceInfo;                                     		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTPageRoomLobby.GotoStartGame_OnOK
// Flags: 
struct UBTPageRoomLobby_execGotoStartGame_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.GotoInventory_OnOK
// Flags: 
struct UBTPageRoomLobby_execGotoInventory_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.ButtonRoomInfo_OnClick
// Flags: 
struct UBTPageRoomLobby_execButtonRoomInfo_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowJoinClan_OK
// Flags: 
struct UBTPageRoomLobby_execBTWindowJoinClan_OK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowInviteClan_OnOK
// Flags: 
struct UBTPageRoomLobby_execBTWindowInviteClan_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTPageRoomLobby.WindowInviteFriend_OnOK
// Flags: 
struct UBTPageRoomLobby_execWindowInviteFriend_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      bTemp:1;                                          		// 0x0008 ( 0x0004 [0x00000001]
//	struct FString                                     imsg;                                             		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	class UBTWindowInviteFriendHK*                     Window;                                           		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTPageRoomLobby.BTWindowRoomInfoHK_OnOK
// Flags: 
struct UBTPageRoomLobby_execBTWindowRoomInfoHK_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     filter;                                           		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FGameRoomInfo                               NetRoomInfo;                                      		// 0x0014 ( 0x0064[ CPF_NeedCtorLink ]
//	class UBTWindowRoomInfoHK*                         BTWindow;                                         		// 0x0078 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetQuestInfoPageHK.TPTopMenu_Quest_OnClick
// Flags: 
struct UBTNetQuestInfoPageHK_execTPTopMenu_Quest_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetQuestInfoPageHK.NotifyDailyQuestReset
// Flags: 
struct UBTNetQuestInfoPageHK_execNotifyDailyQuestReset_Parms
{
};

// Function GUIWarfare.BTNetQuestInfoPageHK.InternalOnOpen
// Flags: 
struct UBTNetQuestInfoPageHK_execInternalOnOpen_Parms
{
	struct FBtrDouble                                  CurrentTime;                                      		// 0x0000 ( 0x0008
	struct FBtrTime                                    tCurr;                                            		// 0x0008 ( 0x0020
	float                                              fTimerInterval;                                   		// 0x0028 ( 0x0004
};

// Function GUIWarfare.BTNetQuestInfoPageHK.InternalOnReOpen
// Flags: 
struct UBTNetQuestInfoPageHK_execInternalOnReOpen_Parms
{
};

// Function GUIWarfare.BTNetQuestInfoPageHK.InitComponent
// Flags: 
struct UBTNetQuestInfoPageHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetGUIPageHK.Default_FadedOut
// Flags: 
struct UBTNetGUIPageHK_execDefault_FadedOut_Parms
{
};

// Function GUIWarfare.BTNetGUIPageHK.FadeOut
// Flags: 
struct UBTNetGUIPageHK_execFadeOut_Parms
{
	unsigned long                                      bTranslate:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bChangeAlpha:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTNetGUIPageHK.FadeIn
// Flags: 
struct UBTNetGUIPageHK_execFadeIn_Parms
{
	unsigned long                                      bTranslate:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bChangeAlpha:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function GUIWarfare.BTNetGUIPageHK.Internal_OnPreDraw
// Flags: 
struct UBTNetGUIPageHK_execInternal_OnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              fadeDirection;                                    		// 0x0008 ( 0x0004
//	unsigned char                                      fadeByte;                                         		// 0x000C ( 0x0001
};

// Function GUIWarfare.BTNetGUIPageHK.NewButtonComponent
// Flags: 
struct UBTNetGUIPageHK_execNewButtonComponent_Parms
{
	struct FFloatBox                                   fbNewCompo;                                       		// 0x0000 ( 0x0010[ CPF_Parm ]
	float                                              RenderWeight;                                     		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTOwnerDrawCaptionButtonHK*                 ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTOwnerDrawCaptionButtonHK*                 btn;                                              		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetGUIPageHK.NewLabelComponent
// Flags: 
struct UBTNetGUIPageHK_execNewLabelComponent_Parms
{
	struct FFloatBox                                   fbNewCompo;                                       		// 0x0000 ( 0x0010[ CPF_Parm ]
	struct FImage                                      bgImg;                                            		// 0x0010 ( 0x0020[ CPF_Parm ]
	float                                              RenderWeight;                                     		// 0x0030 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UBTOwnerDrawImageHK*                         ReturnValue;                                      		// 0x0034 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UBTOwnerDrawImageHK*                         Label;                                            		// 0x0038 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetGUIPageHK.ExitGame
// Flags: 
struct UBTNetGUIPageHK_execExitGame_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function GUIWarfare.BTNetGUIPageHK.OpenTodayResultPage
// Flags: 
struct UBTNetGUIPageHK_execOpenTodayResultPage_Parms
{
};

// Function GUIWarfare.BTNetGUIPageHK.BTWIndowTodayResultHK_OnOK
// Flags: 
struct UBTNetGUIPageHK_execBTWIndowTodayResultHK_OnOK_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetGUIPageHK.WeaponListClick
// Flags: 
struct UBTNetGUIPageHK_execWeaponListClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetGUIPageHK.InitComponent
// Flags: 
struct UBTNetGUIPageHK_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	class UBTOwnerDrawCaptionButtonHK*                 temp;                                             		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTNetGUIPageHK.LabelAAS_OnNextAAS
// Flags: 
struct UBTNetGUIPageHK_execLabelAAS_OnNextAAS_Parms
{
	struct FString                                     NextAAS;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UBTConsole*                                  BTConsole;                                        		// 0x000C ( 0x0004
	class UwMatchMaker*                                MM;                                               		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTNetGUIPageHK.LabelBottomLine_OnNextNotice
// Flags: 
struct UBTNetGUIPageHK_execLabelBottomLine_OnNextNotice_Parms
{
	struct FString                                     NextNotice;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UBTConsole*                                  BTConsole;                                        		// 0x000C ( 0x0004
	class UwMatchMaker*                                MM;                                               		// 0x0010 ( 0x0004
};

// Function GUIWarfare.BTNetGUIPageHK.ButtonTest_OnClick
// Flags: 
struct UBTNetGUIPageHK_execButtonTest_OnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTNetGUIPageHK.InitializeDefaultPage
// Flags: 
struct UBTNetGUIPageHK_execInitializeDefaultPage_Parms
{
};

// Function GUIWarfare.BTNetGUIPageHK.SetDefaultWeapon
// Flags: 
struct UBTNetGUIPageHK_execSetDefaultWeapon_Parms
{
	int                                                SlotIndex;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function GUIWarfare.BTNetGUIPageHK.RefreshPage
// Flags: 
struct UBTNetGUIPageHK_execRefreshPage_Parms
{
};

// Function GUIWarfare.BTNetGUIPageHK.Opened
// Flags: [ FUNC_Event ]
struct UBTNetGUIPageHK_eventOpened_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function GUIWarfare.BTTcpHandler.rfReqAhnNotifyDisconnct
// Flags: 
struct UBTTcpHandler_execrfReqAhnNotifyDisconnct_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfReqAhnHsObject
// Flags: 
struct UBTTcpHandler_execrfReqAhnHsObject_Parms
{
	class TArray< unsigned char >                      Data;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                DataSize;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< unsigned char >                      ResultData;                                       		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                resultSize;                                       		// 0x0020 ( 0x0004
};

// Function GUIWarfare.BTTcpHandler.rfNotifyCouponUseError
// Flags: 
struct UBTTcpHandler_execrfNotifyCouponUseError_Parms
{
	int                                                Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfReqNotifyShopItemDataEnd
// Flags: 
struct UBTTcpHandler_execrfReqNotifyShopItemDataEnd_Parms
{
	int                                                Ver;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckCouponUse
// Flags: 
struct UBTTcpHandler_execrfAckCouponUse_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfReqNotifyShopItemData
// Flags: 
struct UBTTcpHandler_execrfReqNotifyShopItemData_Parms
{
	class TArray< int >                                ProductNo;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductRowGuid;                                   		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ServiceCode;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductName;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductCode;                                      		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductType;                                      		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      SaleType;                                         		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ItemSaleType;                                     		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ISIncludeBonus;                                   		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductCost;                                      		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductHour;                                      		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductQuantity;                                  		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TotalQuantity;                                    		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ReOrderTerms;                                     		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ReorderCount;                                     		// 0x00A8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PurchaseAvailableQuantity;                        		// 0x00B4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                AvailableMinLevel;                                		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                AvailableMaxLevel;                                		// 0x00CC ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      AvailableGender;                                  		// 0x00D8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                InventoryKeepDays;                                		// 0x00E4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SaleMasterFlag;                                   		// 0x00F0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SaleStatus;                                       		// 0x00FC ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Description;                                      		// 0x0108 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property0;                                        		// 0x0114 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property1;                                        		// 0x0120 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property2;                                        		// 0x012C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property3;                                        		// 0x0138 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property4;                                        		// 0x0144 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                IsGift;                                           		// 0x0150 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x015C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckShopItemData
// Flags: 
struct UBTTcpHandler_execrfAckShopItemData_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfNotifyClanLevelup
// Flags: 
struct UBTTcpHandler_execrfNotifyClanLevelup_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Levelup;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfNotifyNewClanName
// Flags: 
struct UBTTcpHandler_execrfNotifyNewClanName_Parms
{
	struct FString                                     New_NickName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfNotifyNewNickName
// Flags: 
struct UBTTcpHandler_execrfNotifyNewNickName_Parms
{
	int                                                Community_Type;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Old_NickName;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     New_NickName;                                     		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckTencent_StartTenProtect
// Flags: 
struct UBTTcpHandler_execrfAckTencent_StartTenProtect_Parms
{
	int                                                CharDBID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckMoveToLobby
// Flags: 
struct UBTTcpHandler_execrfAckMoveToLobby_Parms
{
	unsigned char                                      MessageType;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckPopUpMessage
// Flags: 
struct UBTTcpHandler_execrfAckPopUpMessage_Parms
{
	int                                                MessageType;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfUpdateWebzenShopScriptVersion
// Flags: 
struct UBTTcpHandler_execrfUpdateWebzenShopScriptVersion_Parms
{
	int                                                Year;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                YearId;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                SalesZoneCode;                                    		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckFriendPosition
// Flags: 
struct UBTTcpHandler_execrfAckFriendPosition_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     TargetCharName;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ServerType;                                       		// 0x0010 ( 0x0001[ CPF_Parm ]
	struct FString                                     fServername;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fServerShortName;                                 		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fServerIP;                                        		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                fServerPort;                                      		// 0x0038 ( 0x0004[ CPF_Parm ]
	unsigned char                                      CurPos;                                           		// 0x003C ( 0x0001[ CPF_Parm ]
	unsigned char                                      CurState;                                         		// 0x003D ( 0x0001[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0040 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelNickName;                                  		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameRoomNum;                                      		// 0x0050 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0054 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckLogOut
// Flags: 
struct UBTTcpHandler_execrfAckLogOut_Parms
{
	unsigned char                                      Result;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Reason;                                           		// 0x0001 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function GUIWarfare.BTTcpHandler.rfAckNotifyUpdateCharInfo_LevelMark
// Flags: 
struct UBTTcpHandler_execrfAckNotifyUpdateCharInfo_LevelMark_Parms
{
