#pragma once

// Arctic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.wWeaponBaseParams
// 0x03A8 (0x03D4 - 0x002C)
class UwWeaponBaseParams : public UObject
{
public:
	TEnumAsByte<EeWeaponType>                          eType;                                                    // 0x002C(0x0001) (Edit, EditConst)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	struct FString                                     strName;                                                  // 0x0030(0x000C) (Edit, EditConst, NeedCtorLink)
	int                                                iWeaponID;                                                // 0x003C(0x0004) (Edit, EditConst)
	int                                                iInventoryGroup;                                          // 0x0040(0x0004) (Edit)
	int                                                iPriority;                                                // 0x0044(0x0004) (Edit)
	struct FString                                     szClass_Resource;                                         // 0x0048(0x000C) (Edit, EditConst, NeedCtorLink)
	int                                                iFireMode;                                                // 0x0054(0x0004) (Edit)
	unsigned long                                      bAimAvailable : 1;                                        // 0x0058(0x0004) (Edit)
	float                                              fRateOfFire;                                              // 0x005C(0x0004) (Edit)
	float                                              fFireDelay;                                               // 0x0060(0x0004) (Edit)
	float                                              fMeleeDelay;                                              // 0x0064(0x0004) (Edit)
	int                                                iRoundBurstCount;                                         // 0x0068(0x0004) (Edit)
	float                                              fRoundBurstTime;                                          // 0x006C(0x0004) (Edit)
	float                                              fZoomFOV;                                                 // 0x0070(0x0004) (Edit)
	unsigned long                                      bOverHeat : 1;                                            // 0x0074(0x0004) (Edit)
	float                                              fOverHeat_Up;                                             // 0x0078(0x0004) (Edit)
	float                                              fOverHeat_Down;                                           // 0x007C(0x0004) (Edit)
	TEnumAsByte<EBulletType>                           BulletType;                                               // 0x0080(0x0001) (Edit)
	TEnumAsByte<EProjMoveType>                         ProjMoveType;                                             // 0x0081(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0082(0x0002) MISSED OFFSET
	int                                                iBulletCount;                                             // 0x0084(0x0004) (Edit)
	float                                              fProjSpeed;                                               // 0x0088(0x0004) (Edit)
	unsigned long                                      bExplodeCollide : 1;                                      // 0x008C(0x0004) (Edit)
	unsigned long                                      bProjTakeDamage : 1;                                      // 0x008C(0x0004) (Edit)
	int                                                iBombWeaponID;                                            // 0x0090(0x0004) (Edit)
	float                                              fFuseTime;                                                // 0x0094(0x0004) (Edit)
	unsigned long                                      bFuseImpactTime : 1;                                      // 0x0098(0x0004) (Edit)
	float                                              fActiveTime;                                              // 0x009C(0x0004) (Edit)
	float                                              fProjDecelEachBound;                                      // 0x00A0(0x0004) (Edit)
	float                                              fProjSpin;                                                // 0x00A4(0x0004) (Edit)
	float                                              fProjThrowPitch;                                          // 0x00A8(0x0004) (Edit)
	int                                                i2ndBulletCount;                                          // 0x00AC(0x0004) (Edit)
	unsigned long                                      bBulletLandExplode : 1;                                   // 0x00B0(0x0004) (Edit)
	TEnumAsByte<EDamType>                              damtype;                                                  // 0x00B4(0x0001) (Edit)
	unsigned char                                      UnknownData02[0x3];                                       // 0x00B5(0x0003) MISSED OFFSET
	int                                                iDamage;                                                  // 0x00B8(0x0004) (Edit)
	float                                              fDamWallShot;                                             // 0x00BC(0x0004) (Edit)
	float                                              fMomentum;                                                // 0x00C0(0x0004) (Edit)
	float                                              fMomentum_Pawn;                                           // 0x00C4(0x0004) (Edit)
	float                                              fDamRange_Eff;                                            // 0x00C8(0x0004) (Edit)
	float                                              fDamRange_Max;                                            // 0x00CC(0x0004) (Edit)
	int                                                iDam_OOR;                                                 // 0x00D0(0x0004) (Edit)
	int                                                iDamMelee;                                                // 0x00D4(0x0004) (Edit)
	int                                                iMeleeRange;                                              // 0x00D8(0x0004) (Edit)
	int                                                iMeleeExtent;                                             // 0x00DC(0x0004) (Edit)
	int                                                iMeleeExtent_Head;                                        // 0x00E0(0x0004) (Edit)
	int                                                iMeleeDam_Back;                                           // 0x00E4(0x0004) (Edit)
	float                                              fMeleeDam_Head;                                           // 0x00E8(0x0004) (Edit)
	float                                              fMeleeDam_UpperTorso;                                     // 0x00EC(0x0004) (Edit)
	float                                              fMeleeDam_LowerTorso;                                     // 0x00F0(0x0004) (Edit)
	float                                              fMeleeDam_UpperArm;                                       // 0x00F4(0x0004) (Edit)
	float                                              fMeleeDam_LowerArm;                                       // 0x00F8(0x0004) (Edit)
	float                                              fMeleeDam_UpperLeg;                                       // 0x00FC(0x0004) (Edit)
	float                                              fMeleeDam_LowerLeg;                                       // 0x0100(0x0004) (Edit)
	float                                              fDamPerc_Head;                                            // 0x0104(0x0004) (Edit)
	float                                              fDamPerc_UpperTorso;                                      // 0x0108(0x0004) (Edit)
	float                                              fDamPerc_LowerTorso;                                      // 0x010C(0x0004) (Edit)
	float                                              fDamPerc_UpperArm;                                        // 0x0110(0x0004) (Edit)
	float                                              fDamPerc_LowerArm;                                        // 0x0114(0x0004) (Edit)
	float                                              fDamPerc_UpperLeg;                                        // 0x0118(0x0004) (Edit)
	float                                              fDamPerc_LowerLeg;                                        // 0x011C(0x0004) (Edit)
	float                                              fDamPerc_Heli;                                            // 0x0120(0x0004) (Edit)
	float                                              fDamPerc_SentryGun;                                       // 0x0124(0x0004) (Edit)
	unsigned long                                      bHitEffFriendly : 1;                                      // 0x0128(0x0004) (Edit)
	float                                              fHitGunKick;                                              // 0x012C(0x0004) (Edit)
	float                                              fHitStunTime;                                             // 0x0130(0x0004) (Edit)
	float                                              fHitFlashTime;                                            // 0x0134(0x0004) (Edit)
	float                                              fHitFireTime;                                             // 0x0138(0x0004) (Edit)
	float                                              fHitFreezeTime;                                           // 0x013C(0x0004) (Edit)
	float                                              fHitEAXEffectTime;                                        // 0x0140(0x0004) (Edit)
	struct FString                                     strHitEAXEffectClass;                                     // 0x0144(0x000C) (Edit, NeedCtorLink)
	TEnumAsByte<EReloadType>                           ReloadType;                                               // 0x0150(0x0001) (Edit)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0151(0x0003) MISSED OFFSET
	unsigned long                                      bRechamber : 1;                                           // 0x0154(0x0004) (Edit)
	float                                              fRechamberRate;                                           // 0x0158(0x0004) (Edit)
	float                                              fReloadRate;                                              // 0x015C(0x0004) (Edit)
	float                                              fReloadEmptyRate;                                         // 0x0160(0x0004) (Edit)
	float                                              fReloadBeginRate;                                         // 0x0164(0x0004) (Edit)
	float                                              fReloadEndRate;                                           // 0x0168(0x0004) (Edit)
	float                                              fBulletGravity;                                           // 0x016C(0x0004) (Edit)
	float                                              fExplRad_Inner;                                           // 0x0170(0x0004) (Edit)
	float                                              fExplRad_Outer;                                           // 0x0174(0x0004) (Edit)
	float                                              fExplDam_Inner;                                           // 0x0178(0x0004) (Edit)
	float                                              fExplDam_Outer;                                           // 0x017C(0x0004) (Edit)
	float                                              fExplForce_Effect;                                        // 0x0180(0x0004) (Edit)
	float                                              fExplRad_Effect;                                          // 0x0184(0x0004) (Edit)
	int                                                iAmmo_Magazine;                                           // 0x0188(0x0004) (Edit)
	int                                                iAmmo_Reload;                                             // 0x018C(0x0004) (Edit)
	int                                                iAmmo_Initial;                                            // 0x0190(0x0004) (Edit)
	int                                                iAmmo_Max;                                                // 0x0194(0x0004) (Edit)
	int                                                iSpread_2nd_StartNum;                                     // 0x0198(0x0004) (Edit)
	float                                              fSpread_2nd_Add;                                          // 0x019C(0x0004) (Edit)
	float                                              fSpread_2nd_Max;                                          // 0x01A0(0x0004) (Edit)
	int                                                iSpread_Visual_Add;                                       // 0x01A4(0x0004) (Edit)
	float                                              fSpread_Shotgun;                                          // 0x01A8(0x0004) (Edit)
	float                                              fSpread_Jump;                                             // 0x01AC(0x0004) (Edit)
	float                                              fSpread_Stand_Min;                                        // 0x01B0(0x0004) (Edit)
	float                                              fSpread_Stand_Max;                                        // 0x01B4(0x0004) (Edit)
	float                                              fSpread_Ducked_Min;                                       // 0x01B8(0x0004) (Edit)
	float                                              fSpread_Ducked_Max;                                       // 0x01BC(0x0004) (Edit)
	float                                              fSpread_Prone_Min;                                        // 0x01C0(0x0004) (Edit)
	float                                              fSpread_Prone_Max;                                        // 0x01C4(0x0004) (Edit)
	float                                              fSpread_Move_Add;                                         // 0x01C8(0x0004) (Edit)
	float                                              fSpread_Fire_Add;                                         // 0x01CC(0x0004) (Edit)
	float                                              fSpread_Image_Increase;                                   // 0x01D0(0x0004) (Edit)
	float                                              fSpread_Stand_Reduce;                                     // 0x01D4(0x0004) (Edit)
	float                                              fSpread_Ducked_Reduce;                                    // 0x01D8(0x0004) (Edit)
	float                                              fSpread_Prone_Reduce;                                     // 0x01DC(0x0004) (Edit)
	float                                              fSpread_Aim_move_add;                                     // 0x01E0(0x0004) (Edit)
	float                                              fViewKickHip_XMin;                                        // 0x01E4(0x0004) (Edit)
	float                                              fViewKickHip_XMax;                                        // 0x01E8(0x0004) (Edit)
	float                                              fViewKickHip_YMin;                                        // 0x01EC(0x0004) (Edit)
	float                                              fViewKickHip_YMax;                                        // 0x01F0(0x0004) (Edit)
	float                                              fViewKickHip_Accel;                                       // 0x01F4(0x0004) (Edit)
	float                                              fViewKickHip_Decel;                                       // 0x01F8(0x0004) (Edit)
	float                                              fViewKickHip_StayTime;                                    // 0x01FC(0x0004) (Edit)
	float                                              fViewKickHip_DecaySpeed;                                  // 0x0200(0x0004) (Edit)
	float                                              fViewKickHip_DecayTimeFast;                               // 0x0204(0x0004) (Edit)
	float                                              fViewKickAds_XMin;                                        // 0x0208(0x0004) (Edit)
	float                                              fViewKickAds_XMax;                                        // 0x020C(0x0004) (Edit)
	float                                              fViewKickAds_YMin;                                        // 0x0210(0x0004) (Edit)
	float                                              fViewKickAds_YMax;                                        // 0x0214(0x0004) (Edit)
	float                                              fViewKickAds_Accel;                                       // 0x0218(0x0004) (Edit)
	float                                              fViewKickAds_Decel;                                       // 0x021C(0x0004) (Edit)
	float                                              fViewKickAds_StayTime;                                    // 0x0220(0x0004) (Edit)
	float                                              fViewKickAds_DecaySpeed;                                  // 0x0224(0x0004) (Edit)
	float                                              fViewKickAds_DecayTimeFast;                               // 0x0228(0x0004) (Edit)
	float                                              fAnimRate_PutDown;                                        // 0x022C(0x0004) (Edit)
	float                                              fAnimRate_PutDown_Quick;                                  // 0x0230(0x0004) (Edit)
	float                                              fAnimRate_BringUp;                                        // 0x0234(0x0004) (Edit)
	float                                              fAnimRate_SprintBringUp;                                  // 0x0238(0x0004) (Edit)
	float                                              fAnimRate_AdsOn;                                          // 0x023C(0x0004) (Edit)
	float                                              fAnimRate_AdsOff;                                         // 0x0240(0x0004) (Edit)
	unsigned long                                      bApplyQuickDrop : 1;                                      // 0x0244(0x0004) (Edit)
	float                                              fMaxPitch;                                                // 0x0248(0x0004) (Edit)
	int                                                iCrossHair;                                               // 0x024C(0x0004) (Edit)
	float                                              fMovePivot;                                               // 0x0250(0x0004) (Edit)
	float                                              fSprintStaminaRate;                                       // 0x0254(0x0004) (Edit)
	float                                              fSprintSpeed;                                             // 0x0258(0x0004) (Edit)
	float                                              fRunSpeed;                                                // 0x025C(0x0004) (Edit)
	float                                              fCrouchSpeed;                                             // 0x0260(0x0004) (Edit)
	float                                              fPronedSpeed;                                             // 0x0264(0x0004) (Edit)
	float                                              fAimRunSpeed;                                             // 0x0268(0x0004) (Edit)
	float                                              fAimCrouchSpeed;                                          // 0x026C(0x0004) (Edit)
	float                                              fStaminaRecovery;                                         // 0x0270(0x0004) (Edit)
	float                                              fHitMoveSpeed;                                            // 0x0274(0x0004) (Edit)
	float                                              fHitMoveTime;                                             // 0x0278(0x0004) (Edit)
	float                                              fHitMoveDelay;                                            // 0x027C(0x0004) (Edit)
	float                                              fBreathRadius_Idle;                                       // 0x0280(0x0004) (Edit)
	float                                              fBreathSpeed_Idle;                                        // 0x0284(0x0004) (Edit)
	float                                              fBreathRadius_Aim;                                        // 0x0288(0x0004) (Edit)
	float                                              fBreathSpeed_Aim;                                         // 0x028C(0x0004) (Edit)
	float                                              fBreathRadius_DuckedAim;                                  // 0x0290(0x0004) (Edit)
	float                                              fBreathSpeed_DuckedAim;                                   // 0x0294(0x0004) (Edit)
	float                                              fBreathRadius_ProneAim;                                   // 0x0298(0x0004) (Edit)
	float                                              fBreathSpeed_ProneAim;                                    // 0x029C(0x0004) (Edit)
	float                                              fBobWeapon_Move;                                          // 0x02A0(0x0004) (Edit)
	float                                              fBobScreen_Move;                                          // 0x02A4(0x0004) (Edit)
	float                                              fBobWeapon_Ads_Move;                                      // 0x02A8(0x0004) (Edit)
	float                                              fBobScreen_Ads_Move;                                      // 0x02AC(0x0004) (Edit)
	float                                              fBobWeapon_Ducked_Move;                                   // 0x02B0(0x0004) (Edit)
	float                                              fBobScreen_Ducked_Move;                                   // 0x02B4(0x0004) (Edit)
	float                                              fBobScreen_Prone_Move;                                    // 0x02B8(0x0004) (Edit)
	float                                              fBobWeapon_Sprint_Move;                                   // 0x02BC(0x0004) (Edit)
	float                                              fBobScreen_Sprint_Move;                                   // 0x02C0(0x0004) (Edit)
	float                                              fBobWeapon_sprint_y;                                      // 0x02C4(0x0004) (Edit)
	float                                              fBobScreen_sprint_y;                                      // 0x02C8(0x0004) (Edit)
	float                                              fBobWeapon_ads_move_y;                                    // 0x02CC(0x0004) (Edit)
	float                                              fBobScreen_ads_move_y;                                    // 0x02D0(0x0004) (Edit)
	float                                              fBobWeapon_move_y;                                        // 0x02D4(0x0004) (Edit)
	float                                              fBobScreen_move_y;                                        // 0x02D8(0x0004) (Edit)
	float                                              fBobWeapon_ducked_move_y;                                 // 0x02DC(0x0004) (Edit)
	float                                              fBobScreen_ducked_move_y;                                 // 0x02E0(0x0004) (Edit)
	float                                              fBobScreen_prone_move_y;                                  // 0x02E4(0x0004) (Edit)
	float                                              fSway_HipX_Max;                                           // 0x02E8(0x0004) (Edit)
	float                                              fSway_HipX_Incr;                                          // 0x02EC(0x0004) (Edit)
	float                                              fSway_HipX_Speed;                                         // 0x02F0(0x0004) (Edit)
	float                                              fSway_HipY_Max;                                           // 0x02F4(0x0004) (Edit)
	float                                              fSway_HipY_Incr;                                          // 0x02F8(0x0004) (Edit)
	float                                              fSway_HipY_Speed;                                         // 0x02FC(0x0004) (Edit)
	float                                              fSway_AdsX_Max;                                           // 0x0300(0x0004) (Edit)
	float                                              fSway_AdsX_Incr;                                          // 0x0304(0x0004) (Edit)
	float                                              fSway_AdsX_Speed;                                         // 0x0308(0x0004) (Edit)
	float                                              fSway_AdsY_Max;                                           // 0x030C(0x0004) (Edit)
	float                                              fSway_AdsY_Incr;                                          // 0x0310(0x0004) (Edit)
	float                                              fSway_AdsY_Speed;                                         // 0x0314(0x0004) (Edit)
	float                                              fFiringSway_HipX_Max;                                     // 0x0318(0x0004) (Edit)
	float                                              fFiringSway_HipX_Incr;                                    // 0x031C(0x0004) (Edit)
	float                                              fFiringSway_HipX_Speed;                                   // 0x0320(0x0004) (Edit)
	float                                              fFiringSway_HipY_Max;                                     // 0x0324(0x0004) (Edit)
	float                                              fFiringSway_HipY_Incr;                                    // 0x0328(0x0004) (Edit)
	float                                              fFiringSway_HipY_Speed;                                   // 0x032C(0x0004) (Edit)
	float                                              fFiringSway_AdsX_Max;                                     // 0x0330(0x0004) (Edit)
	float                                              fFiringSway_AdsX_Incr;                                    // 0x0334(0x0004) (Edit)
	float                                              fFiringSway_AdsX_Speed;                                   // 0x0338(0x0004) (Edit)
	float                                              fFiringSway_AdsY_Max;                                     // 0x033C(0x0004) (Edit)
	float                                              fFiringSway_AdsY_Incr;                                    // 0x0340(0x0004) (Edit)
	float                                              fFiringSway_AdsY_Speed;                                   // 0x0344(0x0004) (Edit)
	TEnumAsByte<ECrosshairType>                        CrosshairType;                                            // 0x0348(0x0001) (Edit)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0349(0x0003) MISSED OFFSET
	struct FString                                     CrosshairImage;                                           // 0x034C(0x000C) (Edit, NeedCtorLink)
	int                                                ui_damage;                                                // 0x0358(0x0004) (Edit)
	int                                                ui_spread;                                                // 0x035C(0x0004) (Edit)
	int                                                ui_view_kick;                                             // 0x0360(0x0004) (Edit)
	int                                                ui_rate_of_fire;                                          // 0x0364(0x0004) (Edit)
	int                                                ui_move;                                                  // 0x0368(0x0004) (Edit)
	int                                                ui_range;                                                 // 0x036C(0x0004) (Edit)
	float                                              fNPCSpreadRate;                                           // 0x0370(0x0004)
	float                                              fNPCRateOfFire;                                           // 0x0374(0x0004)
	int                                                iNPCFire;                                                 // 0x0378(0x0004)
	float                                              wt_BoundingMax;                                           // 0x037C(0x0004)
	float                                              wt_RandomMul;                                             // 0x0380(0x0004)
	TArray<float>                                      wt_x;                                                     // 0x0384(0x000C) (NeedCtorLink)
	TArray<float>                                      wt_y;                                                     // 0x0390(0x000C) (NeedCtorLink)
	TArray<float>                                      wt_RandomWeight;                                          // 0x039C(0x000C) (NeedCtorLink)
	float                                              wtAim_BoundingMax;                                        // 0x03A8(0x0004)
	float                                              wtAim_RandomMul;                                          // 0x03AC(0x0004)
	TArray<float>                                      wtAim_x;                                                  // 0x03B0(0x000C) (NeedCtorLink)
	TArray<float>                                      wtAim_y;                                                  // 0x03BC(0x000C) (NeedCtorLink)
	TArray<float>                                      wtAim_RandomWeight;                                       // 0x03C8(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.wWeaponBaseParams");
		return ptr;
	}


	TEnumAsByte<ECrosshairType> GetCrosshairType(const struct FString& szValue);
	TEnumAsByte<EReloadType> GetReloadType(const struct FString& szValue);
	TEnumAsByte<EProjMoveType> GetProjMoveType(const struct FString& szValue);
	TEnumAsByte<EBulletType> GetBulletType(const struct FString& szValue);
};


// Class Engine.wWeaponManager
// 0x006C (0x0098 - 0x002C)
class UwWeaponManager : public UObject
{
public:
	TArray<class UwWeaponBaseParams*>                  WeaponParams;                                             // 0x002C(0x000C) (NeedCtorLink)
	TArray<struct FString>                             arr_szResClass;                                           // 0x0038(0x000C) (NeedCtorLink)
	TArray<class UClass*>                              arr_classRes;                                             // 0x0044(0x000C) (NeedCtorLink)
	TArray<float>                                      BaseSpeed_Sprint;                                         // 0x0050(0x000C) (NeedCtorLink)
	TArray<float>                                      BaseSpeed_Run;                                            // 0x005C(0x000C) (NeedCtorLink)
	TArray<float>                                      BaseSpeed_Aim;                                            // 0x0068(0x000C) (NeedCtorLink)
	TArray<float>                                      BaseSpeed_Run_Cr;                                         // 0x0074(0x000C) (NeedCtorLink)
	TArray<float>                                      BaseSpeed_Aim_Cr;                                         // 0x0080(0x000C) (NeedCtorLink)
	TArray<float>                                      BaseSpeed_Prone;                                          // 0x008C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.wWeaponManager");
		return ptr;
	}


	void STATIC_PrecacheSound();
	void STATIC_PrecacheMaterials(class ALevelInfo* Level);
	void STATIC_PrecacheClasses();
	class UwWeaponBaseParams* GetBaseParam(int id);
	void AddWeaponExParams(class UBTNetExcelData* excelWeapon, bool bCheat, class AwWeapon* Weapon);
	void AddWeaponParams(class UBTNetExcelData* excelWeapon, bool bCheat, class AwWeapon* Weapon);
	void LoadWeaponParams(const struct FString& strExcelFileName, bool bCheat, class AwWeapon* Weapon);
	void AddWeaponRecoilParams(class UBTNetGameData* GameData);
	void LoadWeaponRecoilParams();
	class UClass* GetRes(const struct FString& szRes);
	void InitWeaponPrecacheClasses();
	void LoadWeaponRes();
	bool IsUseWeapon_InGame(int iGameMode, int iWeaponID);
	void DestroyScript();
	void InitScript(const struct FString& strExcelFileName);
};


// Class Engine.ObjectPool
// 0x0010 (0x003C - 0x002C)
class UObjectPool : public UObject
{
public:
	TArray<class UObject*>                             Objects;                                                  // 0x002C(0x000C) (NeedCtorLink)
	int                                                NewCount;                                                 // 0x0038(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.ObjectPool");
		return ptr;
	}


	void Shrink();
	class UObject* FreeObjectDupCheck(class UObject* obj);
	class UObject* FreeObject(class UObject* obj);
	class UObject* AllocateObject(class UClass* ObjectClass);
	class UObject* PopObject(class UClass* ObjectClass);
};


// Class Engine.Actor
// 0x03AC (0x03D8 - 0x002C)
class AActor : public UObject
{
public:
	TEnumAsByte<ELightType>                            LightType;                                                // 0x002C(0x0001) (Edit, Net)
	TEnumAsByte<ELightEffect>                          LightEffect;                                              // 0x002D(0x0001) (Edit, Net)
	unsigned char                                      LightHue;                                                 // 0x002E(0x0001) (Edit, Net)
	unsigned char                                      LightSaturation;                                          // 0x002F(0x0001) (Edit, Net)
	float                                              LightBrightness;                                          // 0x0030(0x0004) (Edit, Net)
	float                                              LightRadius;                                              // 0x0034(0x0004) (Edit, Net)
	unsigned char                                      LightPeriod;                                              // 0x0038(0x0001) (Edit, Net)
	unsigned char                                      LightPhase;                                               // 0x0039(0x0001) (Edit, Net)
	unsigned char                                      LightCone;                                                // 0x003A(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x1];                                       // 0x003B(0x0001) MISSED OFFSET
	float                                              LightBrightnessScale;                                     // 0x003C(0x0004) (Edit)
	float                                              PawnLightBrightnessScale;                                 // 0x0040(0x0004) (Edit)
	TEnumAsByte<EDrawType>                             DrawType;                                                 // 0x0044(0x0001) (Edit, Const, Net)
	TEnumAsByte<EFilterState>                          StaticFilterState;                                        // 0x0045(0x0001) (Const, Native)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0046(0x0002) MISSED OFFSET
	class UStaticMesh*                                 StaticMesh;                                               // 0x0048(0x0004) (Edit, Const, Net)
	class AActor*                                      Owner;                                                    // 0x004C(0x0004) (Const, Net)
	class AActor*                                      Base;                                                     // 0x0050(0x0004) (Const, Net)
	class UMaterial*                                   BaseMaterial;                                             // 0x0054(0x0004) (Const)
	struct FActorRenderDataPtr                         ActorRenderData;                                          // 0x0058(0x0004) (Const, Native)
	struct FLightRenderDataPtr                         LightRenderData;                                          // 0x005C(0x0004) (Const, Native)
	int                                                RenderRevision;                                           // 0x0060(0x0004) (Const, Native)
	int                                                FunctionReplicateCount;                                   // 0x0064(0x0004)
	int                                                VariableReplicateCount;                                   // 0x0068(0x0004)
	TArray<struct FBatchReference>                     StaticSectionBatches;                                     // 0x006C(0x000C) (Const, Native)
	struct FName                                       ForcedVisibilityZoneTag;                                  // 0x0078(0x0004) (Edit, Const)
	float                                              CullDistance;                                             // 0x007C(0x0004) (Edit)
	float                                              fLightScale;                                              // 0x0080(0x0004) (Edit)
	unsigned long                                      bSpecialLit : 1;                                          // 0x0084(0x0004) (Edit, Net)
	unsigned long                                      bActorShadows : 1;                                        // 0x0084(0x0004) (Edit)
	unsigned long                                      bCorona : 1;                                              // 0x0084(0x0004) (Edit)
	unsigned long                                      bDirectionalCorona : 1;                                   // 0x0084(0x0004) (Edit)
	unsigned long                                      bAttenByLife : 1;                                         // 0x0084(0x0004) (Edit)
	unsigned long                                      bLightingVisibility : 1;                                  // 0x0084(0x0004) (Edit)
	unsigned long                                      bUseDynamicLights : 1;                                    // 0x0084(0x0004) (Edit)
	unsigned long                                      bLightChanged : 1;                                        // 0x0084(0x0004)
	unsigned long                                      bDramaticLighting : 1;                                    // 0x0084(0x0004)
	unsigned long                                      bStatic : 1;                                              // 0x0084(0x0004) (Edit, Const)
	unsigned long                                      bHidden : 1;                                              // 0x0084(0x0004) (Edit, Net)
	unsigned long                                      bNoDelete : 1;                                            // 0x0084(0x0004) (Edit, Const)
	unsigned long                                      bDeleteMe : 1;                                            // 0x0084(0x0004) (Const)
	unsigned long                                      bTicked : 1;                                              // 0x0084(0x0004) (Const, Transient)
	unsigned long                                      bDynamicLight : 1;                                        // 0x0084(0x0004) (Edit)
	unsigned long                                      bEnvironmentLight : 1;                                    // 0x0084(0x0004) (Edit)
	unsigned long                                      bTimerLoop : 1;                                           // 0x0084(0x0004)
	unsigned long                                      bOnlyOwnerSee : 1;                                        // 0x0084(0x0004) (Net)
	unsigned long                                      bHighDetail : 1;                                          // 0x0084(0x0004) (Edit)
	unsigned long                                      bSuperHighDetail : 1;                                     // 0x0084(0x0004) (Edit)
	unsigned long                                      bOnlyDrawIfAttached : 1;                                  // 0x0084(0x0004) (Net)
	unsigned long                                      bStasis : 1;                                              // 0x0084(0x0004) (Edit)
	unsigned long                                      bTrailerAllowRotation : 1;                                // 0x0084(0x0004)
	unsigned long                                      bTrailerSameRotation : 1;                                 // 0x0084(0x0004)
	unsigned long                                      bTrailerPrePivot : 1;                                     // 0x0084(0x0004)
	unsigned long                                      bWorldGeometry : 1;                                       // 0x0084(0x0004)
	unsigned long                                      bAcceptsProjectors : 1;                                   // 0x0084(0x0004) (Edit)
	unsigned long                                      bOrientOnSlope : 1;                                       // 0x0084(0x0004)
	unsigned long                                      bOnlyAffectPawns : 1;                                     // 0x0084(0x0004) (Const)
	unsigned long                                      bDisableSorting : 1;                                      // 0x0084(0x0004) (Edit)
	unsigned long                                      bIgnoreEncroachers : 1;                                   // 0x0084(0x0004) (Edit, Net)
	unsigned long                                      bShowOctreeNodes : 1;                                     // 0x0084(0x0004)
	unsigned long                                      bWasSNFiltered : 1;                                       // 0x0088(0x0004)
	unsigned long                                      bShouldStopKarma : 1;                                     // 0x0088(0x0004) (Const, Transient)
	unsigned long                                      bDetailAttachment : 1;                                    // 0x0088(0x0004) (Const)
	unsigned long                                      bNetTemporary : 1;                                        // 0x0088(0x0004) (Const)
	unsigned long                                      bOnlyRelevantToOwner : 1;                                 // 0x0088(0x0004)
	unsigned long                                      bNetDirty : 1;                                            // 0x0088(0x0004) (Const, Transient)
	unsigned long                                      bAlwaysRelevant : 1;                                      // 0x0088(0x0004)
	unsigned long                                      bReplicateInstigator : 1;                                 // 0x0088(0x0004)
	unsigned long                                      bReplicateMovement : 1;                                   // 0x0088(0x0004)
	unsigned long                                      bSkipActorPropertyReplication : 1;                        // 0x0088(0x0004)
	unsigned long                                      bUpdateSimulatedPosition : 1;                             // 0x0088(0x0004)
	unsigned long                                      bTearOff : 1;                                             // 0x0088(0x0004) (Net)
	unsigned long                                      bOnlyDirtyReplication : 1;                                // 0x0088(0x0004)
	unsigned long                                      bReplicateAnimations : 1;                                 // 0x0088(0x0004)
	unsigned long                                      bNetInitialRotation : 1;                                  // 0x0088(0x0004) (Const)
	unsigned long                                      bCompressedPosition : 1;                                  // 0x0088(0x0004)
	unsigned long                                      bAlwaysZeroBoneOffset : 1;                                // 0x0088(0x0004)
	unsigned long                                      bIgnoreVehicles : 1;                                      // 0x0088(0x0004)
	unsigned long                                      bDeferRendering : 1;                                      // 0x0088(0x0004) (Edit)
	unsigned long                                      bBadStateCode : 1;                                        // 0x0088(0x0004)
	unsigned long                                      bSkipTimerInChangedHost : 1;                              // 0x0088(0x0004)
	unsigned long                                      bSkipLifeSpanInChangedHost : 1;                           // 0x0088(0x0004)
	int                                                nOldActor;                                                // 0x008C(0x0004)
	TArray<class UObject*>                             DestroyListeners;                                         // 0x0090(0x000C) (NeedCtorLink)
	TEnumAsByte<EPhysics>                              Physics;                                                  // 0x009C(0x0001) (Edit, Const, Net)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x009D(0x0001) (Net)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x009E(0x0001) (Net)
	unsigned char                                      UnknownData02[0x1];                                       // 0x009F(0x0001) MISSED OFFSET
	int                                                NetTag;                                                   // 0x00A0(0x0004) (Const, Transient)
	float                                              NetUpdateTime;                                            // 0x00A4(0x0004)
	float                                              NetUpdateFrequency;                                       // 0x00A8(0x0004) (Localized)
	float                                              NetPriority;                                              // 0x00AC(0x0004)
	class APawn*                                       Instigator;                                               // 0x00B0(0x0004) (Net)
	class USound*                                      AmbientSound;                                             // 0x00B4(0x0004) (Edit, Net)
	struct FString                                     FmodAmbientSound;                                         // 0x00B8(0x000C) (Edit, NeedCtorLink)
	struct FName                                       AttachmentBone;                                           // 0x00C4(0x0004) (Const, Net)
	class ALevelInfo*                                  Level;                                                    // 0x00C8(0x0004) (Const)
	class ULevel*                                      XLevel;                                                   // 0x00CC(0x0004) (Const, Transient)
	float                                              LifeSpan;                                                 // 0x00D0(0x0004) (Edit)
	float                                              LifeSpanReplicated;                                       // 0x00D4(0x0004) (Net)
	float                                              LifeSpanReplicatedClient;                                 // 0x00D8(0x0004)
	struct FPointRegion                                Region;                                                   // 0x00DC(0x000C) (Const)
	float                                              TimerRate;                                                // 0x00E8(0x0004)
	class UMaterial*                                   OverlayMaterial;                                          // 0x00EC(0x0004) (Edit, Net)
	class UMesh*                                       Mesh;                                                     // 0x00F0(0x0004) (Edit, Const, Net)
	float                                              LastRenderTime;                                           // 0x00F4(0x0004) (Transient)
	struct FName                                       Tag;                                                      // 0x00F8(0x0004) (Edit)
	TArray<int>                                        Leaves;                                                   // 0x00FC(0x000C) (Transient, NeedCtorLink)
	struct FName                                       Event;                                                    // 0x0108(0x0004) (Edit)
	class AInventory*                                  Inventory;                                                // 0x010C(0x0004) (Net)
	float                                              TimerCounter;                                             // 0x0110(0x0004) (Const)
	class UMeshInstance*                               MeshInstance;                                             // 0x0114(0x0004) (Transient)
	float                                              LODBias;                                                  // 0x0118(0x0004) (Edit)
	struct FName                                       InitialState;                                             // 0x011C(0x0004) (Edit)
	struct FName                                       Group;                                                    // 0x0120(0x0004) (Edit)
	TArray<class AActor*>                              Touching;                                                 // 0x0124(0x000C) (Const, NeedCtorLink)
	TArray<struct FPointer>                            OctreeNodes;                                              // 0x0130(0x000C) (Const, Transient, NeedCtorLink)
	struct FBox                                        OctreeBox;                                                // 0x013C(0x001C) (Const, Transient)
	struct FVector                                     OctreeBoxCenter;                                          // 0x0158(0x000C) (Const, Transient)
	struct FVector                                     OctreeBoxRadii;                                           // 0x0164(0x000C) (Const, Transient)
	class AActor*                                      Deleted;                                                  // 0x0170(0x0004) (Const)
	float                                              LatentFloat;                                              // 0x0174(0x0004) (Const)
	int                                                CollisionTag;                                             // 0x0178(0x0004) (Const, Native)
	int                                                JoinedTag;                                                // 0x017C(0x0004) (Const, Transient)
	class APhysicsVolume*                              PhysicsVolume;                                            // 0x0180(0x0004) (Const)
	struct FVector                                     Location;                                                 // 0x0184(0x000C) (Edit, Const, Net)
	struct FRotator                                    Rotation;                                                 // 0x0190(0x000C) (Edit, Const, Net)
	struct FVector                                     Velocity;                                                 // 0x019C(0x000C) (Edit, Net)
	struct FVector                                     Acceleration;                                             // 0x01A8(0x000C)
	float                                              fLeanAcc;                                                 // 0x01B4(0x0004)
	struct FVector                                     vLeanVel;                                                 // 0x01B8(0x000C)
	struct FVector                                     vLeanAcc;                                                 // 0x01C4(0x000C)
	struct FVector                                     CachedLocation;                                           // 0x01D0(0x000C) (Const)
	struct FRotator                                    CachedRotation;                                           // 0x01DC(0x000C) (Const)
	struct FMatrix                                     CachedLocalToWorld;                                       // 0x01E8(0x0040)
	struct FName                                       AttachTag;                                                // 0x0228(0x0004) (Edit)
	TArray<class AActor*>                              Attached;                                                 // 0x022C(0x000C) (Const, NeedCtorLink)
	struct FVector                                     RelativeLocation;                                         // 0x0238(0x000C) (Const, Net)
	struct FRotator                                    RelativeRotation;                                         // 0x0244(0x000C) (Const, Net)
	unsigned long                                      bUseRelativeBaseRotation : 1;                             // 0x0250(0x0004)
	struct FMatrix                                     HardRelMatrix;                                            // 0x0254(0x0040) (Const)
	TArray<struct FProjectorRenderInfoPtr>             Projectors;                                               // 0x0294(0x000C) (Const, Native)
	TArray<struct FStaticMeshProjectorRenderInfoPtr>   StaticMeshProjectors;                                     // 0x02A0(0x000C) (Const, Native)
	class UMaterial*                                   Texture;                                                  // 0x02AC(0x0004) (Edit, Net)
	class UStaticMeshInstance*                         StaticMeshInstance;                                       // 0x02B0(0x0004)
	class UModel*                                      Brush;                                                    // 0x02B4(0x0004) (Const, ExportObject)
	float                                              DrawScale;                                                // 0x02B8(0x0004) (Edit, Const, Net)
	struct FVector                                     DrawScale3D;                                              // 0x02BC(0x000C) (Edit, Const)
	struct FVector                                     PrePivot;                                                 // 0x02C8(0x000C) (Edit, Net)
	unsigned long                                      bSyncCollsionSizeHK : 1;                                  // 0x02D4(0x0004)
	TArray<class UMaterial*>                           Skins;                                                    // 0x02D8(0x000C) (Edit, NeedCtorLink)
	class UMaterial*                                   RepSkin;                                                  // 0x02E4(0x0004) (Net)
	unsigned char                                      AmbientGlow;                                              // 0x02E8(0x0001) (Edit, Net)
	unsigned char                                      MaxLights;                                                // 0x02E9(0x0001) (Edit)
	TEnumAsByte<EUV2Mode>                              UV2Mode;                                                  // 0x02EA(0x0001) (Edit)
	unsigned char                                      UnknownData03[0x1];                                       // 0x02EB(0x0001) MISSED OFFSET
	class UConvexVolume*                               AntiPortal;                                               // 0x02EC(0x0004) (Edit, ExportObject)
	class UMaterial*                                   UV2Texture;                                               // 0x02F0(0x0004) (Edit)
	int                                                UV2TextureSize;                                           // 0x02F4(0x0004) (Edit)
	class UMaterial*                                   UV2DirectionalLightmaps;                                  // 0x02F8(0x0004) (Edit)
	float                                              ScaleGlow;                                                // 0x02FC(0x0004) (Edit)
	class UMaterial*                                   EnvironmentMap;                                           // 0x0300(0x0004) (Edit)
	int                                                CurrentLODLevel;                                          // 0x0304(0x0004)
	unsigned long                                      bShadowMap : 1;                                           // 0x0308(0x0004) (Edit)
	unsigned long                                      bSelfShadowCast : 1;                                      // 0x0308(0x0004) (Edit)
	unsigned long                                      bExcludeVisibilityTest : 1;                               // 0x0308(0x0004) (Edit)
	unsigned long                                      bIsFar : 1;                                               // 0x0308(0x0004) (Edit)
	unsigned long                                      bDontBatch : 1;                                           // 0x0308(0x0004) (Edit)
	TEnumAsByte<EActor_ESurfaceTypes>                  SurfaceType;                                              // 0x030C(0x0001) (Edit)
	TEnumAsByte<ERenderStyle>                          Style;                                                    // 0x030D(0x0001) (Edit, Net)
	unsigned char                                      UnknownData04[0x2];                                       // 0x030E(0x0002) MISSED OFFSET
	unsigned long                                      bUnlit : 1;                                               // 0x0310(0x0004) (Edit, Net)
	unsigned long                                      bShadowCast : 1;                                          // 0x0310(0x0004) (Edit)
	unsigned long                                      bStaticLighting : 1;                                      // 0x0310(0x0004) (Edit)
	unsigned long                                      bUseLightingFromBase : 1;                                 // 0x0310(0x0004) (Edit)
	unsigned long                                      bHurtEntry : 1;                                           // 0x0310(0x0004)
	unsigned long                                      bGameRelevant : 1;                                        // 0x0310(0x0004) (Edit)
	unsigned long                                      bCollideWhenPlacing : 1;                                  // 0x0310(0x0004) (Edit)
	unsigned long                                      bTravel : 1;                                              // 0x0310(0x0004)
	unsigned long                                      bMovable : 1;                                             // 0x0310(0x0004) (Edit)
	unsigned long                                      bDestroyInPainVolume : 1;                                 // 0x0310(0x0004)
	unsigned long                                      bCanBeDamaged : 1;                                        // 0x0310(0x0004)
	unsigned long                                      bShouldBaseAtStartup : 1;                                 // 0x0310(0x0004) (Edit)
	unsigned long                                      bPendingDelete : 1;                                       // 0x0310(0x0004)
	unsigned long                                      bAnimByOwner : 1;                                         // 0x0310(0x0004)
	unsigned long                                      bOwnerNoSee : 1;                                          // 0x0310(0x0004)
	unsigned long                                      bCanTeleport : 1;                                         // 0x0310(0x0004) (Edit)
	unsigned long                                      bClientAnim : 1;                                          // 0x0310(0x0004)
	unsigned long                                      bDisturbFluidSurface : 1;                                 // 0x0310(0x0004)
	float                                              FluidSurfaceShootStrengthMod;                             // 0x0314(0x0004)
	unsigned long                                      bAlwaysTick : 1;                                          // 0x0318(0x0004) (Const)
