#pragma once

// Arctic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GUIWarfare.BTNetGUIPage
// 0x00E4 (0x0448 - 0x0364)
class UBTNetGUIPage : public UGUIPage
{
public:
	class UBTNetMainMenu*                              page_Main;                                                // 0x0364(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTTcpLink_Channel*                          TcpChannel;                                               // 0x0368(0x0004)
	class UBTTcpLink_Login*                            TcpLogin;                                                 // 0x036C(0x0004)
	TArray<struct FString>                             BGMList;                                                  // 0x0370(0x000C) (NeedCtorLink)
	class UBTNetGameData*                              NetGameData;                                              // 0x037C(0x0004)
	class UBTDataTransferClientLink*                   DataTransferLink;                                         // 0x0380(0x0004)
	struct FString                                     strSystem;                                                // 0x0384(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strClanGrade[0x5];                                        // 0x0390(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strSlashW;                                                // 0x03CC(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strSlashN;                                                // 0x03D8(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strSlashC;                                                // 0x03E4(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strSlashT;                                                // 0x03F0(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strTo;                                                    // 0x03FC(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strFrom;                                                  // 0x0408(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strLink;                                                  // 0x0414(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strExit;                                                  // 0x0420(0x000C) (Localized, NeedCtorLink)
	struct FFloatBox                                   fbAdvertise;                                              // 0x042C(0x0010)
	struct FString                                     AdvertiseURL;                                             // 0x043C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTNetGUIPage");
		return ptr;
	}


	void Internal_LostFocus(class UGUIPage* NewMenu);
	void Internal_GetFocus();
	void OnCompleteOpened();
	void OnBackToLastPage();
	void ProcessNat();
	bool InternalOnPreDraw(class UCanvas* C);
	bool MyCanClose(bool bCanceled);
	void Opened(class UGUIComponent* Sender);
	class UBTTcpLink_Login* GetTcpLogin();
	class UBTTcpLink_Channel* GetTcpChannel();
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	struct FChatInfo TextToChatInfo(const struct FString& Text);
	void RefreshPage();
};


// Class GUIWarfare.BTConsole
// 0x022C (0x0BC0 - 0x0994)
class UBTConsole : public UExtendedConsole
{
public:
	struct FString                                     strRecordRetCode[0x4];                                    // 0x0994(0x000C) (Localized, NeedCtorLink)
	struct FString                                     lsNotEnableRecordOption;                                  // 0x09C4(0x000C) (Localized, NeedCtorLink)
	unsigned long                                      bStopOutofSeat : 1;                                       // 0x09D0(0x0004)
	int                                                OutofSeatTime;                                            // 0x09D4(0x0004)
	int                                                OwnerOutofSeatTime;                                       // 0x09D8(0x0004)
	int                                                UserReadyTime;                                            // 0x09DC(0x0004)
	int                                                UserReadyTimeCount;                                       // 0x09E0(0x0004)
	int                                                preLevelTime;                                             // 0x09E4(0x0004)
	int                                                LevelTime;                                                // 0x09E8(0x0004)
	float                                              LastKeySleepTime;                                         // 0x09EC(0x0004)
	unsigned long                                      bReqFontReset : 1;                                        // 0x09F0(0x0004)
	struct FString                                     strChangeQS;                                              // 0x09F4(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strCloseQSWindow;                                         // 0x0A00(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strChatMode[0x7];                                         // 0x0A0C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strChattingHelpGFS;                                       // 0x0A60(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strChattingHelp;                                          // 0x0A6C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strRegulateShot;                                          // 0x0A78(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strSaveShot;                                              // 0x0A84(0x000C) (Localized, NeedCtorLink)
	struct FFloatBox                                   fbChatHistory[0x2];                                       // 0x0A90(0x0010)
	struct FFloatBox                                   fbButtonChatMode;                                         // 0x0AB0(0x0010)
	struct FFloatBox                                   fbChatEditBox;                                            // 0x0AC0(0x0010)
	struct FFloatBox                                   fbLabelEditBox;                                           // 0x0AD0(0x0010)
	struct FString                                     strGhostChatModeTeam;                                     // 0x0AE0(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strGhostChatModeAll;                                      // 0x0AEC(0x000C) (Localized, NeedCtorLink)
	TArray<struct FString>                             MessageType_PostString;                                   // 0x0AF8(0x000C) (NeedCtorLink)
	TArray<struct FColor>                              MessageType_Color;                                        // 0x0B04(0x000C) (NeedCtorLink)
	unsigned long                                      bChatEnabled : 1;                                         // 0x0B10(0x0004)
	class UBTChatEditBoxHK*                            ChatEditBox;                                              // 0x0B14(0x0004) (ExportObject, NeedCtorLink, EditInline)
	float                                              CharEditBoxCursorHeightRatio;                             // 0x0B18(0x0004)
	TEnumAsByte<EMessageType>                          ChatMessageType;                                          // 0x0B1C(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0B1D(0x0003) MISSED OFFSET
	unsigned long                                      bChatInGhostMode : 1;                                     // 0x0B20(0x0004)
	class UMaterial*                                   ChatSelectImg;                                            // 0x0B24(0x0004)
	TArray<struct FMessageItem>                        MessageItems;                                             // 0x0B28(0x000C) (NeedCtorLink)
	float                                              MessageItemsX;                                            // 0x0B34(0x0004)
	float                                              MessageItemsYFromBottom;                                  // 0x0B38(0x0004)
	float                                              MessageItemsLineSpacing;                                  // 0x0B3C(0x0004)
	int                                                MaxMessageItems;                                          // 0x0B40(0x0004)
	unsigned char                                      byPressed_Shift;                                          // 0x0B44(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0B45(0x0003) MISSED OFFSET
	unsigned long                                      ToggleIme : 1;                                            // 0x0B48(0x0004)
	unsigned long                                      ImeNative : 1;                                            // 0x0B48(0x0004)
	class UBTTcpLink_Channel*                          TcpHandler;                                               // 0x0B4C(0x0004)
	float                                              AccumDelta;                                               // 0x0B50(0x0004)
	float                                              EventTimerDelta;                                          // 0x0B54(0x0004)
	float                                              EventTimerNextStep;                                       // 0x0B58(0x0004)
	class UBTNetMainMenu*                              MainMenu;                                                 // 0x0B5C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FColor                                      ShadowColor;                                              // 0x0B60(0x0004)
	int                                                ResetImeCount;                                            // 0x0B64(0x0004)
	unsigned long                                      bAltPressed : 1;                                          // 0x0B68(0x0004)
	int                                                currentBGM;                                               // 0x0B6C(0x0004)
	int                                                CurrentBGMHandle;                                         // 0x0B70(0x0004)
	unsigned long                                      HasBGMDuration : 1;                                       // 0x0B74(0x0004)
	int                                                BGMStartTime;                                             // 0x0B78(0x0004)
	int                                                BGMDuration;                                              // 0x0B7C(0x0004)
	float                                              BGMFadeInTime;                                            // 0x0B80(0x0004)
	float                                              BGMFadeOutTime;                                           // 0x0B84(0x0004)
	int                                                BGMTermBetween;                                           // 0x0B88(0x0004)
	int                                                Term;                                                     // 0x0B8C(0x0004)
	TArray<struct FString>                             BGMs;                                                     // 0x0B90(0x000C) (NeedCtorLink)
	TArray<int>                                        BGMDurations;                                             // 0x0B9C(0x000C) (NeedCtorLink)
	TArray<struct FIntArray>                           BGMPartialPlayInitialSeeks;                               // 0x0BA8(0x000C) (NeedCtorLink)
	unsigned long                                      BGMPartialPlay : 1;                                       // 0x0BB4(0x0004)
	int                                                BGMPartialPlayDuration;                                   // 0x0BB8(0x0004)
	unsigned long                                      bGmPause : 1;                                             // 0x0BBC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTConsole");
		return ptr;
	}


	void ConsoleCMD(const struct FString& Line);
	void SendQuestUpdate();
	void ShowTutorialEndWindow();
	bool CheckTurorial_OnOK(class UGUIComponent* Sender);
	void SetAdminSpec(int B);
	void GetBot();
	void SetBot(int withBot, int num0, int num1, int Grade);
	void LogBot();
	void UpdateAAS();
	void UpdateGameNotice();
	void UpdateConnection(float Delta);
	void ProcessChatBan(float Delta);
	void ProcessOutOfSleep_InRoomLobby();
	void ProcessOutOfDoing_InRoomLobby();
	void ProcessOutOfCounting(int MaxTime, int CountTime, int CountingMsgCode, int OutMsgCode);
	void ProcessOutOfSeat(float Delta);
	bool IsExceptionOutOfSeat();
	void Tick(float Delta);
	void SetTermBetweenBGM(float val);
	void UpdateBGM(float dt);
	bool IsBGMPlaying();
	void StopBGM();
	void NextBGM();
	void SetBGMAdvanced(TArray<struct FString> List, bool partialPlay, int partialDuration, TArray<struct FIntArray> initialSeeks);
	void SetBGM(TArray<struct FString> List);
	void SetOneBGM(const struct FString& List);
	struct FString GetCurrentBGM();
	void SwitchChatMessageType(TEnumAsByte<EInputKey> key);
	void CallChatWhisper();
	void CallChatClan();
	void CallChatTeam();
	void CallChatAll();
	void CallChatMode();
	void SetChatHelpString();
	bool OnIME_Notify(int Type, int LangID, const struct FString& strText, int StartPos, int Size);
	bool NeedToOffIME();
	void DownloadWebzenShop();
	void CompletedQuest();
	void SendMessage(const struct FMessageItem& msgItem);
	void ClearMessageItems();
	void AddMessageItem(const struct FMessageItem& Item);
	struct FMessageItem ConstructMessageItem(const struct FString& Text, TEnumAsByte<EMessageType> MessageType);
	void ProhibitAltTab();
	void AddSystemMessageSaveShot(const struct FString& Text);
	void AddSystemMessageRegulateShot();
	void DrawMessageItems(class UCanvas* C);
	void DrawTextChattingHelp(class UCanvas* C);
	void DrawChatEditBox(class UCanvas* C);
	void PostRender(class UCanvas* C);
	void PreRender(class UCanvas* Canvas);
	void FontReset();
	bool CallSelectAlienType(TEnumAsByte<EInputKey> key);
	void CallBattleHelp();
	void CallSelectItemBuy(int iIndex);
	void CallSelectRadioMessage(int iIndex);
	void CallSelectQuickSlot(int iIndex);
	void CallToggleQuickSlot();
	void SetLoadingTime(int L, int P);
	void CMDHK(int Index, const struct FString& Param1, const struct FString& Param2, const struct FString& param3);
	void StopQuestLog();
	void CloseWindow(int Count);
	void RecordOn_Exception(int retCode);
	void RecordOn_FnRun(int Index);
	bool RecordOn_OnOK(class UGUIComponent* Sender);
	void RecordOn();
	void ShowWindow(const struct FString& windowclassname);
	void StartAutoMove(int Server, int Channel, int gameroom);
	void endTutorial();
	void tutorial(const struct FString& Map);
	void stopoos();
	bool BlockChangeWeapon(int nIndex);
	bool IsHaveMainWeapon(int nIndex);
	bool KeyEvent(TEnumAsByte<EInputKey> key, TEnumAsByte<EInputAction> Action, float Delta);
	bool KeyType(TEnumAsByte<EInputKey> key, const struct FString& Unicode);
	bool GetChatEnabled();
	void SetChatEnabled(bool Value);
	void ChatEditBox_OnInputSpace(class UGUIComponent* Sender, const struct FString& Text);
	void ChatEditBox_OnInputTab(class UGUIComponent* Sender, const struct FString& Text);
};


// Class GUIWarfare.BTNetMainMenu
// 0x086C (0x0CB4 - 0x0448)
class UBTNetMainMenu : public UBTNetGUIPage
{
public:
	class UBTTPChatHK*                                 TPChat;                                                   // 0x0448(0x0004) (ExportObject, NeedCtorLink, EditInline)
	int                                                CheckOneHour;                                             // 0x044C(0x0004)
	TEnumAsByte<EPage>                                 eCurrPage;                                                // 0x0450(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0451(0x0003) MISSED OFFSET
	unsigned long                                      kClanWarUserCountIgnore : 1;                              // 0x0454(0x0004)
	class UPageOnWindowManager*                        pwm;                                                      // 0x0458(0x0004)
	class UwMatchMaker*                                rMM;                                                      // 0x045C(0x0004) (Transient)
	class UwMyPlayerStatus*                            rMyStatus;                                                // 0x0460(0x0004) (Transient)
	class UwGameManager*                               rGameMgr;                                                 // 0x0464(0x0004) (Transient)
	struct FClanInfo                                   MyClanInfo;                                               // 0x0468(0x00A8) (NeedCtorLink)
	struct FClanInfo                                   kRecvClanInfo;                                            // 0x0510(0x00A8) (NeedCtorLink)
	struct FCharInfo                                   MyCharInfo;                                               // 0x05B8(0x00C0)
	struct FString                                     MyClanName;                                               // 0x0678(0x000C) (NeedCtorLink)
	struct FString                                     SaveClanName;                                             // 0x0684(0x000C) (NeedCtorLink)
	unsigned long                                      InTutorial : 1;                                           // 0x0690(0x0004)
	unsigned long                                      EnterBotMode : 1;                                         // 0x0690(0x0004)
	unsigned long                                      CreateBotMode : 1;                                        // 0x0690(0x0004)
	unsigned long                                      bRequestItemList : 1;                                     // 0x0690(0x0004)
	struct FWZInvenListProcess                         WZILP;                                                    // 0x0694(0x001C) (NeedCtorLink)
	int                                                CommandType;                                              // 0x06B0(0x0004)
	int                                                CommandParameter_int;                                     // 0x06B4(0x0004)
	struct FString                                     CommandParameter_string;                                  // 0x06B8(0x000C) (NeedCtorLink)
	unsigned long                                      bIsInPCBang : 1;                                          // 0x06C4(0x0004)
	unsigned long                                      bFirstLogin : 1;                                          // 0x06C4(0x0004)
	unsigned long                                      bAutoMove : 1;                                            // 0x06C4(0x0004)
	unsigned char                                      AutoMoveState;                                            // 0x06C8(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x06C9(0x0003) MISSED OFFSET
	unsigned long                                      AutoMoveDirectionOut : 1;                                 // 0x06CC(0x0004)
	int                                                AutoMoveClanWar;                                          // 0x06D0(0x0004)
	int                                                AutoMoveServerID;                                         // 0x06D4(0x0004)
	int                                                AutoMoveChannelID;                                        // 0x06D8(0x0004)
	int                                                AutoMoveGameRoomNum;                                      // 0x06DC(0x0004)
	struct FString                                     AutoMoveGameRoomPassword;                                 // 0x06E0(0x000C) (NeedCtorLink)
	unsigned long                                      bPostBoxFull : 1;                                         // 0x06EC(0x0004)
	unsigned long                                      bNewMailArrived : 1;                                      // 0x06EC(0x0004)
	int                                                NewMailCount;                                             // 0x06F0(0x0004)
	TArray<struct FServerConnectionInfo>               SCIList;                                                  // 0x06F4(0x000C) (NeedCtorLink)
	TArray<int>                                        NoviceChannelIndex;                                       // 0x0700(0x000C) (NeedCtorLink)
	TArray<struct FMapNameInfo>                        MapNameList;                                              // 0x070C(0x000C) (NeedCtorLink)
	struct FString                                     AuthLogin_ClientIP;                                       // 0x0718(0x000C) (NeedCtorLink)
	unsigned char                                      AuthLogin_ChannelType;                                    // 0x0724(0x0001)
	unsigned char                                      AuthLogin_ConnectAlpha;                                   // 0x0725(0x0001)
	unsigned char                                      AuthLogin_AccountType;                                    // 0x0726(0x0001)
	unsigned char                                      UnknownData02[0x1];                                       // 0x0727(0x0001) MISSED OFFSET
	struct FString                                     AuthLogin_GUID;                                           // 0x0728(0x000C) (NeedCtorLink)
	struct FString                                     AuthLogin_AccountID;                                      // 0x0734(0x000C) (NeedCtorLink)
	int                                                AuthLogin_ChannelingType;                                 // 0x0740(0x0004)
	struct FString                                     AuthLogin_AuthKey;                                        // 0x0744(0x000C) (NeedCtorLink)
	struct FString                                     AuthLogin_RegionKey;                                      // 0x0750(0x000C) (NeedCtorLink)
	struct FString                                     BirthDay;                                                 // 0x075C(0x000C) (NeedCtorLink)
	unsigned char                                      Sex;                                                      // 0x0768(0x0001)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0769(0x0003) MISSED OFFSET
	struct FString                                     szLoginPassword;                                          // 0x076C(0x000C) (NeedCtorLink)
	int                                                LoginTimeStamp;                                           // 0x0778(0x0004)
	int                                                LoginHash1;                                               // 0x077C(0x0004)
	int                                                LoginHash2;                                               // 0x0780(0x0004)
	int                                                LoginHash3;                                               // 0x0784(0x0004)
	int                                                LoginHash4;                                               // 0x0788(0x0004)
	int                                                LoginHash5;                                               // 0x078C(0x0004)
	unsigned long                                      bWarningDurabilityAndExpired : 1;                         // 0x0790(0x0004)
	struct FString                                     strGMList;                                                // 0x0794(0x000C) (Localized, NeedCtorLink)
	unsigned long                                      bChatBan : 1;                                             // 0x07A0(0x0004)
	unsigned long                                      bSystemChatBlock : 1;                                     // 0x07A0(0x0004)
	float                                              ChatAccumTime[0x4];                                       // 0x07A4(0x0004)
	int                                                ChatLogTop;                                               // 0x07B4(0x0004)
	TArray<struct FChatHistory>                        ChatLog;                                                  // 0x07B8(0x000C) (NeedCtorLink)
	struct FString                                     LastRecvWhispherName;                                     // 0x07C4(0x000C) (NeedCtorLink)
	struct FChatInfo                                   PrevChatMode;                                             // 0x07D0(0x001C) (NeedCtorLink)
	struct FString                                     strNotice_All;                                            // 0x07EC(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strNotice_Server;                                         // 0x07F8(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strNotice_Channel;                                        // 0x0804(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strNotice_Room;                                           // 0x0810(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strKick;                                                  // 0x081C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strChangeRoomTitle;                                       // 0x0828(0x000C) (Localized, NeedCtorLink)
	float                                              NoticeUITimeSeconds;                                      // 0x0834(0x0004)
	float                                              NoticeUIPos;                                              // 0x0838(0x0004)
	int                                                NoticeIndex;                                              // 0x083C(0x0004)
	TArray<struct FString>                             BatteryNotice;                                            // 0x0840(0x000C) (NeedCtorLink)
	float                                              AASUITimeSeconds;                                         // 0x084C(0x0004)
	float                                              AASUIPos;                                                 // 0x0850(0x0004)
	TArray<struct FAAS_Struct>                         BatteryAAS;                                               // 0x0854(0x000C) (NeedCtorLink)
	struct FAAS_Struct                                 AASTemp[0x2];                                             // 0x0860(0x0024) (NeedCtorLink)
	struct FString                                     strAASMessage[0x6];                                       // 0x08A8(0x000C) (Localized, NeedCtorLink)
	unsigned long                                      bNewAvailableQuest : 1;                                   // 0x08F0(0x0004)
	unsigned long                                      bNewAvailableEventQuest : 1;                              // 0x08F0(0x0004)
	struct FLevelUpInfoStruct                          LevelUpInfo;                                              // 0x08F4(0x0024) (NeedCtorLink)
	struct FExpiredItemsStruct                         ExpiredItems;                                             // 0x0918(0x0010) (NeedCtorLink)
	struct FDurabilityWarningItemsStruct               DurWarningItems;                                          // 0x0928(0x0010) (NeedCtorLink)
	TArray<struct FString>                             DestroyedDurabilityXItems;                                // 0x0938(0x000C) (NeedCtorLink)
	TArray<int>                                        iSendUpdateQuickSlotList;                                 // 0x0944(0x000C) (NeedCtorLink)
	class UBTPageLogo*                                 page_Logo;                                                // 0x0950(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Logo;                                            // 0x0954(0x000C) (NeedCtorLink)
	class UBTPageLogin*                                page_Login;                                               // 0x0960(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Login;                                           // 0x0964(0x000C) (NeedCtorLink)
	class UBTPageLobby*                                page_Lobby2;                                              // 0x0970(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Lobby2;                                          // 0x0974(0x000C) (NeedCtorLink)
	class UBTPageCharacterCreation*                    page_CharacterCreation;                                   // 0x0980(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_CharacterCreation;                               // 0x0984(0x000C) (NeedCtorLink)
	class UBTPageServerSelection*                      page_ServerSelection;                                     // 0x0990(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_ServerSelection;                                 // 0x0994(0x000C) (NeedCtorLink)
	class UBTPageRoomLobby*                            page_RoomLobby;                                           // 0x09A0(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageRoomLobby*                            RoomLobby;                                                // 0x09A4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageRoomLobby*                            RoomLobbyDefence;                                         // 0x09A8(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageMatchResult*                          page_MatchResult2;                                        // 0x09AC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageMatchResult*                          MatchResult2;                                             // 0x09B0(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageMatchResult*                          MatchResult2_Defence;                                     // 0x09B4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_RoomLobby;                                       // 0x09B8(0x000C) (NeedCtorLink)
	struct FString                                     pagename_RoomLobby_Defence;                               // 0x09C4(0x000C) (NeedCtorLink)
	struct FString                                     pagename_MatchResult2;                                    // 0x09D0(0x000C) (NeedCtorLink)
	struct FString                                     pagename_MatchResult2_Defence;                            // 0x09DC(0x000C) (NeedCtorLink)
	class UBTPageAuction*                              page_Auction;                                             // 0x09E8(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Auction;                                         // 0x09EC(0x000C) (NeedCtorLink)
	class UBTPageHelp*                                 page_Help;                                                // 0x09F8(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Help;                                            // 0x09FC(0x000C) (NeedCtorLink)
	class UBTPageMail*                                 page_Mail;                                                // 0x0A08(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Mail;                                            // 0x0A0C(0x000C) (NeedCtorLink)
	class UBTPageStore*                                page_Store;                                               // 0x0A18(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Store;                                           // 0x0A1C(0x000C) (NeedCtorLink)
	class UBTPageInventory*                            page_Inventory;                                           // 0x0A28(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Inventory;                                       // 0x0A2C(0x000C) (NeedCtorLink)
	class UBTPageMyInfo*                               page_MyInfo;                                              // 0x0A38(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_MyInfo;                                          // 0x0A3C(0x000C) (NeedCtorLink)
	class UBTPageClan*                                 page_Clan;                                                // 0x0A48(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Clan;                                            // 0x0A4C(0x000C) (NeedCtorLink)
	class UBTPageCredit*                               page_Credit;                                              // 0x0A58(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Credit;                                          // 0x0A5C(0x000C) (NeedCtorLink)
	class UBTPageClanWar*                              page_ClanWar;                                             // 0x0A68(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_ClanWar;                                         // 0x0A6C(0x000C) (NeedCtorLink)
	class UBTPageLucky*                                page_Lucky;                                               // 0x0A78(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FString                                     pagename_Lucky;                                           // 0x0A7C(0x000C) (NeedCtorLink)
	TEnumAsByte<EPage>                                 PageOnOpen;                                               // 0x0A88(0x0001)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0A89(0x0003) MISSED OFFSET
	class UBTNetGUIPage*                               page_curr;                                                // 0x0A8C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	TArray<class UBTNetGUIPage*>                       Pages;                                                    // 0x0A90(0x000C) (NeedCtorLink)
	struct FString                                     szAccountName;                                            // 0x0A9C(0x000C) (NeedCtorLink)
	struct FString                                     szLoginServerIP;                                          // 0x0AA8(0x000C) (NeedCtorLink)
	int                                                szLoginServerPort;                                        // 0x0AB4(0x0004)
	int                                                GameRunningCount;                                         // 0x0AB8(0x0004)
	TArray<struct FLoginServerStruct>                  LoginServers;                                             // 0x0ABC(0x000C) (NeedCtorLink)
	unsigned char                                      iTryLoginCount;                                           // 0x0AC8(0x0001)
	unsigned char                                      iMaxTryLoginCount;                                        // 0x0AC9(0x0001)
	unsigned char                                      UnknownData05[0x2];                                       // 0x0ACA(0x0002) MISSED OFFSET
	unsigned long                                      bConnectedLoginServer : 1;                                // 0x0ACC(0x0004)
	unsigned long                                      bConnectedChannelServer : 1;                              // 0x0ACC(0x0004)
	unsigned long                                      bAuthKeySuccess : 1;                                      // 0x0ACC(0x0004)
	struct FString                                     DefaultLobbyBGM;                                          // 0x0AD0(0x000C) (NeedCtorLink)
	struct FString                                     LastMainPageBGM;                                          // 0x0ADC(0x000C) (NeedCtorLink)
	int                                                iUID;                                                     // 0x0AE8(0x0004) (Transient)
	int                                                iChannel;                                                 // 0x0AEC(0x0004) (Transient)
	struct FString                                     ServerName;                                               // 0x0AF0(0x000C) (NeedCtorLink)
	struct FString                                     ServerShortName;                                          // 0x0AFC(0x000C) (NeedCtorLink)
	int                                                ServerGroupID;                                            // 0x0B08(0x0004)
	int                                                ServerID;                                                 // 0x0B0C(0x0004)
	int                                                GameRoomID;                                               // 0x0B10(0x0004)
	struct FString                                     ServerGroupName;                                          // 0x0B14(0x000C) (NeedCtorLink)
	struct FString                                     ChannelName;                                              // 0x0B20(0x000C) (NeedCtorLink)
	int                                                iRoomNum;                                                 // 0x0B2C(0x0004) (Transient)
	int                                                NatType;                                                  // 0x0B30(0x0004)
	TArray<struct FString>                             NatAddrs;                                                 // 0x0B34(0x000C) (NeedCtorLink)
	TArray<int>                                        NatPorts;                                                 // 0x0B40(0x000C) (NeedCtorLink)
	class UBTNatDiag*                                  NatDiag;                                                  // 0x0B4C(0x0004)
	float                                              TimeNatDiagStarted;                                       // 0x0B50(0x0004)
	int                                                NatCheckLoop;                                             // 0x0B54(0x0004)
	float                                              NatDiagInterval;                                          // 0x0B58(0x0004)
	struct FString                                     LocalLogStr[0x9];                                         // 0x0B5C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strNatType[0x4];                                          // 0x0BC8(0x000C) (Localized, NeedCtorLink)
	struct FString                                     strCashCharge;                                            // 0x0BF8(0x000C) (Localized, NeedCtorLink)
	struct FScriptDelegate                             __delegateCheckNat__Delegate;                             // 0x0C04(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateRecv_ClanInfo__Delegate;                          // 0x0C0C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateExpiredItemList__Delegate;                        // 0x0C14(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateDurabilityWarningItemList__Delegate;              // 0x0C1C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateWebzenInvenList__Delegate;                        // 0x0C24(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateWebzenInvenListEnd__Delegate;                     // 0x0C2C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __ClearChatLog__Delegate;                                 // 0x0C34(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __NormalChatLog__Delegate;                                // 0x0C3C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __ClanChatLog__Delegate;                                  // 0x0C44(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __WhisperChatLog__Delegate;                               // 0x0C4C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __SelfChatLog__Delegate;                                  // 0x0C54(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __SystemChatLog__Delegate;                                // 0x0C5C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __TeamChatLog__Delegate;                                  // 0x0C64(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __BroadCastItemChatLog__Delegate;                         // 0x0C6C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __ClearChatLog_Extra__Delegate;                           // 0x0C74(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __NormalChatLog_Extra__Delegate;                          // 0x0C7C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __ClanChatLog_Extra__Delegate;                            // 0x0C84(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __WhisperChatLog_Extra__Delegate;                         // 0x0C8C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __SelfChatLog_Extra__Delegate;                            // 0x0C94(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __SystemChatLog_Extra__Delegate;                          // 0x0C9C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __TeamChatLog_Extra__Delegate;                            // 0x0CA4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __BroadCastItemChatLog_Extra__Delegate;                   // 0x0CAC(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTNetMainMenu");
		return ptr;
	}


	void SendLogin();
	bool OnAppExit(class UGUIComponent* Sender);
	bool TcpLogin_rfAckLoginWithIndonesia_Live(int Result);
	bool TcpLogin_rfAckLoginWithIndonesia_Test(int Result);
	bool TcpLogin_rfAckLoginWithGlobal_Test(int Result);
	bool TcpLogin_rfAckLoginWithGlobal_Live(int Result);
	bool TcpLogin_rfAckLoginWithThailand_Test(int Result);
	bool TcpLogin_rfAckLoginWithThailand_Live(int Result);
	bool TcpLogin_rfAckLoginWithWZAuth_Test(int Result, unsigned char wzp_AccountType, unsigned char wzp_IsBlock, unsigned char wzp_AuthKeySuccess, unsigned char ChannelType);
	bool TcpLogin_rfAckLoginWithWZAuth_Live(int Result, unsigned char wzp_AccountType, unsigned char wzp_IsBlock, unsigned char wzp_AuthKeySuccess, unsigned char ChannelType);
	bool TcpLogin_rfAckLoginWithTencentAuth_Test(int Result, unsigned char tc_AccountType, unsigned char tc_IsBlock);
	bool TcpLogin_rfAckLoginWithTencentAuth_Live(int Result, unsigned char tc_AccountType, unsigned char tc_IsBlock);
	void RequestUpdateQuickSlot(int iQuickSlotIdx);
	void UpdateSendQuickSlotIndex(int iQuickSlotIndex);
	bool CheckMoveToChannel(int iServerIndex);
	void CheckWebzenShopItemList();
	void UpdateWebzenShopItemList(int Year, int YearId, int SalesZoneCode);
	bool ShowHelpWindow_OnOK(class UGUIComponent* Sender);
	void ShowHelpWindow();
	bool ShowReqCashWindow_OnOK(class UGUIComponent* Sender);
	bool ShowCashChargeWindow_OnOK(class UGUIComponent* Sender);
	void ShowCashChargeWindow();
	void UpdateBestLoginServer();
	void SortLoginServerList2(int fromIdx);
	void SortLoginServerList();
	bool Internal_OnFunctionKey(class UGUIComponent* Sender, unsigned char FunctionKey, const struct FString& Text);
	void TPChat_ChangeTab_OnClickTemp(int TabIndex);
	void TPChat_ChangeTab_OnClick(int TabIndex);
	void TPChat_OnChageChatMode(int ChatMode);
	void TPChat_OnInputTab(class UGUIComponent* Sender, const struct FString& Text);
	void TPChat_OnInputSpace(class UGUIComponent* Sender, const struct FString& Text);
	bool Internal_OnChat(class UGUIComponent* Sender, const struct FString& Text);
	void ChatBanEnd_OnTimer(int Index);
	bool CheckChatBan();
	bool UpdateChatBan();
	int IsInClanChannel(const struct FString& ServerIP, int serverPort, int ChannelID);
	bool IsInPageLobby();
	bool IsInPageServerSelection();
	bool IsGameReadyOrPlaying();
	bool IsInRangeDate(const struct FBtrDouble& ServerTime, int syear, int smonth, int sday, int shour, int smin, int eyear, int emonth, int eday, int ehour, int emin);
	bool Is18YearsOld(const struct FBtrDouble& ServerTime, const struct FString& BirthDay);
	void UpdateTimeBatteryAAS();
	void PopAASQueue();
	float GetAASFirstTime();
	struct FString GetAASFirst();
	void PushAASQueue(const struct FString& Text, float Time, unsigned char AASLevel);
	float GetAASBeginTime(unsigned char byLevel);
	unsigned char GetAASLevel();
	void SetAASMessage(unsigned char byType, int AccumTime);
	void ResetBatteryAAS();
	void UpdateTimeBatteryNotice();
	void PopNoticeQueue();
	struct FString GetNoticeFirst();
	void PushNoticeQueue(const struct FString& Notice);
	void ResetBatteryNotice();
	bool TextToGMCommand(const struct FString& Text);
	bool TextToCommand(const struct FString& Text);
	void UpdateChatLog();
	void ResetChatLog();
	bool SelectChatLog(int ChatType, const struct FString& chatText);
	void BroadCastItemChatLog_Extra(const struct FString& cL);
	void TeamChatLog_Extra(const struct FString& cL);
	void SystemChatLog_Extra(const struct FString& cL);
	void SelfChatLog_Extra(const struct FString& cL);
	void WhisperChatLog_Extra(const struct FString& cL);
	void ClanChatLog_Extra(const struct FString& cL);
	void NormalChatLog_Extra(const struct FString& cL);
	void ClearChatLog_Extra();
	void BroadCastItemChatLog(const struct FString& cL);
	void TeamChatLog(const struct FString& cL);
	void SystemChatLog(const struct FString& cL);
	void SelfChatLog(const struct FString& cL);
	void WhisperChatLog(const struct FString& cL);
	void ClanChatLog(const struct FString& cL);
	void NormalChatLog(const struct FString& cL);
	void ClearChatLog();
	int GetChatLogTopIndex();
	void AddChatLog(const struct FString& chatText, int ChatType, bool bForceUpdateLast);
	bool Exit_OnOK(class UGUIComponent* Sender);
	bool TcpLogin_rfAckHash(int Result, const struct FString& Error);
	void Exit_LoginServer(int ErrCode);
	void TryConnect_Login();
	void TcpLogin_OnError(int ErrCode);
	void TcpLogin_OnClose(int ErrCode);
	void TcpLogin_OnConnect(int ErrCode);
	void SetPage(TEnumAsByte<EPage> PageType, bool CloseLastMenu);
	void HaltNetwork();
	bool rfReqForceNatTypeSetting(int NatType);
	void CheckNatPhrase2HK();
	void CheckNatPhrase1HK();
	void CheckNatPhrase0HK();
	void StartNatCheck();
	void rfReqStartNatDiag(const struct FString& Server1Addr, int Server1Port, const struct FString& Server2Addr, int Server2Port);
	void deleOnClose(bool bCancelled);
	bool deleOnKeyEvent(float Delta, unsigned char* key, unsigned char* State);
	void deleOnOpen();
	class UBTTcpLink_Login* GetTcpLogin();
	void InitializeTcpLogin(const struct FString& IP, int Port);
	void InitializeTcpChannel(const struct FString& IP, int Port, int DataPort);
	void ShowPlayTimePerHour_OnEventTimer(int Index);
	bool LoadLoginServerList_Ini();
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void KeepMoving();
	void EndAutoMove();
	void StartAutoMove(int Server, int Channel, int gameroom, const struct FString& Password, int ClanMatch_EnterState);
	bool TutorialChannelAutoMove();
	struct FString FindChannelNickName(int ServerID, int ChannelID);
	struct FString FindServerShortName(int ServerID, int ChannelID);
	struct FString FindServerName(int ServerID);
	int FindServerConnectionInfoIndex(int ServerID, int ChannelID);
	int FindServerChannelInfoIndexByServerIP(const struct FString& ServerIP, int serverPort, int ChannelID);
	void AddServerChannelList(int ServerID, int ChannelID, const struct FString& ServerIP, int serverPort, int ServerDataPort, const struct FString& ServerName, const struct FString& ServerShortName, const struct FString& ChannelName, int ServerGroupID, const struct FString& ServerGroupName, int IsClanChannel, const struct FString& ChannelNickName, bool IsDedicatedServer, float ChannelOption, int nCurUser, int nMaxUser);
	void ClearServerChannelList();
	void CheckItemWarning();
	bool CheckDestroyedDurabilityXItemList();
	bool CheckDestroyedDurabilityXItemList_OnOK(class UGUIComponent* Sender);
	bool CompleteDestroyedDurabilityXItemList();
	bool CheckDurabilityWarningItemList();
	bool CheckExpiredItemList();
	void CompleteExpiredItem();
	void AddExpiredSkillItem(int ItemID, int UniqueID, int SlotPos);
	void AddExpiredItem(int ItemID, const struct FBtrDouble& UniqueID, int SlotPos, int PartID);
	void CompleteDurabilityWarningItem();
	void AddDurabilityWarningItemRepairCost(const struct FBtrDouble& UniqueID, int RepairCost);
	void AddDurabilityWarningItem(const struct FBtrDouble& UniqueID, int ItemID, int SlotPos, int PartID, int Durability);
	void LoginToChannel(const struct FString& IP, int Port, int DataPort);
	void ChannelToLogin2(const struct FString& IP, int Port);
	void ChannelToLogin(const struct FString& IP, int Port);
	void ChannelToLogin_OnEventTimer(int Index);
	void UpdateWebzenInvenListEnd(class UBTNetMainMenu* MainMenu);
	void UpdateWebzenInvenList(class UBTNetMainMenu* MainMenu);
	void StopWebzenInvenList();
	bool sfReqWebzenInvenList(const struct FString& StorageType);
	void SetNewMailArrived(bool B);
	void UpdateDurabilityWarningItemList(class UBTNetMainMenu* MainMenu);
	void UpdateExpiredItemList(class UBTNetMainMenu* MainMenu);
	void UpdateRecv_ClanInfo(class UBTNetMainMenu* MainMenu);
	void delegateCheckNat();
};


// Class GUIWarfare.BTNetGUIPageHK
// 0x01B4 (0x05FC - 0x0448)
class UBTNetGUIPageHK : public UBTNetGUIPage
{
public:
	class UwMatchMaker*                                MM;                                                       // 0x0448(0x0004)
	class UwGameManager*                               GameMgr;                                                  // 0x044C(0x0004)
	struct FString                                     currentBGM;                                               // 0x0450(0x000C) (NeedCtorLink)
	struct FFloatBox                                   fbTPTopMenu;                                              // 0x045C(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTTPTopMenuHK*                              TPTopMenu;                                                // 0x046C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	int                                                SkipTopMenuIndex;                                         // 0x0470(0x0004)
	unsigned long                                      CloseLastMenu : 1;                                        // 0x0474(0x0004)
	struct FFloatBox                                   fbLabelRoomName;                                          // 0x0478(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawSourceClipImageHK*               LabelRoomName;                                            // 0x0488(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelTitle;                                             // 0x048C(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         LabelTitle;                                               // 0x049C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelLeftTopRoll;                                       // 0x04A0(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	struct FFloatBox                                   fbLabelLeftTopRollSource;                                 // 0x04B0(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawSourceClipImageHK*               LabelLeftTopRoll;                                         // 0x04C0(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelTopLine;                                           // 0x04C4(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         LabelTopLine;                                             // 0x04D4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelBottomLine;                                        // 0x04D8(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTLabelNoticeHK*                            LabelBottomLine;                                          // 0x04E8(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelAAS;                                               // 0x04EC(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTTPAASHK*                                  LabelAAS;                                                 // 0x04FC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	unsigned long                                      bSkipInitializeDefaultPage : 1;                           // 0x0500(0x0004)
	unsigned long                                      bFadeTimeTranslate : 1;                                   // 0x0500(0x0004)
	unsigned long                                      bUseTranslate : 1;                                        // 0x0500(0x0004)
	unsigned long                                      bCallFadeIn : 1;                                          // 0x0500(0x0004)
	unsigned long                                      bFading : 1;                                              // 0x0500(0x0004)
	unsigned long                                      bClosing : 1;                                             // 0x0500(0x0004)
	float                                              FadeTime;                                                 // 0x0504(0x0004)
	float                                              CurFadeTime;                                              // 0x0508(0x0004)
	unsigned char                                      CurFade;                                                  // 0x050C(0x0001)
	unsigned char                                      DesiredFade;                                              // 0x050D(0x0001)
	unsigned char                                      StartFade;                                                // 0x050E(0x0001)
	unsigned char                                      UnknownData00[0x1];                                       // 0x050F(0x0001) MISSED OFFSET
	struct FFloatBox                                   fbNewBackground;                                          // 0x0510(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         NewBackground;                                            // 0x0520(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTOwnerDrawImageHK*                         WeaponListBg;                                             // 0x0524(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbWeaponListBg;                                           // 0x0528(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	struct FString                                     strWeaponList[0x6];                                       // 0x0538(0x000C) (Localized, NeedCtorLink)
	TArray<class UBTOwnerDrawCaptionButtonHK*>         WeaponeTypeBtnList;                                       // 0x0580(0x000C) (NeedCtorLink)
	unsigned long                                      bShowWeaponeTypeList : 1;                                 // 0x058C(0x0004)
	class UBTOwnerDrawImageHK*                         SkillListBg;                                              // 0x0590(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbSkillListBg;                                            // 0x0594(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	struct FString                                     strSkillList[0x6];                                        // 0x05A4(0x000C) (Localized, NeedCtorLink)
	TArray<class UBTOwnerDrawCaptionButtonHK*>         SkillTypeBtnList;                                         // 0x05EC(0x000C) (NeedCtorLink)
	unsigned long                                      bShowSkillTypeList : 1;                                   // 0x05F8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTNetGUIPageHK");
		return ptr;
	}


	bool BTWindowJoinClan_OK(class UGUIComponent* Sender);
	bool BTWindowInviteClan_OnOK(class UGUIComponent* Sender);
	bool BTWindowCreateClanHK_OnOK(class UGUIComponent* Sender);
	bool BTWindowCreateClanNeedPointHK_OnClick(class UGUIComponent* Sender);
	bool ClanMenu_ButtonCreateClan_OnClick(class UGUIComponent* Sender);
