#pragma once

// Arctic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class UnrealGame.UnrealPawn
// 0x01D8 (0x11D8 - 0x1000)
class AUnrealPawn : public APawn
{
public:
	unsigned long                                      bNoDefaultInventory : 1;                                  // 0x1000(0x0004) (Edit)
	unsigned long                                      bAcceptAllInventory : 1;                                  // 0x1000(0x0004)
	unsigned long                                      bIsSquadLeader : 1;                                       // 0x1000(0x0004) (Edit)
	unsigned long                                      bSoakDebug : 1;                                           // 0x1000(0x0004)
	unsigned long                                      bKeepTaunting : 1;                                        // 0x1000(0x0004)
	unsigned long                                      bPlayOwnFootsteps : 1;                                    // 0x1000(0x0004)
	unsigned char                                      LoadOut;                                                  // 0x1004(0x0001)
	unsigned char                                      SelectedEquipment[0x10];                                  // 0x1005(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1015(0x0003) MISSED OFFSET
	struct FString                                     RequiredEquipment[0x10];                                  // 0x1018(0x000C) (Edit, NeedCtorLink)
	struct FString                                     OptionalEquipment[0x10];                                  // 0x10D8(0x000C) (NeedCtorLink)
	float                                              AttackSuitability;                                        // 0x1198(0x0004)
	float                                              LastFootStepTime;                                         // 0x119C(0x0004)
	TEnumAsByte<EDoubleClickDir>                       CurrentDir;                                               // 0x11A0(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x11A1(0x0003) MISSED OFFSET
	struct FVector                                     GameObjOffset;                                            // 0x11A4(0x000C)
	struct FRotator                                    GameObjRot;                                               // 0x11B0(0x000C)
	struct FName                                       SquadName;                                                // 0x11BC(0x0004) (Edit)
	struct FString                                     VoiceType;                                                // 0x11C0(0x000C) (NeedCtorLink)
	unsigned long                                      bPlayerShadows : 1;                                       // 0x11CC(0x0004)
	unsigned long                                      bBlobShadow : 1;                                          // 0x11CC(0x0004)
	int                                                Spree;                                                    // 0x11D0(0x0004)
	int                                                iCheckBreath;                                             // 0x11D4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.UnrealPawn");
		return ptr;
	}


	void SpawnGibs(const struct FRotator& HitRotation, float ChunkPerterbation);
	void ChunkUp(const struct FRotator& HitRotation, float ChunkPerterbation);
	void PlayFootStep(int side);
	void IncrementSpree();
	int GetSpree();
	void TakeDrowningDamage();
	void SetMovementPhysics();
	class URosterEntry* GetPlacedRoster();
	void PostNetBeginPlay();
	void PostBeginPlay();
	bool Dodge(TEnumAsByte<EDoubleClickDir> DoubleClickMove);
	bool PerformDodge(TEnumAsByte<EDoubleClickDir> DoubleClickMove, const struct FVector& Dir, const struct FVector& Cross);
	class AInventory* CreateInventory(const struct FString& InventoryClassName);
	class AInventory* CustomCreateInventory(const struct FString& WeaponClassName);
	void AddDefaultInventory(bool bQuickslotChange);
	void AddDefaultInventoryDOA(bool bQuickslotChange);
	bool IsInLoadout(class UClass* InventoryClass);
	void CheckBob(float DeltaTime, const struct FVector& Y);
	struct FName GetWeaponBoneFor(class AInventory* i);
	struct FString GetDebugName();
	void SetAnimAction(const struct FName& NewAction);
	void ShouldUnCrouch();
	void EndJump();
	void HoldGameObject(class AGameObject* gameObj, const struct FName& GameObjBone);
	void HoldFlag(class AActor* FlagActor);
	struct FVector BotDodge(const struct FVector& Dir);
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	void gibbedBy(class AActor* Other);
	bool FindValidTaunt(struct FName* Sequence);
	void DropFlag(const struct FString& sReason);
};


// Class UnrealGame.RosterEntry
// 0x0060 (0x008C - 0x002C)
class URosterEntry : public UObject
{
public:
	class UClass*                                      PawnClass;                                                // 0x002C(0x0004) (Edit)
	struct FString                                     PawnClassName;                                            // 0x0030(0x000C) (Edit, NeedCtorLink)
	struct FString                                     PlayerName;                                               // 0x003C(0x000C) (Edit, NeedCtorLink)
	struct FString                                     ModifiedPlayerName;                                       // 0x0048(0x000C) (Edit, NeedCtorLink)
	struct FString                                     VoiceTypeName;                                            // 0x0054(0x000C) (Edit, NeedCtorLink)
	TEnumAsByte<EOrders>                               Orders;                                                   // 0x0060(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	unsigned long                                      bTaken : 1;                                               // 0x0064(0x0004) (Edit)
	class UClass*                                      FavoriteWeapon;                                           // 0x0068(0x0004) (Edit)
	float                                              Aggressiveness;                                           // 0x006C(0x0004) (Edit)
	float                                              Accuracy;                                                 // 0x0070(0x0004) (Edit)
	float                                              CombatStyle;                                              // 0x0074(0x0004) (Edit)
	float                                              StrafingAbility;                                          // 0x0078(0x0004) (Edit)
	float                                              Tactics;                                                  // 0x007C(0x0004) (Edit)
	float                                              ReactionTime;                                             // 0x0080(0x0004) (Edit)
	float                                              Jumpiness;                                                // 0x0084(0x0004) (Edit)
	unsigned long                                      bJumpy : 1;                                               // 0x0088(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.RosterEntry");
		return ptr;
	}


	void InitBot(class ABot* B);
	bool RecommendAttack();
	bool RecommendFreelance();
	bool RecommendDefense();
	bool NoRecommendation();
	bool RecommendSupport();
	void SetOrders(TEnumAsByte<EPlayerPos> Position);
	void PrecacheRosterFor(class AUnrealTeamInfo* t);
	void Init();
};


// Class UnrealGame.UnrealMPGameInfo
// 0x0110 (0x0AC8 - 0x09B8)
class AUnrealMPGameInfo : public AGameInfo
{
public:
	unsigned char                                      BotMode;                                                  // 0x09B8(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x09B9(0x0003) MISSED OFFSET
	int                                                MinPlayers;                                               // 0x09BC(0x0004)
	float                                              EndTimeDelay;                                             // 0x09C0(0x0004)
	float                                              BotRatio;                                                 // 0x09C4(0x0004)
	unsigned long                                      bPreloadAllSkins : 1;                                     // 0x09C8(0x0004)
	struct FString                                     DefaultVoiceChannel;                                      // 0x09CC(0x000C) (NeedCtorLink)
	unsigned long                                      bAllowPrivateChat : 1;                                    // 0x09D8(0x0004)
	unsigned long                                      bTeamScoreRounds : 1;                                     // 0x09D8(0x0004)
	unsigned long                                      bSoaking : 1;                                             // 0x09D8(0x0004)
	unsigned long                                      bPlayersVsBots : 1;                                       // 0x09D8(0x0004)
	float                                              EndTime;                                                  // 0x09DC(0x0004)
	class ASpecialVehicleObjective*                    SpecialVehicleObjectives;                                 // 0x09E0(0x0004)
	class UClass*                                      LocalStatsScreenClass;                                    // 0x09E4(0x0004)
	struct FString                                     VoiceReplicationInfoType;                                 // 0x09E8(0x000C) (Edit, NeedCtorLink)
	struct FString                                     MPGIPropsDisplayText[0x4];                                // 0x09F4(0x000C) (Localized, NeedCtorLink)
	struct FString                                     MPGIPropDescText[0x4];                                    // 0x0A24(0x000C) (Localized, NeedCtorLink)
	struct FString                                     BotModeText;                                              // 0x0A54(0x000C) (Localized, NeedCtorLink)
	struct FString                                     SPBotText;                                                // 0x0A60(0x000C) (Localized, NeedCtorLink)
	struct FString                                     MPBotText;                                                // 0x0A6C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     SPBotDesc;                                                // 0x0A78(0x000C) (Localized, NeedCtorLink)
	struct FString                                     MPBotDesc;                                                // 0x0A84(0x000C) (Localized, NeedCtorLink)
	struct FString                                     BotOptions[0x4];                                          // 0x0A90(0x000C) (Localized, NeedCtorLink)
	class AMasterServerUplink*                         MSUplink;                                                 // 0x0AC0(0x0004)
	unsigned long                                      bMSUplinkSet : 1;                                         // 0x0AC4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.UnrealMPGameInfo");
		return ptr;
	}


	int MultiMinPlayers();
	struct FString STATIC_GetDescriptionText(const struct FString& PropName);
	void STATIC_FillPlayInfo(class UPlayInfo* PlayInfo);
	struct FString STATIC_GenerateBotOptions(bool bSinglePlayer);
	void STATIC_AdjustBotInterface(bool bSinglePlayer);
	void GetServerDetails(struct FServerResponseLine* ServerState);
	void InitPlacedBot(class AController* C, class URosterEntry* R);
	bool PickupQuery(class APawn* Other, class APickup* Item);
	bool CanDisableObjective(class AGameObjective* Go);
	int AdjustDestroyObjectiveDamage(int Damage, class AController* instigatedBy, class AGameObjective* Go);
	void ShowPathTo(class APlayerController* P, int TeamNum);
	bool CanShowPathTo(class APlayerController* P, int TeamNum);
	void ForceAddBot();
	void ChangeLoadOut(class APlayerController* P, const struct FString& LoadoutName);
	void ScoreGameObject(class AController* C, class AGameObject* Go);
	class AGameObject* GetGameObject(const struct FName& GameObjectName);
	void FindNewObjectives(class AGameObjective* DisabledObjective);
	void ObjectiveDisabled(class AGameObjective* DisabledObjective);
	class UTexture* STATIC_GetRandomTeamSymbol(int Base);
	void RestartGame();
	bool TooManyBots(class AController* botToRemove);
	float SpawnWait(class AAIController* B);
	bool ShouldRespawn(class APickup* Other);
	int GetNumPlayers();
	void TeamScoreEvent(int Team, float Points, const struct FString& Desc);
	void ScoreEvent(class APlayerReplicationInfo* Who, float Points, const struct FString& Desc);
	void GameEvent(const struct FString& GEvent, const struct FString& Desc, class APlayerReplicationInfo* Who);
	void KillEvent(const struct FString& KillType, class APlayerReplicationInfo* Killer, class APlayerReplicationInfo* Victim, class UClass* Damage);
	void SpecialEvent(class APlayerReplicationInfo* Who, const struct FString& Desc);
	void ChangeVoiceChannel(class APlayerReplicationInfo* PRI, int NewChannelIndex, int OldChannelIndex);
	void InitMaplistHandler();
	void InitVoiceReplicationInfo();
	class APlayerController* Login(const struct FString& Portal, const struct FString& Options, struct FString* Error);
	void PreLogin(const struct FString& Options, const struct FString& Address, const struct FString& PlayerID, struct FString* Error, struct FString* FailCode);
};


// Class UnrealGame.Bot
// 0x0190 (0x07E0 - 0x0650)
class ABot : public AScriptedController
{
public:
	unsigned long                                      bCanFire : 1;                                             // 0x0650(0x0004)
	unsigned long                                      bStrafeDir : 1;                                           // 0x0650(0x0004)
	unsigned long                                      bLeadTarget : 1;                                          // 0x0650(0x0004)
	unsigned long                                      bChangeDir : 1;                                           // 0x0650(0x0004)
	unsigned long                                      bFrustrated : 1;                                          // 0x0650(0x0004)
	unsigned long                                      bInitLifeMessage : 1;                                     // 0x0650(0x0004)
	unsigned long                                      bReachedGatherPoint : 1;                                  // 0x0650(0x0004)
	unsigned long                                      bFinalStretch : 1;                                        // 0x0650(0x0004)
	unsigned long                                      bJumpy : 1;                                               // 0x0650(0x0004)
	unsigned long                                      bHasTranslocator : 1;                                     // 0x0650(0x0004)
	unsigned long                                      bHasImpactHammer : 1;                                     // 0x0650(0x0004)
	unsigned long                                      bTacticalDoubleJump : 1;                                  // 0x0650(0x0004)
	unsigned long                                      bWasNearObjective : 1;                                    // 0x0650(0x0004)
	unsigned long                                      bPlannedShot : 1;                                         // 0x0650(0x0004)
	unsigned long                                      bHasFired : 1;                                            // 0x0650(0x0004)
	unsigned long                                      bForcedDirection : 1;                                     // 0x0650(0x0004)
	unsigned long                                      bFireSuccess : 1;                                         // 0x0650(0x0004)
	unsigned long                                      bStoppedFiring : 1;                                       // 0x0650(0x0004)
	unsigned long                                      bEnemyIsVisible : 1;                                      // 0x0650(0x0004)
	unsigned long                                      bTranslocatorHop : 1;                                     // 0x0650(0x0004)
	unsigned long                                      bEnemyEngaged : 1;                                        // 0x0650(0x0004)
	unsigned long                                      bMustCharge : 1;                                          // 0x0650(0x0004)
	unsigned long                                      bPursuingFlag : 1;                                        // 0x0650(0x0004)
	unsigned long                                      bJustLanded : 1;                                          // 0x0650(0x0004)
	unsigned long                                      bSingleTestSection : 1;                                   // 0x0650(0x0004)
	unsigned long                                      bRecommendFastMove : 1;                                   // 0x0650(0x0004)
	unsigned long                                      bDodgingForward : 1;                                      // 0x0650(0x0004)
	unsigned long                                      bInstantAck : 1;                                          // 0x0650(0x0004)
	unsigned long                                      bShieldSelf : 1;                                          // 0x0650(0x0004)
	unsigned long                                      bIgnoreEnemyChange : 1;                                   // 0x0650(0x0004)
	unsigned long                                      bHasSuperWeapon : 1;                                      // 0x0650(0x0004)
	class AActor*                                      TranslocationTarget;                                      // 0x0654(0x0004)
	class AActor*                                      RealTranslocationTarget;                                  // 0x0658(0x0004)
	class AActor*                                      ImpactTarget;                                             // 0x065C(0x0004)
	float                                              TranslocFreq;                                             // 0x0660(0x0004)
	float                                              NextTranslocTime;                                         // 0x0664(0x0004)
	struct FName                                       OldMessageType;                                           // 0x0668(0x0004)
	int                                                OldMessageID;                                             // 0x066C(0x0004)
	struct FVector                                     HidingSpot;                                               // 0x0670(0x000C)
	float                                              Aggressiveness;                                           // 0x067C(0x0004)
	float                                              LastAttractCheck;                                         // 0x0680(0x0004)
	class ANavigationPoint*                            BlockedPath;                                              // 0x0684(0x0004)
	float                                              AcquireTime;                                              // 0x0688(0x0004)
	float                                              Aggression;                                               // 0x068C(0x0004)
	float                                              LoseEnemyCheckTime;                                       // 0x0690(0x0004)
	class AActor*                                      StartleActor;                                             // 0x0694(0x0004)
	float                                              StartTacticalTime;                                        // 0x0698(0x0004)
	float                                              LastUnderFire;                                            // 0x069C(0x0004)
	float                                              BaseAlertness;                                            // 0x06A0(0x0004)
	float                                              Accuracy;                                                 // 0x06A4(0x0004)
	float                                              BaseAggressiveness;                                       // 0x06A8(0x0004)
	float                                              StrafingAbility;                                          // 0x06AC(0x0004)
	float                                              CombatStyle;                                              // 0x06B0(0x0004)
	float                                              Tactics;                                                  // 0x06B4(0x0004)
	float                                              TranslocUse;                                              // 0x06B8(0x0004)
	float                                              ReactionTime;                                             // 0x06BC(0x0004)
	float                                              Jumpiness;                                                // 0x06C0(0x0004)
	class UClass*                                      FavoriteWeapon;                                           // 0x06C4(0x0004)
	struct FString                                     GoalString;                                               // 0x06C8(0x000C) (NeedCtorLink)
	struct FString                                     SoakString;                                               // 0x06D4(0x000C) (NeedCtorLink)
	class ASquadAI*                                    Squad;                                                    // 0x06E0(0x0004)
	class ABot*                                        NextSquadMember;                                          // 0x06E4(0x0004)
	float                                              ReTaskTime;                                               // 0x06E8(0x0004)
	class AUnrealScriptedSequence*                     GoalScript;                                               // 0x06EC(0x0004)
	class AUnrealScriptedSequence*                     EnemyAcquisitionScript;                                   // 0x06F0(0x0004)
	class AVehicle*                                    FormerVehicle;                                            // 0x06F4(0x0004)
	TEnumAsByte<EScriptFollow>                         ScriptedCombat;                                           // 0x06F8(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x06F9(0x0003) MISSED OFFSET
	int                                                FormationPosition;                                        // 0x06FC(0x0004)
	int                                                ChoosingAttackLevel;                                      // 0x0700(0x0004)
	float                                              ChooseAttackTime;                                         // 0x0704(0x0004)
	int                                                ChooseAttackCounter;                                      // 0x0708(0x0004)
	float                                              EnemyVisibilityTime;                                      // 0x070C(0x0004)
	class APawn*                                       VisibleEnemy;                                             // 0x0710(0x0004)
	class APawn*                                       OldEnemy;                                                 // 0x0714(0x0004)
	float                                              StopStartTime;                                            // 0x0718(0x0004)
	float                                              LastRespawnTime;                                          // 0x071C(0x0004)
	float                                              FailedHuntTime;                                           // 0x0720(0x0004)
	class APawn*                                       FailedHuntEnemy;                                          // 0x0724(0x0004)
	float                                              LastSearchTime;                                           // 0x0728(0x0004)
	float                                              LastSearchWeight;                                         // 0x072C(0x0004)
	float                                              CampTime;                                                 // 0x0730(0x0004)
	int                                                LastTaunt;                                                // 0x0734(0x0004)
	int                                                NumRandomJumps;                                           // 0x0738(0x0004)
	struct FString                                     ComboNames[0x4];                                          // 0x073C(0x000C) (NeedCtorLink)
	float                                              LastFireAttempt;                                          // 0x076C(0x0004)
	float                                              GatherTime;                                               // 0x0770(0x0004)
	struct FName                                       OrderNames[0x10];                                         // 0x0774(0x0004) (Edit)
	struct FName                                       OldOrders;                                                // 0x07B4(0x0004)
	class AController*                                 OldOrderGiver;                                            // 0x07B8(0x0004)
	struct FVector                                     LastKnownPosition;                                        // 0x07BC(0x000C)
	struct FVector                                     LastKillerPosition;                                       // 0x07C8(0x000C)
	class ANavigationPoint*                            TestStart;                                                // 0x07D4(0x0004)
	int                                                TestPath;                                                 // 0x07D8(0x0004)
	struct FName                                       TestLabel;                                                // 0x07DC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.Bot");
		return ptr;
	}


	bool ShouldPerformScript();
	bool ScriptingOverridesAI();
	void SetNewScript(class AScriptedSequence* NewScript);
	void SetEnemyReaction(int AlertnessLevel);
	bool IsShootingObjective();
	bool Stopped();
	bool FindViewSpot();
	bool IsHunting();
	bool IsStrafing();
	bool DefendMelee(float dist);
	void DoRetreat();
	void DoTacticalMove();
	void DoCharge();
	void DoStakeOut();
	bool LoseEnemy();
	bool LostContact(float MaxTime);
	float GetDesiredOffset();
	void ForceCelebrate();
	void ForceGiveWeapon();
	void Celebrate();
	void RecoverFromBadStateCode();
	bool Formation();
	bool IsRetreating();
	void damageAttitudeTo(class APawn* Other, float Damage);
	bool SuperPickupNotSpokenFor(class APickup* P);
	float SuperDesireability(class APickup* P);
	float Desireability(class APickup* P);
	bool NeedWeapon();
	void WanderOrCamp(bool bMayCrouch);
	class AActor* FaceActor(float StrafingModifier);
	class AActor* AlternateTranslocDest();
	bool ShouldStrafeTo(class AActor* WayPoint);
	class AActor* FaceMoveTarget();
	void NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn);
	bool TryToDuck(const struct FVector& duckDir, bool bReversed);
	void ChangeStrafe();
	bool TryWallDodge(const struct FVector& HitNormal, class AActor* HitActor);
	void MissedDodge();
	void NotifyFallingHitWall(const struct FVector& HitNormal, class AActor* HitActor);
	void ReceiveWarning(class APawn* shooter, float projSpeed, const struct FVector& FireDir);
	void NotifyTakeHit(class APawn* instigatedBy, const struct FVector& HitLocation, int Damage, class UClass* DamageType, const struct FVector& Momentum, int CollisionPart);
	void ReceiveProjectileWarning(class AProjectile* proj);
	void DelayedWarning();
	struct FRotator AdjustAim(const struct FFireProperties& FiredAmmunition, const struct FVector& projStart, int AimError);
	float AdjustAimError(float AimError, float TargetDist, bool bDefendMelee, bool bInstantProj, bool bLeadTargetNow);
	bool CheckFutureSight(float DeltaTime);
	bool NearWall(float walldist);
	bool NeedToTurn(const struct FVector& targ);
	bool FindBestPathToward(class AActor* A, bool bCheckedReach, bool bAllowDetour);
	bool AllowDetourTo(class ANavigationPoint* N);
	bool SetRouteToGoal(class AActor* A);
	bool StartMoveToward(class AActor* o);
	void NotifyPostLanded();
	bool NotifyLanded(const struct FVector& HitNormal);
	void SetFall();
	bool PriorityObjective();
	bool NotifyBump(class AActor* Other);
	void DirectedWander(const struct FVector& WanderDir);
	bool AdjustAround(class APawn* Other);
	void ClearPathFor(class AController* C);
	void CancelCampFor(class AController* C);
	bool CheckPathToGoalAround(class APawn* P);
	void Restart();
	bool TestDirection(const struct FVector& Dir, struct FVector* pick);
	bool FindRoamDest();
	void SoakStop(const struct FString& problem);
	bool PickRetreatDestination();
	bool FindInventoryGoal(float BestWeight);
	bool FindSuperPickup(float MaxDist);
	void ChooseAttackMode();
	void DoRangedAttackOn(class AActor* A);
	void FightEnemy(bool bCanCharge, float EnemyStrength);
	void VehicleFightEnemy(bool bCanCharge, float EnemyStrength);
	bool EnemyVisible();
	bool DoWaitForLanding();
	void ExecuteWhatToDoNext();
	struct FString GetEnemyName();
	struct FString GetOldEnemyName();
	void WhatToDoNext(unsigned char CallingByte);
	void WasKilledBy(class AController* Other);
	void SetAlertness(float NewAlertness);
	void SetPeripheralVision();
	void SetMaxDesiredSpeed();
	void ResetSkill();
	void InitializeSkill(float InSkill);
	void Possess(class APawn* aPawn);
	void Reset();
	void NotifyMissedJump();
	void NotifyJumpApex();
	void MayDodgeToMoveTarget();
	bool NotifyPhysicsVolumeChange(class APhysicsVolume* NewVolume);
	bool StrafeFromDamage(float Damage, class UClass* DamageType, bool bFindDest);
	void BotVoiceMessage(const struct FName& MessageType, unsigned char MessageID, class AController* Sender);
	void EnemyChanged(bool bNewEnemyVisible);
	void SetEnemyInfo(bool bNewEnemyVisible);
	void Trigger(class AActor* Other, class APawn* EventInstigator);
	float RelativeStrength(class APawn* Other);
	bool AssignSquadResponsibility();
	void FreeScript();
	bool IsSniping();
	void CheckIfShouldCrouch(const struct FVector& StartPosition, const struct FVector& TargetPosition, float Probability);
	bool CanStakeOut();
	bool ClearShot(const struct FVector& TargetLoc, bool bImmediateFire);
	void SetAttractionState();
	void SeePlayer(class APawn* SeenPlayer);
	void HearNoise(float Loudness, class AActor* NoiseMaker);
	void ClearTemporaryOrders();
	void SetTemporaryOrders(const struct FName& NewOrders, class AController* OrderGiver);
	void SetOrders(const struct FName& NewOrders, class AController* OrderGiver);
	void SendMessage(class APlayerReplicationInfo* Recipient, const struct FName& MessageType, unsigned char MessageID, float wait, const struct FName& BroadcastType);
	unsigned char GetMessageIndex(const struct FName& PhraseName);
	void YellAt(class APawn* Moron);
	class AActor* GetOrderObject();
	struct FName GetOrders();
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	bool CanCombo();
	bool CanComboMoving();
	bool ProficientWithWeapon();
	float WeaponPreference(class AwWeapon* W);
	void ChangedWeapon();
	void StopFiring();
	bool CanAttack(class AActor* Other);
	bool FireWeaponAt(class AActor* A);
	void TimedFireWeaponAtEnemy();
	bool ShouldFireAgain(float RefireRate);
	bool WeaponFireAgain(float RefireRate, bool bFinishedFire);
	void WaitForMover(class AMover* M);
	void ImpactJump();
	bool CanUseTranslocator();
	bool CanImpactJump();
	float RateWeapon(class AwWeapon* W);
	void UpdatePawnViewPitch();
	class APawn* GetMyPlayer();
	void InitPlayerReplicationInfo();
	bool DontReuseTaunt(int t);
	bool AutoTaunt();
	void SetCombatTimer();
	void Startle(class AActor* Feared);
	void FearThisSpot(class AAvoidMarker* aSpot);
	void TryCombo(const struct FString& ComboName);
	bool CanDoubleJump(class APawn* Other);
	void GetOutOfVehicle();
	bool NotifyHitWall(const struct FVector& HitNormal, class AActor* Wall);
	void SetupSpecialPathAbilities();
	bool ShouldKeepShielding();
	void NotifyAddInventory(class AInventory* NewItem);
	class AwWeapon* HasSuperWeapon();
	void PostBeginPlay();
	void Destroyed();
};


// Class UnrealGame.SquadAI
// 0x00A8 (0x04D4 - 0x042C)
class ASquadAI : public AReplicationInfo
{
public:
	class AUnrealTeamInfo*                             Team;                                                     // 0x042C(0x0004)
	class AController*                                 SquadLeader;                                              // 0x0430(0x0004)
	class ATeamPlayerReplicationInfo*                  LeaderPRI;                                                // 0x0434(0x0004) (Net)
	class ASquadAI*                                    NextSquad;                                                // 0x0438(0x0004)
	class AGameObjective*                              SquadObjective;                                           // 0x043C(0x0004) (Net)
	int                                                Size;                                                     // 0x0440(0x0004)
	class AAssaultPath*                                AlternatePath;                                            // 0x0444(0x0004)
	struct FName                                       AlternatePathTag;                                         // 0x0448(0x0004)
	class ABot*                                        SquadMembers;                                             // 0x044C(0x0004)
	float                                              GatherThreshold;                                          // 0x0450(0x0004)
	struct FString                                     SupportString;                                            // 0x0454(0x000C) (Localized, NeedCtorLink)
	struct FString                                     DefendString;                                             // 0x0460(0x000C) (Localized, NeedCtorLink)
	struct FString                                     AttackString;                                             // 0x046C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     HoldString;                                               // 0x0478(0x000C) (Localized, NeedCtorLink)
	struct FString                                     FreelanceString;                                          // 0x0484(0x000C) (Localized, NeedCtorLink)
	struct FString                                     SupportStringTrailer;                                     // 0x0490(0x000C) (Localized, NeedCtorLink)
	struct FName                                       CurrentOrders;                                            // 0x049C(0x0004) (Net)
	class APawn*                                       enemies[0x8];                                             // 0x04A0(0x0004)
	int                                                MaxSquadSize;                                             // 0x04C0(0x0004)
	unsigned long                                      bFreelance : 1;                                           // 0x04C4(0x0004) (Net)
	unsigned long                                      bFreelanceAttack : 1;                                     // 0x04C4(0x0004)
	unsigned long                                      bFreelanceDefend : 1;                                     // 0x04C4(0x0004)
	unsigned long                                      bRoamingSquad : 1;                                        // 0x04C4(0x0004)
	unsigned long                                      bAddTransientCosts : 1;                                   // 0x04C4(0x0004)
	class AUnrealScriptedSequence*                     FreelanceScripts;                                         // 0x04C8(0x0004)
	class ARestingFormation*                           RestingFormation;                                         // 0x04CC(0x0004)
	class UClass*                                      RestingFormationClass;                                    // 0x04D0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.SquadAI");
		return ptr;
	}


	bool FriendlyToward(class APawn* Other);
	bool CautiousAdvance(class ABot* B);
	bool IsDefending(class ABot* B);
	bool ClearPathFor(class AController* C);
	bool PickRetreatDestination(class ABot* B);
	bool BeDevious();
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	class ABot* PickBotToReassign();
	float BotSuitability(class ABot* B);
	bool ShouldDestroyTranslocator(class ABot* B);
	bool CheckSquadObjectives(class ABot* B);
	bool OverrideFollowPlayer(class ABot* B);
	bool CheckSpecialVehicleObjectives(class ABot* B);
	float VehicleDesireability(class AVehicle* V, class ABot* B);
	bool CheckVehicle(class ABot* B);
	void BotEnteredVehicle(class ABot* B);
	bool NeverBail(class APawn* P);
	float MaxVehicleDist(class APawn* P);
	bool AssignSquadResponsibility(class ABot* B);
	void AddTransientCosts(class ABot* B, float f);
	bool AllowTaunt(class ABot* B);
	bool TellBotToFollow(class ABot* B, class AController* C);
	void PickNewLeader();
	int GetSize();
	struct FString GetShortOrderStringFor(class ATeamPlayerReplicationInfo* PRI);
	struct FString GetOrderStringFor(class ATeamPlayerReplicationInfo* PRI);
	struct FName GetOrders();
	void Retask(class ABot* B);
	void SetObjective(class AGameObjective* o, bool bForceUpdate);
	void SetFreelanceScriptFor(class ABot* B);
	void SetDefenseScriptFor(class ABot* B);
	void SwitchBots(class ABot* MyBot, class ABot* OtherBot);
	void AddBot(class ABot* B);
	void RemoveBot(class ABot* B);
	void RemovePlayer(class APlayerController* P);
	void SetLeader(class AController* C);
	void SetFinalStretch(bool bValue);
	bool FindPathToObjective(class ABot* B, class AActor* o);
	bool TryToIntercept(class ABot* B, class APawn* P, class AActor* RouteGoal);
	void SetAlternatePath(bool bResetSquad);
	void Initialize(class AUnrealTeamInfo* t, class AGameObjective* o, class AController* C);
	void MergeWith(class ASquadAI* S);
	bool CloseToLeader(class APawn* P);
	bool NearFormationCenter(class APawn* P);
	bool WanderNearLeader(class ABot* B);
	bool WaitAtThisPosition(class APawn* P);
	bool ShouldDeferTo(class AController* C);
	float AssessThreat(class ABot* B, class APawn* NewThreat, bool bThreatVisible);
	bool UnderFire(class APawn* NewThreat, class ABot* Ignored);
	float ModifyThreat(float current, class APawn* NewThreat, bool bThreatVisible, class ABot* B);
	bool FindNewEnemyFor(class ABot* B, bool bSeeEnemy);
	void NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn);
	void RemoveEnemy(class APawn* E);
	bool IsOnSquad(class AController* C);
	unsigned char PriorityObjective(class ABot* B);
	bool SetEnemy(class ABot* B, class APawn* NewEnemy);
	bool ValidEnemy(class APawn* NewEnemy);
	bool AddEnemy(class APawn* NewEnemy);
	bool MustKeepEnemy(class APawn* E);
	bool LostEnemy(class ABot* B);
	bool MergeEnemiesFrom(class ASquadAI* S);
	class AActor* FormationCenter();
	struct FRotator GetFacingRotation();
	class AVehicle* GetLinkVehicle(class ABot* B);
	class AVehicle* GetKeyVehicle(class ABot* B);
	class AActor* SetFacingActor(class ABot* B);
	bool AllowImpactJumpBy(class ABot* B);
	bool AllowTranslocationBy(class ABot* B);
	void Destroyed();
	class ARestingFormation* GetRestingFormation();
	bool AllowDetourTo(class ABot* B, class ANavigationPoint* N);
	bool ShouldSuppressEnemy(class ABot* B);
	void CriticalObjectiveWarning(class APawn* NewEnemy);
	void AssignCombo(class ABot* B);
	void Reset();
};


// Class UnrealGame.GameObject
// 0x0048 (0x046C - 0x0424)
class AGameObject : public ADecoration
{
public:
	unsigned long                                      bHome : 1;                                                // 0x0424(0x0004) (Net)
	unsigned long                                      bHeld : 1;                                                // 0x0424(0x0004) (Net)
	unsigned long                                      bDisabled : 1;                                            // 0x0424(0x0004)
	unsigned long                                      bLastSecondSave : 1;                                      // 0x0424(0x0004)
	class AUnrealPawn*                                 Holder;                                                   // 0x0428(0x0004)
	class ATeamPlayerReplicationInfo*                  HolderPRI;                                                // 0x042C(0x0004) (Net)
	class AGameObjective*                              HomeBase;                                                 // 0x0430(0x0004)
	float                                              TakenTime;                                                // 0x0434(0x0004)
	float                                              MaxDropTime;                                              // 0x0438(0x0004)
	class AController*                                 FirstTouch;                                               // 0x043C(0x0004)
	TArray<class AController*>                         Assists;                                                  // 0x0440(0x000C) (NeedCtorLink)
	struct FName                                       GameObjBone;                                              // 0x044C(0x0004)
	struct FVector                                     GameObjOffset;                                            // 0x0450(0x000C)
	struct FRotator                                    GameObjRot;                                               // 0x045C(0x000C)
	class ATeamInfo*                                   OldTeam;                                                  // 0x0468(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.GameObject");
		return ptr;
	}


	void LogReturned();
	void LogDropped();
	void LogTaken(class AController* C);
	void BaseChange();
	void Landed(const struct FVector& HitNormall);
	void NotReachableBy(class APawn* P);
	void FellOutOfWorld(TEnumAsByte<EeKillZType> KillType);
	void Touch(class AActor* Other);
	bool ValidHolder(class AActor* Other);
	bool IsHome();
	class AActor* Position();
	void SetDisable(bool Disable);
	void ClearHolder();
	void CalcSetHome();
	void SendHomeDisabled(float TimeOut);
	void SendHome();
	void Drop(const struct FVector& NewVel, const struct FString& sReason);
	void Score();
	void SetHolder(class AController* C);
	bool CanBePickedUpBy(class APawn* P);
	bool CanBeThrownBy(class APawn* P);
	void ForceBegin();
	void PostBeginPlay();
};


// Class UnrealGame.UnrealPlayer
// 0x009C (0x0E40 - 0x0DA4)
class AUnrealPlayer : public APlayerController
{
public:
	unsigned long                                      bRising : 1;                                              // 0x0DA4(0x0004)
	unsigned long                                      bLatecomer : 1;                                           // 0x0DA4(0x0004)
	unsigned long                                      bDisplayLoser : 1;                                        // 0x0DA4(0x0004)
	unsigned long                                      bDisplayWinner : 1;                                       // 0x0DA4(0x0004)
	int                                                LastTaunt;                                                // 0x0DA8(0x0004)
	float                                              LastWhispTime;                                            // 0x0DAC(0x0004)
	float                                              LastKillTime;                                             // 0x0DB0(0x0004) (Edit)
	float                                              LastTauntAnimTime;                                        // 0x0DB4(0x0004)
	float                                              LastAutoTauntTime;                                        // 0x0DB8(0x0004)
	struct FString                                     CustomizedAnnouncerPack;                                  // 0x0DBC(0x000C) (NeedCtorLink)
	struct FString                                     CustomStatusAnnouncerPack;                                // 0x0DC8(0x000C) (NeedCtorLink)
	struct FString                                     CustomRewardAnnouncerPack;                                // 0x0DD4(0x000C) (NeedCtorLink)
	TArray<struct FString>                             RejoinChannels;                                           // 0x0DE0(0x000C) (Transient, Config, GlobalConfig, NeedCtorLink)
	TArray<struct FString>                             RecentServers;                                            // 0x0DEC(0x000C) (NeedCtorLink)
	int                                                MaxRecentServers;                                         // 0x0DF8(0x0004)
	unsigned long                                      bDontShowLoginMenu : 1;                                   // 0x0DFC(0x0004)
	unsigned long                                      bReadyToStart : 1;                                        // 0x0DFC(0x0004)
	struct FString                                     LoginMenuClass;                                           // 0x0E00(0x000C) (NeedCtorLink)
	unsigned long                                      bForceLoginMenu : 1;                                      // 0x0E0C(0x0004)
	float                                              LastKickWarningTime;                                      // 0x0E10(0x0004)
	struct FString                                     NetBotDebugString;                                        // 0x0E14(0x000C) (NeedCtorLink)
	struct FName                                       DirName;                                                  // 0x0E20(0x0004)
	struct FRotator                                    rAttackedZoomCameraS;                                     // 0x0E24(0x000C)
	float                                              fAttackedCamera3DZoomRatioS;                              // 0x0E30(0x0004)
	float                                              fAttackedWeapon3DZoomRatioS;                              // 0x0E34(0x0004)
	float                                              fAttacked3DZoomSpeed;                                     // 0x0E38(0x0004)
	float                                              fAttacked3DZoomDecayAcc;                                  // 0x0E3C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.UnrealPlayer");
		return ptr;
	}


	void wViewAttacked(float DeltaTime);
	void wAttackedView(int iPitch, int iYaw, int iRoll);
	void AttackedView(int iWeaponID, float fHitGunKick, const struct FVector& vAttacked);
	void RotateByAttacked(struct FVector* CameraLocation, struct FRotator* CameraRotation);
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	void ClientReceiveBotDebugString(const struct FString& DebugString);
	void ServerSendBotDebugString();
	void NetDebugBot();
	void ServerChatDebug();
	void ClientGameEnded();
	void AutoJoinVoiceChat();
	void PostNetBeginPlay();
	bool NeedNetNotify();
	void SetCustomRewardAnnouncerClass(const struct FString& NewAnnouncerClass);
	struct FString GetCustomRewardAnnouncerClass();
	void SetCustomStatusAnnouncerClass(const struct FString& NewAnnouncerClass);
	struct FString GetCustomStatusAnnouncerClass();
	void ShowMidGameMenu(bool bPause);
	void ServerDropFlag();
	void DropFlag();
	void PlayWinMessage(bool bWinner);
	void ClientPlayTakeHit(const struct FVector& HitLoc, unsigned char Damage, class UClass* DamageType, int CollisionPart);
	void HitSound();
	void NewClientPlayTakeHit(const struct FVector& AttackLoc, const struct FVector& HitLoc, unsigned char Damage, class UClass* DamageType, int iWeaponID, float fHitGunKick, int CollisionPart);
	void NotifyTakeHit(class APawn* instigatedBy, const struct FVector& HitLocation, int Damage, class UClass* DamageType, const struct FVector& Momentum, int CollisionPart);
	void ShowLoginMenu();
	void ClientReceiveLoginMenu(const struct FString& MenuClass, bool bForce);
	void ServerSetReadyToStart();
	void InitInputSystem();
	void PostNetReceive();
	void PlayStartupMessage(unsigned char StartupStage);
	void KickWarning();
	void PlayAnnouncement(class USound* ASound, unsigned char AnnouncementLevel, bool bForce);
	void PlayRewardAnnouncement(const struct FName& AName, unsigned char AnnouncementLevel, bool bForce, TEnumAsByte<ESoundSlot> Slot, bool isWomanVoice);
	void PlayStatusAnnouncement(const struct FString& AName, unsigned char AnnouncementLevel, bool bForce);
	void ServerPlayVehicleHorn(int HornIndex);
	void PlayVehicleHorn(int HornIndex);
	void ServerTaunt(const struct FName& AnimName);
	void TAUNT(const struct FName& Sequence);
	void RandomTaunt();
	unsigned char GetMessageIndex(const struct FName& PhraseName);
	void ServerShowPathToBase(int TeamNum);
	void BasePath(unsigned char Num);
	void SoakPause(class APawn* P);
	void SoakBots();
	bool DontReuseTaunt(int t);
	bool AutoTaunt();
	void Possess(class APawn* aPawn);
	void ShowAI();
	void LogMultiKills(float Reward, bool bEnemyKill);
	void ClientDelayedAnnouncement(class USound* AnnouncementSound, unsigned char Delay);
	void ClientDelayedAnnouncementNamed(const struct FName& Announcement, unsigned char Delay);
	void AwardAdrenaline(float Amount);
	void PostBeginPlay();
	void ClientSendStats(class ATeamPlayerReplicationInfo* PRI, int newgoals, bool bNewFirstBlood, int newKills, int newsuicides, int newFlagTouches, int newFlagReturns, int newFlakCount, int newComboCount, int newHeadCount, int newRanOverCount, int newDaredevilPoints);
	void ClientSendCombos(class ATeamPlayerReplicationInfo* PRI, unsigned char Combos0, unsigned char Combos1, unsigned char Combos2, unsigned char Combos3, unsigned char Combos4);
	void ClientSendMultiKills(class ATeamPlayerReplicationInfo* PRI, unsigned char MultiKills0, unsigned char MultiKills1, unsigned char MultiKills2, unsigned char MultiKills3, unsigned char MultiKills4, unsigned char MultiKills5, unsigned char MultiKills6);
	void ClientSendSprees(class ATeamPlayerReplicationInfo* PRI, unsigned char Spree0, unsigned char Spree1, unsigned char Spree2, unsigned char Spree3, unsigned char Spree4, unsigned char Spree5);
	void ClientSendVehicle(class ATeamPlayerReplicationInfo* PRI, class UClass* V, int Kills, int Deaths, int DeathsDriving, int i);
	void ClientSendWeapon(class ATeamPlayerReplicationInfo* PRI, class UClass* W, int Kills, int Deaths, int deathsholding, int i);
	void ServerGetNextVehicleStats(class ATeamPlayerReplicationInfo* PRI, int i);
	void ServerGetNextWeaponStats(class ATeamPlayerReplicationInfo* PRI, int i);
	void ServerUpdateStatArrays(class ATeamPlayerReplicationInfo* PRI);
	void ServerUpdateStats(class ATeamPlayerReplicationInfo* PRI);
};


// Class UnrealGame.DeathMatch
// 0x0778 (0x1240 - 0x0AC8)
class ADeathMatch : public AUnrealMPGameInfo
{
public:
	TArray<struct FAddBotInfo>                         AddBotQueue;                                              // 0x0AC8(0x000C) (NeedCtorLink)
	int                                                NetWait;                                                  // 0x0AD4(0x0004) (Config)
	int                                                NetWaitClan;                                              // 0x0AD8(0x0004) (Config)
	int                                                MinNetPlayers;                                            // 0x0ADC(0x0004)
	int                                                RestartWait;                                              // 0x0AE0(0x0004)
	unsigned long                                      bTournament : 1;                                          // 0x0AE4(0x0004)
	unsigned long                                      bAutoNumBots : 1;                                         // 0x0AE4(0x0004)
	unsigned long                                      bColoredDMSkins : 1;                                      // 0x0AE4(0x0004)
	unsigned long                                      bPlayersMustBeReady : 1;                                  // 0x0AE4(0x0004)
	unsigned long                                      bForceRespawn : 1;                                        // 0x0AE4(0x0004)
	unsigned long                                      bAdjustSkill : 1;                                         // 0x0AE4(0x0004)
	unsigned long                                      bAllowTaunts : 1;                                         // 0x0AE4(0x0004)
	unsigned long                                      bAllowTrans : 1;                                          // 0x0AE4(0x0004)
	unsigned long                                      bDefaultTranslocator : 1;                                 // 0x0AE4(0x0004)
	unsigned long                                      bOverrideTranslocator : 1;                                // 0x0AE4(0x0004)
	unsigned long                                      bWaitForNetPlayers : 1;                                   // 0x0AE4(0x0004)
	unsigned long                                      bFirstBlood : 1;                                          // 0x0AE4(0x0004)
	unsigned long                                      bQuickStart : 1;                                          // 0x0AE4(0x0004)
	unsigned long                                      bSkipPlaySound : 1;                                       // 0x0AE4(0x0004)
	unsigned long                                      bStartedCountDown : 1;                                    // 0x0AE4(0x0004)
	unsigned long                                      bFinalStartup : 1;                                        // 0x0AE4(0x0004)
	unsigned long                                      bOverTimeBroadcast : 1;                                   // 0x0AE4(0x0004)
	unsigned long                                      bEpicNames : 1;                                           // 0x0AE4(0x0004)
	unsigned long                                      bKillBots : 1;                                            // 0x0AE4(0x0004)
	unsigned long                                      bCustomBots : 1;                                          // 0x0AE4(0x0004)
	unsigned long                                      bReviewingJumpSpots : 1;                                  // 0x0AE4(0x0004)
	unsigned long                                      bAllowPlayerLights : 1;                                   // 0x0AE4(0x0004)
	unsigned long                                      bForceNoPlayerLights : 1;                                 // 0x0AE4(0x0004)
	unsigned long                                      bAlwaysShowLoginMenu : 1;                                 // 0x0AE4(0x0004) (Edit)
	unsigned long                                      GiveBotsFakeUID : 1;                                      // 0x0AE4(0x0004)
	TArray<class AVehicle*>                            Vehicles;                                                 // 0x0AE8(0x000C) (NeedCtorLink)
	unsigned long                                      bForceDefaultCharacter : 1;                               // 0x0AF4(0x0004)
	unsigned long                                      bPlayerBecameActive : 1;                                  // 0x0AF4(0x0004)
	unsigned long                                      bMustHaveMultiplePlayers : 1;                             // 0x0AF4(0x0004)
	unsigned char                                      StartupStage;                                             // 0x0AF8(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0AF9(0x0003) MISSED OFFSET
	int                                                NumRounds;                                                // 0x0AFC(0x0004)
	float                                              SpawnProtectionTime;                                      // 0x0B00(0x0004)
	int                                                DefaultMaxLives;                                          // 0x0B04(0x0004)
	int                                                LateEntryLives;                                           // 0x0B08(0x0004)
	int                                                RemainingTime;                                            // 0x0B0C(0x0004)
	int                                                ElapsedTime;                                              // 0x0B10(0x0004)
	int                                                CountDown;                                                // 0x0B14(0x0004)
	float                                              AdjustedDifficulty;                                       // 0x0B18(0x0004)
	int                                                PlayerKills;                                              // 0x0B1C(0x0004)
	int                                                PlayerDeaths;                                             // 0x0B20(0x0004)
	class UClass*                                      DMSquadClass;                                             // 0x0B24(0x0004)
	class UClass*                                      LevelRulesClass;                                          // 0x0B28(0x0004)
	class ALevelGameRules*                             LevelRules;                                               // 0x0B2C(0x0004)
	class AUnrealTeamInfo*                             EnemyRoster;                                              // 0x0B30(0x0004)
	struct FString                                     EnemyRosterName;                                          // 0x0B34(0x000C) (NeedCtorLink)
	struct FString                                     DefaultEnemyRosterClass;                                  // 0x0B40(0x000C) (NeedCtorLink)
	int                                                RemainingBots;                                            // 0x0B4C(0x0004)
	int                                                InitialBots;                                              // 0x0B50(0x0004)
	class ANavigationPoint*                            LastPlayerStartSpot;                                      // 0x0B54(0x0004)
	class ANavigationPoint*                            LastStartSpot;                                            // 0x0B58(0x0004)
	int                                                NameNumber;                                               // 0x0B5C(0x0004)
	int                                                EndMessageWait;                                           // 0x0B60(0x0004)
	int                                                EndMessageCounter;                                        // 0x0B64(0x0004) (Transient)
	struct FName                                       AltEndGameSoundName[0x2];                                 // 0x0B68(0x0004)
	int                                                SinglePlayerWait;                                         // 0x0B70(0x0004)
	struct FString                                     NamePrefixes[0xA];                                        // 0x0B74(0x000C) (NeedCtorLink)
	struct FString                                     NameSuffixes[0xA];                                        // 0x0BEC(0x000C) (NeedCtorLink)
	class AActor*                                      EndGameFocus;                                             // 0x0C64(0x0004)
	class APlayerController*                           StandalonePlayer;                                         // 0x0C68(0x0004)
	struct FString                                     DMPropsDisplayText[0xE];                                  // 0x0C6C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     DMPropDescText[0xE];                                      // 0x0D14(0x000C) (Localized, NeedCtorLink)
