#pragma once

// Arctic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class WGame.wUtil
// 0x0064 (0x0090 - 0x002C)
class UwUtil : public UObject
{
public:
	struct FString                                     SectionName;                                              // 0x002C(0x000C) (Edit, Const, NeedCtorLink)
	struct FString                                     FileExtension;                                            // 0x0038(0x000C) (Edit, Const, NeedCtorLink)
	class UCachePlayers*                               CachedPlayerList;                                         // 0x0044(0x0004) (Edit, Const, Transient)
	struct FString                                     NoPreference;                                             // 0x0048(0x000C) (Localized, NeedCtorLink)
	struct FString                                     FavoriteWeapon;                                           // 0x0054(0x000C) (Localized, NeedCtorLink)
	struct FString                                     AgilityString;                                            // 0x0060(0x000C) (Localized, NeedCtorLink)
	struct FString                                     TacticsString;                                            // 0x006C(0x000C) (Localized, NeedCtorLink)
	struct FString                                     AccuracyString;                                           // 0x0078(0x000C) (Localized, NeedCtorLink)
	struct FString                                     AggressivenessString;                                     // 0x0084(0x000C) (Localized, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wUtil");
		return ptr;
	}


	TArray<class UClass*> STATIC_GetMutatorClasses(TArray<struct FString> MutClassNames);
	int STATIC_GetTeamInfoSalaryFor(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_GetTeamSalaryFor(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayTacticsRating(TArray<struct FString> Players);
	int STATIC_TeamInfoTacticsRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamTacticsRating(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayAgilityRating(TArray<struct FString> Players);
	int STATIC_TeamInfoAgilityRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamAgilityRating(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayAggressivenessRating(TArray<struct FString> Players);
	int STATIC_TeamInfoAggressivenessRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamAggressivenessRating(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayAccuracyRating(TArray<struct FString> Players);
	int STATIC_TeamInfoAccuracyRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamAccuracyRating(class UGameProfile* GP, int lineupsize);
	int STATIC_AggressivenessRating(const struct FPlayerRecord& PRE);
	int STATIC_TacticsRating(const struct FPlayerRecord& PRE);
	int STATIC_AgilityRating(const struct FPlayerRecord& PRE);
	int STATIC_AccuracyRating(const struct FPlayerRecord& PRE);
	int STATIC_RatingModifier(const struct FString& CharacterName);
	struct FString STATIC_GetFavoriteWeaponFor(const struct FPlayerRecord& PRE);
	int STATIC_GetSalaryFor(const struct FPlayerRecord& PRE);
	struct FPlayerRecord STATIC_FindPlayerRecord(const struct FString& CharName);
	void STATIC_GetMutatorList(TArray<struct UwUtil_FMutatorRecord> MutatorRecords);
	class UDecoText* STATIC_LoadDecoText(const struct FString& PackageName, const struct FString& DecoTextName, int ColumnCount);
	struct FPlayerRecord STATIC_FindUPLPlayerRecord(const struct FString& CharName);
	struct FPlayerRecord STATIC_GetPlayerRecord(int Index);
	void STATIC_GetPlayerList(TArray<struct FPlayerRecord>* PlayerRecords);
};


// Class WGame.wTeamRoster
// 0x0000 (0x0554 - 0x0554)
class AwTeamRoster : public AUnrealTeamInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wTeamRoster");
		return ptr;
	}


	bool BelongsOnTeam(class UClass* PawnClass);
	bool AlreadyExistsEntry(const struct FString& CharacterName, bool bNoRecursion);
	bool AvailableRecord(const struct FString& MenuString);
	class URosterEntry* GetRandomPlayer();
	void FillPlayerTeam(class UGameProfile* G);
	void Initialize(int TeamBots);
	class URosterEntry* GetNamedBot(const struct FString& botname);
	void PostBeginPlay();
};


// Class WGame.wKillerMessagePlus
// 0x0018 (0x0468 - 0x0450)
class AwKillerMessagePlus : public ALocalMessage
{
public:
	struct FString                                     YouKilled;                                                // 0x0450(0x000C) (Edit, Localized, NeedCtorLink)
	struct FString                                     YouKilledTrailer;                                         // 0x045C(0x000C) (Edit, Localized, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wKillerMessagePlus");
		return ptr;
	}


	struct FString STATIC_GetString(int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject);
};


// Class WGame.wDeathMessage
// 0x001C (0x046C - 0x0450)
class AwDeathMessage : public ALocalMessage
{
public:
	struct FString                                     KilledString;                                             // 0x0450(0x000C) (Edit, Localized, NeedCtorLink)
	struct FString                                     SomeoneString;                                            // 0x045C(0x000C) (Edit, Localized, NeedCtorLink)
	unsigned long                                      bNoConsoleDeathMessages : 1;                              // 0x0468(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wDeathMessage");
		return ptr;
	}


	void STATIC_ClientReceive(class APlayerController* P, int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject);
	struct FString STATIC_GetString(int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject);
	struct FColor STATIC_GetConsoleColor(class APlayerReplicationInfo* RelatedPRI_1);
};


// Class WGame.wPurpose
// 0x0024 (0x0050 - 0x002C)
class UwPurpose : public UObject
{
public:
	class AwAIBotBase*                                 Owner;                                                    // 0x002C(0x0004)
	struct FString                                     PlanName;                                                 // 0x0030(0x000C) (NeedCtorLink)
	float                                              ActionMinTime;                                            // 0x003C(0x0004)
	float                                              ActionMaxTime;                                            // 0x0040(0x0004)
	float                                              PlanLength;                                               // 0x0044(0x0004)
	float                                              _TEMP_SCORE;                                              // 0x0048(0x0004)
	float                                              _TEMP_COUNT;                                              // 0x004C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wPurpose");
		return ptr;
	}


	float GetActivationScore();
	float Evaluate(class UwStateData** S);
	class UwPurpose* STATIC_Create(class AwAIBotBase* inOwner);
};


// Class WGame.wPurposeAttackTarget
// 0x0000 (0x0050 - 0x0050)
class UwPurposeAttackTarget : public UwPurpose
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wPurposeAttackTarget");
		return ptr;
	}


	float GetActivationScore();
	float Evaluate(class UwStateData** S);
};


// Class WGame.wAILevel
// 0x0088 (0x0460 - 0x03D8)
class AwAILevel : public AwAILevelBase
{
public:
	class UwMatchMaker*                                MM;                                                       // 0x03D8(0x0004)
	TArray<class ANavigationPoint*>                    FrontLineTeam0;                                           // 0x03DC(0x000C) (NeedCtorLink)
	TArray<class ANavigationPoint*>                    FrontLineTeam1;                                           // 0x03E8(0x000C) (NeedCtorLink)
	int                                                Influence0Length;                                         // 0x03F4(0x0004)
	int                                                Influence1Length;                                         // 0x03F8(0x0004)
	int                                                InfluenceNLength;                                         // 0x03FC(0x0004)
	int                                                AllNavsLength;                                            // 0x0400(0x0004)
	TArray<class ANavigationPoint*>                    Influence0;                                               // 0x0404(0x000C) (NeedCtorLink)
	TArray<class ANavigationPoint*>                    Influence1;                                               // 0x0410(0x000C) (NeedCtorLink)
	TArray<class ANavigationPoint*>                    InfluenceN;                                               // 0x041C(0x000C) (NeedCtorLink)
	TArray<class ANavigationPoint*>                    AllNavs;                                                  // 0x0428(0x000C) (NeedCtorLink)
	int                                                NumTypeAR;                                                // 0x0434(0x0004)
	int                                                NumTypeSMG;                                               // 0x0438(0x0004)
	TArray<class AwAIBotBase*>                         Bots;                                                     // 0x043C(0x000C) (NeedCtorLink)
	class UObjectPool*                                 PoolAction;                                               // 0x0448(0x0004)
	class UObjectPool*                                 PoolActionContainer;                                      // 0x044C(0x0004)
	class UObjectPool*                                 PoolActionLayer;                                          // 0x0450(0x0004)
	class UObjectPool*                                 PoolGoal;                                                 // 0x0454(0x0004)
	class UwPlanMaster*                                PlanMaster;                                               // 0x0458(0x0004)
	unsigned long                                      bInitialized : 1;                                         // 0x045C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wAILevel");
		return ptr;
	}


	void ClearReferences();
	void BotsLovePeace();
	void ResetNames();
	class UwNPCItemGroupParam* GetItemParamByGroupID(int GroupID);
	struct FString GetName(int NameGroupID);
	void KillBot(class AAIController* Bot);
	void KillBots(int Num);
	void KillBotsTeam(int Num, int inTeam);
	void RegisterBot(class AwAIBotBase* Bot);
	class UwNPCActions* GetNPCAction(int ActionGroupID);
	bool ActionExists(int ActionGroupID, const struct FString& Action);
	class UwNPCParam* GetNPCParam(int Grade);
	class UwNPCParam* GetNPCParamByNPCID(int NPCID);
	void UpdateInfluenceListScript();
	void UpdateInfluenceList();
	void UpdateInfluenceListNative();
	void UpdateAllNavs();
	class ANavigationPoint* GetRandomDestFromInfluence(unsigned char inTeam);
	class ANavigationPoint* GetRandomDestFromFrontLine(unsigned char inTeam);
	void InitFrontLine();
	void Tick(float dt);
	void InitInfluenceList();
	void Initialize();
	void PreBeginPlay();
};


// Class WGame.wStateData
// 0x007C (0x00A8 - 0x002C)
class UwStateData : public UObject
{
public:
	class AwAIBotBase*                                 Owner;                                                    // 0x002C(0x0004)
	int                                                Ammo;                                                     // 0x0030(0x0004)
	int                                                MaxAmmo;                                                  // 0x0034(0x0004)
	int                                                Magazine;                                                 // 0x0038(0x0004)
	int                                                NumFragGrenade;                                           // 0x003C(0x0004)
	int                                                NumStunGrenade;                                           // 0x0040(0x0004)
	int                                                NumSmokeGrenade;                                          // 0x0044(0x0004)
	class UwWeaponBaseParams*                          CurrentWeapon;                                            // 0x0048(0x0004)
	TArray<class UwWeaponBaseParams*>                  Weapons;                                                  // 0x004C(0x000C) (NeedCtorLink)
	int                                                SwitchWeaponCount;                                        // 0x0058(0x0004)
	unsigned long                                      IsFlashed : 1;                                            // 0x005C(0x0004)
	unsigned long                                      IsStopAction : 1;                                         // 0x005C(0x0004)
	unsigned long                                      IsStopTargeting : 1;                                      // 0x005C(0x0004)
	unsigned long                                      IsStopGotoFlag1 : 1;                                      // 0x005C(0x0004)
	unsigned long                                      IsStopGotoFlag2 : 1;                                      // 0x005C(0x0004)
	unsigned long                                      IsCrouch : 1;                                             // 0x005C(0x0004)
	unsigned long                                      IsStand : 1;                                              // 0x005C(0x0004)
	unsigned long                                      IsProne : 1;                                              // 0x005C(0x0004)
	unsigned long                                      FreeHead : 1;                                             // 0x005C(0x0004)
	unsigned long                                      FreeHands : 1;                                            // 0x005C(0x0004)
	unsigned long                                      FreeLegs : 1;                                             // 0x005C(0x0004)
	unsigned long                                      CannotFindPath : 1;                                       // 0x005C(0x0004)
	int                                                Health;                                                   // 0x0060(0x0004)
	int                                                PropsectDealtDamage;                                      // 0x0064(0x0004)
	int                                                ProspectTakenDamage;                                      // 0x0068(0x0004)
	unsigned long                                      HasSupplyHelicopter : 1;                                  // 0x006C(0x0004)
	unsigned long                                      HasSupplyUAV : 1;                                         // 0x006C(0x0004)
	unsigned long                                      HasSupplyAirstrike : 1;                                   // 0x006C(0x0004)
	struct FVector                                     Location;                                                 // 0x0070(0x000C)
	class UMemoryItem*                                 Target;                                                   // 0x007C(0x0004)
	unsigned long                                      TargetVisible : 1;                                        // 0x0080(0x0004)
	unsigned long                                      TargetReachable : 1;                                      // 0x0080(0x0004)
	int                                                TargetChangeCount;                                        // 0x0084(0x0004)
	unsigned long                                      CanMeleeTarget : 1;                                       // 0x0088(0x0004)
	unsigned long                                      bUseAiming : 1;                                           // 0x0088(0x0004)
	unsigned long                                      bAimingTarget : 1;                                        // 0x0088(0x0004)
	float                                              MeetNewEnemyProbabilty;                                   // 0x008C(0x0004)
	float                                              Time;                                                     // 0x0090(0x0004)
	int                                                NumCapturedFlags;                                         // 0x0094(0x0004)
	class AwFlagObjectiveBase*                         FlagIamOn;                                                // 0x0098(0x0004)
	int                                                World_NumAllies;                                          // 0x009C(0x0004)
	int                                                World_NumEnemies;                                         // 0x00A0(0x0004)
	unsigned long                                      World_IsSDRespawnTime : 1;                                // 0x00A4(0x0004)
	unsigned long                                      World_TeamGame : 1;                                       // 0x00A4(0x0004)
	unsigned long                                      World_Helicopter : 1;                                     // 0x00A4(0x0004)
	unsigned long                                      World_Airstrike : 1;                                      // 0x00A4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wStateData");
		return ptr;
	}


	class UwStateData* STATIC_Create();
};


// Class WGame.ShortMemory
// 0x0040 (0x006C - 0x002C)
class UShortMemory : public UObject
{
public:
	class AwAIBotBase*                                 Owner;                                                    // 0x002C(0x0004)
	class ALevelInfo*                                  Level;                                                    // 0x0030(0x0004)
	TArray<class UMemoryItem*>                         Memories;                                                 // 0x0034(0x000C) (NeedCtorLink)
	int                                                NumVisibleMemories;                                       // 0x0040(0x0004)
	float                                              RetentionTIme;                                            // 0x0044(0x0004)
	float                                              ResponseTime;                                             // 0x0048(0x0004)
	float                                              MemoryItemUpdateInterval;                                 // 0x004C(0x0004)
	int                                                ResponseQueueHead;                                        // 0x0050(0x0004)
	TArray<float>                                      ResponseQueueTime;                                        // 0x0054(0x000C) (NeedCtorLink)
	TArray<class APawn*>                               ResponseQueuePawn;                                        // 0x0060(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.ShortMemory");
		return ptr;
	}


	void DisplayDebug(class UCanvas* C, float* YL, float* YPos);
	void SetOffsetCrouchHeight(float fHeight);
	void SetOffsetStandHeight(float fHeight);
	class UMemoryItem* GetByPawn(class APawn* P, bool createIfNotFound);
	class UMemoryItem* GetByPawn2(class APawn* P);
	void RemoveByPawn(class APawn* P);
	void RemoveAll();
	void ClearReferences();
	void RemoveMemoriesOverRetentionTime();
	bool RememberByVision(class APawn* P);
	bool RememberBySound(class APawn* P, float Loudness);
	void NotifyDestroyed(class AActor* A);
	void Update(float dt);
	class UShortMemory* STATIC_Create(class AwAIBotBase* inOwner, float inResponseTime);
};


// Class WGame.MemoryItem
// 0x0040 (0x006C - 0x002C)
class UMemoryItem : public UObject
{
public:
	class AwAIBotBase*                                 Owner;                                                    // 0x002C(0x0004)
	float                                              LastTime;                                                 // 0x0030(0x0004)
	struct FVector                                     LastPosition;                                             // 0x0034(0x000C)
	float                                              LastTargetedTime;                                         // 0x0040(0x0004)
	class APawn*                                       Pawn;                                                     // 0x0044(0x0004)
	class APlayerReplicationInfo*                      PRI;                                                      // 0x0048(0x0004)
	int                                                MaxPositions;                                             // 0x004C(0x0004)
	unsigned long                                      IsVisible : 1;                                            // 0x0050(0x0004)
	unsigned long                                      IsVisibleOld : 1;                                         // 0x0050(0x0004)
	unsigned long                                      InSight : 1;                                              // 0x0050(0x0004)
	unsigned long                                      InSightOld : 1;                                           // 0x0050(0x0004)
	struct FVector                                     OffsetStandHeight;                                        // 0x0054(0x000C)
	struct FVector                                     OffsetCrouchHeight;                                       // 0x0060(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.MemoryItem");
		return ptr;
	}


	void SetOffsetCrouchHeight(float fHeight);
	void SetOffsetStandHeight(float fHeight);
	void ClearReferences();
	void Update();
	void AddKnownPosition(const struct FVector& V, float t);
	void NotifyDestroyed(class AActor* A);
	class UMemoryItem* STATIC_Create(class AwAIBotBase* inOwner, class APawn* P);
};


// Class WGame.wAIBotBase
// 0x0074 (0x0690 - 0x061C)
class AwAIBotBase : public AAIController
{
public:
	class UGoal*                                       Goal;                                                     // 0x061C(0x0004)
	class UwFutureState*                               FutureState;                                              // 0x0620(0x0004)
	class UShortMemory*                                Memory;                                                   // 0x0624(0x0004)
	class UTargetingSystem*                            TargetSystem;                                             // 0x0628(0x0004)
	class UwActionPlanner*                             Planner;                                                  // 0x062C(0x0004)
	class UwPlanMaster*                                PlanMaster;                                               // 0x0630(0x0004)
	class AwAILevel*                                   AILevel;                                                  // 0x0634(0x0004)
	class UwNPCActions*                                npcActions;                                               // 0x0638(0x0004)
	float                                              UpdateElapsed;                                            // 0x063C(0x0004)
	float                                              UpdateInterval;                                           // 0x0640(0x0004)
	unsigned long                                      TrySprint : 1;                                            // 0x0644(0x0004)
	float                                              DeadTime;                                                 // 0x0648(0x0004)
	float                                              LastRestartRequestTime;                                   // 0x064C(0x0004)
	unsigned long                                      bDrawPath : 1;                                            // 0x0650(0x0004)
	TArray<float>                                      NavExtraCosts;                                            // 0x0654(0x000C) (NeedCtorLink)
	TArray<float>                                      NavDetourExtraCosts;                                      // 0x0660(0x000C) (NeedCtorLink)
	float                                              NavExtraCostFactor_VisCount;                              // 0x066C(0x0004)
	float                                              NavExtraCostFactor_DetourScore;                           // 0x0670(0x0004)
	float                                              NavExtraCostFactor_DetourMaxDistFactor;                   // 0x0674(0x0004)
	class AwFlagObjectiveBase*                         LastTargetFlag;                                           // 0x0678(0x0004)
	struct FName                                       StateOnPossess;                                           // 0x067C(0x0004)
	struct FVector                                     UpVector;                                                 // 0x0680(0x000C)
	unsigned long                                      IsStopAction : 1;                                         // 0x068C(0x0004)
	unsigned long                                      IsStopTargeting : 1;                                      // 0x068C(0x0004)
	unsigned long                                      IsStopGotoFlag1 : 1;                                      // 0x068C(0x0004)
	unsigned long                                      IsStopGotoFlag2 : 1;                                      // 0x068C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wAIBotBase");
		return ptr;
	}


	void DisplayDebug_Path(class UCanvas* C, float* YL, float* YPos);
	void DisplayDebug(class UCanvas* C, float* YL, float* YPos);
	int SetFireYaw(int FireYaw);
	struct FRotator AdjustAim(const struct FFireProperties& FiredAmmunition, const struct FVector& projStart, int AimError);
	void NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn);
	void HearNoise(float Loudness, class AActor* NoiseMaker);
	void SeePlayer(class APawn* SeenPlayer);
	void NotifyVehicle(class AVehicle* V);
	void OnMemoryVisibleChanged();
	void HandleMessage(const struct FString& Msg);
	void wClientFlash(float fTime);
	bool IsProning();
	void TryProne();
	bool IsCrouching();
	void TryCrouch();
	bool IsStandingUp();
	void TryStandUp();
	bool IsSprinting();
	void SetSprint(bool Value);
	void PawnDied(class APawn* P);
	void ClientOnEndWaitingForStart();
	void ZeroExtraCost();
	void CopyNavExtraCost();
	void UpdateNavDetourExtraCostScript(const struct FVector& S, const struct FVector& E);
	void UpdateNavDetourExtraCost(const struct FVector& S, const struct FVector& E);
	void UpdateNavDetourExtraCostNative(const struct FVector& S, const struct FVector& E);
	void InitNavExtraCost();
	void Cmd(const struct FString& P1, const struct FString& P2, const struct FString& p3, const struct FString& p4, const struct FString& p5);
	float EvaluateState(class UwStateData* S);
	void SetupWStateNative(class UwStateData** S);
	void NotifyAddDefaultInventory();
	void NotifyAddInventory(class AInventory* NewItem);
	void SetupWeapons(class APawn* aPawn);
	void SetPawnClass(const struct FString& inClass, const struct FString& InCharacter);
	void SetName(class UwNPCParam* Param);
	void InitBot(int Grade);
	void ClearReferences();
	bool WeaponFireAgain(float RefireRate, bool bFinishedFire);
	bool ReadyToMeleeAttack();
};


// Class WGame.wPlayerInfo
// 0x0000 (0x002C - 0x002C)
class UwPlayerInfo : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wPlayerInfo");
		return ptr;
	}


	bool STATIC_Setup(class AwPawn* P, const struct FPlayerRecord& Rec);
	bool STATIC_SetupPawn(class AwPawn* P, int iBodyItemID, int iHelmetItemID, int iAcceItemID, int iBackPackID, int iPouchID, int iCamouflageID, int iTeamIndex);
};


// Class WGame.SpeciesType
// 0x01B0 (0x01DC - 0x002C)
class USpeciesType : public UObject
{
public:
	struct FString                                     MaleVoice;                                                // 0x002C(0x000C) (NeedCtorLink)
	struct FString                                     FemaleVoice;                                              // 0x0038(0x000C) (NeedCtorLink)
	struct FString                                     GibGroup;                                                 // 0x0044(0x000C) (NeedCtorLink)
	struct FString                                     MaleRagSkelName;                                          // 0x0050(0x000C) (NeedCtorLink)
	struct FString                                     FemaleRagSkelName;                                        // 0x005C(0x000C) (NeedCtorLink)
	struct FString                                     FemaleSkeleton;                                           // 0x0068(0x000C) (NeedCtorLink)
	struct FString                                     MaleSkeleton;                                             // 0x0074(0x000C) (NeedCtorLink)
	struct FString                                     MaleSoundGroup;                                           // 0x0080(0x000C) (NeedCtorLink)
	struct FString                                     FemaleSoundGroup;                                         // 0x008C(0x000C) (NeedCtorLink)
	struct FString                                     PawnClassName;                                            // 0x0098(0x000C) (NeedCtorLink)
	struct FString                                     SpeciesName;                                              // 0x00A4(0x000C) (Localized, NeedCtorLink)
	int                                                RaceNum;                                                  // 0x00B0(0x0004)
	int                                                DMTeam;                                                   // 0x00B4(0x0004)
	struct FName                                       TauntAnims[0x10];                                         // 0x00B8(0x0004)
	struct FString                                     TauntAnimNames[0x10];                                     // 0x00F8(0x000C) (Localized, NeedCtorLink)
	float                                              AirControl;                                               // 0x01B8(0x0004)
	float                                              GroundSpeed;                                              // 0x01BC(0x0004)
	float                                              WaterSpeed;                                               // 0x01C0(0x0004)
	float                                              JumpZ;                                                    // 0x01C4(0x0004)
	float                                              ReceivedDamageScaling;                                    // 0x01C8(0x0004)
	float                                              DamageScaling;                                            // 0x01CC(0x0004)
	float                                              AccelRate;                                                // 0x01D0(0x0004)
	float                                              DodgeSpeedFactor;                                         // 0x01D4(0x0004)
	float                                              DodgeSpeedZ;                                              // 0x01D8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.SpeciesType");
		return ptr;
	}


	int STATIC_GetOffsetForSequence(const struct FName& Sequence);
	bool STATIC_Setup(class AwPawn* P, const struct FPlayerRecord& Rec);
	void STATIC_SetTeamSkin(class AwPawn* P, const struct FPlayerRecord& Rec, int TeamNum);
	struct FString STATIC_GetRagSkelName(const struct FString& MeshName);
	void STATIC_ModifyPawn(class APawn* P);
	int STATIC_ModifyImpartedDamage(int Damage, class APawn* injured, class APawn* instigatedBy, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType);
	int STATIC_ModifyReceivedDamage(int Damage, class APawn* injured, class APawn* instigatedBy, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType);
	void STATIC_LoadResources(const struct FPlayerRecord& Rec, class ALevelInfo* Level, class APlayerReplicationInfo* PRI, int TeamNum);
	struct FString STATIC_GetVoiceType(bool bIsFemale, class ALevelInfo* Level);
};


// Class WGame.AimedAttachment
// 0x001C (0x03F4 - 0x03D8)
class AAimedAttachment : public AActor
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x03D8(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.AimedAttachment");
		return ptr;
	}

};


// Class WGame.CachePlayers
// 0x000C (0x009C - 0x0090)
class UCachePlayers : public UwUtil
{
public:
	TArray<struct FPlayerRecord>                       Records;                                                  // 0x0090(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.CachePlayers");
		return ptr;
	}

};


// Class WGame.DecoText
// 0x0018 (0x0044 - 0x002C)
class UDecoText : public UObject
{
public:
	struct FString                                     TextName;                                                 // 0x002C(0x000C) (Edit, NeedCtorLink)
	TArray<struct FString>                             Rows;                                                     // 0x0038(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.DecoText");
		return ptr;
	}

};


// Class WGame.AnimNotify_Nemesis_BeamPrepare
// 0x0000 (0x0030 - 0x0030)
class UAnimNotify_Nemesis_BeamPrepare : public UAnimNotify_Scripted
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.AnimNotify_Nemesis_BeamPrepare");
		return ptr;
	}


	void Notify(class AActor* Owner);
};


// Class WGame.wPawn
// 0x0678 (0x1850 - 0x11D8)
class AwPawn : public AUnrealPawn
{
public:
	int                                                RepeaterDeathCount;                                       // 0x11D8(0x0004)
	class ACombo*                                      CurrentCombo;                                             // 0x11DC(0x0004)
	unsigned long                                      bBerserk : 1;                                             // 0x11E0(0x0004)
	unsigned long                                      bInvis : 1;                                               // 0x11E0(0x0004)
	unsigned long                                      bOldInvis : 1;                                            // 0x11E0(0x0004)
	unsigned long                                      bGibbed : 1;                                              // 0x11E0(0x0004)
	unsigned long                                      bCanDodgeDoubleJump : 1;                                  // 0x11E0(0x0004)
	unsigned long                                      bCanBoostDodge : 1;                                       // 0x11E0(0x0004)
	unsigned long                                      bAlreadySetup : 1;                                        // 0x11E0(0x0004)
	unsigned long                                      bSpawnIn : 1;                                             // 0x11E0(0x0004)
	unsigned long                                      bSpawnDone : 1;                                           // 0x11E0(0x0004)
	unsigned long                                      bFrozenBody : 1;                                          // 0x11E0(0x0004)
	unsigned long                                      bFlaming : 1;                                             // 0x11E0(0x0004)
	unsigned long                                      bRubbery : 1;                                             // 0x11E0(0x0004)
	unsigned long                                      bClearWeaponOffsets : 1;                                  // 0x11E0(0x0004)
	float                                              ShieldStrengthMax;                                        // 0x11E4(0x0004) (Edit)
	float                                              SmallShieldStrength;                                      // 0x11E8(0x0004)
	class UClass*                                      Species;                                                  // 0x11EC(0x0004)
	float                                              GruntVolume;                                              // 0x11F0(0x0004) (Edit)
	float                                              FootstepVolume;                                           // 0x11F4(0x0004) (Edit)
	int                                                SimHitFxTicker;                                           // 0x11F8(0x0004) (Transient)
	class UClass*                                      GibGroupClass;                                            // 0x11FC(0x0004) (Edit)
	int                                                GibCountCalf;                                             // 0x1200(0x0004) (Edit)
	int                                                GibCountForearm;                                          // 0x1204(0x0004) (Edit)
	int                                                GibCountHead;                                             // 0x1208(0x0004) (Edit)
	int                                                GibCountTorso;                                            // 0x120C(0x0004) (Edit)
	int                                                GibCountUpperArm;                                         // 0x1210(0x0004) (Edit)
	float                                              MinTimeBetweenPainSounds;                                 // 0x1214(0x0004)
	struct FString                                     HeadShotMessage;                                          // 0x1218(0x000C) (Localized, NeedCtorLink)
	struct FString                                     SoundFootsteps[0x1E];                                     // 0x1224(0x000C) (NeedCtorLink)
	struct FString                                     SoundFootsteps_3rd[0x1E];                                 // 0x138C(0x000C) (NeedCtorLink)
	class UClass*                                      SoundGroupClass;                                          // 0x14F4(0x0004) (Edit)
	struct FString                                     sndScream;                                                // 0x14F8(0x000C) (NeedCtorLink)
	struct FString                                     sndDie;                                                   // 0x1504(0x000C) (NeedCtorLink)
	class AwWeaponAttachment*                          WeaponAttachment;                                         // 0x1510(0x0004)
	class AwFPWeaponAttachment*                        FPWeaponAttachment;                                       // 0x1514(0x0004)
	class AShadowProjector*                            PlayerShadow;                                             // 0x1518(0x0004)
	class AEffect_ShadowController*                    RealtimeShadow;                                           // 0x151C(0x0004)
	unsigned long                                      bRealtimeShadows : 1;                                     // 0x1520(0x0004)
	int                                                iShadowType;                                              // 0x1524(0x0004)
	int                                                MultiJumpRemaining;                                       // 0x1528(0x0004)
	int                                                MaxMultiJump;                                             // 0x152C(0x0004)
	int                                                MultiJumpBoost;                                           // 0x1530(0x0004)
	struct FName                                       WallDodgeAnims[0x4];                                      // 0x1534(0x0004)
	struct FName                                       IdleHeavyAnim;                                            // 0x1544(0x0004)
	struct FName                                       FireHeavyRapidAnim;                                       // 0x1548(0x0004)
	struct FName                                       FireHeavyBurstAnim;                                       // 0x154C(0x0004)
	struct FName                                       FireRootBone;                                             // 0x1550(0x0004)
	struct FName                                       Pistol_FireRifleRapidAnim;                                // 0x1554(0x0004)
	struct FName                                       TelegraphPack_PutdownAnim;                                // 0x1558(0x0004)
	struct FName                                       TelegraphPack_SelectAnim;                                 // 0x155C(0x0004)
	struct FName                                       Pistol_FireAimCrouchRifleRapidAnim;                       // 0x1560(0x0004)
	TEnumAsByte<EFireAnimState>                        FireState;                                                // 0x1564(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x1565(0x0003) MISSED OFFSET
	class UMesh*                                       SkeletonMesh;                                             // 0x1568(0x0004)
	unsigned long                                      bSkeletized : 1;                                          // 0x156C(0x0004)
	unsigned long                                      bDeRes : 1;                                               // 0x156C(0x0004)
	float                                              DeResTime;                                                // 0x1570(0x0004)
	class AEmitter*                                    DeResFX;                                                  // 0x1574(0x0004)
	struct FInterpCurve                                DeResLiftVel;                                             // 0x1578(0x000C) (Edit, NeedCtorLink)
	struct FInterpCurve                                DeResLiftSoftness;                                        // 0x1584(0x000C) (Edit, NeedCtorLink)
	float                                              DeResGravScale;                                           // 0x1590(0x0004) (Edit)
	float                                              DeResLateralFriction;                                     // 0x1594(0x0004) (Edit)
	float                                              RagdollLifeSpan;                                          // 0x1598(0x0004) (Edit)
	float                                              RagInvInertia;                                            // 0x159C(0x0004) (Edit)
	float                                              RagDeathVel;                                              // 0x15A0(0x0004) (Edit)
	float                                              RagShootStrength;                                         // 0x15A4(0x0004) (Edit)
	float                                              RagSpinScale;                                             // 0x15A8(0x0004) (Edit)
	float                                              RagDeathUpKick;                                           // 0x15AC(0x0004) (Edit)
	float                                              RagGravScale;                                             // 0x15B0(0x0004) (Edit)
	class UMaterial*                                   RagConvulseMaterial;                                      // 0x15B4(0x0004) (Edit)
	TArray<class USound*>                              RagImpactSounds;                                          // 0x15B8(0x000C) (Edit, NeedCtorLink)
	float                                              RagImpactSoundInterval;                                   // 0x15C4(0x0004) (Edit)
	float                                              RagImpactVolume;                                          // 0x15C8(0x0004) (Edit)
	float                                              RagLastSoundTime;                                         // 0x15CC(0x0004) (Transient)
	struct FString                                     RagdollOverride;                                          // 0x15D0(0x000C) (NeedCtorLink)
	class AController*                                 OldController;                                            // 0x15DC(0x0004)
	class UMaterial*                                   RealSkins[0x4];                                           // 0x15E0(0x0004)
	struct FString                                     PlacedCharacterName;                                      // 0x15F0(0x000C) (Edit, NeedCtorLink)
	struct FString                                     PlacedFemaleCharacterName;                                // 0x15FC(0x000C) (NeedCtorLink)
	unsigned char                                      TeamSkin;                                                 // 0x1608(0x0001)
	unsigned char                                      UnknownData01[0x3];                                       // 0x1609(0x0003) MISSED OFFSET
	class AwSkinShell*                                 wParts[0x4];                                              // 0x160C(0x0004)
	int                                                MyCamouFlageID;                                           // 0x161C(0x0004)
	int                                                MyTeamIdx;                                                // 0x1620(0x0004)
	class AwSkinShell*                                 wGoreParts[0x5];                                          // 0x1624(0x0004)
	int                                                iDiedCollisionPart;                                       // 0x1638(0x0004)
	int                                                iBackupTeamNum;                                           // 0x163C(0x0004)
	int                                                iWarpCount;                                               // 0x1640(0x0004)
	struct FString                                     strGoreMeshName;                                          // 0x1644(0x000C) (NeedCtorLink)
	struct FString                                     strGoreStaticMeshName;                                    // 0x1650(0x000C) (NeedCtorLink)
	int                                                AddedSkillList[0x16];                                     // 0x165C(0x0004)
	int                                                iStartQSlotIndex;                                         // 0x16B4(0x0004)
	unsigned long                                      bBurning : 1;                                             // 0x16B8(0x0004)
	float                                              fLastBurningTime;                                         // 0x16BC(0x0004)
	class AwProjectile*                                BurningProj;                                              // 0x16C0(0x0004)
	unsigned long                                      bProximityFuze : 1;                                       // 0x16C4(0x0004)
	float                                              fProximityFuzeTime;                                       // 0x16C8(0x0004)
	class AwPawn*                                      ProximityBot;                                             // 0x16CC(0x0004)
	class AEmitter*                                    allyEffect;                                               // 0x16D0(0x0004)
	struct FName                                       Hit_Stun;                                                 // 0x16D4(0x0004)
	struct FName                                       Hit_Stun_Cr;                                              // 0x16D8(0x0004)
	struct FName                                       Hit_Stun_Pr;                                              // 0x16DC(0x0004)
	struct FName                                       Hit_PS[0x4];                                              // 0x16E0(0x0004)
	struct FName                                       Hit_PS_Head;                                              // 0x16F0(0x0004)
	struct FName                                       Hit_PS_Cr[0x4];                                           // 0x16F4(0x0004)
	struct FName                                       Hit_PS_Pr;                                                // 0x1704(0x0004)
	struct FName                                       Hit_PS_Stun;                                              // 0x1708(0x0004)
	struct FName                                       Hit_PS_Stun_Cr;                                           // 0x170C(0x0004)
	struct FName                                       Hit_PS_Stun_Pr;                                           // 0x1710(0x0004)
	struct FName                                       Hit_FR[0x4];                                              // 0x1714(0x0004)
	struct FName                                       Hit_FR_Head;                                              // 0x1724(0x0004)
	struct FName                                       Hit_FR_Cr[0x4];                                           // 0x1728(0x0004)
	struct FName                                       Hit_FR_Pr;                                                // 0x1738(0x0004)
	struct FName                                       Hit_FR_Stun;                                              // 0x173C(0x0004)
	struct FName                                       Hit_FR_Stun_Cr;                                           // 0x1740(0x0004)
	struct FName                                       Hit_FR_Stun_Pr;                                           // 0x1744(0x0004)
	struct FName                                       Hit_RPG[0x4];                                             // 0x1748(0x0004)
	struct FName                                       Hit_RPG_Head;                                             // 0x1758(0x0004)
	struct FName                                       Hit_RPG_Cr[0x4];                                          // 0x175C(0x0004)
	struct FName                                       Hit_RPG_Pr;                                               // 0x176C(0x0004)
	struct FName                                       Hit_RPG_Stun;                                             // 0x1770(0x0004)
	struct FName                                       Hit_RPG_Stun_Cr;                                          // 0x1774(0x0004)
	struct FName                                       Hit_RPG_Stun_Pr;                                          // 0x1778(0x0004)
	struct FName                                       Meele_Rifle_Fail;                                         // 0x177C(0x0004)
	struct FName                                       Meele_Rifle_Cr_Fail;                                      // 0x1780(0x0004)
	struct FName                                       Meele_Rifle_Pr_Fail;                                      // 0x1784(0x0004)
	struct FName                                       Meele_Knife_Fail;                                         // 0x1788(0x0004)
	struct FName                                       Meele_Knife_Cr_Fail;                                      // 0x178C(0x0004)
	struct FName                                       Meele_Knife_Pr_Fail;                                      // 0x1790(0x0004)
	struct FName                                       Knife_Fire;                                               // 0x1794(0x0004)
	struct FName                                       Knife_Fire_Cr;                                            // 0x1798(0x0004)
	struct FName                                       Knife_Fire_Pr;                                            // 0x179C(0x0004)
	struct FName                                       Rifle_Crouch_BoltLeverAnim;                               // 0x17A0(0x0004)
	struct FName                                       Reload_Rifle_2nd_Anim;                                    // 0x17A4(0x0004)
	struct FName                                       Reload_Crouch_Rifle_Anim;                                 // 0x17A8(0x0004)
	struct FName                                       Reload_Crouch_Rifle_2nd_Anim;                             // 0x17AC(0x0004)
	struct FName                                       Reload_Prone_Rifle_2nd_Anim;                              // 0x17B0(0x0004)
	struct FName                                       Pistol_Reload_Rifle_2nd_Anim;                             // 0x17B4(0x0004)
	struct FName                                       Pistol_CrouchReload;                                      // 0x17B8(0x0004)
	struct FName                                       Pistol_CrouchReload_2nd;                                  // 0x17BC(0x0004)
	struct FName                                       Pistol_ProneReload_2nd;                                   // 0x17C0(0x0004)
	struct FName                                       Rpg_Reload_2nd_Anim;                                      // 0x17C4(0x0004)
	struct FName                                       Rpg_CrouchReload;                                         // 0x17C8(0x0004)
	struct FName                                       Rpg_CrouchReload_2nd;                                     // 0x17CC(0x0004)
	struct FName                                       Rpg_ProneReload_2nd;                                      // 0x17D0(0x0004)
	struct FName                                       Putdown_Crouch_Rifle_Anim;                                // 0x17D4(0x0004)
	struct FName                                       PutdownQuick_Crouch_Rifle_Anim;                           // 0x17D8(0x0004)
	struct FName                                       Pistol_CrouchPutdown;                                     // 0x17DC(0x0004)
	struct FName                                       Pistol_CrouchPutdownQuick;                                // 0x17E0(0x0004)
	struct FName                                       Frag_CrouchPutdown;                                       // 0x17E4(0x0004)
	struct FName                                       Frag_CrouchPutdownQuick;                                  // 0x17E8(0x0004)
	struct FName                                       Rpg_CrouchPutdown;                                        // 0x17EC(0x0004)
	struct FName                                       Rpg_CrouchPutdownQuick;                                   // 0x17F0(0x0004)
	struct FName                                       Select_Crouch_Rifle_Anim;                                 // 0x17F4(0x0004)
	struct FName                                       SelectNew_Crouch_Rifle_Anim;                              // 0x17F8(0x0004)
	struct FName                                       Pistol_CrouchSelect;                                      // 0x17FC(0x0004)
	struct FName                                       Frag_CrouchSelect;                                        // 0x1800(0x0004)
	struct FName                                       Rpg_CrouchSelect;                                         // 0x1804(0x0004)
	unsigned long                                      bEndProned : 1;                                           // 0x1808(0x0004)
	unsigned long                                      bEndCrouched : 1;                                         // 0x1808(0x0004)
	TArray<int>                                        wRequiredEquipment;                                       // 0x180C(0x000C) (Edit, NeedCtorLink)
	TArray<int>                                        wRequiredParts;                                           // 0x1818(0x000C) (NeedCtorLink)
	unsigned long                                      bAimed : 1;                                               // 0x1824(0x0004)
	unsigned long                                      bIsMeleeAttacking : 1;                                    // 0x1824(0x0004)
	struct FVector                                     GrenadeFireLocation;                                      // 0x1828(0x000C)
	struct FRotator                                    GrenadeFireRotation;                                      // 0x1834(0x000C)
	struct FVector                                     GrenadeExplodeLocation;                                   // 0x1840(0x000C)
	class UClass*                                      FPWeaponAttachmentClass;                                  // 0x184C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wPawn");
		return ptr;
	}


	void SkillInit(bool bQuickslotChange);
	void ClientSkillDeadPlayer();
	void AddAllyEffect();
	void reset_weapon();
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	void SetBurning(bool bBurn, class AwProjectile* proj);
	void GetWeaponAttachmentInfo(unsigned char* byFlashCount, unsigned char* byFiringMode);
	void SetWeaponQuickChange(bool bOn);
	void SetWeaponQuickReload(bool bOn);
	void SetWeaponQuickAimZoom(bool bOn);
	bool AddWeaponFillAmmoAndMagazine();
	bool AddWeaponMagazine();
	void SetRemoveWeaponSkill(class AwWeapon* W);
	void SetAddWeaponSkill(class AwWeapon* W, int iaWeaponID, int iPartsID);
	void RenderFPWeaponAttachment(class UCanvas* C);
	void MakeShellEffect_Rechamber();
	void MakeShellEffect();
	void ServerCallNoWeaponMessage(unsigned char bySlot);
	void AddNoWeaponChangeMessage(unsigned char bySlot);
	void HandlePickup(class APickup* pick);
	void PlayReload();
	void PlayRechamber();
	void PlayMelee(bool bMeleeKnifeOrButt);
	void PostRender2D(class UCanvas* C, float ScreenLocX, float ScreenLocY);
	int SpawnSupplyItem();
	int SpawnBlackbox();
	void SpawnMedals();
	void ClientSwitchToLastWeapon(unsigned char defuseSwitch);
	void SetSpecialState(unsigned char byState);
	void ServerQSlotChangeCheck();
	void ClientQSlotChangeCheck();
	void AddBaseInvenWeapon(class UwMatchUserInfo* kUser, int iPos);
	void SetSelectedQuickSlotInventory(class UwMatchUserInfo* kUser, bool bQuickslotChange);
	void AddWeaponByWeaponLimited(int iWeaponID, int iPartsID, const struct FBtrDouble& UniqueID);
	void SetInfiniteAmmoTutorial(bool bDeleteGranade, int iGranadeCount);
	void SetInfiniteAmmo(int ammoCount);
	void DoSortEquipedItems(class UwMatchUserInfo* kUserInfo);
	bool CheckWeaponBySubGameMode(class UwMatchUserInfo* kUser);
	void AddDefaultInventoryDOA(bool bQuickslotChange);
	void SetGrenadlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetFlameThrowerlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetMGlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetShotGunlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetPistolInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void AddDefaultInventory(bool bQuickslotChange);
	void RemoveInventoryByDamageType(TEnumAsByte<EeWeaponType> removeWeaponType);
	void RemoveAllInventory();
	void ChangeInventoryByQSlot();
	int GetSlotPosbySkillID(class UwMatchUserInfo* kUser, int iSkillID);
	int GetInvenSkillIDbyPos(class UwMatchUserInfo* kUser, int iPos);
	void AddBaseInvenSkill(class UwMatchUserInfo* kUser, int iPos);
	void SetSelectedQuickSlotSkills(class UwMatchUserInfo* kUser);
	void AddWeaponFromSkill(const struct FBtrDouble& iUniqueID, int iaWeaponID);
	void AddSkillByInventory(class UwMatchUserInfo* kUser);
	void AddDefaultSkills(bool bQuickslotChange);
	TEnumAsByte<EGibType> GetGibParts(int iCollisionPart);
	void SpawnGoreGiblet(int iIndex);
	void MakeGorePawn(int iPart);
	void EndCrouch(float HeightAdjust);
	void EndProne(float HeightAdjust);
	void SetParts(TEnumAsByte<EePlayerParts> iPartsIndex, class UMesh* resMesh, class UStaticMesh* resStaticMesh);
	class UMaterial* GetCamouflage(int iItemID, unsigned char byTeam);
