#pragma once

// Arctic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class XInterface.PropertyManagerBase
// 0x0004 (0x0030 - 0x002C)
class UPropertyManagerBase : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.PropertyManagerBase");
		return ptr;
	}

};


// Class XInterface.GUI
// 0x0028 (0x0054 - 0x002C)
class UGUI : public UObject
{
public:
	class UGUIController*                              Controller;                                               // 0x002C(0x0004) (NoExport)
	struct FPlane                                      SaveModulation;                                           // 0x0030(0x0010) (NoExport)
	float                                              SaveX;                                                    // 0x0040(0x0004) (NoExport)
	float                                              SaveY;                                                    // 0x0044(0x0004) (NoExport)
	struct FColor                                      SaveColor;                                                // 0x0048(0x0004) (NoExport)
	class UFont*                                       SaveFont;                                                 // 0x004C(0x0004) (NoExport)
	unsigned char                                      SaveStyle;                                                // 0x0050(0x0001) (NoExport)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0051(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUI");
		return ptr;
	}


	class UMaterial* GetModLogo(const struct FString& ModDir);
	struct FString GetModValue(const struct FString& ModDir, const struct FString& ModKey);
	void GetModList(TArray<struct FString>* ModDirs, TArray<struct FString>* ModTitles);
	void Profile(const struct FString& ProfileName);
	struct FString STATIC_JoinArray(TArray<struct FString> StringArray, const struct FString& Delim, bool bIgnoreBlanks);
	bool STATIC_IsDigit(const struct FString& Test, bool bAllowDecimal);
};


// Class XInterface.GUIComponent
// 0x0268 (0x02BC - 0x0054)
class UGUIComponent : public UGUI
{
public:
	TArray<struct FTimerData>                          Timers;                                                   // 0x0054(0x000C) (Const, NeedCtorLink)
	class UGUIPage*                                    PageOwner;                                                // 0x0060(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, NoExport, EditInline)
	class UGUIComponent*                               MenuOwner;                                                // 0x0064(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, NoExport, EditInline)
	class UGUIComponent*                               FocusInstead;                                             // 0x0068(0x0004) (Edit, ExportObject, NeedCtorLink, NoExport, EditInline)
	TEnumAsByte<EeMenuState>                           MenuState;                                                // 0x006C(0x0001) (Edit, NoExport)
	TEnumAsByte<EeMenuState>                           LastMenuState;                                            // 0x006D(0x0001) (Edit, EditConst, NoExport)
	TEnumAsByte<EeDropState>                           DropState;                                                // 0x006E(0x0001) (Edit, NoExport)
	TEnumAsByte<EeFontScale>                           FontScale;                                                // 0x006F(0x0001) (Edit)
	class UCanvas*                                     CurrentCanvas;                                            // 0x0070(0x0004)
	struct FString                                     IniOption;                                                // 0x0074(0x000C) (Edit, NeedCtorLink)
	struct FString                                     IniDefault;                                               // 0x0080(0x000C) (Edit, NeedCtorLink)
	struct FString                                     StyleName;                                                // 0x008C(0x000C) (Edit, NeedCtorLink)
	struct FString                                     Hint;                                                     // 0x0098(0x000C) (Edit, Localized, NeedCtorLink)
	class UGUILabel*                                   FriendlyLabel;                                            // 0x00A4(0x0004) (Edit, ExportObject, NeedCtorLink, NoExport, EditInline)
	float                                              WinTop;                                                   // 0x00A8(0x0004) (Edit)
	float                                              WinLeft;                                                  // 0x00AC(0x0004) (Edit)
	float                                              WinWidth;                                                 // 0x00B0(0x0004) (Edit)
	float                                              WinHeight;                                                // 0x00B4(0x0004) (Edit)
	unsigned long                                      bUseAWinPos : 1;                                          // 0x00B8(0x0004) (Edit)
	struct FFloatBox                                   AWinPos;                                                  // 0x00BC(0x0010) (Edit)
	struct FFloatBox                                   RWinPos;                                                  // 0x00CC(0x0010) (Edit)
	struct FFloatBox                                   AWinFrame;                                                // 0x00DC(0x0010) (Edit)
	float                                              RenderWeight;                                             // 0x00EC(0x0004) (Edit)
	int                                                MouseCursorIndex;                                         // 0x00F0(0x0004) (Edit)
	int                                                TabOrder;                                                 // 0x00F4(0x0004) (Edit)
	int                                                Tag;                                                      // 0x00F8(0x0004) (Edit)
	unsigned long                                      bDebugging : 1;                                           // 0x00FC(0x0004) (Edit)
	unsigned long                                      bTabStop : 1;                                             // 0x00FC(0x0004) (Edit)
	unsigned long                                      bFocusOnWatch : 1;                                        // 0x00FC(0x0004) (Edit)
	unsigned long                                      bBoundToParent : 1;                                       // 0x00FC(0x0004) (Edit)
	unsigned long                                      bScaleToParent : 1;                                       // 0x00FC(0x0004) (Edit)
	unsigned long                                      bHasFocus : 1;                                            // 0x00FC(0x0004) (Edit, NoExport)
	unsigned long                                      bVisible : 1;                                             // 0x00FC(0x0004) (Edit)
	unsigned long                                      bAcceptsInput : 1;                                        // 0x00FC(0x0004) (Edit)
	unsigned long                                      bCaptureTabs : 1;                                         // 0x00FC(0x0004) (Edit)
	unsigned long                                      bCaptureMouse : 1;                                        // 0x00FC(0x0004) (Edit)
	unsigned long                                      bNeverFocus : 1;                                          // 0x00FC(0x0004) (Edit)
	unsigned long                                      bRepeatClick : 1;                                         // 0x00FC(0x0004) (Edit)
	unsigned long                                      bRequireReleaseClick : 1;                                 // 0x00FC(0x0004) (Edit)
	unsigned long                                      bMouseOverSound : 1;                                      // 0x00FC(0x0004) (Edit)
	unsigned long                                      bDropSource : 1;                                          // 0x00FC(0x0004) (Edit)
	unsigned long                                      bDropTarget : 1;                                          // 0x00FC(0x0004) (Edit)
	unsigned long                                      bPendingFocus : 1;                                        // 0x00FC(0x0004) (Edit, NoExport)
	unsigned long                                      bInit : 1;                                                // 0x00FC(0x0004) (Edit)
	unsigned long                                      bNeverScale : 1;                                          // 0x00FC(0x0004) (Edit)
	unsigned long                                      bRequiresStyle : 1;                                       // 0x00FC(0x0004) (Const, NoExport)
	unsigned long                                      bPositioned : 1;                                          // 0x00FC(0x0004) (Edit, Const, EditConst, NoExport)
	unsigned long                                      bAnimating : 1;                                           // 0x00FC(0x0004) (Edit, EditConst, NoExport)
	unsigned long                                      bTravelling : 1;                                          // 0x00FC(0x0004) (Edit, Const, EditConst, NoExport)
	unsigned long                                      bSizing : 1;                                              // 0x00FC(0x0004) (Edit, Const, EditConst, NoExport)
	TArray<struct FVector>                             MotionFrame;                                              // 0x0100(0x000C) (Edit, Const, EditConst, NeedCtorLink, NoExport)
	TArray<struct FVector>                             SizeFrame;                                                // 0x010C(0x000C) (Edit, Const, EditConst, NeedCtorLink, NoExport)
	float                                              Bounds[0x4];                                              // 0x0118(0x0004) (Edit, Const, EditConst, NoExport)
	float                                              ClientBounds[0x4];                                        // 0x0128(0x0004) (Edit, Const, EditConst, NoExport)
	unsigned long                                      bTimerRepeat : 1;                                         // 0x0138(0x0004) (Edit)
	int                                                TimerIndex;                                               // 0x013C(0x0004) (Edit, Const, EditConst, NoExport)
	float                                              TimerCountdown;                                           // 0x0140(0x0004) (Edit)
	float                                              TimerInterval;                                            // 0x0144(0x0004) (Edit)
	float                                              MouseOffset[0x4];                                         // 0x0148(0x0004) (Const, NoExport)
	class UGUIContextMenu*                             ContextMenu;                                              // 0x0158(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, EditInline)
	class UGUIToolTip*                                 ToolTip;                                                  // 0x015C(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, EditInline)
	struct FColor                                      WhiteColor;                                               // 0x0160(0x0004) (Const, NoExport)
	class UGUIStyles*                                  Style;                                                    // 0x0164(0x0004) (Edit, ExportObject, NeedCtorLink, NoExport, EditInline)
	TEnumAsByte<EClickSound>                           OnClickSound;                                             // 0x0168(0x0001) (Edit)
	TEnumAsByte<EParentScaleType>                      BoundingType;                                             // 0x0169(0x0001) (Edit)
	TEnumAsByte<EParentScaleType>                      ScalingType;                                              // 0x016A(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x1];                                       // 0x016B(0x0001) MISSED OFFSET
	unsigned long                                      bStandardized : 1;                                        // 0x016C(0x0004) (Edit)
	float                                              StandardHeight;                                           // 0x0170(0x0004) (Edit)
	unsigned long                                      bFlicker : 1;                                             // 0x0174(0x0004)
	int                                                PreDrawCount;                                             // 0x0178(0x0004) (Const, EditConst, NoExport)
	int                                                DrawCount;                                                // 0x017C(0x0004) (Const, EditConst, NoExport)
	int                                                OnRenderCount;                                            // 0x0180(0x0004) (EditConst, NoExport)
	int                                                OnRenderedCount;                                          // 0x0184(0x0004) (EditConst, NoExport)
	int                                                OnPreDrawCount;                                           // 0x0188(0x0004) (EditConst, NoExport)
	int                                                OnDrawCount;                                              // 0x018C(0x0004) (EditConst, NoExport)
	unsigned long                                      bIsDisableHover : 1;                                      // 0x0190(0x0004)
	unsigned long                                      bAlwaysFocus : 1;                                         // 0x0190(0x0004)
	struct FScriptDelegate                             __OnArrival__Delegate;                                    // 0x0194(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnEndAnimation__Delegate;                               // 0x019C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnPreDraw__Delegate;                                    // 0x01A4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDraw__Delegate;                                       // 0x01AC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRender__Delegate;                                     // 0x01B4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRendered__Delegate;                                   // 0x01BC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnActivate__Delegate;                                   // 0x01C4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDeActivate__Delegate;                                 // 0x01CC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnWatch__Delegate;                                      // 0x01D4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnHitTest__Delegate;                                    // 0x01DC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnMessage__Delegate;                                    // 0x01E4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnHide__Delegate;                                       // 0x01EC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnShow__Delegate;                                       // 0x01F4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnBeginTooltip__Delegate;                               // 0x01FC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnEndTooltip__Delegate;                                 // 0x0204(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnInvalidate__Delegate;                                 // 0x020C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnHover__Delegate;                                      // 0x0214(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnClick__Delegate;                                      // 0x021C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDblClick__Delegate;                                   // 0x0224(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnRightClick__Delegate;                                 // 0x022C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnMousePressed__Delegate;                               // 0x0234(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnMouseRelease__Delegate;                               // 0x023C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnTimer__Delegate;                                      // 0x0244(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnChange__Delegate;                                     // 0x024C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnKeyType__Delegate;                                    // 0x0254(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnKeyEvent__Delegate;                                   // 0x025C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDesignModeKeyEvent__Delegate;                         // 0x0264(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnCapturedMouseMove__Delegate;                          // 0x026C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnLoadINI__Delegate;                                    // 0x0274(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnSaveINI__Delegate;                                    // 0x027C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnMultiSelect__Delegate;                                // 0x0284(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnBeginDrag__Delegate;                                  // 0x028C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnEndDrag__Delegate;                                    // 0x0294(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragDrop__Delegate;                                   // 0x029C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragEnter__Delegate;                                  // 0x02A4(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragLeave__Delegate;                                  // 0x02AC(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragOver__Delegate;                                   // 0x02B4(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIComponent");
		return ptr;
	}


	class UCanvas* GetCurrentCanvas();
	void DebugTabOrder();
	void LevelChanged();
	void SetEnabled(bool Value);
	void DisableMe();
	void EnableMe();
	void SetFlicker(bool Value);
	void DisableComponent(class UGUIComponent* Comp);
	void EnableComponent(class UGUIComponent* Comp);
	void KillAnimation();
	void DAnimate(float NewLeft, float NewTop, float NewWidth, float NewHeight, float PositionTime, float DimensionTime);
	void Resize(float NewWidth, float NewHeight, float Time);
	void Animate(float NewLeft, float NewTop, float Time);
	void EndAnimation(class UGUIComponent* Animating, TEnumAsByte<EAnimationType> Type);
	void BeginAnimation(class UGUIComponent* Animating);
	class UGUIPage* OwnerPage();
	void DebugFocusPosition(class UGUIComponent* Who, bool Last);
	void DebugFocus(class UGUIComponent* Who, bool bLose);
	void SetTooltip(class UGUIToolTip* InTooltip);
	void SetToolTipText(const struct FString& NewToolTipText);
	void SetHint(const struct FString& NewHint);
	void SetFriendlyLabel(class UGUILabel* NewLabel);
	void SetFocusInstead(class UGUIComponent* InFocusComp);
	void Show();
	void Hide();
	void CenterMouse();
	void SetVisibility(bool bIsVisible);
	void FillOwner();
	bool PrevPage();
	bool NextPage();
	bool PrevControl(class UGUIComponent* Sender);
	bool NextControl(class UGUIComponent* Sender);
	bool FocusLast(class UGUIComponent* Sender);
	bool FocusFirst(class UGUIComponent* Sender);
	void LoseFocus(class UGUIComponent* Sender);
	void SetFocus(class UGUIComponent* Who);
	bool CanAcceptFocus();
	bool IsInClientBounds();
	bool IsInBounds();
	void TraversalApplyAWinPos();
	void ApplyAWinPos();
	class UGUIComponent* GetTopMenuOwner();
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void DropStateChange(TEnumAsByte<EeDropState> NewState);
	bool IsMultiSelect();
	void MenuStateChange(TEnumAsByte<EeMenuState> NewState);
	struct FString STATIC_MakeColorCode(const struct FColor& NewColor);
	struct FString STATIC_StripColorCodes(const struct FString& InString);
	void SaveINI(const struct FString& Value);
	struct FString LoadINI();
	void free();
	void Closed(class UGUIComponent* Sender, bool bCancelled);
	void Opened(class UGUIComponent* Sender);
	void Timer();
	struct FString AdditionalDebugString();
	bool SpecialHit(bool bForce);
	struct FString GetMenuPath();
	bool IsInIncompleteLetter(const struct FString& strUserName);
	int IsCorrectUserName_THAILAND(const struct FString& strUserName);
	int IsCorrectUserName_China(const struct FString& strUserName);
	int IsCorrectUserName(const struct FString& strUserName);
	void SetPosition(float NewLeft, float NewTop, float NewWidth, float NewHeight, bool bForceRelative);
	void ResolutionChanged(int ResX, int ResY);
	float RelativeHeight(float RealHeight, bool bForce);
	float RelativeWidth(float RealWidth, bool bForce);
	float RelativeTop(float RealTop, bool bForce);
	float RelativeLeft(float RealLeft, bool bForce);
	float ActualTop(float val, bool bForce);
	float ActualLeft(float val, bool bForce);
	float ActualHeight(float val, bool bForce);
	float ActualWidth(float val, bool bForce);
	void UpdateBounds();
	void UpdateOffset(float PosX, float PosY, float PosW, float PosH);
	void AutoPositionOn(TArray<class UGUIComponent*> Components, class UGUIComponent* frame, float LeftPadPerc, float UpperPadPerc, float RightPadPerc, float LowerPadPerc, int NumberOfColumns, float ColumnPadding);
	void AutoPosition(TArray<class UGUIComponent*> Components, float LeftBound, float UpperBound, float RightBound, float LowerBound, float LeftPad, float UpperPad, float RightPad, float LowerPad, int NumberOfColumns, float ColumnPadding);
	void KillTimer(const struct FName& TimerFunc);
	void SetTimer(float Interval, bool bRepeat, const struct FName& TimerFunc);
	class APlayerController* PlayerOwner();
	void OnDragOver(class UGUIComponent* Sender);
	void OnDragLeave(class UGUIComponent* Sender);
	void OnDragEnter(class UGUIComponent* Sender);
	bool OnDragDrop(class UGUIComponent* Sender);
	void OnEndDrag(class UGUIComponent* Sender, bool bAccepted);
	bool OnBeginDrag(class UGUIComponent* Sender);
	bool OnMultiSelect(class UGUIComponent* Sender);
	struct FString OnSaveINI(class UGUIComponent* Sender);
	void OnLoadINI(class UGUIComponent* Sender, const struct FString& S);
	bool OnCapturedMouseMove(float deltaX, float deltaY);
	bool OnDesignModeKeyEvent(TEnumAsByte<EInputKey> key, TEnumAsByte<EInputAction> State);
	bool OnKeyEvent(float Delta, unsigned char* key, unsigned char* State);
	bool OnKeyType(const struct FString& Unicode, unsigned char* key);
	void OnChange(class UGUIComponent* Sender);
	void OnTimer(class UGUIComponent* Sender);
	void OnMouseRelease(class UGUIComponent* Sender);
	void OnMousePressed(class UGUIComponent* Sender, bool bRepeat);
	bool OnRightClick(class UGUIComponent* Sender);
	bool OnDblClick(class UGUIComponent* Sender);
	bool OnClick(class UGUIComponent* Sender);
	bool OnHover(class UGUIComponent* Sender);
	void OnInvalidate(class UGUIComponent* Who);
	bool OnEndTooltip();
	class UGUIToolTip* OnBeginTooltip();
	void OnShow();
	void OnHide();
	void OnMessage(const struct FString& Msg, float MsgLife);
	void OnHitTest(float MouseX, float MouseY);
	void OnWatch();
	void OnDeActivate();
	void OnActivate();
	void OnRendered(class UCanvas* Canvas);
	void OnRender(class UCanvas* Canvas);
	bool OnDraw(class UCanvas* Canvas);
	bool OnPreDraw(class UCanvas* Canvas);
	void OnEndAnimation(class UGUIComponent* Sender, TEnumAsByte<EAnimationType> Type);
	void OnArrival(class UGUIComponent* Sender, TEnumAsByte<EAnimationType> Type);
};


// Class XInterface.GUIMultiComponent
// 0x0044 (0x0300 - 0x02BC)
class UGUIMultiComponent : public UGUIComponent
{
public:
	TArray<class UGUIComponent*>                       Controls;                                                 // 0x02BC(0x000C) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding)
	class UGUIComponent*                               FocusedControl;                                           // 0x02C8(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, NoExport, EditInline)
	TArray<class UGUIComponent*>                       Components;                                               // 0x02CC(0x000C) (Edit, EditFixedSize, NeedCtorLink, NoExport)
	int                                                AnimationCount;                                           // 0x02D8(0x0004) (Edit, EditConst, NoExport)
	unsigned long                                      PropagateVisibility : 1;                                  // 0x02DC(0x0004) (Edit)
	unsigned long                                      bOldStyleMenus : 1;                                       // 0x02DC(0x0004) (Edit)
	unsigned long                                      bDrawFocusedLast : 1;                                     // 0x02DC(0x0004) (Edit)
	unsigned long                                      bAlwaysAutomate : 1;                                      // 0x02DC(0x0004) (Edit)
	struct FScriptDelegate                             __HandleContextMenuOpen__Delegate;                        // 0x02E0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __HandleContextMenuClose__Delegate;                       // 0x02E8(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __NotifyContextSelect__Delegate;                          // 0x02F0(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnCreateComponent__Delegate;                            // 0x02F8(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIMultiComponent");
		return ptr;
	}


	bool RecursiveActiveOwner(class UGUIComponent* checkComponent);
	void TraversalApplyAWinPos();
	class UGUIComponent* NewComponent(class UGUIComponent* newcompo, const struct FFloatBox& fbNewCompo, float RenderWeight, class UGUIMultiComponent* ParentComponent);
	void CheckDuplicateTabOrder();
	void CheckInvalidTabOrder();
	void DebugTabOrder();
	void CenterMouse();
	void LevelChanged();
	void EndAnimation(class UGUIComponent* Animating, TEnumAsByte<EAnimationType> Type);
	void BeginAnimation(class UGUIComponent* Animating);
	void free();
	void Closed(class UGUIComponent* Sender, bool bCancelled);
	void Opened(class UGUIComponent* Sender);
	void SetVisibility(bool bIsVisible);
	void DisableMe();
	void EnableMe();
	bool PrevControl(class UGUIComponent* Sender);
	bool NextControl(class UGUIComponent* Sender);
	bool FocusLast(class UGUIComponent* Sender);
	bool FocusFirst(class UGUIComponent* Sender);
	bool CanAcceptFocus();
	void LoseFocus(class UGUIComponent* Sender);
	void SetFocus(class UGUIComponent* Who);
	void SetFocusInstead(class UGUIComponent* InFocusComp);
	bool RemoveComponent(class UGUIComponent* Comp, bool SkipRemap);
	class UGUIComponent* AppendComponent(class UGUIComponent* NewComp, bool SkipRemap);
	class UGUIComponent* InsertComponent(class UGUIComponent* NewComp, int Index, bool SkipRemap);
	class UGUIComponent* AddComponent(const struct FString& ComponentClass, bool SkipRemap);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void InternalOnShow();
	int FindComponentIndex(class UGUIComponent* Who);
	void RemapComponents();
	void InitializeControls();
	void OnCreateComponent(class UGUIComponent* NewComponent, class UGUIComponent* Sender);
	bool NotifyContextSelect(class UGUIContextMenu* Sender, int ClickIndex);
	bool HandleContextMenuClose(class UGUIContextMenu* Sender);
	bool HandleContextMenuOpen(class UGUIComponent* Sender, class UGUIContextMenu* Menu, class UGUIComponent* ContextMenuOwner);
};


// Class XInterface.GUIStyles
// 0x01FC (0x0250 - 0x0054)
class UGUIStyles : public UGUI
{
public:
	struct FString                                     KeyName;                                                  // 0x0054(0x000C) (Edit, Const, NeedCtorLink)
	struct FString                                     AlternateKeyName[0x2];                                    // 0x0060(0x000C) (Edit, Const, NeedCtorLink)
	struct FString                                     FontNames[0xF];                                           // 0x0078(0x000C) (Edit, NeedCtorLink, NoExport)
	class UGUIFont*                                    Fonts[0xF];                                               // 0x012C(0x0004) (Edit, ExportObject, NeedCtorLink, NoExport, EditInline)
	int                                                FontSizes[0x5];                                           // 0x0168(0x0004) (Edit, NoExport)
	struct FColor                                      FontColors[0x5];                                          // 0x017C(0x0004) (Edit, NoExport)
	struct FColor                                      FontBKColors[0x5];                                        // 0x0190(0x0004) (Edit, NoExport)
	struct FColor                                      FontShadowColor[0x5];                                     // 0x01A4(0x0004) (Edit, NoExport)
	int                                                FontShadowOffset[0x5];                                    // 0x01B8(0x0004) (Edit, NoExport)
	struct FColor                                      ImgColors[0x5];                                           // 0x01CC(0x0004) (Edit, NoExport)
	TEnumAsByte<EMenuRenderStyle>                      RStyles[0x5];                                             // 0x01E0(0x0001) (Edit, NoExport)
	unsigned char                                      UnknownData00[0x3];                                       // 0x01E5(0x0003) MISSED OFFSET
	class UMaterial*                                   Images[0x5];                                              // 0x01E8(0x0004) (Edit, NoExport)
	TEnumAsByte<EeImgStyle>                            ImgStyle[0x5];                                            // 0x01FC(0x0001) (Edit, NoExport)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0201(0x0003) MISSED OFFSET
	float                                              ImgWidths[0x5];                                           // 0x0204(0x0004) (Edit, NoExport)
	float                                              ImgHeights[0x5];                                          // 0x0218(0x0004) (Edit, NoExport)
	int                                                BorderOffsets[0x4];                                       // 0x022C(0x0004) (Edit, NoExport)
	unsigned long                                      bTemporary : 1;                                           // 0x023C(0x0004) (Edit, NoExport)
	struct FScriptDelegate                             __OnDraw__Delegate;                                       // 0x0240(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnDrawText__Delegate;                                   // 0x0248(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIStyles");
		return ptr;
	}


	void Initialize();
	void btrDrawTextStyles(class UCanvas* Canvas, TEnumAsByte<EeMenuState> MenuState, float Left, float Top, float width, float Height, TEnumAsByte<EeTextAlign> Align, const struct FString& Text, TEnumAsByte<EeFontScale> FontScale, int FontSize, float R, float G, float B, float A);
	void btrTextSizeStyles(class UCanvas* Canvas, TEnumAsByte<EeMenuState> MenuState, const struct FString& Text, TEnumAsByte<EeFontScale> FontScale, int FontSize, float* XL, float* YL);
	void STATIC_TextSize(class UCanvas* Canvas, TEnumAsByte<EeMenuState> MenuState, const struct FString& Text, TEnumAsByte<EeFontScale> FontScale, float* XL, float* YL);
	void STATIC_DrawText(class UCanvas* Canvas, TEnumAsByte<EeMenuState> MenuState, float Left, float Top, float width, float Height, TEnumAsByte<EeTextAlign> Align, const struct FString& Text, TEnumAsByte<EeFontScale> FontScale);
	void STATIC_Draw(class UCanvas* Canvas, TEnumAsByte<EeMenuState> MenuState, float Left, float Top, float width, float Height);
	bool OnDrawText(class UCanvas* Canvas, TEnumAsByte<EeMenuState> MenuState, float Left, float Top, float width, float Height, TEnumAsByte<EeTextAlign> Align, const struct FString& Text, TEnumAsByte<EeFontScale> FontScale);
	bool OnDraw(class UCanvas* Canvas, TEnumAsByte<EeMenuState> MenuState, float Left, float Top, float width, float Height);
};


// Class XInterface.GUIFont
// 0x0030 (0x0084 - 0x0054)
class UGUIFont : public UGUI
{
public:
	struct FString                                     KeyName;                                                  // 0x0054(0x000C) (Edit, NeedCtorLink)
	unsigned long                                      bFixedSize : 1;                                           // 0x0060(0x0004) (Edit)
	unsigned long                                      bScaled : 1;                                              // 0x0060(0x0004) (Edit)
	int                                                NormalXRes;                                               // 0x0064(0x0004) (Edit)
	int                                                FallBackRes;                                              // 0x0068(0x0004) (Edit)
	TArray<struct FString>                             FontArrayNames;                                           // 0x006C(0x000C) (Edit, NeedCtorLink)
	TArray<class UFont*>                               FontArrayFonts;                                           // 0x0078(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIFont");
		return ptr;
	}


	class UFont* LoadFont(int i);
	class UFont* STATIC_LoadFontStatic(int i);
	class UFont* GetFont(int XRes);
};


// Class XInterface.GUIController
// 0x03EC (0x045C - 0x0070)
class UGUIController : public UBaseGUIController
{
public:
	class UGUIPage*                                    SaveFadeOutPage;                                          // 0x0070(0x0004) (ExportObject, NeedCtorLink, EditInline)
	unsigned long                                      bSaveCancelled : 1;                                       // 0x0074(0x0004)
	class UBTTcpLink_Channel*                          TcpHandler;                                               // 0x0078(0x0004)
	int                                                FONT_NUM;                                                 // 0x007C(0x0004) (Const)
	int                                                STYLE_NUM;                                                // 0x0080(0x0004) (Const)
	int                                                CURSOR_NUM;                                               // 0x0084(0x0004) (Const)
	TArray<struct FProfileStruct>                      Profilers;                                                // 0x0088(0x000C) (NeedCtorLink)
	struct FFloatBox                                   MouseCursorBounds;                                        // 0x0094(0x0010) (Const)
	TArray<struct FVector>                             MouseCursorOffset;                                        // 0x00A4(0x000C) (NeedCtorLink, EditInline)
	TArray<class UGUIPage*>                            MenuStack;                                                // 0x00B0(0x000C) (ExportObject, NeedCtorLink, EditInline)
	TArray<class UGUIPage*>                            PersistentStack;                                          // 0x00BC(0x000C) (NeedCtorLink)
	TArray<class UGUIFont*>                            FontStack;                                                // 0x00C8(0x000C) (NeedCtorLink, EditInline)
	TArray<class UGUIStyles*>                          StyleStack;                                               // 0x00D4(0x000C) (NeedCtorLink)
	TArray<class UMaterial*>                           MouseCursors;                                             // 0x00E0(0x000C) (NeedCtorLink, EditInline)
	TArray<class UMaterial*>                           ImageList;                                                // 0x00EC(0x000C) (NeedCtorLink)
	TArray<struct FString>                             DefaultStyleNames;                                        // 0x00F8(0x000C) (NeedCtorLink)
	TArray<struct FString>                             StyleNames;                                               // 0x0104(0x000C) (NeedCtorLink)
	TArray<struct FAutoLoadMenu>                       AutoLoad;                                                 // 0x0110(0x000C) (NeedCtorLink)
	TArray<struct FRestoreMenuItem>                    RestoreMenus;                                             // 0x011C(0x000C) (NeedCtorLink)
	TArray<struct FDesignModeHint>                     DesignModeHints;                                          // 0x0128(0x000C) (NeedCtorLink)
	float                                              MenuMouseSens;                                            // 0x0134(0x0004)
	float                                              MouseX;                                                   // 0x0138(0x0004)
	float                                              MouseY;                                                   // 0x013C(0x0004)
	float                                              LastMouseX;                                               // 0x0140(0x0004)
	float                                              LastMouseY;                                               // 0x0144(0x0004)
	float                                              DblClickWindow;                                           // 0x0148(0x0004)
	float                                              LastClickTime;                                            // 0x014C(0x0004)
	float                                              ButtonRepeatDelay;                                        // 0x0150(0x0004)
	float                                              RepeatDelta;                                              // 0x0154(0x0004)
	float                                              RepeatTime;                                               // 0x0158(0x0004)
	float                                              CursorFade;                                               // 0x015C(0x0004)
	float                                              FastCursorFade;                                           // 0x0160(0x0004)
	int                                                MaxSimultaneousPings;                                     // 0x0164(0x0004)
	int                                                FastCursorStep;                                           // 0x0168(0x0004)
	int                                                ResX;                                                     // 0x016C(0x0004) (Const)
	int                                                ResY;                                                     // 0x0170(0x0004) (Const)
	int                                                LastClickX;                                               // 0x0174(0x0004)
	int                                                LastClickY;                                               // 0x0178(0x0004)
	int                                                CursorStep;                                               // 0x017C(0x0004)
	struct FPointer                                    Designer;                                                 // 0x0180(0x0004) (Const, Transient)
	struct FPointer                                    PawnDesigner;                                             // 0x0184(0x0004) (Const, Transient)
	struct FPointer                                    WeaponDesigner;                                           // 0x0188(0x0004) (Const, Transient)
	struct FString                                     MouseOverSound;                                           // 0x018C(0x000C) (NeedCtorLink)
	struct FString                                     ClickSound;                                               // 0x0198(0x000C) (NeedCtorLink)
	struct FString                                     EditSound;                                                // 0x01A4(0x000C) (NeedCtorLink)
	struct FString                                     UpSound;                                                  // 0x01B0(0x000C) (NeedCtorLink)
	struct FString                                     DownSound;                                                // 0x01BC(0x000C) (NeedCtorLink)
	struct FString                                     DragSound;                                                // 0x01C8(0x000C) (NeedCtorLink)
	struct FString                                     FadeSound;                                                // 0x01D4(0x000C) (NeedCtorLink)
	struct FString                                     ItemEquipSuccessSound;                                    // 0x01E0(0x000C) (NeedCtorLink)
	struct FString                                     ItemEquipFailSound;                                       // 0x01EC(0x000C) (NeedCtorLink)
	struct FString                                     ItemTakeoffSound;                                         // 0x01F8(0x000C) (NeedCtorLink)
	struct FString                                     ItemAddPartsSound;                                        // 0x0204(0x000C) (NeedCtorLink)
	struct FString                                     ItemRepairSound;                                          // 0x0210(0x000C) (NeedCtorLink)
	struct FString                                     ItemClickSound;                                           // 0x021C(0x000C) (NeedCtorLink)
	struct FString                                     ItemBuySound;                                             // 0x0228(0x000C) (NeedCtorLink)
	struct FString                                     ItemSellSound;                                            // 0x0234(0x000C) (NeedCtorLink)
	struct FString                                     TrophyWindowSound;                                        // 0x0240(0x000C) (NeedCtorLink)
	struct FString                                     TrophyReceiverUserSound;                                  // 0x024C(0x000C) (NeedCtorLink)
	class UGUIPage*                                    ActivePage;                                               // 0x0258(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIComponent*                               FocusedControl;                                           // 0x025C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIComponent*                               ActiveControl;                                            // 0x0260(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIComponent*                               SkipControl;                                              // 0x0264(0x0004) (ExportObject, NeedCtorLink, EditInline, Deprecated)
	class UGUIComponent*                               MoveControl;                                              // 0x0268(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIComponent*                               DropSource;                                               // 0x026C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIComponent*                               DropTarget;                                               // 0x0270(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIContextMenu*                             ContextMenu;                                              // 0x0274(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIToolTip*                                 MouseOver;                                                // 0x0278(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UMaterial*                                   WhiteBorder;                                              // 0x027C(0x0004)
	struct FString                                     GameResolution;                                           // 0x0280(0x000C) (NeedCtorLink)
	struct FString                                     LastGameType;                                             // 0x028C(0x000C) (Transient, NeedCtorLink)
	struct FString                                     RequestDataMenu;                                          // 0x0298(0x000C) (NeedCtorLink)
	struct FString                                     ArrayPropertyMenu;                                        // 0x02A4(0x000C) (NeedCtorLink)
	struct FString                                     DynArrayPropertyMenu;                                     // 0x02B0(0x000C) (NeedCtorLink)
	struct FString                                     FilterMenu;                                               // 0x02BC(0x000C) (NeedCtorLink)
	struct FString                                     MapVotingMenu;                                            // 0x02C8(0x000C) (NeedCtorLink)
	struct FString                                     KickVotingMenu;                                           // 0x02D4(0x000C) (NeedCtorLink)
	struct FString                                     MatchSetupMenu;                                           // 0x02E0(0x000C) (NeedCtorLink)
	struct FString                                     EditFavoriteMenu;                                         // 0x02EC(0x000C) (NeedCtorLink)
	TArray<struct FString>                             MainMenuOptions;                                          // 0x02F8(0x000C) (NeedCtorLink)
	struct FString                                     DesignerMenu;                                             // 0x0304(0x000C) (NeedCtorLink)
	unsigned char                                      RepeatKey;                                                // 0x0310(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0311(0x0003) MISSED OFFSET
	unsigned long                                      bIgnoreNextRelease : 1;                                   // 0x0314(0x0004)
	unsigned long                                      ShiftPressed : 1;                                         // 0x0314(0x0004)
	unsigned long                                      AltPressed : 1;                                           // 0x0314(0x0004)
	unsigned long                                      CtrlPressed : 1;                                          // 0x0314(0x0004)
	unsigned long                                      bModulateStackedMenus : 1;                                // 0x0314(0x0004)
	unsigned long                                      bQuietMenu : 1;                                           // 0x0314(0x0004)
	unsigned long                                      bNoToolTips : 1;                                          // 0x0314(0x0004)
	unsigned long                                      bDesignModeToolTips : 1;                                  // 0x0314(0x0004)
	unsigned long                                      bAutoRefreshBrowser : 1;                                  // 0x0314(0x0004)
	unsigned long                                      bModAuthor : 1;                                           // 0x0314(0x0004)
	unsigned long                                      bExpertMode : 1;                                          // 0x0314(0x0004)
	unsigned long                                      bDesignMode : 1;                                          // 0x0314(0x0004)
	unsigned long                                      bInteractiveMode : 1;                                     // 0x0314(0x0004)
	unsigned long                                      bHighlightCurrent : 1;                                    // 0x0314(0x0004)
	unsigned long                                      bDrawFullPaths : 1;                                       // 0x0314(0x0004)
	unsigned long                                      MainNotWanted : 1;                                        // 0x0314(0x0004)
	unsigned long                                      bCurMenuInitialized : 1;                                  // 0x0314(0x0004)
	unsigned long                                      bForceMouseCheck : 1;                                     // 0x0314(0x0004)
	unsigned long                                      bIgnoreUntilPress : 1;                                    // 0x0314(0x0004)
	unsigned long                                      bSnapCursor : 1;                                          // 0x0314(0x0004)
	float                                              RenderDelta;                                              // 0x0318(0x0004)
	float                                              LastRenderTime;                                           // 0x031C(0x0004)
	unsigned long                                      bFixedMouseSize : 1;                                      // 0x0320(0x0004)
	unsigned char                                      KeyDown[0xFF];                                            // 0x0324(0x0001) (Const)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0423(0x0001) MISSED OFFSET
	TArray<class UClass*>                              RegisteredClasses;                                        // 0x0424(0x000C) (NeedCtorLink)
	unsigned long                                      bECEEdition : 1;                                          // 0x0430(0x0004)
	int                                                iTempWeaponId;                                            // 0x0434(0x0004)
	TArray<class UGUIPage*>                            SavedPage;                                                // 0x0438(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __OnNeedRawKeyPress__Delegate;                            // 0x0444(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __AddBuddy__Delegate;                                     // 0x044C(0x000C) (NeedCtorLink)
	struct FScriptDelegate                             __PressedCloseWndBtn__Delegate;                           // 0x0454(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIController");
		return ptr;
	}


	class UGUIQuestionPage* ShowQuestionDialog(const struct FString& Question, unsigned char Buttons, unsigned char defButton);
	bool KeyPressed(TEnumAsByte<EInputKey> iKey);
	bool SearchBinds(const struct FString& BindAliasMask, TArray<struct FString>* BindAliases);
	bool GetAssignedKeys(const struct FString& BindAlias, TArray<struct FString>* BindKeyNames, TArray<struct FString>* LocalizedBindKeyNames);
	bool GetCurrentBind(const struct FString& BindKeyName, struct FString* BindKeyValue);
	bool KeyNameFromIndex(unsigned char iKey, struct FString* KeyName, struct FString* LocalizedKeyName);
	bool SetKeyBind(const struct FString& BindKeyName, const struct FString& BindKeyValue);
	struct FString STATIC_GetQuitPage();
	struct FString STATIC_GetSettingsPage();
	struct FString STATIC_GetModPage();
	struct FString STATIC_GetInstantActionPage();
	struct FString STATIC_GetMultiplayerPage();
	struct FString STATIC_GetServerBrowserPage();
	struct FString STATIC_GetSinglePlayerPage();
	struct FString STATIC_GetMainMenuClass();
	void STATIC_Validate();
	void ConsolidateMenus();
	void PurgeComponentClasses();
	void PurgeObjectReferences();
	void VerifyStack();
	void CloseOverlays();
	void NotifyLevelChange();
	void SetRequiredGameResolution(const struct FString& GameRes);
	bool NeedsMenuResolution();
	bool CanShowHints();
	bool HasMouseMoved(float ErrorMargin);
	void MoveFocused(class UGUIComponent* C, int bmLeft, int bmTop, int bmWidth, int bmHeight, float ClipX, float ClipY, float val);
	void ResetFocus();
	void ChangeFocus(class UGUIComponent* Who);
	void SetControllerStatus(bool On);
	void PerformRestore();
	void SaveRestorePages();
	int Count();
	void CloseAll(bool bCancel, bool bForced);
	bool ClickCloseWndBtn();
	void PressedCloseWndBtn();
	bool CloseMenu(bool bCancelled);
	bool RemoveMenu(class UGUIPage* Menu, bool bCancelled);
	bool RemoveMenuAt(int Index, bool bCancelled);
	void PopMenu(int Index, class UGUIPage* CurMenu, bool bCancelled);
	void PushMenu(int Index, class UGUIPage* NewMenu, const struct FString& Param1, const struct FString& Param2);
	void ReplaceMenu2(const struct FString& NewMenuName, bool bCancelled);
	void ReplaceMenu2_FadedOut();
	void CloseMenuPage(class UGUIPage* SelectPage, bool bCancelled);
	bool ReplaceMenu(const struct FString& NewMenuName, const struct FString& Param1, const struct FString& Param2, bool bCancelled);
	void AutoLoadMenus();
	bool OpenMenuByObject(class UGUIPage* NewMenu, const struct FString& Param1, const struct FString& Param2);
	bool OpenMenu(const struct FString& NewMenuName, const struct FString& Param1, const struct FString& Param2);
	class UGUIPage* CreateMenu(const struct FString& NewMenuName);
	class UGUIPage* GetLastMenu();
	void LogControlInfo(class UGUIComponent* Sender);
	void LogControllerInfo();
	void LogMenuStack();
	class UGUIPage* GetMenuByIndex(int Index);
	class UGUIPage* FindMenuByClass(class UClass* PageClass);
	class UGUIPage* FindPersistentMenuByClass(class UClass* PageClass);
	int FindPersistentMenuIndex(class UGUIPage* Menu);
	int FindMenuIndex(class UGUIPage* Menu);
	int FindMenuIndexByName(const struct FString& MenuClass);
	class UGUIPage* FindPersistentMenuByName(const struct FString& MenuClass);
	class UClass* AddComponentClass(const struct FString& ClassName);
	bool RegisterStyle(class UClass* StyleClass, bool bTemporary);
	void PrecachePlayerRecords();
	void InitializeController();
	class UGUIPage* TopPage();
	void GetTeamSymbolList(bool bNoSinglePlayer, TArray<struct FString>* SymbolNames);
	struct FString LoadDecoText(const struct FString& PackageName, const struct FString& DecoTextName);
	bool CheckForECE();
	bool AuthroizeFirewall();
	bool CheckFirewall();
	void LaunchURL(const struct FString& URL);
	void GetMapList(const struct FString& Prefix, class UGUIList* List, bool bDecoText);
	void GetWeaponList(TArray<class UClass*>* WeaponClass, TArray<struct FString>* WeaponDesc);
	void SaveOwnageList(TArray<struct FeOwnageMap> Maps);
	void GetOwnageList(TArray<int>* RLevel, TArray<struct FString>* MNames, TArray<struct FString>* MDesc, TArray<struct FString>* mURL);
	bool GetDEMHeader(const struct FString& DemoName, struct FString* MapName, struct FString* GameType, int* ScoreLimit, int* TimeLimit, int* ClientSide, struct FString* RecordedBy, struct FString* TimeStamp, struct FString* ReqPackages);
	void GetDEMList(TArray<struct FString>* DEMFiles);
	void Profile(const struct FString& ProfileName);
	void SetMoveControl(class UGUIComponent* C);
	void PlayInterfaceSound(TEnumAsByte<EClickSound> soundType);
	void GetOGGList(TArray<struct FString>* OGGFiles);
	void ResetKeyboard();
	void GetProfileList(const struct FString& Prefix, TArray<struct FString>* ProfileList);
	void ResetInput();
	void ResetDesigner();
	bool SetRenderDevice(const struct FString& NewRenderDevice);
	struct FString GetCurrentRes();
	class UGUIStyles* GetStyle(const struct FString& StyleName, TEnumAsByte<EeFontScale>* FontScale);
	class UGUIFont* GetMenuFont(const struct FString& FontName);
	void AddBuddy(const struct FString& NewBuddyName);
	bool OnNeedRawKeyPress(unsigned char NewKey);
	void PopPage();
	void PushPage();
};


// Class XInterface.GUIButton
// 0x0038 (0x02F4 - 0x02BC)
class UGUIButton : public UGUIComponent
{
public:
	TEnumAsByte<EeTextAlign>                           CaptionAlign;                                             // 0x02BC(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02BD(0x0003) MISSED OFFSET
	class UGUIStyles*                                  CaptionEffectStyle;                                       // 0x02C0(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, EditInline)
	struct FString                                     CaptionEffectStyleName;                                   // 0x02C4(0x000C) (Edit, NeedCtorLink)
	struct FString                                     Caption;                                                  // 0x02D0(0x000C) (Edit, Localized, NeedCtorLink)
	struct FPaddingPercent                             AutoSizePadding;                                          // 0x02DC(0x0008) (Edit)
	struct FString                                     SizingCaption;                                            // 0x02E4(0x000C) (Edit, NeedCtorLink)
	unsigned long                                      bAutoSize : 1;                                            // 0x02F0(0x0004) (Edit)
	unsigned long                                      bAutoShrink : 1;                                          // 0x02F0(0x0004) (Edit)
	unsigned long                                      bWrapCaption : 1;                                         // 0x02F0(0x0004) (Edit)
	unsigned long                                      bUseCaptionHeight : 1;                                    // 0x02F0(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIButton");
		return ptr;
	}


	bool InternalOnKeyEvent(float Delta, unsigned char* key, unsigned char* State);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
};


// Class XInterface.StateButton
// 0x0018 (0x030C - 0x02F4)
class UStateButton : public UGUIButton
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x02F4(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.StateButton");
		return ptr;
	}

};


// Class XInterface.GUIToolTip
// 0x0078 (0x0334 - 0x02BC)
class UGUIToolTip : public UGUIComponent
{
public:
	unsigned long                                      bResetPosition : 1;                                       // 0x02BC(0x0004) (Edit)
	unsigned long                                      bTrackMouse : 1;                                          // 0x02BC(0x0004) (Edit)
	unsigned long                                      bMultiLine : 1;                                           // 0x02BC(0x0004) (Edit)
	unsigned long                                      bTrackInput : 1;                                          // 0x02BC(0x0004) (Edit)
	struct FString                                     Text;                                                     // 0x02C0(0x000C) (Edit, Const, NeedCtorLink)
	TArray<struct FString>                             Lines;                                                    // 0x02CC(0x000C) (Edit, Const, NeedCtorLink)
