#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : BTData
# >    File : Classes.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Classes
# ======================================================================================== #
*/

// Class BTData.BTNetPlayerData
class DLL_IMPORT UBTNetPlayerData : public UObject
{
public:

	// UScript Functions
	 struct FName              getNameData ( struct FString category, struct FString key, int iIndex );		// [ FUNC_Native ] BTData.BTNetPlayerData.getNameData
	 struct FString            getData ( struct FString category, struct FString key, int iIndex );		// [ FUNC_Native ] BTData.BTNetPlayerData.getData
	 bool                      LoadPlayerMoveParams (  );                        		// [ FUNC_Native ] BTData.BTNetPlayerData.LoadPlayerMoveParams
	 bool                      LoadPlayerAnimationData (  );                     		// [ FUNC_Native ] BTData.BTNetPlayerData.LoadPlayerAnimationData
	 bool                      LoadPlayerPartsData (  );                         		// [ FUNC_Native ] BTData.BTNetPlayerData.LoadPlayerPartsData

	// Public Imports
	UBTNetPlayerData(class UBTNetPlayerData const &);
	class UBTNetPlayerData &  operator=(class UBTNetPlayerData const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0000

// Class BTData.BTNetMapData
class DLL_IMPORT UBTNetMapData : public UObject
{
public:

	// UScript Functions
	 struct FString            getData ( struct FString category, struct FString key, int iIndex );		// [ FUNC_Native ] BTData.BTNetMapData.getData
	 bool                      LoadMapData (  );                                 		// [ FUNC_Native ] BTData.BTNetMapData.LoadMapData

	// Public Imports
	UBTNetMapData(class UBTNetMapData const &);
	class UBTNetMapData &  operator=(class UBTNetMapData const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0000

// Class BTData.BTNetGameData
class DLL_IMPORT UBTNetGameData : public UObject
{
public:
	class TArray< struct FBT_ItemShopInfo >            NetItemShopInfoList;                              		// 0x002C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_WeaponInfo >              NetWeaponInfoList;                                		// 0x0038 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_Skill >                   NetSkillInfoList;                                 		// 0x0044 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_PartsGroup >              NetPartsGroupList;                                		// 0x0050 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_Promotion >               NetPromotionList;                                 		// 0x005C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_ItemBox >                 NetItemBoxList;                                   		// 0x0068 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_LevelInfo >               NetLevelInfoList;                                 		// 0x0074 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_GameMapInfo >             NetGameMapInfoList;                               		// 0x0080 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FBT_PaintGroup >              NetPaintGroupList;                                		// 0x008C ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      ClearNetData (  );                                		//  BTData.BTNetGameData.ClearNetData
	 bool                      LoadModeDOAParams (  );                           		// [ FUNC_Native ] BTData.BTNetGameData.LoadModeDOAParams
	 bool                      LoadSupplyRandomTable (  );                       		// [ FUNC_Native ] BTData.BTNetGameData.LoadSupplyRandomTable
	 bool                      LoadClanLevelInfoParams (  );                     		// [ FUNC_Native ] BTData.BTNetGameData.LoadClanLevelInfoParams
	 bool                      LoadLevelInfoParams (  );                         		// [ FUNC_Native ] BTData.BTNetGameData.LoadLevelInfoParams
	 bool                      LoadItemBoxParams (  );                           		// [ FUNC_Native ] BTData.BTNetGameData.LoadItemBoxParams
	 bool                      LoadClanMarkParams (  );                          		// [ FUNC_Native ] BTData.BTNetGameData.LoadClanMarkParams
	 bool                      LoadDailyQuestParams (  );                        		// [ FUNC_Native ] BTData.BTNetGameData.LoadDailyQuestParams
	 bool                      LoadRandBoxParams (  );                           		// [ FUNC_Native ] BTData.BTNetGameData.LoadRandBoxParams
	 bool                      LoadQuestParams (  );                             		// [ FUNC_Native ] BTData.BTNetGameData.LoadQuestParams
	 bool                      LoadPaintGroupParams (  );                        		// [ FUNC_Native ] BTData.BTNetGameData.LoadPaintGroupParams
	 bool                      LoadPromotionParams (  );                         		// [ FUNC_Native ] BTData.BTNetGameData.LoadPromotionParams
	 bool                      LoadAddPartsGroupParams (  );                     		// [ FUNC_Native ] BTData.BTNetGameData.LoadAddPartsGroupParams
	 bool                      LoadSkillParams (  );                             		// [ FUNC_Native ] BTData.BTNetGameData.LoadSkillParams
	 bool                      LoadItemResourceParams (  );                      		// [ FUNC_Native ] BTData.BTNetGameData.LoadItemResourceParams
	 bool                      LoadItemParams (  );                              		// [ FUNC_Native ] BTData.BTNetGameData.LoadItemParams
	 bool                      LoadWeaponRecoilParams (  );                      		// [ FUNC_Native ] BTData.BTNetGameData.LoadWeaponRecoilParams
	 bool                      LoadWeaponParams (  );                            		// [ FUNC_Native ] BTData.BTNetGameData.LoadWeaponParams
	 bool                      LoadWeaponRes (  );                               		// [ FUNC_Native ] BTData.BTNetGameData.LoadWeaponRes
	 struct FString            getData ( struct FString category, struct FString key, int iIndex );		// [ FUNC_Native ] BTData.BTNetGameData.getData
	 bool                      LoadAllData (  );                                 		// [ FUNC_Native ] BTData.BTNetGameData.LoadAllData
	 bool                      LoadAddPaintGroupParams (  );                     		// [ FUNC_Native ] BTData.BTNetGameData.LoadAddPaintGroupParams

	// Public Imports
	UBTNetGameData(class UBTNetGameData const &);
	class UBTNetGameData &  operator=(class UBTNetGameData const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x006C

// Class BTData.BTNetExcelData
class DLL_IMPORT UBTNetExcelData : public UObject
{
public:

	// UScript Functions
	 struct FString            getData ( struct FString category, struct FString key, int iIndex );		// [ FUNC_Native ] BTData.BTNetExcelData.getData
	 bool                      LoadExcelData ( struct FString fileName, struct FString sheetName, int numHeadRows, int numHeadColumns, int nKeyColumnOrRow, int arrangeType );		// [ FUNC_Native ] BTData.BTNetExcelData.LoadExcelData

	// Public Imports
	UBTNetExcelData(class UBTNetExcelData const &);
	class UBTNetExcelData &  operator=(class UBTNetExcelData const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0000

#ifdef _MSC_VER
#pragma pack ( pop )
#endif

