#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : BTData
# >    File : Structs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Structs
# ======================================================================================== #
*/

// Struct BTData.BTNetGameData.BT_PaintGroup
class DLL_IMPORT FBT_PaintGroup
{
public:
	int                                                nPaintingID;                                      		// 0x0000 ( 0x0004
	struct FString                                     sPaintingGroupID;                                 		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                nPaintingNum;                                     		// 0x0010 ( 0x0004
	int                                                nPaintingItemID;                                  		// 0x0014 ( 0x0004
	int                                                nPointPrice;                                      		// 0x0018 ( 0x0004
	int                                                nCashPrice;                                       		// 0x001C ( 0x0004
	int                                                nRepairCost;                                      		// 0x0020 ( 0x0004
	int                                                nUIDuirability;                                   		// 0x0024 ( 0x0004

	// Public Imports
	FBT_PaintGroup(struct FBT_PaintGroup const &);
	FBT_PaintGroup(void);
	~FBT_PaintGroup(void);
	struct FBT_PaintGroup &  operator=(struct FBT_PaintGroup const &);
}; // Size: 0x0028

// Struct BTData.BTNetGameData.BT_ItemShop_PriceInfo
class DLL_IMPORT FBT_ItemShop_PriceInfo
{
public:
	int                                                nPeriodNum;                                       		// 0x0000 ( 0x0004
	int                                                nCashPrice;                                       		// 0x0004 ( 0x0004
	int                                                nPointPrice;                                      		// 0x0008 ( 0x0004

	// Public Imports
	struct FBT_ItemShop_PriceInfo &  operator=(struct FBT_ItemShop_PriceInfo const &);
}; // Size: 0x000C

// Struct BTData.BTNetGameData.BT_ItemShopInfo
class DLL_IMPORT FBT_ItemShopInfo
{
public:
	int                                                nItemID;                                          		// 0x0000 ( 0x0004
	struct FString                                     sDispNm;                                          		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                bEquipLimitUserLevel;                             		// 0x0010 ( 0x0004
	unsigned char                                      bEquipTeam;                                       		// 0x0014 ( 0x0001
	unsigned char                                      bEquipSlot;                                       		// 0x0015 ( 0x0001
	unsigned char                                      bOverlap;                                         		// 0x0016 ( 0x0001
	struct FString                                     sAddPartGreoupID;                                 		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              fOptVal1;                                         		// 0x0024 ( 0x0004
	float                                              fOptVal2;                                         		// 0x0028 ( 0x0004
	unsigned char                                      bCostType;                                        		// 0x002C ( 0x0001
	float                                              fRepairCost;                                      		// 0x0030 ( 0x0004
	int                                                nDurWeight;                                       		// 0x0034 ( 0x0004
	unsigned char                                      bShop;                                            		// 0x0038 ( 0x0001
	int                                                nSellStart;                                       		// 0x003C ( 0x0004
	int                                                nSellEnd;                                         		// 0x0040 ( 0x0004
	int                                                bIsSell;                                          		// 0x0044 ( 0x0004
	int                                                nSellPrice;                                       		// 0x0048 ( 0x0004
	struct FBT_ItemShop_PriceInfo                      PriceInfo[ 0x05 ];                                		// 0x004C ( 0x003C
	int                                                bIsAuction;                                       		// 0x0088 ( 0x0004
	int                                                nMaxPriceInAuction;                               		// 0x008C ( 0x0004
	unsigned char                                      bType;                                            		// 0x0090 ( 0x0001
	unsigned char                                      bGrade;                                           		// 0x0091 ( 0x0001

	// Public Imports
	FBT_ItemShopInfo(struct FBT_ItemShopInfo const &);
	FBT_ItemShopInfo(void);
	~FBT_ItemShopInfo(void);
	struct FBT_ItemShopInfo &  operator=(struct FBT_ItemShopInfo const &);
}; // Size: 0x0094

// Struct BTData.BTNetGameData.BT_WeaponInfo
class DLL_IMPORT FBT_WeaponInfo
{
public:
	int                                                nItemID;                                          		// 0x0000 ( 0x0004
	unsigned char                                      bFireMode;                                        		// 0x0004 ( 0x0001
	unsigned char                                      bWeaponShortcut;                                  		// 0x0005 ( 0x0001
	unsigned char                                      bDamageType;                                      		// 0x0006 ( 0x0001
	unsigned char                                      bAimFire;                                         		// 0x0007 ( 0x0001
	float                                              fFireRate;                                        		// 0x0008 ( 0x0004
	float                                              fFireDelay;                                       		// 0x000C ( 0x0004
	float                                              fMeleeDelay;                                      		// 0x0010 ( 0x0004
	float                                              fZoom1;                                           		// 0x0014 ( 0x0004
	float                                              fZoom2;                                           		// 0x0018 ( 0x0004
	unsigned char                                      bBulletType;                                      		// 0x001C ( 0x0001
	int                                                wBulletCount;                                     		// 0x0020 ( 0x0004
	float                                              fProjectileSpeed;                                 		// 0x0024 ( 0x0004
	unsigned char                                      bBulletImpactExplode;                             		// 0x0028 ( 0x0001
	unsigned char                                      bProjectileTakeDamage;                            		// 0x0029 ( 0x0001
	float                                              fBulletBoundDecel;                                		// 0x002C ( 0x0004
	float                                              fBulletThrowRotate;                               		// 0x0030 ( 0x0004
	float                                              fBulletThreadAnglee;                              		// 0x0034 ( 0x0004
	int                                                nBombingWeaponID;                                 		// 0x0038 ( 0x0004
	float                                              fFuseTime;                                        		// 0x003C ( 0x0004
	float                                              fActiveTime;                                      		// 0x0040 ( 0x0004
	float                                              fMomentum;                                        		// 0x0044 ( 0x0004
	float                                              fMomentumChar;                                    		// 0x0048 ( 0x0004
	float                                              fGoreDamageOuter;                                 		// 0x004C ( 0x0004
	float                                              fGoreDamage;                                      		// 0x0050 ( 0x0004
	float                                              fDamageOuter;                                     		// 0x0054 ( 0x0004
	float                                              fDamage;                                          		// 0x0058 ( 0x0004
	float                                              fDamageEffectiveRange;                            		// 0x005C ( 0x0004
	float                                              fDamageOuterRange;                                		// 0x0060 ( 0x0004
	float                                              fPartsDamageHead;                                 		// 0x0064 ( 0x0004
	float                                              fPartsDamageUpperTorso;                           		// 0x0068 ( 0x0004
	float                                              fPartsDamageUpperArm;                             		// 0x006C ( 0x0004
	float                                              fPartsDamageLowerArm;                             		// 0x0070 ( 0x0004
	float                                              fPartsDamageUpperLeg;                             		// 0x0074 ( 0x0004
	float                                              fPartsDamageLowerLeg;                             		// 0x0078 ( 0x0004
	unsigned char                                      bHitEffectFriendly;                               		// 0x007C ( 0x0001
	float                                              fHitGunKick;                                      		// 0x0080 ( 0x0004
	float                                              fHitViewFlashTime;                                		// 0x0084 ( 0x0004
	float                                              fHitFireTime;                                     		// 0x0088 ( 0x0004
	float                                              fMeleeDamage;                                     		// 0x008C ( 0x0004
	unsigned char                                      bReloadType;                                      		// 0x0090 ( 0x0001
	unsigned char                                      bRechamber;                                       		// 0x0091 ( 0x0001
	float                                              fAniTimeRechamber;                                		// 0x0094 ( 0x0004
	float                                              fAniTimeReload;                                   		// 0x0098 ( 0x0004
	float                                              fAniTimeReloadEmpty;                              		// 0x009C ( 0x0004
	float                                              fAniTimeReloadStart;                              		// 0x00A0 ( 0x0004
	float                                              fAniTimeReloadEnd;                                		// 0x00A4 ( 0x0004
	float                                              fExplosionInnerRadius;                            		// 0x00A8 ( 0x0004
	float                                              fExplosionOuterRadius;                            		// 0x00AC ( 0x0004
	float                                              fExplosionRumbleRadius;                           		// 0x00B0 ( 0x0004
	float                                              fExplosionInnerDamage;                            		// 0x00B4 ( 0x0004
	float                                              fExplosionOuterDamage;                            		// 0x00B8 ( 0x0004
	int                                                nStartAmmo;                                       		// 0x00BC ( 0x0004
	int                                                nClipSize;                                        		// 0x00C0 ( 0x0004
	int                                                nReloadAmmo;                                      		// 0x00C4 ( 0x0004
	int                                                nMaxAmmo;                                         		// 0x00C8 ( 0x0004
	float                                              fSpreadStandMin;                                  		// 0x00CC ( 0x0004
	float                                              fSpreadStandMax;                                  		// 0x00D0 ( 0x0004
	float                                              fSpreadDuckedMin;                                 		// 0x00D4 ( 0x0004
	float                                              fSpreadDuckedMax;                                 		// 0x00D8 ( 0x0004
	float                                              fSpreadProneMin;                                  		// 0x00DC ( 0x0004
	float                                              fSpreadProneMax;                                  		// 0x00E0 ( 0x0004
	float                                              fSpreadMoveAdd;                                   		// 0x00E4 ( 0x0004
	float                                              fSpreadFireAdd;                                   		// 0x00E8 ( 0x0004
	float                                              fSpreadOutSpeed;                                  		// 0x00EC ( 0x0004
	float                                              fSpreadStandInRt;                                 		// 0x00F0 ( 0x0004
	float                                              fSpreadDuckedInRt;                                		// 0x00F4 ( 0x0004
	float                                              fSpreadProneInRt;                                 		// 0x00F8 ( 0x0004
	float                                              fViewKickHipXMin;                                 		// 0x00FC ( 0x0004
	float                                              fViewKickHipXMax;                                 		// 0x0100 ( 0x0004
	float                                              fViewKickHipYMin;                                 		// 0x0104 ( 0x0004
	float                                              fViewKickHipYMax;                                 		// 0x0108 ( 0x0004
	float                                              fViewKickHipAccel;                                		// 0x010C ( 0x0004
	float                                              fViewKickHipDecel;                                		// 0x0110 ( 0x0004
	float                                              fViewKickHipStayTime;                             		// 0x0114 ( 0x0004
	float                                              fViewKickHipDecaySpeed;                           		// 0x0118 ( 0x0004
	float                                              fViewKickAdsXMin;                                 		// 0x011C ( 0x0004
	float                                              fViewKickAdsXMax;                                 		// 0x0120 ( 0x0004
	float                                              fViewKickAdsYMin;                                 		// 0x0124 ( 0x0004
	float                                              fViewKickAdsYMax;                                 		// 0x0128 ( 0x0004
	float                                              fViewKickAdsAccel;                                		// 0x012C ( 0x0004
	float                                              fViewKickAdsDecel;                                		// 0x0130 ( 0x0004
	float                                              fViewKickAdsStayTime;                             		// 0x0134 ( 0x0004
	float                                              fViewKickAdsDecaySpeed;                           		// 0x0138 ( 0x0004
	float                                              fBreathStandGun;                                  		// 0x013C ( 0x0004
	float                                              fBreathStandGunSpeed;                             		// 0x0140 ( 0x0004
	float                                              fBobSprintGun;                                    		// 0x0144 ( 0x0004
	float                                              fBobSprintView;                                   		// 0x0148 ( 0x0004
	float                                              fBreathAdsGunAim;                                 		// 0x014C ( 0x0004
	float                                              fBreathAdsGunAimSpeed;                            		// 0x0150 ( 0x0004
	float                                              fBreathAdsDuckedGunAim;                           		// 0x0154 ( 0x0004
	float                                              fBreathAdsDuckedGunAimSpeed;                      		// 0x0158 ( 0x0004
	float                                              fBreathAdsProneGunAim;                            		// 0x015C ( 0x0004
	float                                              fBreathAdsProneGunAimSpeed;                       		// 0x0160 ( 0x0004
	float                                              fBobAdsMoveGunAim;                                		// 0x0164 ( 0x0004
	float                                              fBobAdsMoveView;                                  		// 0x0168 ( 0x0004
	float                                              fBobHipMoveGun;                                   		// 0x016C ( 0x0004
	float                                              fBobHipMoveView;                                  		// 0x0170 ( 0x0004
	float                                              fBobHipDuckedMoveGun;                             		// 0x0174 ( 0x0004
	float                                              fBobHipDuckedMoveView;                            		// 0x0178 ( 0x0004
	float                                              fBobHipProneMoveView;                             		// 0x017C ( 0x0004
	float                                              fWpSprintStaStat;                                 		// 0x0180 ( 0x0004
	float                                              fWpSprintMove;                                    		// 0x0184 ( 0x0004
	float                                              fWpStandMove;                                     		// 0x0188 ( 0x0004
	float                                              fWpCrouchMove;                                    		// 0x018C ( 0x0004
	float                                              fWpProneMove;                                     		// 0x0190 ( 0x0004
	float                                              fWpAimMove;                                       		// 0x0194 ( 0x0004
	float                                              fWpCrouchAimMove;                                 		// 0x0198 ( 0x0004
	float                                              fAniRateDrop;                                     		// 0x019C ( 0x0004
	float                                              fAniRateRaise;                                    		// 0x01A0 ( 0x0004
	float                                              fAniRateSprintRaise;                              		// 0x01A4 ( 0x0004
	float                                              fAniRateAdsOn;                                    		// 0x01A8 ( 0x0004
	float                                              fAniRateAdsOff;                                   		// 0x01AC ( 0x0004
	float                                              fSwayGunHipXMaxAngle;                             		// 0x01B0 ( 0x0004
	float                                              fSwayGunHiipXMoveAngle;                           		// 0x01B4 ( 0x0004
	float                                              fSwayGunHipXMove;                                 		// 0x01B8 ( 0x0004
	float                                              fSwayGunHipYMaxAngle;                             		// 0x01BC ( 0x0004
	float                                              fSwayGunHipYMoveAngle;                            		// 0x01C0 ( 0x0004
	float                                              fSwayGunHipYMove;                                 		// 0x01C4 ( 0x0004
	float                                              fSwayGunAdsXMaxAngle;                             		// 0x01C8 ( 0x0004
	float                                              fSwayGunAdsXMoveAngle;                            		// 0x01CC ( 0x0004
	float                                              fSwayGunAdsXMove;                                 		// 0x01D0 ( 0x0004
	float                                              fSwayGunAdsYMaxAngle;                             		// 0x01D4 ( 0x0004
	float                                              fSwayGunAdsYMoveAngle;                            		// 0x01D8 ( 0x0004
	float                                              fSwayGunAdsYMove;                                 		// 0x01DC ( 0x0004
	float                                              fViewAnglePitchMax;                               		// 0x01E0 ( 0x0004
	float                                              fGunPosHipMoveFrontY;                             		// 0x01E4 ( 0x0004
	float                                              fGunPosHipMoveFrontX;                             		// 0x01E8 ( 0x0004
	int                                                nUIDamage;                                        		// 0x01EC ( 0x0004
	int                                                nUISpread;                                        		// 0x01F0 ( 0x0004
	int                                                nUIViewKick;                                      		// 0x01F4 ( 0x0004
	int                                                nUIFireRate;                                      		// 0x01F8 ( 0x0004
	int                                                nUIMove;                                          		// 0x01FC ( 0x0004
	int                                                nUIRange;                                         		// 0x0200 ( 0x0004
	int                                                nProjectileMoveType;                              		// 0x0204 ( 0x0004
	float                                              fPartsDamageHeli;                                 		// 0x0208 ( 0x0004
	float                                              fSpreadJump;                                      		// 0x020C ( 0x0004
	float                                              fViewKickHipDecayTimeFast;                        		// 0x0210 ( 0x0004
	float                                              fViewKickAdsDecayTimeFast;                        		// 0x0214 ( 0x0004

	// Public Imports
	struct FBT_WeaponInfo &  operator=(struct FBT_WeaponInfo const &);
}; // Size: 0x0218

// Struct BTData.BTNetGameData.BT_Skill
class DLL_IMPORT FBT_Skill
{
public:
	int                                                mSkillID;                                         		// 0x0000 ( 0x0004
	struct FString                                     mSkillName;                                       		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	unsigned char                                      mSKillSection;                                    		// 0x0010 ( 0x0001
	unsigned char                                      mSkillType;                                       		// 0x0011 ( 0x0001
	int                                                mPrecedingSkillID;                                		// 0x0014 ( 0x0004

	// Public Imports
	FBT_Skill(struct FBT_Skill const &);
	FBT_Skill(void);
	~FBT_Skill(void);
	struct FBT_Skill &  operator=(struct FBT_Skill const &);
}; // Size: 0x0018

// Struct BTData.BTNetGameData.BT_PartsGroup
class DLL_IMPORT FBT_PartsGroup
{
public:
	int                                                nPartID;                                          		// 0x0000 ( 0x0004
	struct FString                                     sPartGroupID;                                     		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     sPartName;                                        		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                nDispNum;                                         		// 0x001C ( 0x0004
	int                                                nSSID;                                            		// 0x0020 ( 0x0004
	int                                                nSilencerID;                                      		// 0x0024 ( 0x0004
	int                                                nCamoID;                                          		// 0x0028 ( 0x0004
	int                                                nPaintID;                                         		// 0x002C ( 0x0004
	float                                              fSightAimDiffX;                                   		// 0x0030 ( 0x0004
	float                                              fSightAimDiffY;                                   		// 0x0034 ( 0x0004
	float                                              fSightAimDiffZ;                                   		// 0x0038 ( 0x0004
	float                                              fDurWeight;                                       		// 0x003C ( 0x0004
	int                                                nSkillID;                                         		// 0x0040 ( 0x0004
	int                                                nUIDamageRange;                                   		// 0x0044 ( 0x0004
	int                                                nUIFireSound;                                     		// 0x0048 ( 0x0004
	int                                                nUIDurability;                                    		// 0x004C ( 0x0004
	struct FString                                     sZoom1;                                           		// 0x0050 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     sZoom2;                                           		// 0x005C ( 0x000C[ CPF_NeedCtorLink ]

	// Public Imports
	FBT_PartsGroup(struct FBT_PartsGroup const &);
	FBT_PartsGroup(void);
	~FBT_PartsGroup(void);
	struct FBT_PartsGroup &  operator=(struct FBT_PartsGroup const &);
}; // Size: 0x0068

// Struct BTData.BTNetGameData.BT_Promotion
class DLL_IMPORT FBT_Promotion
{
public:
	int                                                nLevel;                                           		// 0x0000 ( 0x0004
	struct FString                                     sAcquieItem;                                      		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                nPartID;                                          		// 0x0010 ( 0x0004

	// Public Imports
	FBT_Promotion(struct FBT_Promotion const &);
	FBT_Promotion(void);
	~FBT_Promotion(void);
	struct FBT_Promotion &  operator=(struct FBT_Promotion const &);
}; // Size: 0x0014

// Struct BTData.BTNetGameData.BT_ItemBox
class DLL_IMPORT FBT_ItemBox
{
public:
	int                                                nItemBoxID;                                       		// 0x0000 ( 0x0004
	int                                                nItemCount;                                       		// 0x0004 ( 0x0004
	int                                                nItemID[ 0x14 ];                                  		// 0x0008 ( 0x0050
	int                                                nPartID[ 0x14 ];                                  		// 0x0058 ( 0x0050

	// Public Imports
	struct FBT_ItemBox &  operator=(struct FBT_ItemBox const &);
}; // Size: 0x00A8

// Struct BTData.BTNetGameData.BT_LevelInfo
class DLL_IMPORT FBT_LevelInfo
{
public:
	struct FString                                     sLevelName;                                       		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                nLevel;                                           		// 0x000C ( 0x0004
	int                                                nUpperExp;                                        		// 0x0010 ( 0x0004
	struct FString                                     sClassfy;                                         		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]

	// Public Imports
	FBT_LevelInfo(struct FBT_LevelInfo const &);
	FBT_LevelInfo(void);
	~FBT_LevelInfo(void);
	struct FBT_LevelInfo &  operator=(struct FBT_LevelInfo const &);
}; // Size: 0x0020

// Struct BTData.BTNetGameData.BT_GameMapInfo
class DLL_IMPORT FBT_GameMapInfo
{
public:
	int                                                nIdx;                                             		// 0x0000 ( 0x0004
	int                                                nMapID;                                           		// 0x0004 ( 0x0004
	struct FString                                     sMapNm;                                           		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              fSupHealth;                                       		// 0x0014 ( 0x0004
	float                                              fSupHeli;                                         		// 0x0018 ( 0x0004
	float                                              fSupBomb;                                         		// 0x001C ( 0x0004
	float                                              fSupUAV;                                          		// 0x0020 ( 0x0004
	int                                                nModFFA;                                          		// 0x0024 ( 0x0004
	int                                                nModFFAMax;                                       		// 0x0028 ( 0x0004
	int                                                nModTDM;                                          		// 0x002C ( 0x0004
	int                                                nModTDMMax;                                       		// 0x0030 ( 0x0004
	int                                                nModSD;                                           		// 0x0034 ( 0x0004
	int                                                nModSDMax;                                        		// 0x0038 ( 0x0004
	int                                                nModDOM;                                          		// 0x003C ( 0x0004
	int                                                nModDOMMax;                                       		// 0x0040 ( 0x0004
	int                                                nModSab;                                          		// 0x0044 ( 0x0004
	int                                                nModSabMax;                                       		// 0x0048 ( 0x0004

	// Public Imports
	FBT_GameMapInfo(struct FBT_GameMapInfo const &);
	FBT_GameMapInfo(void);
	~FBT_GameMapInfo(void);
	struct FBT_GameMapInfo &  operator=(struct FBT_GameMapInfo const &);
}; // Size: 0x004C

#ifdef _MSC_VER
#pragma pack ( pop )
#endif

