#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : GUI2K4
# >    File : Classes.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Classes
# ======================================================================================== #
*/

// Class GUI2K4.UT2K4GUIController
class DLL_IMPORT UUT2K4GUIController : public UGUIController
{
public:

	// UScript Functions
	 void                      PurgeComponentClasses (  );                       		//  GUI2K4.UT2K4GUIController.PurgeComponentClasses
	 class UClass*             AddComponentClass ( struct FString ClassName );   		//  GUI2K4.UT2K4GUIController.AddComponentClass
	 struct FString            GetQuitPage (  );                                 		// [ FUNC_Simulated ] GUI2K4.UT2K4GUIController.GetQuitPage
	 struct FString            GetSettingsPage (  );                             		// [ FUNC_Simulated ] GUI2K4.UT2K4GUIController.GetSettingsPage
	 struct FString            GetModPage (  );                                  		// [ FUNC_Simulated ] GUI2K4.UT2K4GUIController.GetModPage
	 struct FString            GetInstantActionPage (  );                        		// [ FUNC_Simulated ] GUI2K4.UT2K4GUIController.GetInstantActionPage
	 struct FString            GetMultiplayerPage (  );                          		// [ FUNC_Simulated ] GUI2K4.UT2K4GUIController.GetMultiplayerPage
	 struct FString            GetServerBrowserPage (  );                        		// [ FUNC_Simulated ] GUI2K4.UT2K4GUIController.GetServerBrowserPage
	 struct FString            GetSinglePlayerPage (  );                         		// [ FUNC_Simulated ] GUI2K4.UT2K4GUIController.GetSinglePlayerPage
	 void                      eventValidate (  );                               		// [ FUNC_Simulated | FUNC_Event ] GUI2K4.UT2K4GUIController.Validate
	 bool                      eventOpenMenu ( struct FString NewMenuName, struct FString Param1, struct FString Param2 );		// [ FUNC_Event ] GUI2K4.UT2K4GUIController.OpenMenu
	 bool                      SetFocusTo ( class UFloatingWindow* Menu );       		//  GUI2K4.UT2K4GUIController.SetFocusTo
	 void                      ReturnToMainMenu (  );                            		//  GUI2K4.UT2K4GUIController.ReturnToMainMenu
}; // Size: 0x0000

// Class GUI2K4.PopupPageBase
class DLL_IMPORT UPopupPageBase : public UUT2K4GUIPage
{
public:
	unsigned long                                      bFadeTimeChangeAlpha:1;                           		// 0x0364 ( 0x0004 )  [0x00000001]
	unsigned long                                      bFadeTimeChangeColor:1;                           		// 0x0364 ( 0x0004 )  [0x00000002]
	unsigned long                                      bFadeTimeTranslate:1;                             		// 0x0364 ( 0x0004 )  [0x00000004]
	unsigned long                                      bUseChangeAlpha:1;                                		// 0x0364 ( 0x0004 )  [0x00000008]
	unsigned long                                      bUseTranslate:1;                                  		// 0x0364 ( 0x0004 )  [0x00000010]
	class UFloatingImage*                              i_FrameBG;                                        		// 0x0368 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned long                                      bCallFadeIn:1;                                    		// 0x036C ( 0x0004 )  [0x00000001]
	unsigned long                                      bFading:1;                                        		// 0x036C ( 0x0004 )  [0x00000002]
	unsigned long                                      bClosing:1;                                       		// 0x036C ( 0x0004 )  [0x00000004]
	float                                              FadeTime;                                         		// 0x0370 ( 0x0004 ) [ CPF_Edit ]
	float                                              CurFadeTime;                                      		// 0x0374 ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      CurFade;                                          		// 0x0378 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      DesiredFade;                                      		// 0x0379 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      StartFade;                                        		// 0x037A ( 0x0001 ) [ CPF_Edit ]
	struct FFloatBox                                   CurAWinPos;                                       		// 0x037C ( 0x0010 ) 
	struct FFloatBox                                   DesiredAWinPos;                                   		// 0x038C ( 0x0010 ) 
	struct FFloatBox                                   slidePos;                                         		// 0x039C ( 0x0010 ) 
	struct FScriptDelegate                             __OnFadeEnd__Delegate;                            		// 0x03AC ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      Default_FadedOut (  );                            		//  GUI2K4.PopupPageBase.Default_FadedOut
	 void                      FadeOut ( bool bTranslate, bool bChangeAlpha );   		//  GUI2K4.PopupPageBase.FadeOut
	 void                      FadeIn ( bool bTranslate, bool bChangeAlpha );    		//  GUI2K4.PopupPageBase.FadeIn
	 bool                      InternalOnPreDraw ( class UCanvas* C );           		//  GUI2K4.PopupPageBase.InternalOnPreDraw
	 void                      OnFadeEnd (  );                                   		//  GUI2K4.PopupPageBase.OnFadeEnd
	 bool                      FindPoupPageBaseInMenuStack ( class UGUIPage* CurrentPage );		//  GUI2K4.PopupPageBase.FindPoupPageBaseInMenuStack
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUI2K4.PopupPageBase.Opened
}; // Size: 0x0050

// Class GUI2K4.FloatingWindow
class DLL_IMPORT UFloatingWindow : public UPopupPageBase
{
public:
	class UGUIHeader*                                  t_WindowTitle;                                    		// 0x03B4 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIButton*                                  b_ExitButton;                                     		// 0x03B8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     WindowName;                                       		// 0x03BC ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	float                                              MinPageWidth;                                     		// 0x03C8 ( 0x0004 ) [ CPF_Edit ]
	float                                              MinPageHeight;                                    		// 0x03CC ( 0x0004 ) [ CPF_Edit ]
	float                                              MaxPageHeight;                                    		// 0x03D0 ( 0x0004 ) [ CPF_Edit ]
	float                                              MaxPageWidth;                                     		// 0x03D4 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bResizeWidthAllowed:1;                            		// 0x03D8 ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bResizeHeightAllowed:1;                           		// 0x03D8 ( 0x0004 )  [0x00000002][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bResizing:1;                                      		// 0x03D8 ( 0x0004 )  [0x00000004][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bMoveAllowed:1;                                   		// 0x03D8 ( 0x0004 )  [0x00000008][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bMoving:1;                                        		// 0x03D8 ( 0x0004 )  [0x00000010][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      TSizing:1;                                        		// 0x03D8 ( 0x0004 )  [0x00000020][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      RSizing:1;                                        		// 0x03D8 ( 0x0004 )  [0x00000040][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      LSizing:1;                                        		// 0x03D8 ( 0x0004 )  [0x00000080][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      BtSizing:1;                                       		// 0x03D8 ( 0x0004 )  [0x00000100][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      TLSizing:1;                                       		// 0x03D8 ( 0x0004 )  [0x00000200][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      TRSizing:1;                                       		// 0x03D8 ( 0x0004 )  [0x00000400][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      BRSizing:1;                                       		// 0x03D8 ( 0x0004 )  [0x00000800][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      BLSizing:1;                                       		// 0x03D8 ( 0x0004 )  [0x00001000][ CPF_Edit | CPF_EditConst ]
	float                                              DefaultLeft;                                      		// 0x03DC ( 0x0004 ) [ CPF_Edit ]
	float                                              DefaultTop;                                       		// 0x03E0 ( 0x0004 ) [ CPF_Edit ]
	float                                              DefaultWidth;                                     		// 0x03E4 ( 0x0004 ) [ CPF_Edit ]
	float                                              DefaultHeight;                                    		// 0x03E8 ( 0x0004 ) [ CPF_Edit ]
	int                                                HeaderMouseCursorIndex;                           		// 0x03EC ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bSetControlsBoundToParent:1;                      		// 0x03F0 ( 0x0004 )  [0x00000001]
	unsigned long                                      bSetControlsScaleToParent:1;                      		// 0x03F0 ( 0x0004 )  [0x00000002]

	// UScript Functions
	 void                      SetMouseCursorIndex ( int NewIndex );             		//  GUI2K4.FloatingWindow.SetMouseCursorIndex
	 bool                      XButtonClicked ( class UGUIComponent* Sender );   		//  GUI2K4.FloatingWindow.XButtonClicked
	 bool                      HoveringBottomLeft (  );                          		//  GUI2K4.FloatingWindow.HoveringBottomLeft
	 bool                      HoveringTopLeft (  );                             		//  GUI2K4.FloatingWindow.HoveringTopLeft
	 bool                      HoveringBottomBorder (  );                        		//  GUI2K4.FloatingWindow.HoveringBottomBorder
	 bool                      HoveringTopBorder (  );                           		//  GUI2K4.FloatingWindow.HoveringTopBorder
	 bool                      HoveringRightBorder (  );                         		//  GUI2K4.FloatingWindow.HoveringRightBorder
	 bool                      HoveringLeftBorder (  );                          		//  GUI2K4.FloatingWindow.HoveringLeftBorder
	 bool                      ResizeAllowed (  );                               		//  GUI2K4.FloatingWindow.ResizeAllowed
	 void                      ResizedHeight (  );                               		//  GUI2K4.FloatingWindow.ResizedHeight
	 void                      ResizedWidth (  );                                		//  GUI2K4.FloatingWindow.ResizedWidth
	 void                      ResizedBoth (  );                                 		//  GUI2K4.FloatingWindow.ResizedBoth
	 void                      eventResolutionChanged ( int ResX, int ResY );    		// [ FUNC_Event ] GUI2K4.FloatingWindow.ResolutionChanged
	 void                      FloatingRendered ( class UCanvas* C );            		//  GUI2K4.FloatingWindow.FloatingRendered
	 bool                      FloatingPreDraw ( class UCanvas* C );             		//  GUI2K4.FloatingWindow.FloatingPreDraw
	 void                      SetPanelPosition ( class UCanvas* C );            		//  GUI2K4.FloatingWindow.SetPanelPosition
	 bool                      FloatingHover ( class UGUIComponent* Sender );    		//  GUI2K4.FloatingWindow.FloatingHover
	 void                      SaveCurrentPosition (  );                         		//  GUI2K4.FloatingWindow.SaveCurrentPosition
	 void                      FloatingMouseRelease ( class UGUIComponent* Sender );		//  GUI2K4.FloatingWindow.FloatingMouseRelease
	 void                      FloatingMousePressed ( class UGUIComponent* Sender, bool bRepeat );		//  GUI2K4.FloatingWindow.FloatingMousePressed
	 void                      eventSetFocus ( class UGUIComponent* Who );       		// [ FUNC_Event ] GUI2K4.FloatingWindow.SetFocus
	 void                      InternalOnCreateComponent ( class UGUIComponent* NewComp, class UGUIComponent* Sender );		//  GUI2K4.FloatingWindow.InternalOnCreateComponent
	 void                      SetDefaultPosition (  );                          		//  GUI2K4.FloatingWindow.SetDefaultPosition
	 void                      CheckBounds (  );                                 		//  GUI2K4.FloatingWindow.CheckBounds
	 bool                      SystemMenuPreDraw ( class UCanvas* Canvas );      		//  GUI2K4.FloatingWindow.SystemMenuPreDraw
	 void                      AddSystemMenu (  );                               		//  GUI2K4.FloatingWindow.AddSystemMenu
	 bool                      AlignFrame ( class UCanvas* C );                  		//  GUI2K4.FloatingWindow.AlignFrame
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUI2K4.FloatingWindow.InitComponent
}; // Size: 0x0040

// Class GUI2K4.fntUT2k4Menu
class DLL_IMPORT UfntUT2k4Menu : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4Default
class DLL_IMPORT UfntUT2k4Default : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4Large
class DLL_IMPORT UfntUT2k4Large : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4Header
class DLL_IMPORT UfntUT2k4Header : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4Small
class DLL_IMPORT UfntUT2k4Small : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4MidGame
class DLL_IMPORT UfntUT2k4MidGame : public UGUIFont
{
public:
	int                                                FontScreenWidth[ 0x07 ];                          		// 0x0084 ( 0x001C ) 

	// UScript Functions
	 class UFont*              eventGetFont ( int XRes );                        		// [ FUNC_Event ] GUI2K4.fntUT2k4MidGame.GetFont
	 class UFont*              GetMidGameFont ( int XRes );                      		//  GUI2K4.fntUT2k4MidGame.GetMidGameFont
}; // Size: 0x001C

// Class GUI2K4.fntUT2k4SmallHeader
class DLL_IMPORT UfntUT2k4SmallHeader : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4ServerList
class DLL_IMPORT UfntUT2k4ServerList : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4IRC
class DLL_IMPORT UfntUT2k4IRC : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2k4MainMenu
class DLL_IMPORT UfntUT2k4MainMenu : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.fntUT2K4Medium
class DLL_IMPORT UfntUT2K4Medium : public UGUIFont
{
public:
}; // Size: 0x0000

// Class GUI2K4.GUI2Styles
class DLL_IMPORT UGUI2Styles : public UGUIStyles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2RoundButton
class DLL_IMPORT USTY2RoundButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2RoundScaledButton
class DLL_IMPORT USTY2RoundScaledButton : public USTY2RoundButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SquareButton
class DLL_IMPORT USTY2SquareButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ListBox
class DLL_IMPORT USTY2ListBox : public USTY2SquareButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ScrollZone
class DLL_IMPORT USTY2ScrollZone : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2TextButton
class DLL_IMPORT USTY2TextButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2Page
class DLL_IMPORT USTY2Page : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2Footer
class DLL_IMPORT USTY2Footer : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2Header
class DLL_IMPORT USTY2Header : public USTY2Footer
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2TabButton
class DLL_IMPORT USTY2TabButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2CharButton
class DLL_IMPORT USTY2CharButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ArrowLeft
class DLL_IMPORT USTY2ArrowLeft : public USTY2RoundButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ArrowRight
class DLL_IMPORT USTY2ArrowRight : public USTY2RoundButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ServerBrowserGrid
class DLL_IMPORT USTY2ServerBrowserGrid : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2NoBackground
class DLL_IMPORT USTY2NoBackground : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ServerBrowserGridHeader
class DLL_IMPORT USTY2ServerBrowserGridHeader : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SliderCaption
class DLL_IMPORT USTY2SliderCaption : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2LadderButton
class DLL_IMPORT USTY2LadderButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2LadderButtonHi
class DLL_IMPORT USTY2LadderButtonHi : public USTY2LadderButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2LadderButtonActive
class DLL_IMPORT USTY2LadderButtonActive : public USTY2LadderButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2BindBox
class DLL_IMPORT USTY2BindBox : public USTY2NoBackground
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SquareBar
class DLL_IMPORT USTY2SquareBar : public USTY2RoundButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SquareMenuButton
class DLL_IMPORT USTY2SquareMenuButton : public USTY2SquareButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2MidGameButton
class DLL_IMPORT USTY2MidGameButton : public USTY2SquareMenuButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2TextLabel
class DLL_IMPORT USTY2TextLabel : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ComboListBox
class DLL_IMPORT USTY2ComboListBox : public USTY2ListBox
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2IRCText
class DLL_IMPORT USTY2IRCText : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2IRCEntry
class DLL_IMPORT USTY2IRCEntry : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2BrowserButton
class DLL_IMPORT USTY2BrowserButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ContextMenu
class DLL_IMPORT USTY2ContextMenu : public USTY2ListBox
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ServerListContextMenu
class DLL_IMPORT USTY2ServerListContextMenu : public USTY2ContextMenu
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ListSelection
class DLL_IMPORT USTY2ListSelection : public USTY_ListSelection
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2TabBackground
class DLL_IMPORT USTY2TabBackground : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2BrowserListSel
class DLL_IMPORT USTY2BrowserListSel : public USTY2ListSelection
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2EditBox
class DLL_IMPORT USTY2EditBox : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2CheckBox
class DLL_IMPORT USTY2CheckBox : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2CheckBoxCheck
class DLL_IMPORT USTY2CheckBoxCheck : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SliderKnob
class DLL_IMPORT USTY2SliderKnob : public USTY2RoundButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2BottomTabButton
class DLL_IMPORT USTY2BottomTabButton : public USTY2TabButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ListSectionHeader
class DLL_IMPORT USTY2ListSectionHeader : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ItemOutline
class DLL_IMPORT USTY2ItemOutline : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ListHighlight
class DLL_IMPORT USTY2ListHighlight : public USTY2ListSelection
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2MouseOverLabel
class DLL_IMPORT USTY2MouseOverLabel : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SliderBar
class DLL_IMPORT USTY2SliderBar : public USTY2SquareButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2DarkTextLabel
class DLL_IMPORT USTY2DarkTextLabel : public USTY2TextLabel
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2TextButtonEffect
class DLL_IMPORT USTY2TextButtonEffect : public USTY2TextButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ArrowRightDbl
class DLL_IMPORT USTY2ArrowRightDbl : public USTY2RoundButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ArrowLeftDbl
class DLL_IMPORT USTY2ArrowLeftDbl : public USTY2RoundButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2FooterButton
class DLL_IMPORT USTY2FooterButton : public USTY2TabButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SectionHeaderText
class DLL_IMPORT USTY2SectionHeaderText : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2ComboButton
class DLL_IMPORT USTY2ComboButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2VertUpButton
class DLL_IMPORT USTY2VertUpButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2VertDownButton
class DLL_IMPORT USTY2VertDownButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2VertGrip
class DLL_IMPORT USTY2VertGrip : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2Spinner
class DLL_IMPORT USTY2Spinner : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SectionHeaderTop
class DLL_IMPORT USTY2SectionHeaderTop : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2SectionHeaderBar
class DLL_IMPORT USTY2SectionHeaderBar : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2CloseButton
class DLL_IMPORT USTY2CloseButton : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2CoolScroll
class DLL_IMPORT USTY2CoolScroll : public UGUI2Styles
{
public:
}; // Size: 0x0000

// Class GUI2K4.STY2AltComboButton
class DLL_IMPORT USTY2AltComboButton : public USTY2ComboButton
{
public:
}; // Size: 0x0000

// Class GUI2K4.UT2K4InGameChat
class DLL_IMPORT UUT2K4InGameChat : public UFloatingWindow
{
public:
	class UGUISectionBackground*                       sb_Main;                                          		// 0x03F4 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UmoEditBox*                                  eb_Send;                                          		// 0x03F8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIScrollTextBox*                           lb_Chat;                                          		// 0x03FC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	int                                                OldCMC;                                           		// 0x0400 ( 0x0004 ) [ CPF_Edit ]
	class TArray< unsigned char >                      CloseKey;                                         		// 0x0404 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink | CPF_EditInline ]
	class FColor                                       TextColor[ 0x03 ];                                		// 0x0410 ( 0x000C ) [ CPF_Edit | CPF_EditInline | CPF_EditInlineNotify ]

	// UScript Functions
	 void                      InternalOnCreateComponent ( class UGUIComponent* NewComp, class UGUIComponent* Sender );		//  GUI2K4.UT2K4InGameChat.InternalOnCreateComponent
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  GUI2K4.UT2K4InGameChat.InternalOnKeyEvent
	 void                      HandleChat ( struct FString Msg, int TeamIndex ); 		//  GUI2K4.UT2K4InGameChat.HandleChat
	 void                      Closed ( class UGUIComponent* Sender, bool bCancelled );		//  GUI2K4.UT2K4InGameChat.Closed
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] GUI2K4.UT2K4InGameChat.Opened
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  GUI2K4.UT2K4InGameChat.InitComponent
}; // Size: 0x0028

// Class GUI2K4.AltSectionBackground
class DLL_IMPORT UAltSectionBackground : public UGUISectionBackground
{
public:
}; // Size: 0x0000

#ifdef _MSC_VER
#pragma pack ( pop )
#endif

