#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : UnrealGame
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function UnrealGame.StartupMessage.GotoHud
// Flags: 
struct AStartupMessage_execGotoHud_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.StartupMessage.GetString
// Flags: 
struct AStartupMessage_execGetString_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x001C ( 0x0004
//	int                                                PlayerCount;                                      		// 0x0020 ( 0x0004
//	class AGameReplicationInfo*                        GRI;                                              		// 0x0024 ( 0x0004
};

// Function UnrealGame.StartupMessage.ClientReceive
// Flags: [ FUNC_Simulated ]
struct AStartupMessage_execClientReceive_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.DeathMatch.PermitWeaponChangeInSpecialMode
// Flags: 
struct ADeathMatch_execPermitWeaponChangeInSpecialMode_Parms
{
};

// Function UnrealGame.DeathMatch.AnnounceUAV
// Flags: 
struct ADeathMatch_execAnnounceUAV_Parms
{
	class AController*                                 Caller;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.AnnounceHelicopter
// Flags: 
struct ADeathMatch_execAnnounceHelicopter_Parms
{
	class AController*                                 Caller;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.AnnounceArtillery
// Flags: 
struct ADeathMatch_execAnnounceArtillery_Parms
{
	class AController*                                 Caller;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.GetAllLoadHints
// Flags: 
struct ADeathMatch_execGetAllLoadHints_Parms
{
	unsigned long                                      bThisClassOnly:1;                                 		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class TArray< struct FString >                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	class TArray< struct FString >                     Hints;                                            		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.GetNextLoadHint
// Flags: 
struct ADeathMatch_execGetNextLoadHint_Parms
{
	struct FString                                     MapName;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class TArray< struct FString >                     Hints;                                            		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.SetGrammar
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventSetGrammar_Parms
{
};

// Function UnrealGame.DeathMatch.PrecacheGameAnnouncements
// Flags: 
struct ADeathMatch_execPrecacheGameAnnouncements_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.WantsPickups
// Flags: 
struct ADeathMatch_execWantsPickups_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.EndSpree
// Flags: 
struct ADeathMatch_execEndSpree_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Other;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.DeathMatch.NotifySpree
// Flags: 
struct ADeathMatch_execNotifySpree_Parms
{
	class AController*                                 Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Num;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.DeathMatch.GetDescriptionText
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventGetDescriptionText_Parms
{
	struct FString                                     PropName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.GetDisplayText
// Flags: 
struct ADeathMatch_execGetDisplayText_Parms
{
	struct FString                                     PropName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.FillPlayInfo
// Flags: 
struct ADeathMatch_execFillPlayInfo_Parms
{
	class UPlayInfo*                                   PlayInfo;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.AcceptPlayInfoProperty
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventAcceptPlayInfoProperty_Parms
{
	struct FString                                     PropertyName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.ReviewJumpSpots
// Flags: 
struct ADeathMatch_execReviewJumpSpots_Parms
{
	struct FName                                       TestLabel;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ANavigationPoint*                            StartSpot;                                        		// 0x0004 ( 0x0004
	class AController*                                 C;                                                		// 0x0008 ( 0x0004
	class APawn*                                       P;                                                		// 0x000C ( 0x0004
	class ABot*                                        B;                                                		// 0x0010 ( 0x0004
	class UClass*                                      PawnClass;                                        		// 0x0014 ( 0x0004
};

// Function UnrealGame.DeathMatch.addaistrike
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execaddaistrike_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	struct FVector                                     V;                                                		// 0x0008 ( 0x000C
	class AActor*                                      A;                                                		// 0x0014 ( 0x0004
};

// Function UnrealGame.DeathMatch.addaifire
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execaddaifire_Parms
{
	struct FString                                     Num;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Team;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.addai
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execaddai_Parms
{
	struct FString                                     Num;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Team;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.addaibot
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execaddaibot_Parms
{
	struct FString                                     Num;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Team;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Grade;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     NPCID;                                            		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.AddwAIBot
// Flags: 
struct ADeathMatch_execAddwAIBot_Parms
{
	struct FString                                     strNum;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     strTeam;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     aiClass;                                          		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     strGrade;                                         		// 0x0024 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     strNPCID;                                         		// 0x0030 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     strRegenLoc;                                      		// 0x003C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      BotClass;                                         		// 0x0048 ( 0x0004
	int                                                lp1;                                              		// 0x004C ( 0x0004
	int                                                Num;                                              		// 0x0050 ( 0x0004
	int                                                Team;                                             		// 0x0054 ( 0x0004
	int                                                NPCID;                                            		// 0x0058 ( 0x0004
	int                                                Grade;                                            		// 0x005C ( 0x0004
	int                                                RegenLoc;                                         		// 0x0060 ( 0x0004
	unsigned long                                      forceTeam:1;                                      		// 0x0064 ( 0x0004 [0x00000001]
	class TArray< int >                                BotID;                                            		// 0x0068 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.rfAckGetBotID
// Flags: 
struct ADeathMatch_execrfAckGetBotID_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RequestedAFCount;                                 		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      RequestedRSACount;                                		// 0x0005 ( 0x0001[ CPF_Parm ]
	class TArray< int >                                AFBotID;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                RSABotID;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.HandleGetBotID
// Flags: 
struct ADeathMatch_execHandleGetBotID_Parms
{
	int                                                Team;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                BotID;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x0010 ( 0x0004
	struct FAddBotInfo                                 cur;                                              		// 0x0014 ( 0x0014
	class AController*                                 Bot;                                              		// 0x0028 ( 0x0004
	class AUnrealTeamInfo*                             BotTeam;                                          		// 0x002C ( 0x0004
};

// Function UnrealGame.DeathMatch.EnqueueAddBot
// Flags: 
struct ADeathMatch_execEnqueueAddBot_Parms
{
	class UClass*                                      BotClass;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Team;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Grade;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                NPCID;                                            		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                RegenLoc;                                         		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FAddBotInfo                                 i;                                                		// 0x0014 ( 0x0014
};

// Function UnrealGame.DeathMatch.Killaibots
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execKillaibots_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.DeathMatch.Kill
// Flags: 
struct ADeathMatch_execKill_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                BotID;                                            		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.KillBots
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execKillBots_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class AController*                                 NextC;                                            		// 0x0008 ( 0x0004
};

// Function UnrealGame.DeathMatch.AddBots
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execAddBots_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.AddNamedBot
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execAddNamedBot_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.dobalancebots
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execdobalancebots_Parms
{
};

// Function UnrealGame.DeathMatch.setFakeUID
// Flags: [ FUNC_Exec ]
struct ADeathMatch_execsetFakeUID_Parms
{
};

// Function UnrealGame.DeathMatch.ReduceDamage
// Flags: 
struct ADeathMatch_execReduceDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       injured;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       instigatedBy;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	class UClass*                                      DamageType;                                       		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                iWeaponType;                                      		// 0x0028 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x002C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.AdjustSkill
// Flags: 
struct ADeathMatch_execAdjustSkill_Parms
{
	class AAIController*                               B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           P;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bWinner:1;                                        		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.ScoreKill
// Flags: 
struct ADeathMatch_execScoreKill_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Other;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      OtherPRI;                                         		// 0x0008 ( 0x0004
};

// Function UnrealGame.DeathMatch.ScoreObjective
// Flags: 
struct ADeathMatch_execScoreObjective_Parms
{
	class APlayerReplicationInfo*                      Scorer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Score;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.CheckScore
// Flags: 
struct ADeathMatch_execCheckScore_Parms
{
	class APlayerReplicationInfo*                      Scorer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.CheckMaxLives
// Flags: 
struct ADeathMatch_execCheckMaxLives_Parms
{
	class APlayerReplicationInfo*                      Scorer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AController*                                 C;                                                		// 0x0008 ( 0x0004
//	class APlayerReplicationInfo*                      Living;                                           		// 0x000C ( 0x0004
//	unsigned long                                      bNoneLeft:1;                                      		// 0x0010 ( 0x0004 [0x00000001]
};

// Function UnrealGame.DeathMatch.RatePlayerStart
// Flags: 
struct ADeathMatch_execRatePlayerStart_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Team;                                             		// 0x0004 ( 0x0001[ CPF_Parm ]
	class AController*                                 Player;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerStart*                                P;                                                		// 0x0010 ( 0x0004
//	float                                              Score;                                            		// 0x0014 ( 0x0004
//	float                                              NextDist;                                         		// 0x0018 ( 0x0004
//	class AController*                                 OtherPlayer;                                      		// 0x001C ( 0x0004
//	float                                              fTemp;                                            		// 0x0020 ( 0x0004
};

// Function UnrealGame.DeathMatch.CheckLives
// Flags: 
struct ADeathMatch_execCheckLives_Parms
{
	class APlayerReplicationInfo*                      Scorer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AController*                                 C;                                                		// 0x0008 ( 0x0004
//	class APlayerReplicationInfo*                      Living;                                           		// 0x000C ( 0x0004
//	unsigned long                                      bNoneLeft:1;                                      		// 0x0010 ( 0x0004 [0x00000001]
//	unsigned long                                      bCheck:1;                                         		// 0x0014 ( 0x0004 [0x00000001]
};

// Function UnrealGame.DeathMatch.ChangeHostExtraWork
// Flags: 
struct ADeathMatch_execChangeHostExtraWork_Parms
{
};

// Function UnrealGame.DeathMatch.GetUserBackToVehicle
// Flags: 
struct ADeathMatch_execGetUserBackToVehicle_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.ContinueMatch
// Flags: 
struct ADeathMatch_execContinueMatch_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004
	class AActor*                                      A;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.RecoverHelicopter
// Flags: 
struct ADeathMatch_execRecoverHelicopter_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	unsigned long                                      bDestroyed:1;                                     		// 0x0008 ( 0x0004 [0x00000001]
};

// Function UnrealGame.DeathMatch.OnKillingDropOut
// Flags: 
struct ADeathMatch_execOnKillingDropOut_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.CalcItemUsedTimeAll
// Flags: 
struct ADeathMatch_execCalcItemUsedTimeAll_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.DeathMatch.ForcedStartMatch
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventForcedStartMatch_Parms
{
};

// Function UnrealGame.DeathMatch.UpdateVehicles
// Flags: 
struct ADeathMatch_execUpdateVehicles_Parms
{
	class AVehicle*                                    V;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.DeathMatch.ProcessDefaultInv
// Flags: 
struct ADeathMatch_execProcessDefaultInv_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.DeathMatch.GameAddDefaultInventory
// Flags: 
struct ADeathMatch_execGameAddDefaultInventory_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.AnnounceTimesUp
// Flags: 
struct ADeathMatch_execAnnounceTimesUp_Parms
{
	class AController*                                 P;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.DeathMatch.GetNetWait
// Flags: 
struct ADeathMatch_execGetNetWait_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.PlayStartupMessage
// Flags: 
struct ADeathMatch_execPlayStartupMessage_Parms
{
	class AController*                                 P;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.DeathMatch.PlayEndOfMatchMessage
// Flags: 
struct ADeathMatch_execPlayEndOfMatchMessage_Parms
{
};

// Function UnrealGame.DeathMatch.FindPlayerStart_TU
// Flags: 
struct ADeathMatch_execFindPlayerStart_TU_Parms
{
	class AController*                                 Player;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      inTeam;                                           		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     incomingName;                                     		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      Team;                                             		// 0x0018 ( 0x0001
//	int                                                lp1;                                              		// 0x001C ( 0x0004
//	class APlayerStart_Defence*                        S;                                                		// 0x0020 ( 0x0004
//	class ANavigationPoint*                            respawnPoint;                                     		// 0x0024 ( 0x0004
//	class TArray< class APlayerStart_Defence* >        candidates;                                       		// 0x0028 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.FindPlayerStart
// Flags: 
struct ADeathMatch_execFindPlayerStart_Parms
{
	class AController*                                 Player;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      inTeam;                                           		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     incomingName;                                     		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ANavigationPoint*                            Best;                                             		// 0x0018 ( 0x0004
};

// Function UnrealGame.DeathMatch.SetGameEndType
// Flags: 
struct ADeathMatch_execSetGameEndType_Parms
{
	struct FString                                     Reason;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.EndGame
// Flags: 
struct ADeathMatch_execEndGame_Parms
{
	class APlayerReplicationInfo*                      Winner;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.AnnounceMatchInfo
// Flags: 
struct ADeathMatch_execAnnounceMatchInfo_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.DeathMatch.deleAnnounceMatchInfo
// Flags: 
struct ADeathMatch_execdeleAnnounceMatchInfo_Parms
{
};

// Function UnrealGame.DeathMatch.BalanceBots
// Flags: 
struct ADeathMatch_execBalanceBots_Parms
{
	int                                                AF;                                               		// 0x0000 ( 0x0004
	int                                                rsa;                                              		// 0x0004 ( 0x0004
	int                                                afAdd;                                            		// 0x0008 ( 0x0004
	int                                                rsaAdd;                                           		// 0x000C ( 0x0004
	int                                                lp1;                                              		// 0x0010 ( 0x0004
	class AController*                                 C;                                                		// 0x0014 ( 0x0004
	class UwMatchMaker*                                MM;                                               		// 0x0018 ( 0x0004
};

// Function UnrealGame.DeathMatch.StartMatch
// Flags: 
struct ADeathMatch_execStartMatch_Parms
{
	unsigned long                                      bTemp:1;                                          		// 0x0000 ( 0x0004 [0x00000001]
	int                                                Num;                                              		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.FindTeamFor
// Flags: 
struct ADeathMatch_execFindTeamFor_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AUnrealTeamInfo*                             ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.InitPlacedBot
// Flags: 
struct ADeathMatch_execInitPlacedBot_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class URosterEntry*                                R;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AUnrealTeamInfo*                             BotTeam;                                          		// 0x0008 ( 0x0004
};

// Function UnrealGame.DeathMatch.InitializeBot
// Flags: 
struct ADeathMatch_execInitializeBot_Parms
{
	class ABot*                                        NewBot;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AUnrealTeamInfo*                             BotTeam;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	class URosterEntry*                                Chosen;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.SpawnBot
// Flags: 
struct ADeathMatch_execSpawnBot_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class ABot*                                        ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        NewBot;                                           		// 0x0010 ( 0x0004
//	class URosterEntry*                                Chosen;                                           		// 0x0014 ( 0x0004
//	class AUnrealTeamInfo*                             BotTeam;                                          		// 0x0018 ( 0x0004
//	struct FString                                     FullName;                                         		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.PreLoadBot
// Flags: 
struct ADeathMatch_execPreLoadBot_Parms
{
};

// Function UnrealGame.DeathMatch.PreLoadNamedBot
// Flags: 
struct ADeathMatch_execPreLoadNamedBot_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.GetBotTeam2
// Flags: 
struct ADeathMatch_execGetBotTeam2_Parms
{
	unsigned long                                      forceTeam:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                Team;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AUnrealTeamInfo*                             ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.GetBotTeam
// Flags: 
struct ADeathMatch_execGetBotTeam_Parms
{
	int                                                TeamBots;                                         		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AUnrealTeamInfo*                             ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UClass*                                      RosterClass;                                      		// 0x0008 ( 0x0004
};

// Function UnrealGame.DeathMatch.InitTeamSymbols
// Flags: 
struct ADeathMatch_execInitTeamSymbols_Parms
{
};

// Function UnrealGame.DeathMatch.InitGameReplicationInfo
// Flags: 
struct ADeathMatch_execInitGameReplicationInfo_Parms
{
};

// Function UnrealGame.DeathMatch.GetServerDetails
// Flags: 
struct ADeathMatch_execGetServerDetails_Parms
{
	struct FServerResponseLine                         ServerState;                                      		// 0x0000 ( 0x0070[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.NeedPlayers
// Flags: 
struct ADeathMatch_execNeedPlayers_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.Logout
// Flags: 
struct ADeathMatch_execLogout_Parms
{
	class AController*                                 Exiting;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.AllowBecomeActivePlayer
// Flags: 
struct ADeathMatch_execAllowBecomeActivePlayer_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.BecomeSpectator
// Flags: 
struct ADeathMatch_execBecomeSpectator_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.ChangeName
// Flags: 
struct ADeathMatch_execChangeName_Parms
{
	class AController*                                 Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     S;                                                		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bNameChange:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AController*                                 aPlayer;                                          		// 0x0014 ( 0x0004
	class AController*                                 C;                                                		// 0x0018 ( 0x0004
	class AController*                                 P;                                                		// 0x001C ( 0x0004
};

// Function UnrealGame.DeathMatch.ShouldRespawn
// Flags: 
struct ADeathMatch_execShouldRespawn_Parms
{
	class APickup*                                     Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.CanSpectate
// Flags: 
struct ADeathMatch_execCanSpectate_Parms
{
	class APlayerController*                           Viewer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bOnlySpectator:1;                                 		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AActor*                                      ViewTarget;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.AddDefaultInventory
// Flags: 
struct ADeathMatch_execAddDefaultInventory_Parms
{
	class APawn*                                       PlayerPawn;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.AddBot
// Flags: 
struct ADeathMatch_execAddBot_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        NewBot;                                           		// 0x0010 ( 0x0004
};

// Function UnrealGame.DeathMatch.ForceAddBot
// Flags: 
struct ADeathMatch_execForceAddBot_Parms
{
};

// Function UnrealGame.DeathMatch.TooManyBots
// Flags: 
struct ADeathMatch_execTooManyBots_Parms
{
	class AController*                                 botToRemove;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.RestartPlayer
// Flags: 
struct ADeathMatch_execRestartPlayer_Parms
{
	class AController*                                 aPlayer;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.ChangeLoadOut
// Flags: 
struct ADeathMatch_execChangeLoadOut_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     LoadoutName;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.PostLogin
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventPostLogin_Parms
{
	class APlayerController*                           NewPlayer;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.Login
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventLogin_Parms
{
	struct FString                                     Portal;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Options;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class APlayerController*                           ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           NewPlayer;                                        		// 0x0028 ( 0x0004
//	class AController*                                 C;                                                		// 0x002C ( 0x0004
};

// Function UnrealGame.DeathMatch.AtCapacity
// Flags: 
struct ADeathMatch_execAtCapacity_Parms
{
	unsigned long                                      bSpectator:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AController*                                 C;                                                		// 0x0008 ( 0x0004
//	unsigned long                                      bForcedSpectator:1;                               		// 0x000C ( 0x0004 [0x00000001]
};

// Function UnrealGame.DeathMatch.PlayWinMessage
// Flags: 
struct ADeathMatch_execPlayWinMessage_Parms
{
	class APlayerController*                           Player;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bWinner:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.CheckEndGame
// Flags: 
struct ADeathMatch_execCheckEndGame_Parms
{
	class APlayerReplicationInfo*                      Winner;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AController*                                 P;                                                		// 0x0014 ( 0x0004
//	class AController*                                 nextController;                                   		// 0x0018 ( 0x0004
//	class APlayerController*                           Player;                                           		// 0x001C ( 0x0004
//	unsigned long                                      bLastMan:1;                                       		// 0x0020 ( 0x0004 [0x00000001]
};

// Function UnrealGame.DeathMatch.CheckEndGameCondition
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventCheckEndGameCondition_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.DeathMatch.AcceptInventory
// Flags: 
struct ADeathMatch_execAcceptInventory_Parms
{
	class APawn*                                       PlayerPawn;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.GetMinPlayers
// Flags: 
struct ADeathMatch_execGetMinPlayers_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.TweakSkill
// Flags: 
struct ADeathMatch_execTweakSkill_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.InitGame
// Flags: [ FUNC_Event ]
struct ADeathMatch_eventInitGame_Parms
{
	struct FString                                     Options;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     InOpt;                                            		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                LevelMinPlayers;                                  		// 0x0024 ( 0x0004
};

// Function UnrealGame.DeathMatch.AddGameSpecificInventory
// Flags: 
struct ADeathMatch_execAddGameSpecificInventory_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DeathMatch.AllowTransloc
// Flags: 
struct ADeathMatch_execAllowTransloc_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.NeverAllowTransloc
// Flags: 
struct ADeathMatch_execNeverAllowTransloc_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.InitLogging
// Flags: 
struct ADeathMatch_execInitLogging_Parms
{
};

// Function UnrealGame.DeathMatch.VehicleScoreKill
// Flags: 
struct ADeathMatch_execVehicleScoreKill_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    DestroyedVehicle;                                 		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     KillInfo;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.Killed
// Flags: 
struct ADeathMatch_execKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       KilledPawn;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                WeaponType;                                       		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bWallShot:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bEnemyKill:1;                                     		// 0x001C ( 0x0004 [0x00000001]
	int                                                Score;                                            		// 0x0020 ( 0x0004
	struct FString                                     KillInfo;                                         		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.DeathMatch.CheckReady
// Flags: 
struct ADeathMatch_execCheckReady_Parms
{
};

// Function UnrealGame.DeathMatch.JustStarted
// Flags: 
struct ADeathMatch_execJustStarted_Parms
{
	float                                              t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.Reset
// Flags: 
struct ADeathMatch_execReset_Parms
{
};

// Function UnrealGame.DeathMatch.OverrideInitialBots
// Flags: 
struct ADeathMatch_execOverrideInitialBots_Parms
{
};

// Function UnrealGame.DeathMatch.PostBeginPlay
// Flags: 
struct ADeathMatch_execPostBeginPlay_Parms
{
};

// Function UnrealGame.DeathMatch.GetTimeSecondsLeft
// Flags: 
struct ADeathMatch_execGetTimeSecondsLeft_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DeathMatch.SendBgmMessageBeginMatch
// Flags: 
struct ADeathMatch_execSendBgmMessageBeginMatch_Parms
{
	class AController*                                 P;                                                		// 0x0000 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.MultiMinPlayers
// Flags: 
struct AUnrealMPGameInfo_execMultiMinPlayers_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.GetDescriptionText
// Flags: [ FUNC_Event ]
struct AUnrealMPGameInfo_eventGetDescriptionText_Parms
{
	struct FString                                     PropName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealMPGameInfo.FillPlayInfo
// Flags: 
struct AUnrealMPGameInfo_execFillPlayInfo_Parms
{
	class UPlayInfo*                                   PlayInfo;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.GenerateBotOptions
// Flags: 
struct AUnrealMPGameInfo_execGenerateBotOptions_Parms
{
	unsigned long                                      bSinglePlayer:1;                                  		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     Option;                                           		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	unsigned char                                      Value;                                            		// 0x001C ( 0x0001
};

// Function UnrealGame.UnrealMPGameInfo.AdjustBotInterface
// Flags: 
struct AUnrealMPGameInfo_execAdjustBotInterface_Parms
{
	unsigned long                                      bSinglePlayer:1;                                  		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.UnrealMPGameInfo.GetServerDetails
// Flags: 
struct AUnrealMPGameInfo_execGetServerDetails_Parms
{
	struct FServerResponseLine                         ServerState;                                      		// 0x0000 ( 0x0070[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealMPGameInfo.InitPlacedBot
// Flags: 
struct AUnrealMPGameInfo_execInitPlacedBot_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class URosterEntry*                                R;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealMPGameInfo.PickupQuery
// Flags: 
struct AUnrealMPGameInfo_execPickupQuery_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APickup*                                     Item;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      bAllowPickup;                                     		// 0x000C ( 0x0001
};

// Function UnrealGame.UnrealMPGameInfo.CanDisableObjective
// Flags: 
struct AUnrealMPGameInfo_execCanDisableObjective_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.AdjustDestroyObjectiveDamage
// Flags: 
struct AUnrealMPGameInfo_execAdjustDestroyObjectiveDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 instigatedBy;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AGameObjective*                              Go;                                               		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.ShowPathTo
// Flags: 
struct AUnrealMPGameInfo_execShowPathTo_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                TeamNum;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealMPGameInfo.CanShowPathTo
// Flags: 
struct AUnrealMPGameInfo_execCanShowPathTo_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                TeamNum;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.ForceAddBot
// Flags: 
struct AUnrealMPGameInfo_execForceAddBot_Parms
{
};

// Function UnrealGame.UnrealMPGameInfo.ChangeLoadOut
// Flags: 
struct AUnrealMPGameInfo_execChangeLoadOut_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     LoadoutName;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealMPGameInfo.ScoreGameObject
// Flags: 
struct AUnrealMPGameInfo_execScoreGameObject_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameObject*                                 Go;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealMPGameInfo.GetGameObject
// Flags: 
struct AUnrealMPGameInfo_execGetGameObject_Parms
{
	struct FName                                       GameObjectName;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameObject*                                 ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.FindNewObjectives
// Flags: 
struct AUnrealMPGameInfo_execFindNewObjectives_Parms
{
	class AGameObjective*                              DisabledObjective;                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealMPGameInfo.ObjectiveDisabled
// Flags: 
struct AUnrealMPGameInfo_execObjectiveDisabled_Parms
{
	class AGameObjective*                              DisabledObjective;                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealMPGameInfo.GetRandomTeamSymbol
// Flags: 
struct AUnrealMPGameInfo_execGetRandomTeamSymbol_Parms
{
	int                                                Base;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UTexture*                                    ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.RestartGame
// Flags: 
struct AUnrealMPGameInfo_execRestartGame_Parms
{
};

// Function UnrealGame.UnrealMPGameInfo.TooManyBots
// Flags: 
struct AUnrealMPGameInfo_execTooManyBots_Parms
{
	class AController*                                 botToRemove;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.SpawnWait
// Flags: 
struct AUnrealMPGameInfo_execSpawnWait_Parms
{
	class AAIController*                               B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.ShouldRespawn
// Flags: 
struct AUnrealMPGameInfo_execShouldRespawn_Parms
{
	class APickup*                                     Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.GetNumPlayers
// Flags: 
struct AUnrealMPGameInfo_execGetNumPlayers_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealMPGameInfo.TeamScoreEvent
// Flags: 
struct AUnrealMPGameInfo_execTeamScoreEvent_Parms
{
	int                                                Team;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Points;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Desc;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealMPGameInfo.ScoreEvent
// Flags: 
struct AUnrealMPGameInfo_execScoreEvent_Parms
{
	class APlayerReplicationInfo*                      Who;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Points;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Desc;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealMPGameInfo.GameEvent
// Flags: 
struct AUnrealMPGameInfo_execGameEvent_Parms
{
	struct FString                                     GEvent;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Desc;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      Who;                                              		// 0x0018 ( 0x0004[ CPF_Parm ]
	class ATeamPlayerReplicationInfo*                  TPRI;                                             		// 0x001C ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.KillEvent
// Flags: 
struct AUnrealMPGameInfo_execKillEvent_Parms
{
	struct FString                                     KillType;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      Killer;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      Victim;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	class UClass*                                      Damage;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	class ATeamPlayerReplicationInfo*                  TPRI;                                             		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.SpecialEvent
// Flags: 
struct AUnrealMPGameInfo_execSpecialEvent_Parms
{
	class APlayerReplicationInfo*                      Who;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Desc;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealMPGameInfo.ChangeVoiceChannel
// Flags: 
struct AUnrealMPGameInfo_execChangeVoiceChannel_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                NewChannelIndex;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                OldChannelIndex;                                  		// 0x0008 ( 0x0004[ CPF_Parm ]
	class AVoiceChatRoom*                              NewChannel;                                       		// 0x000C ( 0x0004
	class AVoiceChatRoom*                              OldChannel;                                       		// 0x0010 ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.InitMaplistHandler
// Flags: 
struct AUnrealMPGameInfo_execInitMaplistHandler_Parms
{
	class UClass*                                      MaplistManagerClass;                              		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.InitVoiceReplicationInfo
// Flags: 
struct AUnrealMPGameInfo_execInitVoiceReplicationInfo_Parms
{
	class UClass*                                      VRIClass;                                         		// 0x0000 ( 0x0004
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.Login
// Flags: [ FUNC_Event ]
struct AUnrealMPGameInfo_eventLogin_Parms
{
	struct FString                                     Portal;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Options;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class APlayerController*                           ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0028 ( 0x0004
};

// Function UnrealGame.UnrealMPGameInfo.PreLogin
// Flags: [ FUNC_Event ]
struct AUnrealMPGameInfo_eventPreLogin_Parms
{
	struct FString                                     Options;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Address;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     PlayerID;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     FailCode;                                         		// 0x0030 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class AMasterServerUplink*                         MSU;                                              		// 0x003C ( 0x0004
};

// Function UnrealGame.RosterEntry.InitBot
// Flags: 
struct URosterEntry_execInitBot_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.RosterEntry.RecommendAttack
// Flags: 
struct URosterEntry_execRecommendAttack_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.RosterEntry.RecommendFreelance
// Flags: 
struct URosterEntry_execRecommendFreelance_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.RosterEntry.RecommendDefense
// Flags: 
struct URosterEntry_execRecommendDefense_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.RosterEntry.NoRecommendation
// Flags: 
struct URosterEntry_execNoRecommendation_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.RosterEntry.RecommendSupport
// Flags: 
struct URosterEntry_execRecommendSupport_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.RosterEntry.SetOrders
// Flags: 
struct URosterEntry_execSetOrders_Parms
{
	unsigned char                                      Position;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.RosterEntry.PrecacheRosterFor
// Flags: 
struct URosterEntry_execPrecacheRosterFor_Parms
{
	class AUnrealTeamInfo*                             t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.RosterEntry.Init
// Flags: 
struct URosterEntry_execInit_Parms
{
};

// Function UnrealGame.UnrealPawn.SpawnGibs
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execSpawnGibs_Parms
{
	struct FRotator                                    HitRotation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              ChunkPerterbation;                                		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.ChunkUp
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execChunkUp_Parms
{
	struct FRotator                                    HitRotation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              ChunkPerterbation;                                		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.PlayFootStep
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execPlayFootStep_Parms
{
	int                                                side;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.IncrementSpree
// Flags: 
struct AUnrealPawn_execIncrementSpree_Parms
{
};

// Function UnrealGame.UnrealPawn.GetSpree
// Flags: 
struct AUnrealPawn_execGetSpree_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPawn.TakeDrowningDamage
// Flags: 
struct AUnrealPawn_execTakeDrowningDamage_Parms
{
};

// Function UnrealGame.UnrealPawn.SetMovementPhysics
// Flags: 
struct AUnrealPawn_execSetMovementPhysics_Parms
{
};

// Function UnrealGame.UnrealPawn.GetPlacedRoster
// Flags: 
struct AUnrealPawn_execGetPlacedRoster_Parms
{
	class URosterEntry*                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPawn.PostNetBeginPlay
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execPostNetBeginPlay_Parms
{
	class ASquadAI*                                    S;                                                		// 0x0000 ( 0x0004
	class URosterEntry*                                R;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.UnrealPawn.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execPostBeginPlay_Parms
{
};

// Function UnrealGame.UnrealPawn.Dodge
// Flags: 
struct AUnrealPawn_execDodge_Parms
{
	unsigned char                                      DoubleClickMove;                                  		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     X;                                                		// 0x0008 ( 0x000C
//	struct FVector                                     Y;                                                		// 0x0014 ( 0x000C
//	struct FVector                                     Z;                                                		// 0x0020 ( 0x000C
};

// Function UnrealGame.UnrealPawn.PerformDodge
// Flags: 
struct AUnrealPawn_execPerformDodge_Parms
{
	unsigned char                                      DoubleClickMove;                                  		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FVector                                     Dir;                                              		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Cross;                                            		// 0x0010 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPawn.CreateInventory
// Flags: 
struct AUnrealPawn_execCreateInventory_Parms
{
	struct FString                                     InventoryClassName;                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class AInventory*                                  ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AInventory*                                  Inv;                                              		// 0x0010 ( 0x0004
//	class UClass*                                      InventoryClass;                                   		// 0x0014 ( 0x0004
};

// Function UnrealGame.UnrealPawn.CustomCreateInventory
// Flags: 
struct AUnrealPawn_execCustomCreateInventory_Parms
{
	struct FString                                     WeaponClassName;                                  		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class AInventory*                                  ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AInventory*                                  Inv;                                              		// 0x0010 ( 0x0004
};

// Function UnrealGame.UnrealPawn.AddDefaultInventory
// Flags: 
struct AUnrealPawn_execAddDefaultInventory_Parms
{
	unsigned long                                      bQuickslotChange:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.AddDefaultInventoryDOA
// Flags: 
struct AUnrealPawn_execAddDefaultInventoryDOA_Parms
{
	unsigned long                                      bQuickslotChange:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.IsInLoadout
// Flags: 
struct AUnrealPawn_execIsInLoadout_Parms
{
	class UClass*                                      InventoryClass;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	struct FString                                     invstring;                                        		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPawn.PlayBreathSounds
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execPlayBreathSounds_Parms
{
};

// Function UnrealGame.UnrealPawn.CheckBob
// Flags: 
struct AUnrealPawn_execCheckBob_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Y;                                                		// 0x0004 ( 0x000C[ CPF_Parm ]
	float                                              OldBobTime;                                       		// 0x0010 ( 0x0004
	int                                                M;                                                		// 0x0014 ( 0x0004
	int                                                N;                                                		// 0x0018 ( 0x0004
	float                                              fStaminaRatio;                                    		// 0x001C ( 0x0004
};

// Function UnrealGame.UnrealPawn.GetWeaponBoneFor
// Flags: 
struct AUnrealPawn_execGetWeaponBoneFor_Parms
{
	class AInventory*                                  i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPawn.GetDebugName
// Flags: 
struct AUnrealPawn_execGetDebugName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPawn.SetAnimAction
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealPawn_eventSetAnimAction_Parms
{
	struct FName                                       NewAction;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.ShouldUnCrouch
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execShouldUnCrouch_Parms
{
};

// Function UnrealGame.UnrealPawn.EndJump
// Flags: 
struct AUnrealPawn_execEndJump_Parms
{
};

// Function UnrealGame.UnrealPawn.HoldGameObject
// Flags: 
struct AUnrealPawn_execHoldGameObject_Parms
{
	class AGameObject*                                 gameObj;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       GameObjBone;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.HoldFlag
// Flags: 
struct AUnrealPawn_execHoldFlag_Parms
{
	class AActor*                                      FlagActor;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.BotDodge
// Flags: 
struct AUnrealPawn_execBotDodge_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     Vel;                                              		// 0x0018 ( 0x000C
};

// Function UnrealGame.UnrealPawn.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     t;                                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	float                                              XL;                                               		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealPawn.gibbedBy
// Flags: 
struct AUnrealPawn_execgibbedBy_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPawn.FindValidTaunt
// Flags: [ FUNC_Simulated ]
struct AUnrealPawn_execFindValidTaunt_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.UnrealPawn.DropFlag
// Flags: 
struct AUnrealPawn_execDropFlag_Parms
{
	struct FString                                     sReason;                                          		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.GameObjective.SetTeam
// Flags: 
struct AGameObjective_execSetTeam_Parms
{
	unsigned char                                      TeamIndex;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.GameObjective.AwardAssaultScore
// Flags: 
struct AGameObjective_execAwardAssaultScore_Parms
{
	int                                                Score;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.GameObjective.ShareScore
// Flags: 
struct AGameObjective_execShareScore_Parms
{
	int                                                Score;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     EventDesc;                                        		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0010 ( 0x0004
	float                                              SharedScore;                                      		// 0x0014 ( 0x0004
};

// Function UnrealGame.GameObjective.AddScorer
// Flags: 
struct AGameObjective_execAddScorer_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Pct;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FScorerRecord                               S;                                                		// 0x0008 ( 0x0008
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function UnrealGame.GameObjective.UpdatePrecacheMaterials
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execUpdatePrecacheMaterials_Parms
{
};

// Function UnrealGame.GameObjective.GetObjectiveProgress
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execGetObjectiveProgress_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.SetObjectiveOverlay
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execSetObjectiveOverlay_Parms
{
	unsigned long                                      bShow:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	class UMaterial*                                   newUV2Material;                                   		// 0x0008 ( 0x0004
};

// Function UnrealGame.GameObjective.PostNetReceive
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execPostNetReceive_Parms
{
};

// Function UnrealGame.GameObjective.HighlightPhysicalObjective
// Flags: 
struct AGameObjective_execHighlightPhysicalObjective_Parms
{
	unsigned long                                      bShow:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.GameObjective.PrecacheAnnouncer
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execPrecacheAnnouncer_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FString                                     SoundPackageName;                                 		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.GameObjective.Trigger
// Flags: 
struct AGameObjective_execTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       Instigator;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.GameObjective.CheckPlayCriticalAlarm
// Flags: 
struct AGameObjective_execCheckPlayCriticalAlarm_Parms
{
	unsigned long                                      bNewCritical:1;                                   		// 0x0000 ( 0x0004 [0x00000001]
};

// Function UnrealGame.GameObjective.SetCriticalStatus
// Flags: 
struct AGameObjective_execSetCriticalStatus_Parms
{
	unsigned long                                      bNewCriticalStatus:1;                             		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.GameObjective.IsCritical
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execIsCritical_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.IsActive
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execIsActive_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.SetActive
// Flags: 
struct AGameObjective_execSetActive_Parms
{
	unsigned long                                      bActiveStatus:1;                                  		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.GameObjective.Reset
// Flags: 
struct AGameObjective_execReset_Parms
{
};

// Function UnrealGame.GameObjective.BetterObjectiveThan
// Flags: 
struct AGameObjective_execBetterObjectiveThan_Parms
{
	class AGameObjective*                              Best;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      DesiredTeamNum;                                   		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      RequesterTeamNum;                                 		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.PlayDestructionMessage
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execPlayDestructionMessage_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function UnrealGame.GameObjective.DisableObjective
// Flags: 
struct AGameObjective_execDisableObjective_Parms
{
	class APawn*                                       Instigator;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0004 ( 0x0004
};

// Function UnrealGame.GameObjective.CompleteObjective
// Flags: 
struct AGameObjective_execCompleteObjective_Parms
{
	class APawn*                                       Instigator;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.GameObjective.GetNumDefenders
// Flags: 
struct AGameObjective_execGetNumDefenders_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.TellBotHowToDisable
// Flags: 
struct AGameObjective_execTellBotHowToDisable_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.GetHumanReadableName
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execGetHumanReadableName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.GameObjective.OwnsDefenseScript
// Flags: 
struct AGameObjective_execOwnsDefenseScript_Parms
{
	class AUnrealScriptedSequence*                     S;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.Timer
// Flags: 
struct AGameObjective_execTimer_Parms
{
};

// Function UnrealGame.GameObjective.NearObjective
// Flags: 
struct AGameObjective_execNearObjective_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.BotNearObjective
// Flags: 
struct AGameObjective_execBotNearObjective_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.PlayAlarm
// Flags: 
struct AGameObjective_execPlayAlarm_Parms
{
};

// Function UnrealGame.GameObjective.UpdateLocationName
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execUpdateLocationName_Parms
{
};

// Function UnrealGame.GameObjective.ForceBegin
// Flags: 
struct AGameObjective_execForceBegin_Parms
{
};

// Function UnrealGame.GameObjective.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct AGameObjective_execPostBeginPlay_Parms
{
	class AGameObjective*                              o;                                                		// 0x0000 ( 0x0004
	class AGameObjective*                              CurrentObjective;                                 		// 0x0004 ( 0x0004
	class AAssaultPath*                                A;                                                		// 0x0008 ( 0x0004
	class AUnrealScriptedSequence*                     W;                                                		// 0x000C ( 0x0004
	class AActor*                                      ac;                                               		// 0x0010 ( 0x0004
	class ANavigationPoint*                            N;                                                		// 0x0014 ( 0x0004
};

// Function UnrealGame.GameObjective.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AGameObjective_eventPreBeginPlay_Parms
{
};

// Function UnrealGame.GameObjective.CanDoubleJump
// Flags: 
struct AGameObjective_execCanDoubleJump_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObjective.GetDifficulty
// Flags: 
struct AGameObjective_execGetDifficulty_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.JumpSpot.TryTranslocator
// Flags: 
struct AJumpSpot_execTryTranslocator_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        B;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.JumpSpot.SuggestMovePreparation
// Flags: [ FUNC_Event ]
struct AJumpSpot_eventSuggestMovePreparation_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Num;                                              		// 0x0008 ( 0x0004
//	class ABot*                                        B;                                                		// 0x000C ( 0x0004
//	float                                              RealJumpZ;                                        		// 0x0010 ( 0x0004
//	float                                              RealGroundSpeed;                                  		// 0x0014 ( 0x0004
//	struct FVector                                     DodgeV;                                           		// 0x0018 ( 0x000C
//	struct FVector                                     Dir;                                              		// 0x0024 ( 0x000C
};

// Function UnrealGame.JumpSpot.SpecialCost
// Flags: [ FUNC_Event ]
struct AJumpSpot_eventSpecialCost_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UReachSpec*                                  Path;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Num;                                              		// 0x000C ( 0x0004
//	struct FVector                                     DodgeV;                                           		// 0x0010 ( 0x000C
//	float                                              AllowedJumpZ;                                     		// 0x001C ( 0x0004
//	float                                              RealGroundSpeed;                                  		// 0x0020 ( 0x0004
};

// Function UnrealGame.JumpSpot.EffectiveDoubleJump
// Flags: 
struct AJumpSpot_execEffectiveDoubleJump_Parms
{
	class UReachSpec*                                  Path;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.JumpSpot.CanDoubleJump
// Flags: 
struct AJumpSpot_execCanDoubleJump_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.JumpSpot.CanMakeJump
// Flags: 
struct AJumpSpot_execCanMakeJump_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              JumpHeight;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              GroundSpeed;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Num;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	class AActor*                                      Start;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bForceCheck:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     V;                                                		// 0x001C ( 0x000C
//	struct FVector                                     S;                                                		// 0x0028 ( 0x000C
};

// Function UnrealGame.JumpSpot.PostBeginPlay
// Flags: 
struct AJumpSpot_execPostBeginPlay_Parms
{
};

// Function UnrealGame.GameObject.LogReturned
// Flags: 
struct AGameObject_execLogReturned_Parms
{
};

// Function UnrealGame.GameObject.LogDropped
// Flags: 
struct AGameObject_execLogDropped_Parms
{
};

// Function UnrealGame.GameObject.LogTaken
// Flags: 
struct AGameObject_execLogTaken_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.GameObject.BaseChange
// Flags: [ FUNC_Simulated ]
struct AGameObject_execBaseChange_Parms
{
};

// Function UnrealGame.GameObject.Landed
// Flags: 
struct AGameObject_execLanded_Parms
{
	struct FVector                                     HitNormall;                                       		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x000C ( 0x0004
};

// Function UnrealGame.GameObject.NotReachableBy
// Flags: [ FUNC_Event ]
struct AGameObject_eventNotReachableBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.GameObject.FellOutOfWorld
// Flags: [ FUNC_Event ]
struct AGameObject_eventFellOutOfWorld_Parms
{
	unsigned char                                      KillType;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.GameObject.Touch
// Flags: 
struct AGameObject_execTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.GameObject.ValidHolder
// Flags: 
struct AGameObject_execValidHolder_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       P;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.GameObject.IsHome
// Flags: 
struct AGameObject_execIsHome_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObject.Position
// Flags: 
struct AGameObject_execPosition_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObject.SetDisable
// Flags: 
struct AGameObject_execSetDisable_Parms
{
	unsigned long                                      Disable:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.GameObject.ClearHolder
// Flags: 
struct AGameObject_execClearHolder_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	class AGameReplicationInfo*                        GRI;                                              		// 0x0004 ( 0x0004
};

// Function UnrealGame.GameObject.CalcSetHome
// Flags: 
struct AGameObject_execCalcSetHome_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.GameObject.SendHomeDisabled
// Flags: 
struct AGameObject_execSendHomeDisabled_Parms
{
	float                                              TimeOut;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.GameObject.SendHome
// Flags: 
struct AGameObject_execSendHome_Parms
{
};

// Function UnrealGame.GameObject.Drop
// Flags: 
struct AGameObject_execDrop_Parms
{
	struct FVector                                     NewVel;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FString                                     sReason;                                          		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.GameObject.Score
// Flags: 
struct AGameObject_execScore_Parms
{
};

// Function UnrealGame.GameObject.SetHolder
// Flags: 
struct AGameObject_execSetHolder_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.GameObject.CanBePickedUpBy
// Flags: 
struct AGameObject_execCanBePickedUpBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObject.CanBeThrownBy
// Flags: 
struct AGameObject_execCanBeThrownBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.GameObject.ForceBegin
// Flags: 
struct AGameObject_execForceBegin_Parms
{
};

// Function UnrealGame.GameObject.PostBeginPlay
// Flags: 
struct AGameObject_execPostBeginPlay_Parms
{
};

// Function UnrealGame.TeamPlayerReplicationInfo.AddVehicleDeathDriving
// Flags: 
struct ATeamPlayerReplicationInfo_execAddVehicleDeathDriving_Parms
{
	class UClass*                                      V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	struct FVehicleStats                               NewVehicleStats;                                  		// 0x0008 ( 0x0010
};

// Function UnrealGame.TeamPlayerReplicationInfo.AddVehicleDeath
// Flags: 
struct ATeamPlayerReplicationInfo_execAddVehicleDeath_Parms
{
	class UClass*                                      D;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      V;                                                		// 0x0004 ( 0x0004
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FVehicleStats                               NewVehicleStats;                                  		// 0x000C ( 0x0010
};

// Function UnrealGame.TeamPlayerReplicationInfo.AddVehicleKill
// Flags: 
struct ATeamPlayerReplicationInfo_execAddVehicleKill_Parms
{
	class UClass*                                      D;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      V;                                                		// 0x0004 ( 0x0004
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FVehicleStats                               NewVehicleStats;                                  		// 0x000C ( 0x0010
};

// Function UnrealGame.TeamPlayerReplicationInfo.UpdateVehicleStats
// Flags: [ FUNC_Simulated ]
struct ATeamPlayerReplicationInfo_execUpdateVehicleStats_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      V;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                newKills;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                newDeaths;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                newDeathsDriving;                                 		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0014 ( 0x0004
	struct FVehicleStats                               NewVehicleStats;                                  		// 0x0018 ( 0x0010
};

// Function UnrealGame.TeamPlayerReplicationInfo.AddWeaponDeathHolding
// Flags: 
struct ATeamPlayerReplicationInfo_execAddWeaponDeathHolding_Parms
{
	class UClass*                                      W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	struct FWeaponStats                                NewWeaponStats;                                   		// 0x0008 ( 0x0010
};

// Function UnrealGame.TeamPlayerReplicationInfo.AddWeaponDeath
// Flags: 
struct ATeamPlayerReplicationInfo_execAddWeaponDeath_Parms
{
	class UClass*                                      D;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      W;                                                		// 0x0004 ( 0x0004
	class UClass*                                      LastWeapon;                                       		// 0x0008 ( 0x0004
	int                                                i;                                                		// 0x000C ( 0x0004
	struct FWeaponStats                                NewWeaponStats;                                   		// 0x0010 ( 0x0010
	class AVehicle*                                    DrivenVehicle;                                    		// 0x0020 ( 0x0004
};

// Function UnrealGame.TeamPlayerReplicationInfo.AddWeaponKill
// Flags: 
struct ATeamPlayerReplicationInfo_execAddWeaponKill_Parms
{
	class UClass*                                      D;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      W;                                                		// 0x0004 ( 0x0004
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FWeaponStats                                NewWeaponStats;                                   		// 0x000C ( 0x0010
};

// Function UnrealGame.TeamPlayerReplicationInfo.UpdateWeaponStats
// Flags: [ FUNC_Simulated ]
struct ATeamPlayerReplicationInfo_execUpdateWeaponStats_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      W;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                newKills;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                newDeaths;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                newDeathsHolding;                                 		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0014 ( 0x0004
	struct FWeaponStats                                NewWeaponStats;                                   		// 0x0018 ( 0x0010
};

// Function UnrealGame.TeamPlayerReplicationInfo.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct ATeamPlayerReplicationInfo_execPostBeginPlay_Parms
{
};

// Function UnrealGame.SpecialVehicleObjective.Reset
// Flags: 
struct ASpecialVehicleObjective_execReset_Parms
{
};

// Function UnrealGame.SpecialVehicleObjective.UnTrigger
// Flags: 
struct ASpecialVehicleObjective_execUnTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SpecialVehicleObjective.Trigger
// Flags: 
struct ASpecialVehicleObjective_execTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SpecialVehicleObjective.IsAccessibleTo
// Flags: 
struct ASpecialVehicleObjective_execIsAccessibleTo_Parms
{
	class APawn*                                       BotPawn;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.SpecialVehicleObjective.PostBeginPlay
// Flags: 
struct ASpecialVehicleObjective_execPostBeginPlay_Parms
{
	class AUnrealMPGameInfo*                           G;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.DMStatsScreen.NextStats
// Flags: 
struct ADMStatsScreen_execNextStats_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                j;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.DMStatsScreen.DrawScoreboard
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct ADMStatsScreen_eventDrawScoreboard_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                j;                                                		// 0x0008 ( 0x0004
	int                                                temp;                                             		// 0x000C ( 0x0004
	int                                                AwardsNum;                                        		// 0x0010 ( 0x0004
	int                                                CombosNum;                                        		// 0x0014 ( 0x0004
	int                                                GoalsNum;                                         		// 0x0018 ( 0x0004
	int                                                Ordered[ 0x14 ];                                  		// 0x001C ( 0x0050
	float                                              OffsetY;                                          		// 0x006C ( 0x0004
	float                                              AwardsOffsetY;                                    		// 0x0070 ( 0x0004
	float                                              CombosOffsetY;                                    		// 0x0074 ( 0x0004
	float                                              GoalsOffsetY;                                     		// 0x0078 ( 0x0004
	float                                              CombatOffsetY;                                    		// 0x007C ( 0x0004
	float                                              WeaponsOffsetY;                                   		// 0x0080 ( 0x0004
	float                                              VehiclesOffsetY;                                  		// 0x0084 ( 0x0004
	float                                              AwardsBoxSizeY;                                   		// 0x0088 ( 0x0004
	float                                              CombosBoxSizeY;                                   		// 0x008C ( 0x0004
	float                                              GoalsBoxSizeY;                                    		// 0x0090 ( 0x0004
	float                                              CombatBoxSizeY;                                   		// 0x0094 ( 0x0004
	float                                              WeaponsBoxSizeY;                                  		// 0x0098 ( 0x0004
	float                                              VehiclesBoxSizeY;                                 		// 0x009C ( 0x0004
	float                                              XL;                                               		// 0x00A0 ( 0x0004
	float                                              LargeYL;                                          		// 0x00A4 ( 0x0004
	float                                              IndentX;                                          		// 0x00A8 ( 0x0004
	float                                              AwardWidth;                                       		// 0x00AC ( 0x0004
	float                                              WeaponWidth;                                      		// 0x00B0 ( 0x0004
	float                                              AwardX;                                           		// 0x00B4 ( 0x0004
	float                                              AwardsBoxX;                                       		// 0x00B8 ( 0x0004
	float                                              CombatBoxX;                                       		// 0x00BC ( 0x0004
	float                                              GoalsBoxX;                                        		// 0x00C0 ( 0x0004
	float                                              CombosBoxX;                                       		// 0x00C4 ( 0x0004
};

// Function UnrealGame.DMStatsScreen.MakeColorCode
// Flags: 
struct ADMStatsScreen_execMakeColorCode_Parms
{
	class FColor                                       NewColor;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealVoiceReplicationInfo.DestroyVoiceChannel
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execDestroyVoiceChannel_Parms
{
	class AVoiceChatRoom*                              Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealVoiceReplicationInfo.CreateNewVoiceChannel
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execCreateNewVoiceChannel_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AVoiceChatRoom*                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.IsMember
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execIsMember_Parms
{
	class APlayerReplicationInfo*                      TestPRI;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelIndex;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bNoCascade:1;                                     		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVoiceChatRoom*                              VCR;                                              		// 0x0010 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetPlayerChannelCount
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetPlayerChannelCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< class AVoiceChatRoom* >              Arr;                                              		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetPublicChannelCount
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetPublicChannelCount_Parms
{
	unsigned long                                      bSingleTeam:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                cnt;                                              		// 0x000C ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetPlayerChannels
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetPlayerChannels_Parms
{
	class TArray< class AVoiceChatRoom* >              ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class TArray< class AVoiceChatRoom* >              Rooms;                                            		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetPublicChannels
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetPublicChannels_Parms
{
	class TArray< class AVoiceChatRoom* >              ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class TArray< class AVoiceChatRoom* >              Rooms;                                            		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetChannelIndex
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealVoiceReplicationInfo_eventGetChannelIndex_Parms
{
	struct FString                                     ChannelTitle;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TeamIndex;                                        		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetChannelCount
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealVoiceReplicationInfo_eventGetChannelCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetChannels
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetChannels_Parms
{
	class TArray< class AVoiceChatRoom* >              ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetMemberChannels
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetMemberChannels_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class TArray< int >                                ChannelIndexArray;                                		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x001C ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetChannelMembersAt
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetChannelMembersAt_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class AVoiceChatRoom*                              Room;                                             		// 0x0010 ( 0x0004
//	class TArray< class APlayerReplicationInfo* >      Members;                                          		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< int >                                MemberIds;                                        		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x002C ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetChannelMembers
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetChannelMembers_Parms
{
	struct FString                                     ChatRoomName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TeamIndex;                                        		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class TArray< int >                                ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class AVoiceChatRoom*                              Room;                                             		// 0x001C ( 0x0004
//	class TArray< class APlayerReplicationInfo* >      Members;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< int >                                MemberIds;                                        		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0038 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetChannelAt
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetChannelAt_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AVoiceChatRoom*                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.GetChannel
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execGetChannel_Parms
{
	struct FString                                     ChatRoomName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TeamIndex;                                        		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AVoiceChatRoom*                              ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.RemoveVoiceChannel
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execRemoveVoiceChannel_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVoiceChatRoom*                              VCR;                                              		// 0x0008 ( 0x0004
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.AddVoiceChannel
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execAddVoiceChannel_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AVoiceChatRoom*                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                cnt;                                              		// 0x000C ( 0x0004
//	class AVoiceChatRoom*                              VCR;                                              		// 0x0010 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.LeaveChannel
// Flags: 
struct AUnrealVoiceReplicationInfo_execLeaveChannel_Parms
{
	struct FString                                     ChannelTitle;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVoiceChatRoom*                              VCR;                                              		// 0x0014 ( 0x0004
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.JoinChannelAt
// Flags: 
struct AUnrealVoiceReplicationInfo_execJoinChannelAt_Parms
{
	int                                                ChannelIndex;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Password;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ReturnValue;                                      		// 0x0014 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVoiceChatRoom*                              VCR;                                              		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.JoinChannel
// Flags: 
struct AUnrealVoiceReplicationInfo_execJoinChannel_Parms
{
	struct FString                                     ChannelTitle;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     Password;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ReturnValue;                                      		// 0x001C ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVoiceChatRoom*                              VCR;                                              		// 0x0020 ( 0x0004
//	int                                                i;                                                		// 0x0024 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.CanJoinChannel
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execCanJoinChannel_Parms
{
	struct FString                                     ChannelTitle;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVoiceChatRoom*                              VCR;                                              		// 0x0014 ( 0x0004
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.RemoveVoiceChatter
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execRemoveVoiceChatter_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.AddVoiceChatter
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execAddVoiceChatter_Parms
{
	class APlayerReplicationInfo*                      NewPRI;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealVoiceReplicationInfo.InitChannels
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execInitChannels_Parms
{
	class AVoiceChatRoom*                              VCR;                                              		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.SetGRI
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealVoiceReplicationInfo_eventSetGRI_Parms
{
	class AGameReplicationInfo*                        NewGRI;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealVoiceReplicationInfo.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealVoiceReplicationInfo_eventPostNetBeginPlay_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealVoiceReplicationInfo.PostBeginPlay
// Flags: [ FUNC_Event ]
struct AUnrealVoiceReplicationInfo_eventPostBeginPlay_Parms
{
};

// Function UnrealGame.UnrealVoiceReplicationInfo.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct AUnrealVoiceReplicationInfo_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                i;                                                		// 0x000C ( 0x0004
	int                                                j;                                                		// 0x0010 ( 0x0004
	class TArray< class AVoiceChatRoom* >              Rooms;                                            		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< class APlayerReplicationInfo* >      Members;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     TeamString;                                       		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.Bot.ShouldPerformScript
// Flags: 
struct ABot_execShouldPerformScript_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.ScriptingOverridesAI
// Flags: 
struct ABot_execScriptingOverridesAI_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.SetNewScript
// Flags: 
struct ABot_execSetNewScript_Parms
{
	class AScriptedSequence*                           NewScript;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.SetEnemyReaction
// Flags: 
struct ABot_execSetEnemyReaction_Parms
{
	int                                                AlertnessLevel;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.IsShootingObjective
// Flags: 
struct ABot_execIsShootingObjective_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.Stopped
// Flags: 
struct ABot_execStopped_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.FindViewSpot
// Flags: 
struct ABot_execFindViewSpot_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.IsHunting
// Flags: 
struct ABot_execIsHunting_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.IsStrafing
// Flags: 
struct ABot_execIsStrafing_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.DefendMelee
// Flags: 
struct ABot_execDefendMelee_Parms
{
	float                                              dist;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.DoRetreat
// Flags: 
struct ABot_execDoRetreat_Parms
{
};

// Function UnrealGame.Bot.DoTacticalMove
// Flags: 
struct ABot_execDoTacticalMove_Parms
{
};

// Function UnrealGame.Bot.DoCharge
// Flags: 
struct ABot_execDoCharge_Parms
{
};

// Function UnrealGame.Bot.DoStakeOut
// Flags: 
struct ABot_execDoStakeOut_Parms
{
};

// Function UnrealGame.Bot.LoseEnemy
// Flags: 
struct ABot_execLoseEnemy_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.LostContact
// Flags: 
struct ABot_execLostContact_Parms
{
	float                                              MaxTime;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.GetDesiredOffset
// Flags: 
struct ABot_execGetDesiredOffset_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.ForceCelebrate
// Flags: 
struct ABot_execForceCelebrate_Parms
{
	unsigned long                                      bRealCrouch:1;                                    		// 0x0000 ( 0x0004 [0x00000001]
};

// Function UnrealGame.Bot.ForceGiveWeapon
// Flags: 
struct ABot_execForceGiveWeapon_Parms
{
	struct FVector                                     TossVel;                                          		// 0x0000 ( 0x000C
	struct FVector                                     LeaderVel;                                        		// 0x000C ( 0x000C
};

// Function UnrealGame.Bot.Celebrate
// Flags: 
struct ABot_execCelebrate_Parms
{
};

// Function UnrealGame.Bot.RecoverFromBadStateCode
// Flags: [ FUNC_Event ]
struct ABot_eventRecoverFromBadStateCode_Parms
{
};

// Function UnrealGame.Bot.Formation
// Flags: 
struct ABot_execFormation_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.IsRetreating
// Flags: 
struct ABot_execIsRetreating_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.damageAttitudeTo
// Flags: 
struct ABot_execdamageAttitudeTo_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Damage;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.SuperPickupNotSpokenFor
// Flags: 
struct ABot_execSuperPickupNotSpokenFor_Parms
{
	class APickup*                                     P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        CurrentOwner;                                     		// 0x0008 ( 0x0004
};

// Function UnrealGame.Bot.SuperDesireability
// Flags: [ FUNC_Event ]
struct ABot_eventSuperDesireability_Parms
{
	class APickup*                                     P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.Desireability
// Flags: [ FUNC_Event ]
struct ABot_eventDesireability_Parms
{
	class APickup*                                     P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.NeedWeapon
// Flags: 
struct ABot_execNeedWeapon_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AInventory*                                  Inv;                                              		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.WanderOrCamp
// Flags: 
struct ABot_execWanderOrCamp_Parms
{
	unsigned long                                      bMayCrouch:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.Bot.FaceActor
// Flags: 
struct ABot_execFaceActor_Parms
{
	float                                              StrafingModifier;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              RelativeDir;                                      		// 0x0008 ( 0x0004
//	float                                              dist;                                             		// 0x000C ( 0x0004
//	float                                              minDist;                                          		// 0x0010 ( 0x0004
//	class AActor*                                      SquadFace;                                        		// 0x0014 ( 0x0004
//	class AActor*                                      N;                                                		// 0x0018 ( 0x0004
//	unsigned long                                      bEnemyNotEngaged:1;                               		// 0x001C ( 0x0004 [0x00000001]
//	unsigned long                                      bTranslocTactics:1;                               		// 0x0020 ( 0x0004 [0x00000001]
//	unsigned long                                      bCatchup:1;                                       		// 0x0024 ( 0x0004 [0x00000001]
};

// Function UnrealGame.Bot.AlternateTranslocDest
// Flags: 
struct ABot_execAlternateTranslocDest_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.ShouldStrafeTo
// Flags: 
struct ABot_execShouldStrafeTo_Parms
{
	class AActor*                                      WayPoint;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ANavigationPoint*                            N;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.Bot.FaceMoveTarget
// Flags: 
struct ABot_execFaceMoveTarget_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.NotifyKilled
// Flags: 
struct ABot_execNotifyKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       KilledPawn;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.TryToDuck
// Flags: 
struct ABot_execTryToDuck_Parms
{
	struct FVector                                     duckDir;                                          		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bReversed:1;                                      		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     HitLocation;                                      		// 0x0014 ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0020 ( 0x000C
//	struct FVector                                     Extent;                                           		// 0x002C ( 0x000C
//	struct FVector                                     Start;                                            		// 0x0038 ( 0x000C
//	class AActor*                                      HitActor;                                         		// 0x0044 ( 0x0004
//	unsigned long                                      bSuccess:1;                                       		// 0x0048 ( 0x0004 [0x00000001]
//	unsigned long                                      bDuckLeft:1;                                      		// 0x004C ( 0x0004 [0x00000001]
//	unsigned long                                      bWallHit:1;                                       		// 0x0050 ( 0x0004 [0x00000001]
//	unsigned long                                      bChangeStrafe:1;                                  		// 0x0054 ( 0x0004 [0x00000001]
//	float                                              minDist;                                          		// 0x0058 ( 0x0004
//	float                                              dist;                                             		// 0x005C ( 0x0004
};

// Function UnrealGame.Bot.ChangeStrafe
// Flags: 
struct ABot_execChangeStrafe_Parms
{
};

// Function UnrealGame.Bot.TryWallDodge
// Flags: 
struct ABot_execTryWallDodge_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AActor*                                      HitActor;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     X;                                                		// 0x0014 ( 0x000C
//	struct FVector                                     Y;                                                		// 0x0020 ( 0x000C
//	struct FVector                                     Z;                                                		// 0x002C ( 0x000C
//	struct FVector                                     Dir;                                              		// 0x0038 ( 0x000C
//	struct FVector                                     TargetDir;                                        		// 0x0044 ( 0x000C
//	struct FVector                                     NewHitNormal;                                     		// 0x0050 ( 0x000C
//	struct FVector                                     HitLocation;                                      		// 0x005C ( 0x000C
//	struct FVector                                     Extent;                                           		// 0x0068 ( 0x000C
//	float                                              DP;                                               		// 0x0074 ( 0x0004
//	class AActor*                                      NewHitActor;                                      		// 0x0078 ( 0x0004
};

// Function UnrealGame.Bot.MissedDodge
// Flags: [ FUNC_Event ]
struct ABot_eventMissedDodge_Parms
{
	class AActor*                                      HitActor;                                         		// 0x0000 ( 0x0004
	struct FVector                                     HitNormal;                                        		// 0x0004 ( 0x000C
	struct FVector                                     HitLocation;                                      		// 0x0010 ( 0x000C
	struct FVector                                     Extent;                                           		// 0x001C ( 0x000C
	struct FVector                                     Vel2D;                                            		// 0x0028 ( 0x000C
};

// Function UnrealGame.Bot.NotifyFallingHitWall
// Flags: [ FUNC_Event ]
struct ABot_eventNotifyFallingHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AActor*                                      HitActor;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.ReceiveWarning
// Flags: 
struct ABot_execReceiveWarning_Parms
{
	class APawn*                                       shooter;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              projSpeed;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     FireDir;                                          		// 0x0008 ( 0x000C[ CPF_Parm ]
	float                                              enemyDist;                                        		// 0x0014 ( 0x0004
	float                                              projTime;                                         		// 0x0018 ( 0x0004
	struct FVector                                     X;                                                		// 0x001C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0028 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0034 ( 0x000C
	struct FVector                                     enemyDir;                                         		// 0x0040 ( 0x000C
	unsigned long                                      bResult:1;                                        		// 0x004C ( 0x0004 [0x00000001]
};

// Function UnrealGame.Bot.NotifyTakeHit
// Flags: 
struct ABot_execNotifyTakeHit_Parms
{
	class APawn*                                       instigatedBy;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	int                                                Damage;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.Bot.ReceiveProjectileWarning
// Flags: 
struct ABot_execReceiveProjectileWarning_Parms
{
	class AProjectile*                                 proj;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              enemyDist;                                        		// 0x0004 ( 0x0004
	float                                              projTime;                                         		// 0x0008 ( 0x0004
	struct FVector                                     X;                                                		// 0x000C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0018 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0024 ( 0x000C
	struct FVector                                     enemyDir;                                         		// 0x0030 ( 0x000C
};

// Function UnrealGame.Bot.DelayedWarning
// Flags: [ FUNC_Event ]
struct ABot_eventDelayedWarning_Parms
{
	struct FVector                                     X;                                                		// 0x0000 ( 0x000C
	struct FVector                                     Y;                                                		// 0x000C ( 0x000C
	struct FVector                                     Z;                                                		// 0x0018 ( 0x000C
	struct FVector                                     Dir;                                              		// 0x0024 ( 0x000C
	struct FVector                                     LineDist;                                         		// 0x0030 ( 0x000C
	struct FVector                                     FuturePos;                                        		// 0x003C ( 0x000C
	struct FVector                                     HitLocation;                                      		// 0x0048 ( 0x000C
	struct FVector                                     HitNormal;                                        		// 0x0054 ( 0x000C
	class AActor*                                      HitActor;                                         		// 0x0060 ( 0x0004
	float                                              dist;                                             		// 0x0064 ( 0x0004
};

// Function UnrealGame.Bot.AdjustAim
// Flags: 
struct ABot_execAdjustAim_Parms
{
	struct FFireProperties                             FiredAmmunition;                                  		// 0x0000 ( 0x0014[ CPF_Parm ]
	struct FVector                                     projStart;                                        		// 0x0014 ( 0x000C[ CPF_Parm ]
	int                                                AimError;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FRotator                                    FireRotation;                                     		// 0x0030 ( 0x000C
//	struct FRotator                                    TargetLook;                                       		// 0x003C ( 0x000C
//	float                                              FireDist;                                         		// 0x0048 ( 0x0004
//	float                                              TargetDist;                                       		// 0x004C ( 0x0004
//	float                                              projSpeed;                                        		// 0x0050 ( 0x0004
//	float                                              TravelTime;                                       		// 0x0054 ( 0x0004
//	class AActor*                                      HitActor;                                         		// 0x0058 ( 0x0004
//	struct FVector                                     FireSpot;                                         		// 0x005C ( 0x000C
//	struct FVector                                     FireDir;                                          		// 0x0068 ( 0x000C
//	struct FVector                                     TargetVel;                                        		// 0x0074 ( 0x000C
//	struct FVector                                     HitLocation;                                      		// 0x0080 ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x008C ( 0x000C
//	int                                                realYaw;                                          		// 0x0098 ( 0x0004
//	unsigned long                                      bDefendMelee:1;                                   		// 0x009C ( 0x0004 [0x00000001]
//	unsigned long                                      bClean:1;                                         		// 0x00A0 ( 0x0004 [0x00000001]
//	unsigned long                                      bLeadTargetNow:1;                                 		// 0x00A4 ( 0x0004 [0x00000001]
};

// Function UnrealGame.Bot.AdjustAimError
// Flags: 
struct ABot_execAdjustAimError_Parms
{
	float                                              AimError;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              TargetDist;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bDefendMelee:1;                                   		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bInstantProj:1;                                   		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bLeadTargetNow:1;                                 		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              aimdist;                                          		// 0x0018 ( 0x0004
//	float                                              desireddist;                                      		// 0x001C ( 0x0004
//	float                                              NewAngle;                                         		// 0x0020 ( 0x0004
//	struct FVector                                     VelDir;                                           		// 0x0024 ( 0x000C
//	struct FVector                                     AccelDir;                                         		// 0x0030 ( 0x000C
};

// Function UnrealGame.Bot.CheckFutureSight
// Flags: 
struct ABot_execCheckFutureSight_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     FutureLoc;                                        		// 0x0008 ( 0x000C
};

// Function UnrealGame.Bot.NearWall
// Flags: 
struct ABot_execNearWall_Parms
{
	float                                              walldist;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      HitActor;                                         		// 0x0008 ( 0x0004
//	struct FVector                                     HitLocation;                                      		// 0x000C ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0018 ( 0x000C
//	struct FVector                                     ViewSpot;                                         		// 0x0024 ( 0x000C
//	struct FVector                                     ViewDist;                                         		// 0x0030 ( 0x000C
//	struct FVector                                     LookDir;                                          		// 0x003C ( 0x000C
};

// Function UnrealGame.Bot.NeedToTurn
// Flags: 
struct ABot_execNeedToTurn_Parms
{
	struct FVector                                     targ;                                             		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.FindBestPathToward
// Flags: 
struct ABot_execFindBestPathToward_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bCheckedReach:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bAllowDetour:1;                                   		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVehicle*                                    VBase;                                            		// 0x0010 ( 0x0004
};

// Function UnrealGame.Bot.AllowDetourTo
// Flags: [ FUNC_Event ]
struct ABot_eventAllowDetourTo_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.SetRouteToGoal
// Flags: 
struct ABot_execSetRouteToGoal_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.StartMoveToward
// Flags: 
struct ABot_execStartMoveToward_Parms
{
	class AActor*                                      o;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.NotifyPostLanded
// Flags: [ FUNC_Event ]
struct ABot_eventNotifyPostLanded_Parms
{
};

// Function UnrealGame.Bot.NotifyLanded
// Flags: 
struct ABot_execNotifyLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     Vel2D;                                            		// 0x0010 ( 0x000C
};

// Function UnrealGame.Bot.SetFall
// Flags: 
struct ABot_execSetFall_Parms
{
};

// Function UnrealGame.Bot.PriorityObjective
// Flags: 
struct ABot_execPriorityObjective_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.NotifyBump
// Flags: [ FUNC_Event ]
struct ABot_eventNotifyBump_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       P;                                                		// 0x0008 ( 0x0004
//	class AVehicle*                                    V;                                                		// 0x000C ( 0x0004
};

// Function UnrealGame.Bot.DirectedWander
// Flags: 
struct ABot_execDirectedWander_Parms
{
	struct FVector                                     WanderDir;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function UnrealGame.Bot.AdjustAround
// Flags: 
struct ABot_execAdjustAround_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Speed;                                            		// 0x0008 ( 0x0004
//	struct FVector                                     VelDir;                                           		// 0x000C ( 0x000C
//	struct FVector                                     OtherDir;                                         		// 0x0018 ( 0x000C
//	struct FVector                                     SideDir;                                          		// 0x0024 ( 0x000C
};

// Function UnrealGame.Bot.ClearPathFor
// Flags: 
struct ABot_execClearPathFor_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.CancelCampFor
// Flags: 
struct ABot_execCancelCampFor_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.CheckPathToGoalAround
// Flags: 
struct ABot_execCheckPathToGoalAround_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.Restart
// Flags: 
struct ABot_execRestart_Parms
{
};

// Function UnrealGame.Bot.TestDirection
// Flags: 
struct ABot_execTestDirection_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     pick;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     HitLocation;                                      		// 0x001C ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0028 ( 0x000C
//	struct FVector                                     dist;                                             		// 0x0034 ( 0x000C
//	class AActor*                                      HitActor;                                         		// 0x0040 ( 0x0004
};

// Function UnrealGame.Bot.FindRoamDest
// Flags: 
struct ABot_execFindRoamDest_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      BestPath;                                         		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.SoakStop
// Flags: [ FUNC_Event ]
struct ABot_eventSoakStop_Parms
{
	struct FString                                     problem;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class AUnrealPlayer*                               PC;                                               		// 0x000C ( 0x0004
};

// Function UnrealGame.Bot.PickRetreatDestination
// Flags: 
struct ABot_execPickRetreatDestination_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      BestPath;                                         		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.FindInventoryGoal
// Flags: 
struct ABot_execFindInventoryGoal_Parms
{
	float                                              BestWeight;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      BestPath;                                         		// 0x0008 ( 0x0004
};

// Function UnrealGame.Bot.FindSuperPickup
// Flags: 
struct ABot_execFindSuperPickup_Parms
{
	float                                              MaxDist;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      BestPath;                                         		// 0x0008 ( 0x0004
//	class APickup*                                     P;                                                		// 0x000C ( 0x0004
};

// Function UnrealGame.Bot.ChooseAttackMode
// Flags: 
struct ABot_execChooseAttackMode_Parms
{
	float                                              EnemyStrength;                                    		// 0x0000 ( 0x0004
	float                                              WeaponRating;                                     		// 0x0004 ( 0x0004
	float                                              RetreatThreshold;                                 		// 0x0008 ( 0x0004
};

// Function UnrealGame.Bot.DoRangedAttackOn
// Flags: 
struct ABot_execDoRangedAttackOn_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.FightEnemy
// Flags: 
struct ABot_execFightEnemy_Parms
{
	unsigned long                                      bCanCharge:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              EnemyStrength;                                    		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     X;                                                		// 0x0008 ( 0x000C
	struct FVector                                     Y;                                                		// 0x0014 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0020 ( 0x000C
	float                                              enemyDist;                                        		// 0x002C ( 0x0004
	float                                              AdjustedCombatStyle;                              		// 0x0030 ( 0x0004
	unsigned long                                      bFarAway:1;                                       		// 0x0034 ( 0x0004 [0x00000001]
	unsigned long                                      bOldForcedCharge:1;                               		// 0x0038 ( 0x0004 [0x00000001]
};

// Function UnrealGame.Bot.VehicleFightEnemy
// Flags: 
struct ABot_execVehicleFightEnemy_Parms
{
	unsigned long                                      bCanCharge:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              EnemyStrength;                                    		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.EnemyVisible
// Flags: 
struct ABot_execEnemyVisible_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.DoWaitForLanding
// Flags: 
struct ABot_execDoWaitForLanding_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.ExecuteWhatToDoNext
// Flags: 
struct ABot_execExecuteWhatToDoNext_Parms
{
};

// Function UnrealGame.Bot.GetEnemyName
// Flags: 
struct ABot_execGetEnemyName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.Bot.GetOldEnemyName
// Flags: 
struct ABot_execGetOldEnemyName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.Bot.WhatToDoNext
// Flags: 
struct ABot_execWhatToDoNext_Parms
{
	unsigned char                                      CallingByte;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.Bot.WasKilledBy
// Flags: 
struct ABot_execWasKilledBy_Parms
{
	class AController*                                 Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.SetAlertness
// Flags: 
struct ABot_execSetAlertness_Parms
{
	float                                              NewAlertness;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.SetPeripheralVision
// Flags: 
struct ABot_execSetPeripheralVision_Parms
{
};

// Function UnrealGame.Bot.SetMaxDesiredSpeed
// Flags: 
struct ABot_execSetMaxDesiredSpeed_Parms
{
};

// Function UnrealGame.Bot.ResetSkill
// Flags: 
struct ABot_execResetSkill_Parms
{
	float                                              AdjustedYaw;                                      		// 0x0000 ( 0x0004
};

// Function UnrealGame.Bot.InitializeSkill
// Flags: 
struct ABot_execInitializeSkill_Parms
{
	float                                              InSkill;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.Possess
// Flags: 
struct ABot_execPossess_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.Reset
// Flags: 
struct ABot_execReset_Parms
{
};

// Function UnrealGame.Bot.NotifyMissedJump
// Flags: [ FUNC_Event ]
struct ABot_eventNotifyMissedJump_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004
	class AActor*                                      OldMoveTarget;                                    		// 0x0004 ( 0x0004
	struct FVector                                     Loc2D;                                            		// 0x0008 ( 0x000C
	struct FVector                                     NavLoc2D;                                         		// 0x0014 ( 0x000C
	float                                              BestDist;                                         		// 0x0020 ( 0x0004
	float                                              newdist;                                          		// 0x0024 ( 0x0004
};

// Function UnrealGame.Bot.NotifyJumpApex
// Flags: [ FUNC_Event ]
struct ABot_eventNotifyJumpApex_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C
	struct FVector                                     Dir;                                              		// 0x0018 ( 0x000C
	struct FVector                                     Extent;                                           		// 0x0024 ( 0x000C
	class AActor*                                      HitActor;                                         		// 0x0030 ( 0x0004
};

// Function UnrealGame.Bot.MayDodgeToMoveTarget
// Flags: [ FUNC_Event ]
struct ABot_eventMayDodgeToMoveTarget_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 ( 0x000C
	struct FVector                                     X;                                                		// 0x000C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0018 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0024 ( 0x000C
	struct FVector                                     DodgeV;                                           		// 0x0030 ( 0x000C
	struct FVector                                     NewDir;                                           		// 0x003C ( 0x000C
	float                                              dist;                                             		// 0x0048 ( 0x0004
	float                                              newdist;                                          		// 0x004C ( 0x0004
	float                                              RealJumpZ;                                        		// 0x0050 ( 0x0004
	class AActor*                                      OldMoveTarget;                                    		// 0x0054 ( 0x0004
};

// Function UnrealGame.Bot.NotifyPhysicsVolumeChange
// Flags: 
struct ABot_execNotifyPhysicsVolumeChange_Parms
{
	class APhysicsVolume*                              NewVolume;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     jumpDir;                                          		// 0x0008 ( 0x000C
};

// Function UnrealGame.Bot.StrafeFromDamage
// Flags: 
struct ABot_execStrafeFromDamage_Parms
{
	float                                              Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bFindDest:1;                                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.BotVoiceMessage
// Flags: 
struct ABot_execBotVoiceMessage_Parms
{
	struct FName                                       MessageType;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MessageID;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	class AController*                                 Sender;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.EnemyChanged
// Flags: 
struct ABot_execEnemyChanged_Parms
{
	unsigned long                                      bNewEnemyVisible:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.Bot.SetEnemyInfo
// Flags: 
struct ABot_execSetEnemyInfo_Parms
{
	unsigned long                                      bNewEnemyVisible:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class ABot*                                        B;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.Trigger
// Flags: 
struct ABot_execTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.RelativeStrength
// Flags: 
struct ABot_execRelativeStrength_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              compare;                                          		// 0x0008 ( 0x0004
//	int                                                adjustedOther;                                    		// 0x000C ( 0x0004
};

// Function UnrealGame.Bot.AssignSquadResponsibility
// Flags: 
struct ABot_execAssignSquadResponsibility_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.FreeScript
// Flags: 
struct ABot_execFreeScript_Parms
{
};

// Function UnrealGame.Bot.IsSniping
// Flags: 
struct ABot_execIsSniping_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.CheckIfShouldCrouch
// Flags: 
struct ABot_execCheckIfShouldCrouch_Parms
{
	struct FVector                                     StartPosition;                                    		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     TargetPosition;                                   		// 0x000C ( 0x000C[ CPF_Parm ]
	float                                              Probability;                                      		// 0x0018 ( 0x0004[ CPF_Parm ]
	class AActor*                                      HitActor;                                         		// 0x001C ( 0x0004
	struct FVector                                     HitNormal;                                        		// 0x0020 ( 0x000C
	struct FVector                                     HitLocation;                                      		// 0x002C ( 0x000C
	struct FVector                                     X;                                                		// 0x0038 ( 0x000C
	struct FVector                                     Y;                                                		// 0x0044 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0050 ( 0x000C
	struct FVector                                     projStart;                                        		// 0x005C ( 0x000C
};

// Function UnrealGame.Bot.CanStakeOut
// Flags: 
struct ABot_execCanStakeOut_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              relstr;                                           		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.ClearShot
// Flags: 
struct ABot_execClearShot_Parms
{
	struct FVector                                     TargetLoc;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bImmediateFire:1;                                 		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      bSeeTarget:1;                                     		// 0x0014 ( 0x0004 [0x00000001]
};

// Function UnrealGame.Bot.SetAttractionState
// Flags: 
struct ABot_execSetAttractionState_Parms
{
};

// Function UnrealGame.Bot.SeePlayer
// Flags: [ FUNC_Event ]
struct ABot_eventSeePlayer_Parms
{
	class APawn*                                       SeenPlayer;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.HearNoise
// Flags: 
struct ABot_execHearNoise_Parms
{
	float                                              Loudness;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      NoiseMaker;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.ClearTemporaryOrders
// Flags: 
struct ABot_execClearTemporaryOrders_Parms
{
};

// Function UnrealGame.Bot.SetTemporaryOrders
// Flags: 
struct ABot_execSetTemporaryOrders_Parms
{
	struct FName                                       NewOrders;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 OrderGiver;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.SetOrders
// Flags: 
struct ABot_execSetOrders_Parms
{
	struct FName                                       NewOrders;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 OrderGiver;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.SendMessage
// Flags: 
struct ABot_execSendMessage_Parms
{
	class APlayerReplicationInfo*                      Recipient;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       MessageType;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MessageID;                                        		// 0x0008 ( 0x0001[ CPF_Parm ]
	float                                              wait;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FName                                       BroadcastType;                                    		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.GetMessageIndex
// Flags: 
struct ABot_execGetMessageIndex_Parms
{
	struct FName                                       PhraseName;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.YellAt
// Flags: 
struct ABot_execYellAt_Parms
{
	class APawn*                                       Moron;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              threshold;                                        		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.GetOrderObject
// Flags: 
struct ABot_execGetOrderObject_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.GetOrders
// Flags: 
struct ABot_execGetOrders_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.DisplayDebug
// Flags: 
struct ABot_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	class AwWeapon*                                    Best[ 0x05 ];                                     		// 0x000C ( 0x0014
	class AwWeapon*                                    moving;                                           		// 0x0020 ( 0x0004
	class AwWeapon*                                    temp;                                             		// 0x0024 ( 0x0004
	unsigned long                                      bFound:1;                                         		// 0x0028 ( 0x0004 [0x00000001]
	int                                                i;                                                		// 0x002C ( 0x0004
	class AInventory*                                  Inv;                                              		// 0x0030 ( 0x0004
	struct FString                                     S;                                                		// 0x0034 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.Bot.CanCombo
// Flags: 
struct ABot_execCanCombo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.CanComboMoving
// Flags: 
struct ABot_execCanComboMoving_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.ProficientWithWeapon
// Flags: 
struct ABot_execProficientWithWeapon_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              proficiency;                                      		// 0x0004 ( 0x0004
};

// Function UnrealGame.Bot.WeaponPreference
// Flags: 
struct ABot_execWeaponPreference_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              WeaponStickiness;                                 		// 0x0008 ( 0x0004
};

// Function UnrealGame.Bot.ChangedWeapon
// Flags: 
struct ABot_execChangedWeapon_Parms
{
};

// Function UnrealGame.Bot.StopFiring
// Flags: 
struct ABot_execStopFiring_Parms
{
};

// Function UnrealGame.Bot.CanAttack
// Flags: 
struct ABot_execCanAttack_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.FireWeaponAt
// Flags: 
struct ABot_execFireWeaponAt_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.TimedFireWeaponAtEnemy
// Flags: 
struct ABot_execTimedFireWeaponAtEnemy_Parms
{
};

// Function UnrealGame.Bot.ShouldFireAgain
// Flags: 
struct ABot_execShouldFireAgain_Parms
{
	float                                              RefireRate;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ADestroyableObjective*                       ObjectiveTarget;                                  		// 0x0008 ( 0x0004
};

// Function UnrealGame.Bot.WeaponFireAgain
// Flags: 
struct ABot_execWeaponFireAgain_Parms
{
	float                                              RefireRate;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bFinishedFire:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.WaitForMover
// Flags: 
struct ABot_execWaitForMover_Parms
{
	class AMover*                                      M;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.ImpactJump
// Flags: 
struct ABot_execImpactJump_Parms
{
	struct FVector                                     RealDestination;                                  		// 0x0000 ( 0x000C
};

// Function UnrealGame.Bot.CanUseTranslocator
// Flags: 
struct ABot_execCanUseTranslocator_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.CanImpactJump
// Flags: 
struct ABot_execCanImpactJump_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.RateWeapon
// Flags: [ FUNC_Simulated ]
struct ABot_execRateWeapon_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.UpdatePawnViewPitch
// Flags: 
struct ABot_execUpdatePawnViewPitch_Parms
{
};

// Function UnrealGame.Bot.GetMyPlayer
// Flags: 
struct ABot_execGetMyPlayer_Parms
{
	class APawn*                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.InitPlayerReplicationInfo
// Flags: 
struct ABot_execInitPlayerReplicationInfo_Parms
{
};

// Function UnrealGame.Bot.DontReuseTaunt
// Flags: 
struct ABot_execDontReuseTaunt_Parms
{
	int                                                t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.AutoTaunt
// Flags: 
struct ABot_execAutoTaunt_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.SetCombatTimer
// Flags: 
struct ABot_execSetCombatTimer_Parms
{
};

// Function UnrealGame.Bot.Startle
// Flags: 
struct ABot_execStartle_Parms
{
	class AActor*                                      Feared;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.FearThisSpot
// Flags: 
struct ABot_execFearThisSpot_Parms
{
	class AAvoidMarker*                                aSpot;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.TryCombo
// Flags: 
struct ABot_execTryCombo_Parms
{
	struct FString                                     ComboName;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.Bot.CanDoubleJump
// Flags: 
struct ABot_execCanDoubleJump_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.GetOutOfVehicle
// Flags: 
struct ABot_execGetOutOfVehicle_Parms
{
};

// Function UnrealGame.Bot.NotifyHitWall
// Flags: [ FUNC_Event ]
struct ABot_eventNotifyHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AActor*                                      Wall;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVehicle*                                    V;                                                		// 0x0014 ( 0x0004
};

// Function UnrealGame.Bot.SetupSpecialPathAbilities
// Flags: [ FUNC_Event ]
struct ABot_eventSetupSpecialPathAbilities_Parms
{
};

// Function UnrealGame.Bot.ShouldKeepShielding
// Flags: 
struct ABot_execShouldKeepShielding_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.Bot.NotifyAddInventory
// Flags: 
struct ABot_execNotifyAddInventory_Parms
{
	class AInventory*                                  NewItem;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.Bot.HasSuperWeapon
// Flags: 
struct ABot_execHasSuperWeapon_Parms
{
	class AwWeapon*                                    ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       CheckPawn;                                        		// 0x0004 ( 0x0004
//	class AInventory*                                  Inv;                                              		// 0x0008 ( 0x0004
};

// Function UnrealGame.Bot.PostBeginPlay
// Flags: 
struct ABot_execPostBeginPlay_Parms
{
};

// Function UnrealGame.Bot.Destroyed
// Flags: 
struct ABot_execDestroyed_Parms
{
};

// Function UnrealGame.KillingSpreeMessage.ClientReceive
// Flags: [ FUNC_Simulated ]
struct AKillingSpreeMessage_execClientReceive_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.KillingSpreeMessage.GetString
// Flags: 
struct AKillingSpreeMessage_execGetString_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.KillingSpreeMessage.GetRelatedString
// Flags: 
struct AKillingSpreeMessage_execGetRelatedString_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.KillingSpreeMessage.GetFontSize
// Flags: 
struct AKillingSpreeMessage_execGetFontSize_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI1;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI2;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      LocalPlayer;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       ViewPawn;                                         		// 0x0014 ( 0x0004
};

// Function UnrealGame.DMSquad.AssignSquadResponsibility
// Flags: 
struct ADMSquad_execAssignSquadResponsibility_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       PlayerPawn;                                       		// 0x0008 ( 0x0004
//	class AController*                                 C;                                                		// 0x000C ( 0x0004
//	class AActor*                                      MoveTarget;                                       		// 0x0010 ( 0x0004
};

// Function UnrealGame.DMSquad.FriendlyToward
// Flags: 
struct ADMSquad_execFriendlyToward_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.SetEnemy
// Flags: 
struct ADMSquad_execSetEnemy_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       NewEnemy;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      bResult:1;                                        		// 0x000C ( 0x0004 [0x00000001]
};

// Function UnrealGame.DMSquad.GetOrders
// Flags: 
struct ADMSquad_execGetOrders_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.BeDevious
// Flags: 
struct ADMSquad_execBeDevious_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.NearFormationCenter
// Flags: 
struct ADMSquad_execNearFormationCenter_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.WaitAtThisPosition
// Flags: 
struct ADMSquad_execWaitAtThisPosition_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.CheckSquadObjectives
// Flags: 
struct ADMSquad_execCheckSquadObjectives_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.ShouldDeferTo
// Flags: 
struct ADMSquad_execShouldDeferTo_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.RemoveBot
// Flags: 
struct ADMSquad_execRemoveBot_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DMSquad.AddBot
// Flags: 
struct ADMSquad_execAddBot_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.DMSquad.IsDefending
// Flags: 
struct ADMSquad_execIsDefending_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.DMSquad.DisplayDebug
// Flags: 
struct ADMSquad_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     enemyList;                                        		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function UnrealGame.DMSquad.AssignCombo
// Flags: 
struct ADMSquad_execAssignCombo_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SquadAI.FriendlyToward
// Flags: 
struct ASquadAI_execFriendlyToward_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.CautiousAdvance
// Flags: 
struct ASquadAI_execCautiousAdvance_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.IsDefending
// Flags: 
struct ASquadAI_execIsDefending_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.ClearPathFor
// Flags: 
struct ASquadAI_execClearPathFor_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        B;                                                		// 0x0008 ( 0x0004
//	unsigned long                                      bForceDefer:1;                                    		// 0x000C ( 0x0004 [0x00000001]
//	struct FVector                                     Dir;                                              		// 0x0010 ( 0x000C
//	float                                              DirZ;                                             		// 0x001C ( 0x0004
};

// Function UnrealGame.SquadAI.PickRetreatDestination
// Flags: 
struct ASquadAI_execPickRetreatDestination_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.BeDevious
// Flags: 
struct ASquadAI_execBeDevious_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.DisplayDebug
// Flags: 
struct ASquadAI_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     enemyList;                                        		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function UnrealGame.SquadAI.PickBotToReassign
// Flags: 
struct ASquadAI_execPickBotToReassign_Parms
{
	class ABot*                                        ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        B;                                                		// 0x0004 ( 0x0004
//	class ABot*                                        Best;                                             		// 0x0008 ( 0x0004
//	float                                              val;                                              		// 0x000C ( 0x0004
//	float                                              BestVal;                                          		// 0x0010 ( 0x0004
//	float                                              Suitability;                                      		// 0x0014 ( 0x0004
//	float                                              BestSuitability;                                  		// 0x0018 ( 0x0004
};

// Function UnrealGame.SquadAI.BotSuitability
// Flags: 
struct ASquadAI_execBotSuitability_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.ShouldDestroyTranslocator
// Flags: 
struct ASquadAI_execShouldDestroyTranslocator_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AUnrealMPGameInfo*                           G;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.CheckSquadObjectives
// Flags: 
struct ASquadAI_execCheckSquadObjectives_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      DesiredPosition;                                  		// 0x0008 ( 0x0004
//	unsigned long                                      bInPosition:1;                                    		// 0x000C ( 0x0004 [0x00000001]
//	unsigned long                                      bMovingToSuperPickup:1;                           		// 0x0010 ( 0x0004 [0x00000001]
//	float                                              SuperDist;                                        		// 0x0014 ( 0x0004
};

// Function UnrealGame.SquadAI.OverrideFollowPlayer
// Flags: 
struct ASquadAI_execOverrideFollowPlayer_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AGameObjective*                              PickedObjective;                                  		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.CheckSpecialVehicleObjectives
// Flags: 
struct ASquadAI_execCheckSpecialVehicleObjectives_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AUnrealMPGameInfo*                           G;                                                		// 0x0008 ( 0x0004
//	class ASpecialVehicleObjective*                    o;                                                		// 0x000C ( 0x0004
//	class ASpecialVehicleObjective*                    Best;                                             		// 0x0010 ( 0x0004
};

// Function UnrealGame.SquadAI.VehicleDesireability
// Flags: 
struct ASquadAI_execVehicleDesireability_Parms
{
	class AVehicle*                                    V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        B;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Result;                                           		// 0x000C ( 0x0004
};

// Function UnrealGame.SquadAI.CheckVehicle
// Flags: 
struct ASquadAI_execCheckVehicle_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      BestPath;                                         		// 0x0008 ( 0x0004
//	class AActor*                                      BestEntry;                                        		// 0x000C ( 0x0004
//	class AVehicle*                                    SquadVehicle;                                     		// 0x0010 ( 0x0004
//	class AVehicle*                                    V;                                                		// 0x0014 ( 0x0004
//	class AVehicle*                                    MainVehicle;                                      		// 0x0018 ( 0x0004
//	float                                              newdist;                                          		// 0x001C ( 0x0004
//	float                                              BestDist;                                         		// 0x0020 ( 0x0004
//	float                                              NewRating;                                        		// 0x0024 ( 0x0004
//	float                                              BestRating;                                       		// 0x0028 ( 0x0004
//	float                                              BaseRadius;                                       		// 0x002C ( 0x0004
//	class ABot*                                        S;                                                		// 0x0030 ( 0x0004
//	class APlayerController*                           PC;                                               		// 0x0034 ( 0x0004
//	unsigned long                                      bSkip:1;                                          		// 0x0038 ( 0x0004 [0x00000001]
};

// Function UnrealGame.SquadAI.BotEnteredVehicle
// Flags: 
struct ASquadAI_execBotEnteredVehicle_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SquadAI.NeverBail
// Flags: 
struct ASquadAI_execNeverBail_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.MaxVehicleDist
// Flags: 
struct ASquadAI_execMaxVehicleDist_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.AssignSquadResponsibility
// Flags: 
struct ASquadAI_execAssignSquadResponsibility_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.AddTransientCosts
// Flags: 
struct ASquadAI_execAddTransientCosts_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              f;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class ABot*                                        S;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.AllowTaunt
// Flags: 
struct ASquadAI_execAllowTaunt_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.TellBotToFollow
// Flags: 
struct ASquadAI_execTellBotToFollow_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       Leader;                                           		// 0x000C ( 0x0004
//	class AGameObjective*                              o;                                                		// 0x0010 ( 0x0004
//	class AGameObjective*                              Best;                                             		// 0x0014 ( 0x0004
//	float                                              newdist;                                          		// 0x0018 ( 0x0004
//	float                                              BestDist;                                         		// 0x001C ( 0x0004
};

// Function UnrealGame.SquadAI.PickNewLeader
// Flags: 
struct ASquadAI_execPickNewLeader_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.SquadAI.GetSize
// Flags: 
struct ASquadAI_execGetSize_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.GetShortOrderStringFor
// Flags: [ FUNC_Simulated ]
struct ASquadAI_execGetShortOrderStringFor_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.SquadAI.GetOrderStringFor
// Flags: [ FUNC_Simulated ]
struct ASquadAI_execGetOrderStringFor_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.SquadAI.GetOrders
// Flags: 
struct ASquadAI_execGetOrders_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FName                                       NewOrders;                                        		// 0x0004 ( 0x0004
};

// Function UnrealGame.SquadAI.Retask
// Flags: 
struct ASquadAI_execRetask_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SquadAI.SetObjective
// Flags: 
struct ASquadAI_execSetObjective_Parms
{
	class AGameObjective*                              o;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bForceUpdate:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	class ABot*                                        M;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.SetFreelanceScriptFor
// Flags: 
struct ASquadAI_execSetFreelanceScriptFor_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AUnrealScriptedSequence*                     S;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.SquadAI.SetDefenseScriptFor
// Flags: 
struct ASquadAI_execSetDefenseScriptFor_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AUnrealScriptedSequence*                     S;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.SquadAI.SwitchBots
// Flags: 
struct ASquadAI_execSwitchBots_Parms
{
	class ABot*                                        MyBot;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        OtherBot;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	class ASquadAI*                                    OtherSquad;                                       		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.AddBot
// Flags: 
struct ASquadAI_execAddBot_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SquadAI.RemoveBot
// Flags: 
struct ASquadAI_execRemoveBot_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        Prev;                                             		// 0x0004 ( 0x0004
};

// Function UnrealGame.SquadAI.RemovePlayer
// Flags: 
struct ASquadAI_execRemovePlayer_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameObjective*                              NewObjective;                                     		// 0x0004 ( 0x0004
};

// Function UnrealGame.SquadAI.SetLeader
// Flags: 
struct ASquadAI_execSetLeader_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SquadAI.SetFinalStretch
// Flags: 
struct ASquadAI_execSetFinalStretch_Parms
{
	unsigned long                                      bValue:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class ABot*                                        S;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.SquadAI.FindPathToObjective
// Flags: 
struct ASquadAI_execFindPathToObjective_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      o;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        S;                                                		// 0x000C ( 0x0004
//	float                                              N;                                                		// 0x0010 ( 0x0004
//	float                                              GatherWaitTime;                                   		// 0x0014 ( 0x0004
//	class AVehicle*                                    V;                                                		// 0x0018 ( 0x0004
};

// Function UnrealGame.SquadAI.TryToIntercept
// Flags: 
struct ASquadAI_execTryToIntercept_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AActor*                                      RouteGoal;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.SetAlternatePath
// Flags: 
struct ASquadAI_execSetAlternatePath_Parms
{
	unsigned long                                      bResetSquad:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AAssaultPath*                                List[ 0x10 ];                                     		// 0x0004 ( 0x0040
	int                                                i;                                                		// 0x0044 ( 0x0004
	int                                                Num;                                              		// 0x0048 ( 0x0004
	class AAssaultPath*                                A;                                                		// 0x004C ( 0x0004
	float                                              sum;                                              		// 0x0050 ( 0x0004
	float                                              R;                                                		// 0x0054 ( 0x0004
	class ABot*                                        S;                                                		// 0x0058 ( 0x0004
};

// Function UnrealGame.SquadAI.Initialize
// Flags: 
struct ASquadAI_execInitialize_Parms
{
	class AUnrealTeamInfo*                             t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameObjective*                              o;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SquadAI.MergeWith
// Flags: 
struct ASquadAI_execMergeWith_Parms
{
	class ASquadAI*                                    S;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        B;                                                		// 0x0004 ( 0x0004
	class ABot*                                        Prev;                                             		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.CloseToLeader
// Flags: 
struct ASquadAI_execCloseToLeader_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              dist;                                             		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.NearFormationCenter
// Flags: 
struct ASquadAI_execNearFormationCenter_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      center;                                           		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.WanderNearLeader
// Flags: 
struct ASquadAI_execWanderNearLeader_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.WaitAtThisPosition
// Flags: 
struct ASquadAI_execWaitAtThisPosition_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.ShouldDeferTo
// Flags: 
struct ASquadAI_execShouldDeferTo_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.AssessThreat
// Flags: 
struct ASquadAI_execAssessThreat_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       NewThreat;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bThreatVisible:1;                                 		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              ThreatValue;                                      		// 0x0010 ( 0x0004
//	float                                              NewStrength;                                      		// 0x0014 ( 0x0004
//	float                                              dist;                                             		// 0x0018 ( 0x0004
};

// Function UnrealGame.SquadAI.UnderFire
// Flags: 
struct ASquadAI_execUnderFire_Parms
{
	class APawn*                                       NewThreat;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        Ignored;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        B;                                                		// 0x000C ( 0x0004
};

// Function UnrealGame.SquadAI.ModifyThreat
// Flags: 
struct ASquadAI_execModifyThreat_Parms
{
	float                                              Current;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       NewThreat;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bThreatVisible:1;                                 		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	class ABot*                                        B;                                                		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.FindNewEnemyFor
// Flags: 
struct ASquadAI_execFindNewEnemyFor_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSeeEnemy:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
//	class APawn*                                       BestEnemy;                                        		// 0x0010 ( 0x0004
//	class APawn*                                       OldEnemy;                                         		// 0x0014 ( 0x0004
//	unsigned long                                      bSeeNew:1;                                        		// 0x0018 ( 0x0004 [0x00000001]
//	float                                              BestThreat;                                       		// 0x001C ( 0x0004
//	float                                              NewThreat;                                        		// 0x0020 ( 0x0004
};

// Function UnrealGame.SquadAI.NotifyKilled
// Flags: 
struct ASquadAI_execNotifyKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       KilledPawn;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	class ABot*                                        B;                                                		// 0x000C ( 0x0004
};

// Function UnrealGame.SquadAI.RemoveEnemy
// Flags: 
struct ASquadAI_execRemoveEnemy_Parms
{
	class APawn*                                       E;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        B;                                                		// 0x0004 ( 0x0004
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.SquadAI.IsOnSquad
// Flags: 
struct ASquadAI_execIsOnSquad_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.PriorityObjective
// Flags: 
struct ASquadAI_execPriorityObjective_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.SetEnemy
// Flags: 
struct ASquadAI_execSetEnemy_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       NewEnemy;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ABot*                                        M;                                                		// 0x000C ( 0x0004
//	unsigned long                                      bResult:1;                                        		// 0x0010 ( 0x0004 [0x00000001]
};

// Function UnrealGame.SquadAI.ValidEnemy
// Flags: 
struct ASquadAI_execValidEnemy_Parms
{
	class APawn*                                       NewEnemy;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.AddEnemy
// Flags: 
struct ASquadAI_execAddEnemy_Parms
{
	class APawn*                                       NewEnemy;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	class ABot*                                        M;                                                		// 0x000C ( 0x0004
//	unsigned long                                      bCurrentEnemy:1;                                  		// 0x0010 ( 0x0004 [0x00000001]
};

// Function UnrealGame.SquadAI.MustKeepEnemy
// Flags: 
struct ASquadAI_execMustKeepEnemy_Parms
{
	class APawn*                                       E;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.LostEnemy
// Flags: 
struct ASquadAI_execLostEnemy_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       Lost;                                             		// 0x0008 ( 0x0004
//	unsigned long                                      bFound:1;                                         		// 0x000C ( 0x0004 [0x00000001]
//	class ABot*                                        M;                                                		// 0x0010 ( 0x0004
};

// Function UnrealGame.SquadAI.MergeEnemiesFrom
// Flags: 
struct ASquadAI_execMergeEnemiesFrom_Parms
{
	class ASquadAI*                                    S;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	unsigned long                                      bNew:1;                                           		// 0x000C ( 0x0004 [0x00000001]
//	unsigned long                                      bAdd:1;                                           		// 0x0010 ( 0x0004 [0x00000001]
};

// Function UnrealGame.SquadAI.FormationCenter
// Flags: 
struct ASquadAI_execFormationCenter_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.GetFacingRotation
// Flags: 
struct ASquadAI_execGetFacingRotation_Parms
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FRotator                                    Rot;                                              		// 0x000C ( 0x000C
};

// Function UnrealGame.SquadAI.GetLinkVehicle
// Flags: 
struct ASquadAI_execGetLinkVehicle_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.GetKeyVehicle
// Flags: 
struct ASquadAI_execGetKeyVehicle_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.SetFacingActor
// Flags: 
struct ASquadAI_execSetFacingActor_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.AllowImpactJumpBy
// Flags: 
struct ASquadAI_execAllowImpactJumpBy_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.AllowTranslocationBy
// Flags: 
struct ASquadAI_execAllowTranslocationBy_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.Destroyed
// Flags: 
struct ASquadAI_execDestroyed_Parms
{
};

// Function UnrealGame.SquadAI.GetRestingFormation
// Flags: 
struct ASquadAI_execGetRestingFormation_Parms
{
	class ARestingFormation*                           ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.AllowDetourTo
// Flags: 
struct ASquadAI_execAllowDetourTo_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ANavigationPoint*                            N;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.ShouldSuppressEnemy
// Flags: 
struct ASquadAI_execShouldSuppressEnemy_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.SquadAI.CriticalObjectiveWarning
// Flags: 
struct ASquadAI_execCriticalObjectiveWarning_Parms
{
	class APawn*                                       NewEnemy;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        M;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.SquadAI.AssignCombo
// Flags: 
struct ASquadAI_execAssignCombo_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.SquadAI.Reset
// Flags: 
struct ASquadAI_execReset_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.wViewAttacked
// Flags: 
struct AUnrealPlayer_execwViewAttacked_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     v1;                                               		// 0x0004 ( 0x000C
	int                                                i1;                                               		// 0x0010 ( 0x0004
	int                                                i2;                                               		// 0x0014 ( 0x0004
	float                                              fFixedTime;                                       		// 0x0018 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.wAttackedView
// Flags: 
struct AUnrealPlayer_execwAttackedView_Parms
{
	int                                                iPitch;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iYaw;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                iRoll;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                iDist1;                                           		// 0x000C ( 0x0004
	int                                                iDist2;                                           		// 0x0010 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.AttackedView
// Flags: 
struct AUnrealPlayer_execAttackedView_Parms
{
	int                                                iWeaponID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              fHitGunKick;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     vAttacked;                                        		// 0x0008 ( 0x000C[ CPF_Parm ]
	int                                                iPitch;                                           		// 0x0014 ( 0x0004
	int                                                iYaw;                                             		// 0x0018 ( 0x0004
	int                                                iRoll;                                            		// 0x001C ( 0x0004
	float                                              fValue;                                           		// 0x0020 ( 0x0004
	float                                              fAimRatio;                                        		// 0x0024 ( 0x0004
	struct FVector                                     ViewDir;                                          		// 0x0028 ( 0x000C
	struct FVector                                     AxisX;                                            		// 0x0034 ( 0x000C
	struct FVector                                     AxisY;                                            		// 0x0040 ( 0x000C
	struct FVector                                     AxisZ;                                            		// 0x004C ( 0x000C
	struct FVector                                     ApplyValue;                                       		// 0x0058 ( 0x000C
};

// Function UnrealGame.UnrealPlayer.RotateByAttacked
// Flags: 
struct AUnrealPlayer_execRotateByAttacked_Parms
{
	struct FVector                                     CameraLocation;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FRotator                                    CameraRotation;                                   		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FRotator                                    rTemp;                                            		// 0x0018 ( 0x000C
	float                                              f3DZoomRatio;                                     		// 0x0024 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function UnrealGame.UnrealPlayer.ClientReceiveBotDebugString
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientReceiveBotDebugString_Parms
{
	struct FString                                     DebugString;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.ServerSendBotDebugString
// Flags: 
struct AUnrealPlayer_execServerSendBotDebugString_Parms
{
};

// Function UnrealGame.UnrealPlayer.NetDebugBot
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execNetDebugBot_Parms
{
};

// Function UnrealGame.UnrealPlayer.ServerChatDebug
// Flags: 
struct AUnrealPlayer_execServerChatDebug_Parms
{
	class ABroadcastHandler*                           B;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.ClientGameEnded
// Flags: 
struct AUnrealPlayer_execClientGameEnded_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	class TArray< class AVoiceChatRoom* >              Channels;                                         		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.AutoJoinVoiceChat
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execAutoJoinVoiceChat_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                j;                                                		// 0x0004 ( 0x0004
	int                                                cnt;                                              		// 0x0008 ( 0x0004
	struct FString                                     DefaultChannel;                                   		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealPlayer_eventPostNetBeginPlay_Parms
{
};

// Function UnrealGame.UnrealPlayer.NeedNetNotify
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execNeedNetNotify_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPlayer.SetCustomRewardAnnouncerClass
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execSetCustomRewardAnnouncerClass_Parms
{
	struct FString                                     NewAnnouncerClass;                                		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.GetCustomRewardAnnouncerClass
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execGetCustomRewardAnnouncerClass_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.SetCustomStatusAnnouncerClass
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execSetCustomStatusAnnouncerClass_Parms
{
	struct FString                                     NewAnnouncerClass;                                		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.GetCustomStatusAnnouncerClass
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execGetCustomStatusAnnouncerClass_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.ShowMidGameMenu
// Flags: 
struct AUnrealPlayer_execShowMidGameMenu_Parms
{
	unsigned long                                      bPause:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ServerDropFlag
// Flags: 
struct AUnrealPlayer_execServerDropFlag_Parms
{
};

// Function UnrealGame.UnrealPlayer.DropFlag
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execDropFlag_Parms
{
};

// Function UnrealGame.UnrealPlayer.PlayWinMessage
// Flags: 
struct AUnrealPlayer_execPlayWinMessage_Parms
{
	unsigned long                                      bWinner:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ClientPlayTakeHit
// Flags: 
struct AUnrealPlayer_execClientPlayTakeHit_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned char                                      Damage;                                           		// 0x000C ( 0x0001[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.HitSound
// Flags: 
struct AUnrealPlayer_execHitSound_Parms
{
};

// Function UnrealGame.UnrealPlayer.NewClientPlayTakeHit
// Flags: 
struct AUnrealPlayer_execNewClientPlayTakeHit_Parms
{
	struct FVector                                     AttackLoc;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitLoc;                                           		// 0x000C ( 0x000C[ CPF_Parm ]
	unsigned char                                      Damage;                                           		// 0x0018 ( 0x0001[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                iWeaponID;                                        		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              fHitGunKick;                                      		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0028 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     HitDir;                                           		// 0x002C ( 0x000C
	class UwWeaponBaseParams*                          WBP;                                              		// 0x0038 ( 0x0004
	class UPlayerInput*                                pInput;                                           		// 0x003C ( 0x0004
};

// Function UnrealGame.UnrealPlayer.NotifyTakeHit
// Flags: 
struct AUnrealPlayer_execNotifyTakeHit_Parms
{
	class APawn*                                       instigatedBy;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	int                                                Damage;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                iDam;                                             		// 0x0028 ( 0x0004
	struct FVector                                     AttackLoc;                                        		// 0x002C ( 0x000C
	float                                              fHitGunKick;                                      		// 0x0038 ( 0x0004
	float                                              iWeaponID;                                        		// 0x003C ( 0x0004
	class UPlayerInput*                                pInput;                                           		// 0x0040 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.ShowLoginMenu
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execShowLoginMenu_Parms
{
	int                                                X;                                                		// 0x0000 ( 0x0004
	struct FString                                     NetworkAddress;                                   		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.UnrealPlayer.ClientReceiveLoginMenu
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientReceiveLoginMenu_Parms
{
	struct FString                                     MenuClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bForce:1;                                         		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ServerSetReadyToStart
// Flags: 
struct AUnrealPlayer_execServerSetReadyToStart_Parms
{
};

// Function UnrealGame.UnrealPlayer.InitInputSystem
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execInitInputSystem_Parms
{
};

// Function UnrealGame.UnrealPlayer.PostNetReceive
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealPlayer_eventPostNetReceive_Parms
{
};

// Function UnrealGame.UnrealPlayer.PlayStartupMessage
// Flags: 
struct AUnrealPlayer_execPlayStartupMessage_Parms
{
	unsigned char                                      StartupStage;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.KickWarning
// Flags: [ FUNC_Event ]
struct AUnrealPlayer_eventKickWarning_Parms
{
};

// Function UnrealGame.UnrealPlayer.PlayAnnouncement
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execPlayAnnouncement_Parms
{
	class USound*                                      ASound;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      AnnouncementLevel;                                		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      bForce:1;                                         		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.PlayRewardAnnouncement
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execPlayRewardAnnouncement_Parms
{
	struct FName                                       AName;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      AnnouncementLevel;                                		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      bForce:1;                                         		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x000C ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.PlayStatusAnnouncement
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execPlayStatusAnnouncement_Parms
{
	struct FString                                     AName;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      AnnouncementLevel;                                		// 0x000C ( 0x0001[ CPF_Parm ]
	unsigned long                                      bForce:1;                                         		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ServerPlayVehicleHorn
// Flags: 
struct AUnrealPlayer_execServerPlayVehicleHorn_Parms
{
	int                                                HornIndex;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    V;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.PlayVehicleHorn
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execPlayVehicleHorn_Parms
{
	int                                                HornIndex;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    V;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.ServerTaunt
// Flags: 
struct AUnrealPlayer_execServerTaunt_Parms
{
	struct FName                                       AnimName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.TAUNT
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execTAUNT_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.RandomTaunt
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execRandomTaunt_Parms
{
	int                                                tauntNum;                                         		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.GetMessageIndex
// Flags: 
struct AUnrealPlayer_execGetMessageIndex_Parms
{
	struct FName                                       PhraseName;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPlayer.ServerShowPathToBase
// Flags: 
struct AUnrealPlayer_execServerShowPathToBase_Parms
{
	int                                                TeamNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.BasePath
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execBasePath_Parms
{
	unsigned char                                      Num;                                              		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.SoakPause
// Flags: 
struct AUnrealPlayer_execSoakPause_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.SoakBots
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execSoakBots_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.DontReuseTaunt
// Flags: 
struct AUnrealPlayer_execDontReuseTaunt_Parms
{
	int                                                t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPlayer.AutoTaunt
// Flags: 
struct AUnrealPlayer_execAutoTaunt_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealPlayer.Possess
// Flags: 
struct AUnrealPlayer_execPossess_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ShowAI
// Flags: [ FUNC_Exec ]
struct AUnrealPlayer_execShowAI_Parms
{
};

// Function UnrealGame.UnrealPlayer.LogMultiKills
// Flags: 
struct AUnrealPlayer_execLogMultiKills_Parms
{
	float                                              Reward;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bEnemyKill:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ClientDelayedAnnouncement
// Flags: 
struct AUnrealPlayer_execClientDelayedAnnouncement_Parms
{
	class USound*                                      AnnouncementSound;                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Delay;                                            		// 0x0004 ( 0x0001[ CPF_Parm ]
	class AAnnounceAdrenaline*                         A;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.ClientDelayedAnnouncementNamed
// Flags: 
struct AUnrealPlayer_execClientDelayedAnnouncementNamed_Parms
{
	struct FName                                       Announcement;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Delay;                                            		// 0x0004 ( 0x0001[ CPF_Parm ]
	class AAnnounceAdrenaline*                         A;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.AwardAdrenaline
// Flags: 
struct AUnrealPlayer_execAwardAdrenaline_Parms
{
	float                                              Amount;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.PostBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AUnrealPlayer_eventPostBeginPlay_Parms
{
	class UClass*                                      VoiceClass;                                       		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealPlayer.ClientSendStats
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientSendStats_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                newgoals;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bNewFirstBlood:1;                                 		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                newKills;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                newsuicides;                                      		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                newFlagTouches;                                   		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                newFlagReturns;                                   		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                newFlakCount;                                     		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                newComboCount;                                    		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                newHeadCount;                                     		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                newRanOverCount;                                  		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                newDaredevilPoints;                               		// 0x002C ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ClientSendCombos
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientSendCombos_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Combos0;                                          		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Combos1;                                          		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Combos2;                                          		// 0x0006 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Combos3;                                          		// 0x0007 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Combos4;                                          		// 0x0008 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ClientSendMultiKills
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientSendMultiKills_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MultiKills0;                                      		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      MultiKills1;                                      		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned char                                      MultiKills2;                                      		// 0x0006 ( 0x0001[ CPF_Parm ]
	unsigned char                                      MultiKills3;                                      		// 0x0007 ( 0x0001[ CPF_Parm ]
	unsigned char                                      MultiKills4;                                      		// 0x0008 ( 0x0001[ CPF_Parm ]
	unsigned char                                      MultiKills5;                                      		// 0x0009 ( 0x0001[ CPF_Parm ]
	unsigned char                                      MultiKills6;                                      		// 0x000A ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ClientSendSprees
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientSendSprees_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Spree0;                                           		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Spree1;                                           		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Spree2;                                           		// 0x0006 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Spree3;                                           		// 0x0007 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Spree4;                                           		// 0x0008 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Spree5;                                           		// 0x0009 ( 0x0001[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ClientSendVehicle
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientSendVehicle_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      V;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Kills;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Deaths;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                DeathsDriving;                                    		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0014 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ClientSendWeapon
// Flags: [ FUNC_Simulated ]
struct AUnrealPlayer_execClientSendWeapon_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      W;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Kills;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Deaths;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                deathsholding;                                    		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0014 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ServerGetNextVehicleStats
// Flags: 
struct AUnrealPlayer_execServerGetNextVehicleStats_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ServerGetNextWeaponStats
// Flags: 
struct AUnrealPlayer_execServerGetNextWeaponStats_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ServerUpdateStatArrays
// Flags: 
struct AUnrealPlayer_execServerUpdateStatArrays_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealPlayer.ServerUpdateStats
// Flags: 
struct AUnrealPlayer_execServerUpdateStats_Parms
{
	class ATeamPlayerReplicationInfo*                  PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealTeamInfo.RemoveFromTeam
// Flags: 
struct AUnrealTeamInfo_execRemoveFromTeam_Parms
{
	class AController*                                 Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealTeamInfo.SetBotOrders
// Flags: 
struct AUnrealTeamInfo_execSetBotOrders_Parms
{
	class ABot*                                        NewBot;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class URosterEntry*                                R;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealTeamInfo.BelongsOnTeam
// Flags: 
struct AUnrealTeamInfo_execBelongsOnTeam_Parms
{
	class UClass*                                      PawnClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.UnrealTeamInfo.AddToTeam
// Flags: 
struct AUnrealTeamInfo_execAddToTeam_Parms
{
	class AController*                                 Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      bResult:1;                                        		// 0x0008 ( 0x0004 [0x00000001]
};

// Function UnrealGame.UnrealTeamInfo.GetNamedBot
// Flags: 
struct AUnrealTeamInfo_execGetNamedBot_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class URosterEntry*                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealTeamInfo.GetNextBot
// Flags: 
struct AUnrealTeamInfo_execGetNextBot_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class URosterEntry*                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function UnrealGame.UnrealTeamInfo.AddNamedBot
// Flags: 
struct AUnrealTeamInfo_execAddNamedBot_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                j;                                                		// 0x000C ( 0x0004
};

// Function UnrealGame.UnrealTeamInfo.AddRandomPlayer
// Flags: 
struct AUnrealTeamInfo_execAddRandomPlayer_Parms
{
	int                                                j;                                                		// 0x0000 ( 0x0004
};

// Function UnrealGame.UnrealTeamInfo.AlreadyExistsEntry
// Flags: 
struct AUnrealTeamInfo_execAlreadyExistsEntry_Parms
{
	struct FString                                     CharacterName;                                    		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bNoRecursion:1;                                   		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealTeamInfo.GetRandomPlayer
// Flags: 
struct AUnrealTeamInfo_execGetRandomPlayer_Parms
{
	class URosterEntry*                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealTeamInfo.ChooseBotClass
// Flags: 
struct AUnrealTeamInfo_execChooseBotClass_Parms
{
	struct FString                                     botname;                                          		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class URosterEntry*                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealTeamInfo.NeedsBotMoreThan
// Flags: 
struct AUnrealTeamInfo_execNeedsBotMoreThan_Parms
{
	class AUnrealTeamInfo*                             t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealTeamInfo.NextLoadOut
// Flags: [ FUNC_Simulated ]
struct AUnrealTeamInfo_execNextLoadOut_Parms
{
	class UClass*                                      CurrentLoadout;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	class UClass*                                      Result;                                           		// 0x000C ( 0x0004
};

// Function UnrealGame.UnrealTeamInfo.FillPlayerTeam
// Flags: 
struct AUnrealTeamInfo_execFillPlayerTeam_Parms
{
	class UGameProfile*                                G;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealTeamInfo.Initialize
// Flags: 
struct AUnrealTeamInfo_execInitialize_Parms
{
	int                                                TeamBots;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.UnrealTeamInfo.AllBotsSpawned
// Flags: 
struct AUnrealTeamInfo_execAllBotsSpawned_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealTeamInfo.OverrideInitialBots
// Flags: 
struct AUnrealTeamInfo_execOverrideInitialBots_Parms
{
	int                                                N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AUnrealTeamInfo*                             t;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealTeamInfo.Reset
// Flags: 
struct AUnrealTeamInfo_execReset_Parms
{
};

// Function UnrealGame.WeaponDamageType.GetWeaponClass
// Flags: 
struct AWeaponDamageType_execGetWeaponClass_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.LevelGameRules.UpdateGame
// Flags: 
struct ALevelGameRules_execUpdateGame_Parms
{
	class AGameInfo*                                   G;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.LevelGameRules.PreBeginPlay
// Flags: 
struct ALevelGameRules_execPreBeginPlay_Parms
{
};

// Function UnrealGame.HoldSpot.FreeScript
// Flags: 
struct AHoldSpot_execFreeScript_Parms
{
};

// Function UnrealGame.HoldSpot.GetMoveTarget
// Flags: 
struct AHoldSpot_execGetMoveTarget_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealScriptedSequence.HigherPriorityThan
// Flags: 
struct AUnrealScriptedSequence_execHigherPriorityThan_Parms
{
	class AUnrealScriptedSequence*                     S;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ABot*                                        B;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealScriptedSequence.BeginPlay
// Flags: 
struct AUnrealScriptedSequence_execBeginPlay_Parms
{
	class AUnrealScriptedSequence*                     S;                                                		// 0x0000 ( 0x0004
	class AUnrealScriptedSequence*                     Last;                                             		// 0x0004 ( 0x0004
	class ASnipingVolume*                              V;                                                		// 0x0008 ( 0x0004
};

// Function UnrealGame.UnrealScriptedSequence.CheckForErrors
// Flags: 
struct AUnrealScriptedSequence_execCheckForErrors_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.UnrealScriptedSequence.FreeScript
// Flags: 
struct AUnrealScriptedSequence_execFreeScript_Parms
{
};

// Function UnrealGame.UnrealScriptedSequence.Reset
// Flags: 
struct AUnrealScriptedSequence_execReset_Parms
{
};

// Function UnrealGame.TeamGame.EndGameTauntFor
// Flags: 
struct ATeamGame_execEndGameTauntFor_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     S;                                                		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.TeamGame.EndGameCommentFor
// Flags: 
struct ATeamGame_execEndGameCommentFor_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class AController*                                 Best;                                             		// 0x0008 ( 0x0004
	struct FString                                     S;                                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.TeamGame.PickEndGameTauntFor
// Flags: 
struct ATeamGame_execPickEndGameTauntFor_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.TeamGame.WeakObjectives
// Flags: 
struct ATeamGame_execWeakObjectives_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004
};

// Function UnrealGame.TeamGame.GetAllLoadHints
// Flags: 
struct ATeamGame_execGetAllLoadHints_Parms
{
	unsigned long                                      bThisClassOnly:1;                                 		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class TArray< struct FString >                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	class TArray< struct FString >                     Hints;                                            		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function UnrealGame.TeamGame.PostLogin
// Flags: [ FUNC_Event ]
struct ATeamGame_eventPostLogin_Parms
{
	class APlayerController*                           NewPlayer;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.TeamGame.InitVoiceReplicationInfo
// Flags: 
struct ATeamGame_execInitVoiceReplicationInfo_Parms
{
};

// Function UnrealGame.TeamGame.AnnounceScore
// Flags: 
struct ATeamGame_execAnnounceScore_Parms
{
	int                                                ScoringTeam;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	struct FName                                       ScoreSound;                                       		// 0x0008 ( 0x0004
	int                                                OtherTeam;                                        		// 0x000C ( 0x0004
};

// Function UnrealGame.TeamGame.AcceptPlayInfoProperty
// Flags: [ FUNC_Event ]
struct ATeamGame_eventAcceptPlayInfoProperty_Parms
{
	struct FString                                     PropertyName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function UnrealGame.TeamGame.GetDescriptionText
// Flags: [ FUNC_Event ]
struct ATeamGame_eventGetDescriptionText_Parms
{
	struct FString                                     PropName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function UnrealGame.TeamGame.FillPlayInfo
// Flags: 
struct ATeamGame_execFillPlayInfo_Parms
{
	class UPlayInfo*                                   PlayInfo;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function UnrealGame.TeamGame.FindNewObjectives
// Flags: 
struct ATeamGame_execFindNewObjectives_Parms
{
	class AGameObjective*                              DisabledObjective;                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function UnrealGame.TeamGame.ParseMessageString
// Flags: 
struct ATeamGame_execParseMessageString_Parms
{
	class AMutator*                                    BaseMutator;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Who;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Message;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     OutMsg;                                           		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     Cmd;                                              		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                pos;                                              		// 0x0038 ( 0x0004
//	int                                                i;                                                		// 0x003C ( 0x0004
};

// Function UnrealGame.TeamGame.FindTeamDesignation
// Flags: 
struct ATeamGame_execFindTeamDesignation_Parms
{
