#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : BatteryNet
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function BatteryNet.BTTcpHandler_DStoDP_Script_Interface.SetGameManager
// Flags: [ FUNC_Event ]
struct UBTTcpHandler_DStoDP_Script_Interface_eventSetGameManager_Parms
{
	class UwGameManager*                               pgameMgr;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function BatteryNet.BTTcpHandler_DStoDP_Script_Interface.SetMatchMaker
// Flags: [ FUNC_Event ]
struct UBTTcpHandler_DStoDP_Script_Interface_eventSetMatchMaker_Parms
{
	class UwMatchMaker*                                pMM;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqUpdateProcessState
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqUpdateProcessState_Parms
{
	int                                                State;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfAckProcessExcuteCmd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfAckProcessExcuteCmd_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MajorType;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MinorType;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     CmdValue;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqProcessExcuteCmd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqProcessExcuteCmd_Parms
{
	int                                                MajorType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MinorType;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     CmdValue;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqUpdateUserCount_DudeServer
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqUpdateUserCount_DudeServer_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MaxUserCount;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                CurUserCount;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqUpdateUserCount_LoginServer
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqUpdateUserCount_LoginServer_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MaxUserCount;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                CurUserCount;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqUpdateUserCount_ChannelServer
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqUpdateUserCount_ChannelServer_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelCount;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ChannelNum;                                       		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelMaxUserCount;                              		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelCurUserCount;                              		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelPlayingUserCount;                          		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelRoomCount;                                 		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0044 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqTerminateDedicateHostProcess
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqTerminateDedicateHostProcess_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfAckStartDedicateHost
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfAckStartDedicateHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ProcessID;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqStartDedicateHost
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqStartDedicateHost_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelIPAddr;                                    		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ChannelPortNum;                                   		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfAckQuitDedicateHost
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfAckQuitDedicateHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                PID;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqQuitDedicateHost
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqQuitDedicateHost_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfAckLogin
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfAckLogin_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqLogin
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqLogin_Parms
{
	int                                                PID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	class TArray< unsigned char >                      ServerIPAddrType;                                 		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ServerIPAddr;                                     		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ServerPortType;                                   		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ServerPortNum;                                    		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0038 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfAckHash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfAckHash_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.sfReqHash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execsfReqHash_Parms
{
	int                                                HashField0;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                HashField1;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                HashField2;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                HashField3;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqUpdateProcessState
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqUpdateProcessState_Parms
{
	int                                                State;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfAckProcessExcuteCmd
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfAckProcessExcuteCmd_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MajorType;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MinorType;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     CmdValue;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqProcessExcuteCmd
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqProcessExcuteCmd_Parms
{
	int                                                MajorType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MinorType;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     CmdValue;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqUpdateUserCount_DudeServer
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqUpdateUserCount_DudeServer_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MaxUserCount;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                CurUserCount;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqUpdateUserCount_LoginServer
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqUpdateUserCount_LoginServer_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MaxUserCount;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                CurUserCount;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqUpdateUserCount_ChannelServer
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqUpdateUserCount_ChannelServer_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelCount;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ChannelNum;                                       		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelMaxUserCount;                              		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelCurUserCount;                              		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelPlayingUserCount;                          		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ChannelRoomCount;                                 		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0044 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqTerminateDedicateHostProcess
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqTerminateDedicateHostProcess_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfAckStartDedicateHost
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfAckStartDedicateHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ProcessID;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqStartDedicateHost
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqStartDedicateHost_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelIPAddr;                                    		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ChannelPortNum;                                   		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfAckQuitDedicateHost
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfAckQuitDedicateHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                PID;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqQuitDedicateHost
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqQuitDedicateHost_Parms
{
	int                                                ServerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfAckLogin
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfAckLogin_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqLogin
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqLogin_Parms
{
	int                                                PID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	class TArray< unsigned char >                      ServerIPAddrType;                                 		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ServerIPAddr;                                     		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ServerPortType;                                   		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ServerPortNum;                                    		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0038 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfAckHash
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfAckHash_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.rfReqHash
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventrfReqHash_Parms
{
	int                                                HashField0;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                HashField1;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                HashField2;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                HashField3;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.OnError
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventOnError_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.OnClose
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventOnClose_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.OnConnect
// Flags: [ FUNC_Event ]
struct UBTTcpLink_Process2Agent_eventOnConnect_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.Close
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execClose_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.Connect
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execConnect_Parms
{
	struct FString                                     sIpaddr;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                nPort;                                            		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Process2Agent.InitNetwork
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Process2Agent_execInitNetwork_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpHandler_DS_Script_Interface.SetGameManager
// Flags: [ FUNC_Event ]
struct UBTTcpHandler_DS_Script_Interface_eventSetGameManager_Parms
{
	class UwGameManager*                               pgameMgr;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function BatteryNet.BTTcpHandler_DS_Script_Interface.SetMatchMaker
// Flags: [ FUNC_Event ]
struct UBTTcpHandler_DS_Script_Interface_eventSetMatchMaker_Parms
{
	class UwMatchMaker*                                pMM;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfNotifyCouponUseError
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfNotifyCouponUseError_Parms
{
	int                                                Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckCouponUse
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckCouponUse_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqCouponUse
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqCouponUse_Parms
{
	struct FString                                     Serial;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyShopItemDataEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyShopItemDataEnd_Parms
{
	int                                                Ver;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyShopItemData
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyShopItemData_Parms
{
	class TArray< int >                                ProductNo;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductRowGuid;                                   		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ServiceCode;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductName;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductCode;                                      		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProductType;                                      		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      SaleType;                                         		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ItemSaleType;                                     		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ISIncludeBonus;                                   		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductCost;                                      		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductHour;                                      		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductQuantity;                                  		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TotalQuantity;                                    		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ReOrderTerms;                                     		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ReorderCount;                                     		// 0x00A8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PurchaseAvailableQuantity;                        		// 0x00B4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                AvailableMinLevel;                                		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                AvailableMaxLevel;                                		// 0x00CC ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      AvailableGender;                                  		// 0x00D8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                InventoryKeepDays;                                		// 0x00E4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SaleMasterFlag;                                   		// 0x00F0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SaleStatus;                                       		// 0x00FC ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Description;                                      		// 0x0108 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property0;                                        		// 0x0114 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property1;                                        		// 0x0120 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property2;                                        		// 0x012C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property3;                                        		// 0x0138 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Property4;                                        		// 0x0144 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                IsGift;                                           		// 0x0150 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x015C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckShopItemData
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckShopItemData_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqShopItemData
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqShopItemData_Parms
{
	int                                                Ver;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyLoadingStatus
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyLoadingStatus_Parms
{
	int                                                Status;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqUpdateUserPerformenceInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqUpdateUserPerformenceInfo_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MinFps;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MaxFps;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                AvgFps;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                MinPing;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                MaxPing;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                AvgPing;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqAhnNotifyDisconnct
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqAhnNotifyDisconnct_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckAhnHsObject
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckAhnHsObject_Parms
{
	class TArray< unsigned char >                      Data;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                DataSize;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqAhnHsObject
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqAhnHsObject_Parms
{
	class TArray< unsigned char >                      Data;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                DataSize;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfNotifyClanLevelup
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfNotifyClanLevelup_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Levelup;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfNotifyNewClanName
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfNotifyNewClanName_Parms
{
	struct FString                                     New_NickName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfNotifyNewNickName
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfNotifyNewNickName_Parms
{
	int                                                Community_Type;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Old_NickName;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     New_NickName;                                     		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGameMapData
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGameMapData_Parms
{
	class TArray< int >                                nIdx;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nMapID;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     nMapNm;                                           		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< float >                              fSupHealth;                                       		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< float >                              fSupHeli;                                         		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< float >                              fSupBomb;                                         		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< float >                              fSupUAV;                                          		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModFFA;                                          		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModFFAMax;                                       		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModTDM;                                          		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModTDMMax;                                       		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModSD;                                           		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModSDMax;                                        		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModDOM;                                          		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModDOMMax;                                       		// 0x00A8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModSab;                                          		// 0x00B4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                nModSabMax;                                       		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00CC ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGameMapData
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGameMapData_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckTencent_StartTenProtect
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckTencent_StartTenProtect_Parms
{
	int                                                CharDBID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckMoveToLobby
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckMoveToLobby_Parms
{
	unsigned char                                      MessageType;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPopUpMessage
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPopUpMessage_Parms
{
	int                                                MessageType;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfUpdateWebzenShopScriptVersion
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfUpdateWebzenShopScriptVersion_Parms
{
	int                                                Year;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                YearId;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                SalesZoneCode;                                    		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSetClientVersion
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSetClientVersion_Parms
{
	int                                                ClientVersion;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckFriendPosition
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckFriendPosition_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     TargetCharName;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ServerType;                                       		// 0x0010 ( 0x0001[ CPF_Parm ]
	struct FString                                     fServername;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fServerShortName;                                 		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fServerIP;                                        		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                fServerPort;                                      		// 0x0038 ( 0x0004[ CPF_Parm ]
	unsigned char                                      CurPos;                                           		// 0x003C ( 0x0001[ CPF_Parm ]
	unsigned char                                      CurState;                                         		// 0x003D ( 0x0001[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0040 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelNickName;                                  		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameRoomNum;                                      		// 0x0050 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0054 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqFriendPosition
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqFriendPosition_Parms
{
	struct FString                                     TargetCharName;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      CommunityType;                                    		// 0x000C ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckDedicateHost_Login
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckDedicateHost_Login_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqDedicateHost_Login
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqDedicateHost_Login_Parms
{
	int                                                ProcessID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                RoomNum;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckLogOut
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckLogOut_Parms
{
	unsigned char                                      Result;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Reason;                                           		// 0x0001 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqLogOut
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqLogOut_Parms
{
	unsigned char                                      Reason;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckTencent_AASInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckTencent_AASInfo_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsAdult;                                          		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsQQAuth;                                         		// 0x0005 ( 0x0001[ CPF_Parm ]
	int                                                AccumTimeSec;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSetCommunityOption
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSetCommunityOption_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrStr;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSetCommunityOption
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSetCommunityOption_Parms
{
	int                                                Opt_Wispher;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Opt_GameInvite;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Opt_FriendInvite;                                 		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Opt_ClanInvite;                                   		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckCommunityOptionList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckCommunityOptionList_Parms
{
	int                                                Opt_Wispher;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Opt_GameInvite;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Opt_FriendInvite;                                 		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Opt_ClanInvite;                                   		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqCommunityOptionList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqCommunityOptionList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyUpdateCharInfo_TitleMark
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyUpdateCharInfo_TitleMark_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TitleMarkID;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyUpdateCharInfo_LevelMark
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyUpdateCharInfo_LevelMark_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                LevelMarkID;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetRankingInfoListEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetRankingInfoListEnd_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetRankingInfoList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetRankingInfoList_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RankingType;                                      		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CommunityType;                                    		// 0x0005 ( 0x0001[ CPF_Parm ]
	class TArray< struct FString >                     CharName;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CharLevel;                                        		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkPattern;                                  		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBG;                                       		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBL;                                       		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum;                                    		// 0x0050 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum_Prev;                               		// 0x005C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ranking_Accum_Exp;                                		// 0x0068 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x0074 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x0080 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x008C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x0098 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00A4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00B0 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetRankingInfoListStart
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetRankingInfoListStart_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RankingType;                                      		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CommunityType;                                    		// 0x0005 ( 0x0001[ CPF_Parm ]
	int                                                TotalCount;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetRankingInfoList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetRankingInfoList_Parms
{
	unsigned char                                      RankingType;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      CommunityType;                                    		// 0x0001 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckCharDetailInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckCharDetailInfo_Parms
{
	int                                                MaxSerial;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MaxScore;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MaxKill;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                MaxAssist;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Serial3;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                Serial5;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Serial7;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                Serial10;                                         		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                Serial15;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                AR;                                               		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                SMG;                                              		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                SR;                                               		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                SW;                                               		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                Melee;                                            		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                Grenade;                                          		// 0x0038 ( 0x0004[ CPF_Parm ]
	int                                                FlashBang;                                        		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                Foot;                                             		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                AT4;                                              		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                MG;                                               		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Fire;                                             		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                RPG7;                                             		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                TimeBomb;                                         		// 0x0054 ( 0x0004[ CPF_Parm ]
	int                                                IcendiaryBomb;                                    		// 0x0058 ( 0x0004[ CPF_Parm ]
	int                                                ClusterBomb;                                      		// 0x005C ( 0x0004[ CPF_Parm ]
	int                                                ByChopper;                                        		// 0x0060 ( 0x0004[ CPF_Parm ]
	int                                                Artillery;                                        		// 0x0064 ( 0x0004[ CPF_Parm ]
	int                                                KillChopper;                                      		// 0x0068 ( 0x0004[ CPF_Parm ]
	int                                                FirstKill;                                        		// 0x006C ( 0x0004[ CPF_Parm ]
	int                                                LastKill;                                         		// 0x0070 ( 0x0004[ CPF_Parm ]
	int                                                AllKill;                                          		// 0x0074 ( 0x0004[ CPF_Parm ]
	int                                                Dominate;                                         		// 0x0078 ( 0x0004[ CPF_Parm ]
	int                                                InstallBomb;                                      		// 0x007C ( 0x0004[ CPF_Parm ]
	int                                                DefuseBomb;                                       		// 0x0080 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0084 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqCharDetailInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqCharDetailInfo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqInGameRoomUserClanLevelChanged
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqInGameRoomUserClanLevelChanged_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqInGameRoomUserInfoChanged
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqInGameRoomUserInfoChanged_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatchResultHistory
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatchResultHistory_Parms
{
	class TArray< struct FBtrDouble >                  MatchDate;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsWin;                                            		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     EnemyClanname;                                    		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatchResultHistory
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatchResultHistory_Parms
{
	struct FString                                     ClanNm;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckDeleteMailAll
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckDeleteMailAll_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MailType;                                         		// 0x0004 ( 0x0001[ CPF_Parm ]
	int                                                Count;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqDeleteMailAll
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqDeleteMailAll_Parms
{
	unsigned char                                      MailType;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_PublicWaitRoomChanged
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_PublicWaitRoomChanged_Parms
{
	int                                                WaitRoomIdx;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     RoomName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                MapNum;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                CurUserCount;                                     		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                MaxUserCount;                                     		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Status;                                           		// 0x001C ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsPublic;                                         		// 0x001D ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckEventNotify
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckEventNotify_Parms
{
	int                                                Type;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqEventNotify
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqEventNotify_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_NotifyChangeClanname
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_NotifyChangeClanname_Parms
{
	struct FString                                     NewClanname;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_ChangeClanname
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_ChangeClanname_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                RemainCount;                                      		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewClanname;                                      		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPaidItem_ChangeClanname
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPaidItem_ChangeClanname_Parms
{
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	struct FString                                     NewClanname;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_EndPublicWaitRoomList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_EndPublicWaitRoomList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_PublicWaitRoomList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_PublicWaitRoomList_Parms
{
	class TArray< int >                                WaitRoomIdx;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     LeaderName;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     RoomName;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MapNum;                                           		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CurUserCount;                                     		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MaxUserCount;                                     		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      Status;                                           		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0054 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_StartPublicWaitRoomList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_StartPublicWaitRoomList_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Count;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_GetPublicWaitRoomList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_GetPublicWaitRoomList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckServerType
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckServerType_Parms
{
	unsigned char                                      Type;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqServerType
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqServerType_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckServerShutdown
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckServerShutdown_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqServerShutdown
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqServerShutdown_Parms
{
	struct FString                                     AuthKey;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                SecondAfter;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FBtrDouble                                  ShutdownTime;                                     		// 0x0010 ( 0x0008[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyEndTutorial
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyEndTutorial_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     CharName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanMarkPattern;                                  		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                ClanMarkBG;                                       		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                ClanMarkBL;                                       		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                ClanWin;                                          		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                ClanLose;                                         		// 0x0034 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookFor;                                        		// 0x0038 ( 0x0001[ CPF_Parm ]
	int                                                Result;                                           		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x0054 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0058 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyEndTutorial
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyEndTutorial_Parms
{
	int                                                TutorialResultType;                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyStartTutorial
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyStartTutorial_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyStartTutorial
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyStartTutorial_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRoomUserPingInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRoomUserPingInfo_Parms
{
	class TArray< int >                                UnqueID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ping;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostPriorityPoint;                                		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRoomUserPingInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRoomUserPingInfo_Parms
{
	class TArray< int >                                UnqueID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Ping;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostPriorityPoint;                                		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckMyEquipedQSlotList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckMyEquipedQSlotList_Parms
{
	class TArray< unsigned char >                      QSlotDispOrder;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  MWUniqueID;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWItemID;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWPartID;                                         		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWPaintID;                                        		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  PistolUniqueID;                                   		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolItemID;                                     		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolPartID;                                     		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolPaintID;                                    		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  TW1UniqueID;                                      		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TWItemID1;                                        		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  TW2UniqueID;                                      		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TWItemID2;                                        		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill1ID;                                         		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill2ID;                                         		// 0x00A8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill3ID;                                         		// 0x00B4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill4ID;                                         		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x00CC ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00D0 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqMyEquipedQSlotList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqMyEquipedQSlotList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckMyEquipedSkillList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckMyEquipedSkillList_Parms
{
	class TArray< int >                                SkillIDs;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SlotPositions;                                    		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqMyEquipedSkillList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqMyEquipedSkillList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckMyEquipedItemList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckMyEquipedItemList_Parms
{
	class TArray< int >                                ItemIDs;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                SlotPositions;                                    		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                AddPartsID;                                       		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PaintID;                                          		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  UniqueID;                                         		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x003C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0040 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqMyEquipedItemList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqMyEquipedItemList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetMyMailBoxState
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetMyMailBoxState_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsFull;                                           		// 0x0004 ( 0x0001[ CPF_Parm ]
	int                                                NewMailCount;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetMyMailBoxState
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetMyMailBoxState_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSetLookForClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSetLookForClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsLookingFor;                                     		// 0x0010 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSetLookForClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSetLookForClan_Parms
{
	unsigned char                                      IsLookingFor;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckExteriorRoomOwnerInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckExteriorRoomOwnerInfo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqExteriorRoomOwnerInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqExteriorRoomOwnerInfo_Parms
{
	int                                                RoomNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     OwnerName;                                        		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     OwnerIP;                                          		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_SetWaitRoomPublic
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_SetWaitRoomPublic_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Set;                                              		// 0x0010 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_SetWaitRoomPublic
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_SetWaitRoomPublic_Parms
{
	unsigned char                                      Set;                                              		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRemoveCheckTeamBalanceList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRemoveCheckTeamBalanceList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_NotifyChangeClanMark
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_NotifyChangeClanMark_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Pattern;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                BG;                                               		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                BL;                                               		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_ChangeClanMark
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_ChangeClanMark_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                StackCount;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPaidItem_ChangeClanMark
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPaidItem_ChangeClanMark_Parms
{
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	unsigned char                                      IsPaid;                                           		// 0x0008 ( 0x0001[ CPF_Parm ]
	int                                                Pattern;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                BG;                                               		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                BL;                                               		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_ClanMarkDupCheck
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_ClanMarkDupCheck_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPaidItem_ClanMarkDupCheck
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPaidItem_ClanMarkDupCheck_Parms
{
	unsigned char                                      IsPaid;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                Pattern;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                BG;                                               		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                BL;                                               		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_RelayBroadcast
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_RelayBroadcast_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Msg;                                              		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_BroadCast
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_BroadCast_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                StackCount;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPaidItem_BroadCast
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPaidItem_BroadCast_Parms
{
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                Command;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     Message;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_EraseRecord
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_EraseRecord_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                Command;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                RemainCount;                                      		// 0x001C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPaidItem_EraseRecord
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPaidItem_EraseRecord_Parms
{
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                Command;                                          		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPaidItem_ChangeCharname
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPaidItem_ChangeCharname_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                RemainCount;                                      		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewCharname;                                      		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPaidItem_ChangeCharname
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPaidItem_ChangeCharname_Parms
{
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	struct FString                                     NewCharname;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRecvSystemMsg
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRecvSystemMsg_Parms
{
	unsigned char                                      CommunityType;                                    		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FSystemMsgParam                             MsgInfo;                                          		// 0x0004 ( 0x0024[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSendSystemMsg
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSendSystemMsg_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSendSystemMsg
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSendSystemMsg_Parms
{
	unsigned char                                      RecvType;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     SendCharName;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     RecvCharname;                                     		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FSystemMsgParam                             MsgInfo;                                          		// 0x001C ( 0x0024[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0040 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRandomBox_Use
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRandomBox_Use_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  RandomBoxItemIdx;                                 		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                RandomBxoItemCount;                               		// 0x0018 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ItemIDChoose;                                     		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PartIDChoose;                                     		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PeriodOnChoosenItem;                              		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                StackCountOnChoosenItem;                          		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      bHave;                                            		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  ItemIdx;                                          		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  UntilTime;                                        		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                StackCount;                                       		// 0x0070 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x007C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRandomBox_Use
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRandomBox_Use_Parms
{
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckChangedRoomTitle_FromGM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckChangedRoomTitle_FromGM_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RoomNumber;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewRoomTitle;                                     		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckChangeRoomTitle_GM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckChangeRoomTitle_GM_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RoomNumber;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewRoomTitle;                                     		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqChangeRoomTitle_GM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqChangeRoomTitle_GM_Parms
{
	int                                                RoomNumber;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewRoomTitle;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGMLeaveRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGMLeaveRoom_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RoomNumber;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGMEnterRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGMEnterRoom_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RoomNumber;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckQuestGetAvailableEventList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckQuestGetAvailableEventList_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                QuestID;                                          		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqQuestGetAvailableEventList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqQuestGetAvailableEventList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckCharBlockInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckCharBlockInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FBtrDouble                                  ChatBlockStartTime;                               		// 0x0004 ( 0x0008[ CPF_Parm ]
	struct FBtrDouble                                  ChatBlockEndTime;                                 		// 0x000C ( 0x0008[ CPF_Parm ]
	class TArray< struct FBtrDouble >                  BlockedItemIdx;                                   		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqCharBlockInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqCharBlockInfo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqIsPaidWebzenPCBang
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqIsPaidWebzenPCBang_Parms
{
	unsigned char                                      IsPaid;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_GetClanWaittingRoomInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_GetClanWaittingRoomInfo_Parms
{
	int                                                WaitRoomIndex;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MapNumArray;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                VersusMode;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FString                                     WaitRoomName;                                     		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0030 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_GetClanWaittingRoomInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_GetClanWaittingRoomInfo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckReturnBotID
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckReturnBotID_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqReturnBotID
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqReturnBotID_Parms
{
	class TArray< int >                                BotID;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetBotID
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetBotID_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RequestedAFCount;                                 		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      RequestedRSACount;                                		// 0x0005 ( 0x0001[ CPF_Parm ]
	class TArray< int >                                AFBotID;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                RSABotID;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetBotID
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetBotID_Parms
{
	unsigned char                                      AFCount;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      RSACount;                                         		// 0x0001 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_ChangeRoomSetting
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_ChangeRoomSetting_Parms
{
	int                                                WaitRoomIndex;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MapNumArray;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                VersusMode;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsPublic;                                         		// 0x0024 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_ChangeRoomSetting
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_ChangeRoomSetting_Parms
{
	int                                                WaitRoomIndex;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                MapNumArray;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                VersusMode;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsPublic;                                         		// 0x0014 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckParamCheckSum
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckParamCheckSum_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqParamCheckSum
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqParamCheckSum_Parms
{
	struct FString                                     key;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Value;                                            		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckWebzenBillingUseStorageItem
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckWebzenBillingUseStorageItem_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                ItemID;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FBtrDouble                                  ItemExtra;                                        		// 0x001C ( 0x0008[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqWebzenBillingUseStorageItem
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqWebzenBillingUseStorageItem_Parms
{
	int                                                StorageSeq;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                StorageItemSeq;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      StorageItemType;                                  		// 0x0008 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckWebzenBillingStorageListEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckWebzenBillingStorageListEnd_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckWebzenBillingStorageList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckWebzenBillingStorageList_Parms
{
	class TArray< int >                                Seq;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemSeq;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                GroupCode;                                        		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ShareFlag;                                        		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductSeq;                                       		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     CashName;                                         		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  CashPoint;                                        		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     SendAccountID;                                    		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     SendMessage;                                      		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ItemType;                                         		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      RelationType;                                     		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ProductType;                                      		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PriceSeq;                                         		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x009C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckWebzenBillingStorageListStart
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckWebzenBillingStorageListStart_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TotalCount;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                TotalPage;                                        		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                CurPage;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqWebzenBillingStorageList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqWebzenBillingStorageList_Parms
{
	int                                                Page;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                CountForPage;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Type;                                             		// 0x0008 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGiftItemByWebzenCash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGiftItemByWebzenCash_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                LeftProductCount;                                 		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGiftItemByWebzenCash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGiftItemByWebzenCash_Parms
{
	struct FString                                     ReceiverCharName;                                 		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Message;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                PackageProductSeq;                                		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                PriceSeq;                                         		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                ProductDisplaySeq;                                		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGiftItemByWebzenCashGP20
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGiftItemByWebzenCashGP20_Parms
{
	struct FString                                     ReceiverCharName;                                 		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Message;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ProductNo;                                        		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Cointype;                                         		// 0x001C ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckBuyItemByWebzenCash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckBuyItemByWebzenCash_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqBuyItemByWebzenCash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqBuyItemByWebzenCash_Parms
{
	int                                                PackageProductSeq;                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ProductDisplaySeq;                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                PriceSeq;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ItemIDs;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemUniqueID;                                     		// 0x0018 ( 0x0008[ CPF_Parm ]
	unsigned char                                      BuyOption1;                                       		// 0x0020 ( 0x0001[ CPF_Parm ]
	unsigned char                                      BuyOption2;                                       		// 0x0021 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqBuyItemByWebzenCashGP20
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqBuyItemByWebzenCashGP20_Parms
{
	int                                                ProductNo;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Cointype;                                         		// 0x0004 ( 0x0001[ CPF_Parm ]
	struct FBtrDouble                                  ItemID;                                           		// 0x0008 ( 0x0008[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckWebzenShopScriptVersion
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckWebzenShopScriptVersion_Parms
{
	int                                                Year;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                YearId;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                SalesZoneCode;                                    		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqWebzenShopScriptVersion
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqWebzenShopScriptVersion_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckWebzenCash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckWebzenCash_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  PCoinCash;                                        		// 0x0010 ( 0x0008[ CPF_Parm ]
	struct FBtrDouble                                  CCoinCash;                                        		// 0x0018 ( 0x0008[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqWebzenCash
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqWebzenCash_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRegisteredPCBangInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRegisteredPCBangInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsRegisteredPCBang;                               		// 0x0010 ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsMainPCBang;                                     		// 0x0011 ( 0x0001[ CPF_Parm ]
	struct FString                                     PCBangName;                                       		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRegisteredPCBangInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRegisteredPCBangInfo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRegisterMainPCBang
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRegisterMainPCBang_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRegisterMainPCBang
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRegisterMainPCBang_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPCBangUserListEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPCBangUserListEnd_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPCBangUserList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPCBangUserList_Parms
{
	class TArray< struct FString >                     FriendName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CM_Pattern;                                       		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CM_BG;                                            		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CM_BL;                                            		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Level;                                            		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanGrade;                                        		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanWin;                                          		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLose;                                         		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsLookForClan;                                    		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsCombat;                                         		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x00A8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x00B4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00C0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00CC ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPCBangUserListStart
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPCBangUserListStart_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                TotalCount;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPCBangUserList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPCBangUserList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqDailyQuestNewAvailable
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqDailyQuestNewAvailable_Parms
{
	class TArray< int >                                ExpiredQuestID;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                NewQuestID;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqQuestNewAvailable
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqQuestNewAvailable_Parms
{
	class TArray< int >                                AchivedQuestID;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                NewQuestID;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsDailyQuest;                                     		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ExpiredQuest;                                     		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0030 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckQuestUpdate
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckQuestUpdate_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqQuestUpdate
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqQuestUpdate_Parms
{
	int                                                UniqueID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                GameRoomNum;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                QuestID;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CountPrograss;                                    		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckQuestListEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckQuestListEnd_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckQuestList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckQuestList_Parms
{
	class TArray< int >                                QuestID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                CountPrograss;                                    		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsDailyQuest;                                     		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckQuestListStart
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckQuestListStart_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqQuestList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqQuestList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckPermanentRoomInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckPermanentRoomInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ClanIdx;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      FixedGameMode;                                    		// 0x0008 ( 0x0001[ CPF_Parm ]
	unsigned char                                      FixedMaxUserCnt;                                  		// 0x0009 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqPermanentRoomInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqPermanentRoomInfo_Parms
{
	int                                                RoomNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_FoundMatch
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_FoundMatch_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_FoundMatch
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_FoundMatch_Parms
{
	int                                                ChannelID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RoomNumber;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_NotifyStartSearching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_NotifyStartSearching_Parms
{
	int                                                ShouldWaitMore;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_StartSearching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_StartSearching_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ShouldWaitMore;                                   		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_StartSearching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_StartSearching_Parms
{
	int                                                RequestCount;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckLimitedListInChannel
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckLimitedListInChannel_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                LimitedMapID;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LimitedModeID;                                    		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqLimitedListInChannel
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqLimitedListInChannel_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRecvInviteGameRoomResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRecvInviteGameRoomResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRecvInviteGameRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRecvInviteGameRoom_Parms
{
	struct FString                                     RoomUniqueID;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                RoomNumber;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned char                                      Answer;                                           		// 0x0010 ( 0x0001[ CPF_Parm ]
	struct FString                                     InviteCharName;                                   		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvInviteGameRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvInviteGameRoom_Parms
{
	struct FString                                     InviteUserServerName;                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                InviteUserServerID;                               		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                InviteUserChannelNumber;                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     RoomUniqueID;                                     		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                RoomNumber;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FString                                     RoomName;                                         		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      RoomState;                                        		// 0x0030 ( 0x0001[ CPF_Parm ]
	struct FString                                     MapName;                                          		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     OwnerName;                                        		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      GameMode;                                         		// 0x004C ( 0x0001[ CPF_Parm ]
	unsigned char                                      WeaponLimit;                                      		// 0x004D ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsTeamBalance;                                    		// 0x004E ( 0x0001[ CPF_Parm ]
	struct FString                                     Password;                                         		// 0x0050 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InviteCharName;                                   		// 0x005C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0068 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckInviteGameRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckInviteGameRoom_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Answer;                                           		// 0x0004 ( 0x0001[ CPF_Parm ]
	struct FString                                     GuestCharName;                                    		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqInviteGameRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqInviteGameRoom_Parms
{
	struct FString                                     GuestCharName;                                    		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_StopSearching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_StopSearching_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_StopSearching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_StopSearching_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_ChangeLeader
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_ChangeLeader_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                NewLeader;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewLeaderName;                                    		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_ChangeLeader
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_ChangeLeader_Parms
{
	int                                                WaitRoomIdx;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                NewLeaderID;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewLeaderName;                                    		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_WaittingTeamList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_WaittingTeamList_Parms
{
	int                                                TtotlCount;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                Grade;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Map;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Versus;                                           		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_WaittingTeamList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_WaittingTeamList_Parms
{
	int                                                StartIndex;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnCount;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_Chat
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_Chat_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Msg;                                              		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_Chat
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_Chat_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_LeaveNotify
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_LeaveNotify_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_Leave
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_Leave_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_Leave
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_Leave_Parms
{
	int                                                WaittingID;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_MemberList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_MemberList_Parms
{
	class TArray< unsigned char >                      IsLeader;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkPA;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBG;                                       		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBL;                                       		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Level;                                            		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     CharName;                                         		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanGrade;                                        		// 0x0048 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanWin;                                          		// 0x0054 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLose;                                         		// 0x0060 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x006C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x0078 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x0084 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x0090 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x009C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x00A8 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00B4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00C0 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_MemberList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_MemberList_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_JoinNotify
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_JoinNotify_Parms
{
	unsigned char                                      IsLeader;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                ClanMarkPA;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ClanMarkBG;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ClanMarkBL;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Level;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     CharName;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanGrade;                                        		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                ClanWin;                                          		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                ClanLose;                                         		// 0x0028 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanLevel;                                        		// 0x0038 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x004C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0050 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_Join
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_Join_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_Join
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_Join_Parms
{
	int                                                WaittingID;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_InviteCrewResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_InviteCrewResult_Parms
{
	struct FString                                     Invitee;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_RecvInviteCrew
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_RecvInviteCrew_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Inviter;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_RecvInviteCrew
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_RecvInviteCrew_Parms
{
	struct FString                                     Inviter;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ServerIP;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Port;                                             		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                WaittingID;                                       		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                MapNum;                                           		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                InviteUserChannelNum;                             		// 0x0030 ( 0x0004[ CPF_Parm ]
	struct FString                                     LeaderName;                                       		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     RoomName;                                         		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x004C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_InviteCrew
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_InviteCrew_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_InviteCrew
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_InviteCrew_Parms
{
	struct FString                                     Invitee;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_NotifiyStartCombat
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_NotifiyStartCombat_Parms
{
	class TArray< int >                                MapNumArray;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                VersusMode;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_StartCombat
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_StartCombat_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_StartCombat
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_StartCombat_Parms
{
	class TArray< int >                                MapNumArray;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                VersusMode;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanMatch_GetReady
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanMatch_GetReady_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                RoomIndex;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanMatch_GetReady
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanMatch_GetReady_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckAutoChangedTeamUserList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckAutoChangedTeamUserList_Parms
{
	class TArray< int >                                UserID;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TeamNum;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetItemFromItemBox
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetItemFromItemBox_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ItemIDChoose;                                     		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                PartIDChoose;                                     		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FBtrDouble                                  BoxItemIdx;                                       		// 0x0018 ( 0x0008[ CPF_Parm ]
	int                                                BxoItemCount;                                     		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned char                                      bHave;                                            		// 0x0024 ( 0x0001[ CPF_Parm ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0028 ( 0x0008[ CPF_Parm ]
	struct FBtrDouble                                  UntilTime;                                        		// 0x0030 ( 0x0008[ CPF_Parm ]
	int                                                StackCount;                                       		// 0x0038 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x003C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetItemFromItemBox
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetItemFromItemBox_Parms
{
	struct FBtrDouble                                  ItemUniqueID;                                     		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                ItemID;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ItemIDChoose;                                     		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                PartIDChoose;                                     		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckItemListInItemBox
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckItemListInItemBox_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemUniqueID;                                     		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                BoxItemID;                                        		// 0x0018 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ItemID;                                           		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PartID;                                           		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqItemListInItemBox
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqItemListInItemBox_Parms
{
	struct FBtrDouble                                  ItemUniqueID;                                     		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                BoxItemID;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvForceFailedClientLoading
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvForceFailedClientLoading_Parms
{
	int                                                ErrCode;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckForceFailedClientLoading
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckForceFailedClientLoading_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqForceFailedClientLoading
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqForceFailedClientLoading_Parms
{
	int                                                FailedUserID;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ErrCode;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckStartHolePunching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckStartHolePunching_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameType;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ReqStartUserID;                                   		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqStartHolePunching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqStartHolePunching_Parms
{
	int                                                GameType;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReqStartUserID;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyMyCharInfoToRoomUser
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyMyCharInfoToRoomUser_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                UID;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserName;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Grade;                                            		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                TeamNum;                                          		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Statue;                                           		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsHost;                                           		// 0x0029 ( 0x0001[ CPF_Parm ]
	struct FString                                     UserIP;                                           		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                CM_Pattern;                                       		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                CM_BG;                                            		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                CM_BL;                                            		// 0x004C ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookFor;                                        		// 0x0050 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0054 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyMyCharInfoToRoomUser
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyMyCharInfoToRoomUser_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyDurabilityZeroItem
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyDurabilityZeroItem_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                UserID;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	class TArray< struct FBtrDouble >                  ItemUniqueIDs;                                    		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemIDs;                                          		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemPartIDs;                                      		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ItemSlotPos;                                      		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0044 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckChatWispherMyCommunity
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckChatWispherMyCommunity_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqChatWispherMyCommunity
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqChatWispherMyCommunity_Parms
{
	struct FString                                     SourceCharName;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     SenderName;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Msg;                                              		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyDisconnectHostInLoading
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyDisconnectHostInLoading_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostID;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvForceDisconnected_FromGM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvForceDisconnected_FromGM_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckForceDisconnectUser_GM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckForceDisconnectUser_GM_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqForceDisconnectUser_GM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqForceDisconnectUser_GM_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvNotice_FromGM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvNotice_FromGM_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     NoticeMsg;                                        		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsFromDB;                                         		// 0x001C ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotice_GM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotice_GM_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      NoticeType;                                       		// 0x0010 ( 0x0001[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                GameRoomNum;                                      		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotice_GM
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotice_GM_Parms
{
	unsigned char                                      NoticeType;                                       		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                ServerID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                GameRoomNum;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSpecificChannelUserInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSpecificChannelUserInfo_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     UserID;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                UserLevels;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanPattern;                                      		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x002C ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                LevelMarkID;                                      		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x004C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0050 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSpecificChannelUserInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSpecificChannelUserInfo_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSpecificGameRoomInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSpecificGameRoomInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                GameNum;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Title;                                            		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     MapName;                                          		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                MapNum;                                           		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned char                                      UserCount;                                        		// 0x0024 ( 0x0001[ CPF_Parm ]
	unsigned char                                      MaxCount;                                         		// 0x0025 ( 0x0001[ CPF_Parm ]
	struct FString                                     GameModeName;                                     		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ModeNum;                                          		// 0x0034 ( 0x0004[ CPF_Parm ]
	unsigned char                                      WeaponLimit;                                      		// 0x0038 ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsHardCore;                                       		// 0x0039 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Status;                                           		// 0x003A ( 0x0001[ CPF_Parm ]
	struct FString                                     RoomOwnerIP;                                      		// 0x003C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                GameMinute;                                       		// 0x0048 ( 0x0004[ CPF_Parm ]
	struct FString                                     RoomOwnerName;                                    		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsSpecial;                                        		// 0x0058 ( 0x0001[ CPF_Parm ]
	unsigned char                                      IsPassword;                                       		// 0x0059 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x005C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSpecificGameRoomInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSpecificGameRoomInfo_Parms
{
	int                                                RoomNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckChannelUserListInGameRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckChannelUserListInGameRoom_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                TotalCount;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                StartIndex;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	class TArray< int >                                UID;                                              		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     CharName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                UserLevel;                                        		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanPattern;                                      		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanBG;                                           		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanBL;                                           		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IsLookForClan;                                    		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x0070 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x007C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x0088 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved1;                                        		// 0x0094 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved2;                                        		// 0x00A0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Reserved3;                                        		// 0x00AC ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00B8 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqChannelUserListInGameRoom
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqChannelUserListInGameRoom_Parms
{
	int                                                ChannelNum;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                StartIndex;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvDeleteFriend
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvDeleteFriend_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     FromCharName;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckDeleteFriend
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckDeleteFriend_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< struct FString >                     FailedCharname;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqDeleteFriend
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqDeleteFriend_Parms
{
	class TArray< struct FString >                     DeleteCharName;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGameGuardAuthData
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGameGuardAuthData_Parms
{
	int                                                AuthDataIndex;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                AuthDataVal1;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                AuthDataVal2;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                AuthDataVal3;                                     		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGameGuardAuthData
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGameGuardAuthData_Parms
{
	int                                                AuthDataIndex;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                AuthDataVal1;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                AuthDataVal2;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                AuthDataVal3;                                     		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckCheckEquipedWeaponDurability
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckCheckEquipedWeaponDurability_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< struct FBtrDouble >                  ItemUniqueID;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemSlotNum;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqCheckEquipedWeaponDurability
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqCheckEquipedWeaponDurability_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_GetChopper
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_GetChopper_Parms
{
	int                                                GetChopperUID;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                GetChopperAssistUID;                              		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              KillXCoord;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              KillYCoord;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	float                                              KillZCoord;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                KillPos;                                          		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                KillWeaponID;                                     		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                KillWeaponPartID;                                 		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                KillRange;                                        		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                KillDamage;                                       		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                ChopperCallerID;                                  		// 0x0030 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChopperCallerName;                                		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              ChopperXCoord;                                    		// 0x0040 ( 0x0004[ CPF_Parm ]
	float                                              ChopperYCoord;                                    		// 0x0044 ( 0x0004[ CPF_Parm ]
	float                                              ChopperZCoord;                                    		// 0x0048 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x004C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckAcquirePromotionItems
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckAcquirePromotionItems_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Result;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  ItemUniqueID;                                     		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ItemIDs;                                          		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PartIDs;                                          		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0038 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckIsAvailClanURL
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckIsAvailClanURL_Parms
{
	struct FString                                     ClanURL;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqIsAvailClanURL
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqIsAvailClanURL_Parms
{
	struct FString                                     ClanURL;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetIsHostBlocking
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetIsHostBlocking_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Blocking;                                         		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetIsHostBlocking
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetIsHostBlocking_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyHostBlocking
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyHostBlocking_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Blocking;                                         		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyHostBlocking
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyHostBlocking_Parms
{
	unsigned char                                      Blocking;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetHolePunchingResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetHolePunchingResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Phrase;                                           		// 0x0004 ( 0x0001[ CPF_Parm ]
	int                                                InterventionUserID;                               		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Intervention;                                     		// 0x000C ( 0x0001[ CPF_Parm ]
	class TArray< int >                                FailedUserIDs;                                    		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetHolePunchingResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetHolePunchingResult_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyRecvDummyForHolePunching
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyRecvDummyForHolePunching_Parms
{
	int                                                ClientUserID;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Phrase;                                           		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_ChangeWeaponSet
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_ChangeWeaponSet_Parms
{
	int                                                UID;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                SetNumber;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_UpdateDomScore
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_UpdateDomScore_Parms
{
	int                                                AFScore;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RSAScore;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyRelayServerAddr
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyRelayServerAddr_Parms
{
	struct FString                                     RelayIP;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                RelayPort;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetUserHostPriorityPoint
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetUserHostPriorityPoint_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                HostPriorityPoint;                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetUserHostPriorityPoint
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetUserHostPriorityPoint_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqUpdateMyHostPriorityPoint
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqUpdateMyHostPriorityPoint_Parms
{
	int                                                HostPriorityPoint;                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqWriteServerLog
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqWriteServerLog_Parms
{
	unsigned char                                      Destination;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     LogMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_SetRoundStartTime
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_SetRoundStartTime_Parms
{
	class TArray< int >                                UID;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_SetGameStartTime
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_SetGameStartTime_Parms
{
	class TArray< int >                                UID;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvForceDisconnectUDPFromHost
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvForceDisconnectUDPFromHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckForceDisconnectUDPFromHost
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckForceDisconnectUDPFromHost_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqForceDisconnectUDPFromHost
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqForceDisconnectUDPFromHost_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_TakeAPoint
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_TakeAPoint_Parms
{
	class TArray< int >                                TakerUID;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      TakePos;                                          		// 0x000C ( 0x0001[ CPF_Parm ]
	class TArray< float >                              TakerXCoord;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< float >                              TakerYCoord;                                      		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< float >                              TakerZCoord;                                      		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TakerPos;                                         		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TakerWeaponID;                                    		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TakerWeaponPartID;                                		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TakerRange;                                       		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0064 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyChangeRoomState
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyChangeRoomState_Parms
{
	unsigned char                                      RoomState;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_DefuseBomb
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_DefuseBomb_Parms
{
	int                                                DefuserUID;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      DefusePos;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	float                                              DefuserXCoord;                                    		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              DefuserYCoord;                                    		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              DefuserZCoord;                                    		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                DefuserPos;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                DefuserWeaponID;                                  		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                DefuserWeaponPartID;                              		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                DefuserRange;                                     		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGamePlay_InstallBomb
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGamePlay_InstallBomb_Parms
{
	int                                                InstallerUID;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      InstallPos;                                       		// 0x0004 ( 0x0001[ CPF_Parm ]
	float                                              InstallerXCoord;                                  		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              InstallerYCoord;                                  		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              InstallerZCoord;                                  		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                InstallerPos;                                     		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                InstallerWeaponID;                                		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                InstallerWeaponPartID;                            		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                InstallerRange;                                   		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckDBCharInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckDBCharInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                CM_Pattern;                                       		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                CM_BG;                                            		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                CM_BL;                                            		// 0x0030 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanPersonIntro;                                  		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                MainWeaponItemID;                                 		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                MainWeaponPartID;                                 		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponItemID;                                  		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                SubWeaponPartID;                                  		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                AFSpecialCostumeItemID;                           		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                RSASpecialCostumeItemID;                          		// 0x0054 ( 0x0004[ CPF_Parm ]
	struct FCharInfo                                   stCharInfo;                                       		// 0x0058 ( 0x00C0[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0118 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x011C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqDBCharInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqDBCharInfo_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqForceNatTypeSetting
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqForceNatTypeSetting_Parms
{
	int                                                NatType;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetServerTime
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetServerTime_Parms
{
	struct FBtrDouble                                  ServerTime;                                       		// 0x0000 ( 0x0008[ CPF_Parm ]
	struct FString                                     ClientIP;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetServerTime
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetServerTime_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqLogEndEachRound
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqLogEndEachRound_Parms
{
	int                                                StartCnt;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                EndCnt;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                RoundEndType;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                RoundEndTime;                                     		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned char                                      VTeam;                                            		// 0x0010 ( 0x0001[ CPF_Parm ]
	unsigned char                                      VTeamAD;                                          		// 0x0011 ( 0x0001[ CPF_Parm ]
	int                                                AFScore;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                RSAScore;                                         		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                Round;                                            		// 0x001C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqLogGetScore
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqLogGetScore_Parms
{
	struct FKillDeathLog                               KillDeathLogParam;                                		// 0x0000 ( 0x004C[ CPF_Parm ]
	class TArray< int >                                AssistUIDs;                                       		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      AssistScores;                                     		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0064 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckAuctionTradeHistory
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckAuctionTradeHistory_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ItemID;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                PartID;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	class TArray< struct FString >                     SellerCharNm;                                     		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                DamageDegree;                                     		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Price;                                            		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x003C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqAuctionTradeHistory
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqAuctionTradeHistory_Parms
{
	int                                                ItemID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                PartID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSendGift
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSendGift_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                PointRemain;                                      		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                CashRemain;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSendGift
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSendGift_Parms
{
	int                                                ItemID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     RecvCharname;                                     		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     RecvMessage;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      BuyOption1;                                       		// 0x001C ( 0x0001[ CPF_Parm ]
	unsigned char                                      BuyOption2;                                       		// 0x001D ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGetAttachedItemFromMemo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGetAttachedItemFromMemo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                ItemID;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGetAttachedItemFromMemo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGetAttachedItemFromMemo_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MemoIdx;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ItemID;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyNewClanMember
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyNewClanMember_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckChatClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckChatClan_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Message;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Result;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqChatClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqChatClan_Parms
{
	struct FString                                     Message;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckTestDouble
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckTestDouble_Parms
{
	struct FBtrDouble                                  vDouble;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	class TArray< struct FBtrDouble >                  vDoubles;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqTestDouble
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqTestDouble_Parms
{
	struct FBtrDouble                                  vDouble;                                          		// 0x0000 ( 0x0008[ CPF_Parm ]
	class TArray< struct FBtrDouble >                  vDoubles;                                         		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyLoadingState
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyLoadingState_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                UserID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      LoadingState;                                     		// 0x0008 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqNotifyLoadingState
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqNotifyLoadingState_Parms
{
	unsigned char                                      LoadingState;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckFailedStartGame
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckFailedStartGame_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsHost;                                           		// 0x0010 ( 0x0001[ CPF_Parm ]
	int                                                FailedUserID;                                     		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                LoadingStep;                                      		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqFailedStartGame
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqFailedStartGame_Parms
{
	int                                                LoadingStep;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSuccessStartGame
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSuccessStartGame_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsHost;                                           		// 0x0010 ( 0x0001[ CPF_Parm ]
	struct FString                                     HostIP;                                           		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostPort;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                LoadingStep;                                      		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSuccessStartGame
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSuccessStartGame_Parms
{
	int                                                LoadingStep;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanCharPersonelIntro
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanCharPersonelIntro_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     PersonelIntro;                                    		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanCharPersonelIntro
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanCharPersonelIntro_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanPersonelIntro
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanPersonelIntro_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanPersonelIntro
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanPersonelIntro_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     PersonelIntro;                                    		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanChangeInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanChangeInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanChangeInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanChangeInfo_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsRecruit;                                        		// 0x000C ( 0x0001[ CPF_Parm ]
	unsigned char                                      Region;                                           		// 0x000D ( 0x0001[ CPF_Parm ]
	struct FString                                     Keyword;                                          		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanIntro;                                        		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Notice;                                           		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanClose
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanClose_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanClose
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanClose_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyClanSecession
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyClanSecession_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanSecession
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanSecession_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanSecession
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanSecession_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanNews
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanNews_Parms
{
	class TArray< struct FString >                     IssueDate;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      IssueType;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     IssuedClanMember;                                 		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanNews
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanNews_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckNotifyAdjustClanMemberGrade
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckNotifyAdjustClanMemberGrade_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      CharGrade;                                        		// 0x0018 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckAdjustClanMemberGrade
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckAdjustClanMemberGrade_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      CharGrade;                                        		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqAdjustClanMemberGrade
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqAdjustClanMemberGrade_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CharName;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      CharGrade;                                        		// 0x0018 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanUserListEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanUserListEnd_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanUserList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanUserList_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Level;                                            		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     CharName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ClanGrade;                                        		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanWinCnt;                                       		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLoseCnt;                                      		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                LevelMarkID;                                      		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TitleMarkID;                                      		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                DudeId;                                           		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0070 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanUserListStart
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanUserListStart_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                TotalCount;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanUserList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanUserList_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSearchClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSearchClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TotalPage;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ClanMarkPattern;                                  		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMarkBG;                                       		// 0x0020 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ClanMarkBL;                                       		// 0x002C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanName;                                         		// 0x0038 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanMaster;                                       		// 0x0044 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMember;                                       		// 0x0050 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanMemberMax;                                    		// 0x005C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanCreateDate;                                   		// 0x0068 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanWin;                                          		// 0x0074 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLose;                                         		// 0x0080 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanDraw;                                         		// 0x008C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanRank;                                         		// 0x0098 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ClanRecruit;                                      		// 0x00A4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                ClanLevel;                                        		// 0x00B0 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00BC ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSerachClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSerachClan_Parms
{
	unsigned char                                      SearchType;                                       		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     Keyword;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ClanStatus;                                       		// 0x0010 ( 0x0001[ CPF_Parm ]
	unsigned char                                      ClanRegion;                                       		// 0x0011 ( 0x0001[ CPF_Parm ]
	int                                                ReqPage;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckJoinClanResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckJoinClanResult_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Permit;                                           		// 0x000C ( 0x0001[ CPF_Parm ]
	struct FString                                     PermitCharName;                                   		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRecvJoinClanResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRecvJoinClanResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRecvJoinClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRecvJoinClan_Parms
{
	int                                                UserIdx;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     CharName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReqMsg;                                           		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Permit;                                           		// 0x001C ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvJoinClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvJoinClan_Parms
{
	int                                                UserIdx;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     CharName;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Message;                                          		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckJoinClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckJoinClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     SpecificCharName;                                 		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     RealRecvCharName;                                 		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      RealRecvCharClanGrade;                            		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqJoinClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqJoinClan_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanManagerName;                                  		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Message;                                          		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckInviteClanResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckInviteClanResult_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Permit;                                           		// 0x000C ( 0x0001[ CPF_Parm ]
	struct FString                                     ClanNm;                                           		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRecvClanInviteResult
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRecvClanInviteResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckRecvClanInvite
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckRecvClanInvite_Parms
{
	int                                                InviterUserDBID;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     InviterCharname;                                  		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InviterMsg;                                       		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Permit;                                           		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqRecvClanInvite
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqRecvClanInvite_Parms
{
	int                                                InviterUserDBID;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     InviterCharname;                                  		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InviteMsg;                                        		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckInviteClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckInviteClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqInviteClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqInviteClan_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InviteMsg;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckClanInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckClanInfo_Parms
{
	struct FClanInfo                                   stClanInfo;                                       		// 0x0000 ( 0x00A8[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00A8 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqClanInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqClanInfo_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckCreateClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckCreateClan_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  ItemIdx;                                          		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                StackCount;                                       		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqCreateClan
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqCreateClan_Parms
{
	struct FString                                     ClanName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanURL;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanIntro;                                        		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanKeyword;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ClanRegion;                                       		// 0x0030 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckDupCheckClanName
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckDupCheckClanName_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqDupCheckClanName
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqDupCheckClanName_Parms
{
	struct FString                                     ClanNam;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckSellShopItemInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckSellShopItemInfo_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FBtrDouble                                  UniqueItemID;                                     		// 0x0010 ( 0x0008[ CPF_Parm ]
	int                                                SellPoint;                                        		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                CurPoint;                                         		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                AfterPoint;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqSellShopItemInfo
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqSellShopItemInfo_Parms
{
	struct FBtrDouble                                  UniqueItemID;                                     		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                Count;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckGameOverEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckGameOverEnd_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqGameOverEnd
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqGameOverEnd_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckAuctionItemListCount
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckAuctionItemListCount_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ErrMsg;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Section;                                          		// 0x0010 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Classfy;                                          		// 0x0011 ( 0x0001[ CPF_Parm ]
	int                                                ItemType;                                         		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ItemGrade;                                        		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x001C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqAuctionItemListCount
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqAuctionItemListCount_Parms
{
	unsigned char                                      Section;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Classfy;                                          		// 0x0001 ( 0x0001[ CPF_Parm ]
	int                                                ItemType;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ItemGrade;                                        		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckServerTime
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckServerTime_Parms
{
	int                                                Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqServerTime
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqServerTime_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckEntryQSlotIDList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckEntryQSlotIDList_Parms
{
	int                                                UserNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< unsigned char >                      QSlotDispOrder;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWItemID;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWPartID;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                MWPaintID;                                        		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolItemID;                                     		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolPartID;                                     		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                PistolPaintID;                                    		// 0x004C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TWItemID1;                                        		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                TWItemID2;                                        		// 0x0064 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill1ID;                                         		// 0x0070 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill2ID;                                         		// 0x007C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill3ID;                                         		// 0x0088 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< int >                                Skill4ID;                                         		// 0x0094 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x00A0 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqEntryQSlotIDList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqEntryQSlotIDList_Parms
{
	int                                                UserNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckEntryQSlotUniqueIDList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckEntryQSlotUniqueIDList_Parms
{
	int                                                UserNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< unsigned char >                      QSlotDispOrder;                                   		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  MWUniqueID;                                       		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  PistolUniqueID;                                   		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  TW1UniqueID;                                      		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  TW2UniqueID;                                      		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0040 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfReqEntryQSlotUniqueIDList
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfReqEntryQSlotUniqueIDList_Parms
{
	int                                                UserNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function BatteryNet.BTTcpLink_Channel.sfAckAuctionBidding
// Flags: [ FUNC_Native ]
struct UBTTcpLink_Channel_execsfAckAuctionBidding_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
