#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : WGame
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function WGame.wAILevel.ClearReferences
// Flags: 
struct AwAILevel_execClearReferences_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function WGame.wAILevel.BotsLovePeace
// Flags: 
struct AwAILevel_execBotsLovePeace_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
	class AwAIBotBase*                                 Bot;                                              		// 0x0004 ( 0x0004
};

// Function WGame.wAILevel.ResetNames
// Flags: [ FUNC_Exec ]
struct AwAILevel_execResetNames_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
	class AwAIBotBase*                                 Bot;                                              		// 0x0004 ( 0x0004
};

// Function WGame.wAILevel.GetItemParamByGroupID
// Flags: 
struct AwAILevel_execGetItemParamByGroupID_Parms
{
	int                                                GroupID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwNPCItemGroupParam*                         ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
//	class TArray< class UwNPCItemGroupParam* >         candidates;                                       		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wAILevel.GetName
// Flags: 
struct AwAILevel_execGetName_Parms
{
	int                                                NameGroupID;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x0010 ( 0x0004
//	int                                                lp2;                                              		// 0x0014 ( 0x0004
//	class TArray< struct FString >                     nameCandidates;                                   		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
//	unsigned long                                      Found:1;                                          		// 0x0024 ( 0x0004 [0x00000001]
//	struct FString                                     curName;                                          		// 0x0028 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wAILevel.KillBot
// Flags: 
struct AwAILevel_execKillBot_Parms
{
	class AAIController*                               Bot;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WGame.wAILevel.KillBots
// Flags: 
struct AwAILevel_execKillBots_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
};

// Function WGame.wAILevel.KillBotsTeam
// Flags: 
struct AwAILevel_execKillBotsTeam_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                inTeam;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function WGame.wAILevel.RegisterBot
// Flags: 
struct AwAILevel_execRegisterBot_Parms
{
	class AwAIBotBase*                                 Bot;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAILevel.GetNPCAction
// Flags: 
struct AwAILevel_execGetNPCAction_Parms
{
	int                                                ActionGroupID;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwNPCActions*                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwNPCActions*                                A;                                                		// 0x0008 ( 0x0004
};

// Function WGame.wAILevel.ActionExists
// Flags: 
struct AwAILevel_execActionExists_Parms
{
	int                                                ActionGroupID;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Action;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0014 ( 0x0004
};

// Function WGame.wAILevel.GetNPCParam
// Flags: 
struct AwAILevel_execGetNPCParam_Parms
{
	int                                                Grade;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwNPCParam*                                  ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
//	struct FString                                     Type;                                             		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	class UwNPCSpawnParam*                             spawnParam;                                       		// 0x0018 ( 0x0004
//	class UwNPCSpawnParam*                             curParam;                                         		// 0x001C ( 0x0004
//	class TArray< class UwNPCSpawnParam* >             spawnParams;                                      		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wAILevel.GetNPCParamByNPCID
// Flags: 
struct AwAILevel_execGetNPCParamByNPCID_Parms
{
	int                                                NPCID;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwNPCParam*                                  ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function WGame.wAILevel.UpdateInfluenceListScript
// Flags: 
struct AwAILevel_execUpdateInfluenceListScript_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
	class ANavigationPoint*                            nav;                                              		// 0x0004 ( 0x0004
};

// Function WGame.wAILevel.UpdateInfluenceList
// Flags: 
struct AwAILevel_execUpdateInfluenceList_Parms
{
};

// Function WGame.wAILevel.UpdateInfluenceListNative
// Flags: [ FUNC_Native ]
struct AwAILevel_execUpdateInfluenceListNative_Parms
{
};

// Function WGame.wAILevel.UpdateAllNavs
// Flags: 
struct AwAILevel_execUpdateAllNavs_Parms
{
	class ANavigationPoint*                            nav;                                              		// 0x0000 ( 0x0004
};

// Function WGame.wAILevel.GetRandomDestFromInfluence
// Flags: 
struct AwAILevel_execGetRandomDestFromInfluence_Parms
{
	unsigned char                                      inTeam;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAILevel.GetRandomDestFromFrontLine
// Flags: 
struct AwAILevel_execGetRandomDestFromFrontLine_Parms
{
	unsigned char                                      inTeam;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAILevel.InitFrontLine
// Flags: 
struct AwAILevel_execInitFrontLine_Parms
{
	class ANavigationPoint*                            nav;                                              		// 0x0000 ( 0x0004
};

// Function WGame.wAILevel.Tick
// Flags: [ FUNC_Event ]
struct AwAILevel_eventTick_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAILevel.InitInfluenceList
// Flags: 
struct AwAILevel_execInitInfluenceList_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
	class ANavigationPoint*                            nav;                                              		// 0x0004 ( 0x0004
};

// Function WGame.wAILevel.Initialize
// Flags: 
struct AwAILevel_execInitialize_Parms
{
};

// Function WGame.wAILevel.PreBeginPlay
// Flags: [ FUNC_Event ]
struct AwAILevel_eventPreBeginPlay_Parms
{
};

// Function WGame.wState.Create
// Flags: 
struct UwState_execCreate_Parms
{
	class UwState*                                     ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwState*                                     i;                                                		// 0x0004 ( 0x0004
};

// Function WGame.ShortMemory.DisplayDebug
// Flags: 
struct UShortMemory_execDisplayDebug_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                lp1;                                              		// 0x000C ( 0x0004
	struct FString                                     S;                                                		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
	class UMemoryItem*                                 M;                                                		// 0x001C ( 0x0004
	struct FVector                                     loc;                                              		// 0x0020 ( 0x000C
};

// Function WGame.ShortMemory.GetByPawn
// Flags: [ FUNC_Event ]
struct UShortMemory_eventGetByPawn_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      createIfNotFound:1;                               		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UMemoryItem*                                 ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x000C ( 0x0004
//	class UMemoryItem*                                 M;                                                		// 0x0010 ( 0x0004
//	class UMemoryItem*                                 cm;                                               		// 0x0014 ( 0x0004
};

// Function WGame.ShortMemory.GetByPawn2
// Flags: [ FUNC_Event ]
struct UShortMemory_eventGetByPawn2_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UMemoryItem*                                 ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.ShortMemory.RemoveByPawn
// Flags: 
struct UShortMemory_execRemoveByPawn_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	class UMemoryItem*                                 M;                                                		// 0x0008 ( 0x0004
};

// Function WGame.ShortMemory.RemoveAll
// Flags: 
struct UShortMemory_execRemoveAll_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function WGame.ShortMemory.ClearReferences
// Flags: 
struct UShortMemory_execClearReferences_Parms
{
};

// Function WGame.ShortMemory.RemoveMemoriesOverRetentionTime
// Flags: 
struct UShortMemory_execRemoveMemoriesOverRetentionTime_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function WGame.ShortMemory.ByVision2
// Flags: 
struct UShortMemory_execByVision2_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.ShortMemory.ByVision
// Flags: 
struct UShortMemory_execByVision_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.ShortMemory.BySound
// Flags: 
struct UShortMemory_execBySound_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Loudness;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.ShortMemory.NotifyDestroyed
// Flags: 
struct UShortMemory_execNotifyDestroyed_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
};

// Function WGame.ShortMemory.Update
// Flags: 
struct UShortMemory_execUpdate_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	unsigned long                                      visibleChanged:1;                                 		// 0x0008 ( 0x0004 [0x00000001]
	class APawn*                                       P;                                                		// 0x000C ( 0x0004
};

// Function WGame.ShortMemory.Create
// Flags: 
struct UShortMemory_execCreate_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              inResponseTime;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UShortMemory*                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UShortMemory*                                S;                                                		// 0x000C ( 0x0004
};

// Function WGame.MemoryItem.ClearReferences
// Flags: 
struct UMemoryItem_execClearReferences_Parms
{
};

// Function WGame.MemoryItem.Update
// Flags: 
struct UMemoryItem_execUpdate_Parms
{
	float                                              Angle;                                            		// 0x0000 ( 0x0004
};

// Function WGame.MemoryItem.AddKnownPosition
// Flags: 
struct UMemoryItem_execAddKnownPosition_Parms
{
	struct FVector                                     V;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              t;                                                		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function WGame.MemoryItem.NotifyDestroyed
// Flags: 
struct UMemoryItem_execNotifyDestroyed_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.MemoryItem.Create
// Flags: 
struct UMemoryItem_execCreate_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UMemoryItem*                                 ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UMemoryItem*                                 i;                                                		// 0x000C ( 0x0004
};

// Function WGame.wAIBotBase.DisplayDebug_Path
// Flags: 
struct AwAIBotBase_execDisplayDebug_Path_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	class AActor*                                      pp;                                               		// 0x000C ( 0x0004
	struct FString                                     ppStr;                                            		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x001C ( 0x0004
};

// Function WGame.wAIBotBase.DisplayDebug
// Flags: 
struct AwAIBotBase_execDisplayDebug_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              ammoMax;                                          		// 0x000C ( 0x0004
	float                                              Ammo;                                             		// 0x0010 ( 0x0004
	struct FString                                     targetName;                                       		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     supposedTargetName;                               		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
	class UMemoryItem*                                 supposedTarget;                                   		// 0x002C ( 0x0004
};

// Function WGame.wAIBotBase.SetFireYaw
// Flags: 
struct AwAIBotBase_execSetFireYaw_Parms
{
	int                                                FireYaw;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAIBotBase.AdjustAim
// Flags: 
struct AwAIBotBase_execAdjustAim_Parms
{
	struct FFireProperties                             FiredAmmunition;                                  		// 0x0000 ( 0x0014[ CPF_Parm ]
	struct FVector                                     projStart;                                        		// 0x0014 ( 0x000C[ CPF_Parm ]
	int                                                AimError;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FRotator                                    LookDir;                                          		// 0x0030 ( 0x000C
//	struct FRotator                                    R;                                                		// 0x003C ( 0x000C
//	class APawn*                                       pawnTarget;                                       		// 0x0048 ( 0x0004
//	struct FCoords                                     C;                                                		// 0x004C ( 0x0030
//	struct FVector                                     HeadLoc;                                          		// 0x007C ( 0x000C
//	struct FVector                                     lookVect;                                         		// 0x0088 ( 0x000C
//	struct FVector                                     rightVect;                                        		// 0x0094 ( 0x000C
//	struct FVector                                     vel1;                                             		// 0x00A0 ( 0x000C
//	struct FVector                                     vel2;                                             		// 0x00AC ( 0x000C
//	float                                              aimErrorMax;                                      		// 0x00B8 ( 0x0004
//	float                                              movementFactor;                                   		// 0x00BC ( 0x0004
//	float                                              dist;                                             		// 0x00C0 ( 0x0004
//	float                                              distRatio;                                        		// 0x00C4 ( 0x0004
//	float                                              distFactorMin;                                    		// 0x00C8 ( 0x0004
//	float                                              distFactorMax;                                    		// 0x00CC ( 0x0004
//	float                                              outerRange;                                       		// 0x00D0 ( 0x0004
//	float                                              aimErrorX;                                        		// 0x00D4 ( 0x0004
//	float                                              aimErrorY;                                        		// 0x00D8 ( 0x0004
};

// Function WGame.wAIBotBase.CallHelicopter
// Flags: 
struct AwAIBotBase_execCallHelicopter_Parms
{
	unsigned long                                      ignoreSupply:1;                                   		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwHelicopter*                                P;                                                		// 0x0008 ( 0x0004
};

// Function WGame.wAIBotBase.NotifyKilled
// Flags: 
struct AwAIBotBase_execNotifyKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       KilledPawn;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAIBotBase.HearNoise
// Flags: 
struct AwAIBotBase_execHearNoise_Parms
{
	float                                              Loudness;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      NoiseMaker;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AwPawn*                                      P;                                                		// 0x0008 ( 0x0004
};

// Function WGame.wAIBotBase.SeePlayer
// Flags: [ FUNC_Event ]
struct AwAIBotBase_eventSeePlayer_Parms
{
	class APawn*                                       SeenPlayer;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAIBotBase.NotifyVehicle
// Flags: 
struct AwAIBotBase_execNotifyVehicle_Parms
{
	class AVehicle*                                    V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAIBotBase.OnMemoryVisibleChanged
// Flags: 
struct AwAIBotBase_execOnMemoryVisibleChanged_Parms
{
};

// Function WGame.wAIBotBase.HandleMessage
// Flags: 
struct AwAIBotBase_execHandleMessage_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wAIBotBase.wClientFlash
// Flags: 
struct AwAIBotBase_execwClientFlash_Parms
{
	float                                              fTime;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAIBotBase.IsProning
// Flags: 
struct AwAIBotBase_execIsProning_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAIBotBase.TryProne
// Flags: 
struct AwAIBotBase_execTryProne_Parms
{
};

// Function WGame.wAIBotBase.IsCrouching
// Flags: 
struct AwAIBotBase_execIsCrouching_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAIBotBase.TryCrouch
// Flags: 
struct AwAIBotBase_execTryCrouch_Parms
{
};

// Function WGame.wAIBotBase.IsStandingUp
// Flags: 
struct AwAIBotBase_execIsStandingUp_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAIBotBase.TryStandUp
// Flags: 
struct AwAIBotBase_execTryStandUp_Parms
{
};

// Function WGame.wAIBotBase.IsSprinting
// Flags: 
struct AwAIBotBase_execIsSprinting_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAIBotBase.SetSprint
// Flags: 
struct AwAIBotBase_execSetSprint_Parms
{
	unsigned long                                      Value:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wAIBotBase.PawnDied
// Flags: 
struct AwAIBotBase_execPawnDied_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAIBotBase.ClientOnEndWaitingForStart
// Flags: 
struct AwAIBotBase_execClientOnEndWaitingForStart_Parms
{
};

// Function WGame.wAIBotBase.ZeroExtraCost
// Flags: 
struct AwAIBotBase_execZeroExtraCost_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wAIBotBase.CopyNavExtraCost
// Flags: 
struct AwAIBotBase_execCopyNavExtraCost_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wAIBotBase.UpdateNavDetourExtraCostScript
// Flags: 
struct AwAIBotBase_execUpdateNavDetourExtraCostScript_Parms
{
	struct FVector                                     S;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     E;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
	float                                              segmentDist;                                      		// 0x0018 ( 0x0004
	float                                              dist;                                             		// 0x001C ( 0x0004
	float                                              Extra;                                            		// 0x0020 ( 0x0004
	struct FVector                                     N;                                                		// 0x0024 ( 0x000C
	class ANavigationPoint*                            np;                                               		// 0x0030 ( 0x0004
};

// Function WGame.wAIBotBase.UpdateNavDetourExtraCost
// Flags: 
struct AwAIBotBase_execUpdateNavDetourExtraCost_Parms
{
	struct FVector                                     S;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     E;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
};

// Function WGame.wAIBotBase.UpdateNavDetourExtraCostNative
// Flags: [ FUNC_Native ]
struct AwAIBotBase_execUpdateNavDetourExtraCostNative_Parms
{
	struct FVector                                     S;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     E;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
};

// Function WGame.wAIBotBase.InitNavExtraCost
// Flags: 
struct AwAIBotBase_execInitNavExtraCost_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004
	int                                                ExtraCost;                                        		// 0x0004 ( 0x0004
	int                                                maxVisCount;                                      		// 0x0008 ( 0x0004
};

// Function WGame.wAIBotBase.Cmd
// Flags: [ FUNC_Exec ]
struct AwAIBotBase_execCmd_Parms
{
	struct FString                                     P1;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     P2;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     p3;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     p4;                                               		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     p5;                                               		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class AController*                                 C;                                                		// 0x003C ( 0x0004
	class UwActionContainer*                           bestPlan;                                         		// 0x0040 ( 0x0004
	float                                              bestPlanScore;                                    		// 0x0044 ( 0x0004
};

// Function WGame.wAIBotBase.EvaluateState
// Flags: 
struct AwAIBotBase_execEvaluateState_Parms
{
	class UwState*                                     S;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wAIBotBase.SetupWStateScript
// Flags: 
struct AwAIBotBase_execSetupWStateScript_Parms
{
	class UwState*                                     S;                                                		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              MaxAmmoPrimary;                                   		// 0x0004 ( 0x0004
	float                                              CurAmmoPrimary;                                   		// 0x0008 ( 0x0004
	int                                                lp1;                                              		// 0x000C ( 0x0004
	int                                                myTeam;                                           		// 0x0010 ( 0x0004
	class AwAIPawn*                                    aiPawn;                                           		// 0x0014 ( 0x0004
	class AwWeapon*                                    Weapon;                                           		// 0x0018 ( 0x0004
	class AInventory*                                  Inv;                                              		// 0x001C ( 0x0004
};

// Function WGame.wAIBotBase.SetupWState
// Flags: 
struct AwAIBotBase_execSetupWState_Parms
{
	class UwState*                                     S;                                                		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WGame.wAIBotBase.SetupWStateNative
// Flags: [ FUNC_Native ]
struct AwAIBotBase_execSetupWStateNative_Parms
{
	class UwState*                                     S;                                                		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WGame.wAIBotBase.NotifyAddDefaultInventory
// Flags: 
struct AwAIBotBase_execNotifyAddDefaultInventory_Parms
{
};

// Function WGame.wAIBotBase.NotifyAddInventory
// Flags: 
struct AwAIBotBase_execNotifyAddInventory_Parms
{
	class AInventory*                                  NewItem;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wAIBotBase.SetupWeapons
// Flags: 
struct AwAIBotBase_execSetupWeapons_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                lp1;                                              		// 0x0008 ( 0x0004
	class TArray< class UwNPCItemGroupParam* >         items;                                            		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wAIBotBase.SetPawnClass
// Flags: 
struct AwAIBotBase_execSetPawnClass_Parms
{
	struct FString                                     inClass;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InCharacter;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wAIBotBase.SetName
// Flags: 
struct AwAIBotBase_execSetName_Parms
{
	class UwNPCParam*                                  Param;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	class AController*                                 C;                                                		// 0x0008 ( 0x0004
	struct FString                                     nameCandidate;                                    		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wAIBotBase.InitBot
// Flags: 
struct AwAIBotBase_execInitBot_Parms
{
	int                                                Grade;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwNPCItemGroupParam*                         npcItemParam;                                     		// 0x0004 ( 0x0004
};

// Function WGame.wAIBotBase.PostBeginPlay
// Flags: [ FUNC_Event ]
struct AwAIBotBase_eventPostBeginPlay_Parms
{
};

// Function WGame.wAIBotBase.ClearReferences
// Flags: 
struct AwAIBotBase_execClearReferences_Parms
{
};

// Function WGame.wAIBotBase.WeaponFireAgain
// Flags: 
struct AwAIBotBase_execWeaponFireAgain_Parms
{
	float                                              RefireRate;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bFinishedFire:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayerInfo.Setup
// Flags: 
struct UwPlayerInfo_execSetup_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FPlayerRecord                               Rec;                                              		// 0x0004 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0100 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UMesh*                                       NewMesh;                                          		// 0x0104 ( 0x0004
//	struct FPlayerSet                                  NewPlayerSet;                                     		// 0x0108 ( 0x0030[ CPF_NeedCtorLink ]
};

// Function WGame.wPlayerInfo.SetupPawn
// Flags: 
struct UwPlayerInfo_execSetupPawn_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iBodyItemID;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                iHeadItemID;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                iHelmetItemID;                                    		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                iAcceItemID;                                      		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                iTeamIndex;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwGameManager*                               gm;                                               		// 0x001C ( 0x0004
//	class UwItemResourceParam*                         resParam;                                         		// 0x0020 ( 0x0004
//	class UMesh*                                       NewMesh;                                          		// 0x0024 ( 0x0004
};

// Function WGame.SpeciesType.GetOffsetForSequence
// Flags: 
struct USpeciesType_execGetOffsetForSequence_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function WGame.SpeciesType.Setup
// Flags: 
struct USpeciesType_execSetup_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FPlayerRecord                               Rec;                                              		// 0x0004 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0100 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UMesh*                                       customskel;                                       		// 0x0104 ( 0x0004
//	struct FString                                     SkelName;                                         		// 0x0108 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                TeamNum;                                          		// 0x0114 ( 0x0004
//	int                                                i;                                                		// 0x0118 ( 0x0004
//	int                                                j;                                                		// 0x011C ( 0x0004
};

// Function WGame.SpeciesType.SetTeamSkin
// Flags: 
struct USpeciesType_execSetTeamSkin_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FPlayerRecord                               Rec;                                              		// 0x0004 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                TeamNum;                                          		// 0x0100 ( 0x0004[ CPF_Parm ]
};

// Function WGame.SpeciesType.GetRagSkelName
// Flags: 
struct USpeciesType_execGetRagSkelName_Parms
{
	struct FString                                     MeshName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.SpeciesType.ModifyPawn
// Flags: 
struct USpeciesType_execModifyPawn_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.SpeciesType.ModifyImpartedDamage
// Flags: 
struct USpeciesType_execModifyImpartedDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       injured;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       instigatedBy;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.SpeciesType.ModifyReceivedDamage
// Flags: 
struct USpeciesType_execModifyReceivedDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       injured;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       instigatedBy;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.SpeciesType.LoadResources
// Flags: 
struct USpeciesType_execLoadResources_Parms
{
	struct FPlayerRecord                               Rec;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	class ALevelInfo*                                  Level;                                            		// 0x00FC ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0100 ( 0x0004[ CPF_Parm ]
	int                                                TeamNum;                                          		// 0x0104 ( 0x0004[ CPF_Parm ]
	struct FString                                     BodySkinName;                                     		// 0x0108 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     SkelName;                                         		// 0x0114 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     FaceSkinName;                                     		// 0x0120 ( 0x000C[ CPF_NeedCtorLink ]
	class UMaterial*                                   NewBodySkin;                                      		// 0x012C ( 0x0004
	class UMaterial*                                   NewFaceSkin;                                      		// 0x0130 ( 0x0004
	class UMaterial*                                   TeamFaceSkin;                                     		// 0x0134 ( 0x0004
	class UClass*                                      GibGroupClass;                                    		// 0x0138 ( 0x0004
	class UMesh*                                       customskel;                                       		// 0x013C ( 0x0004
};

// Function WGame.SpeciesType.GetVoiceType
// Flags: 
struct USpeciesType_execGetVoiceType_Parms
{
	unsigned long                                      bIsFemale:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class ALevelInfo*                                  Level;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wUtil.GetMutatorClasses
// Flags: [ FUNC_Simulated ]
struct UwUtil_execGetMutatorClasses_Parms
{
	class TArray< struct FString >                     MutClassNames;                                    		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class TArray< class UClass* >                      ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	int                                                j;                                                		// 0x001C ( 0x0004
//	class TArray< class UClass* >                      Arr;                                              		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FMutatorRecord >              LocalRecords;                                     		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wUtil.GetTeamInfoSalaryFor
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execGetTeamInfoSalaryFor_Parms
{
	class AUnrealTeamInfo*                             UT;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	int                                                numchars;                                         		// 0x0014 ( 0x0004
};

// Function WGame.wUtil.GetTeamSalaryFor
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execGetTeamSalaryFor_Parms
{
	class UGameProfile*                                GP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	int                                                numchars;                                         		// 0x0014 ( 0x0004
};

// Function WGame.wUtil.TeamArrayTacticsRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamArrayTacticsRating_Parms
{
	class TArray< struct FString >                     Players;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x0010 ( 0x0004
//	float                                              Count;                                            		// 0x0014 ( 0x0004
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x001C ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.wUtil.TeamInfoTacticsRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamInfoTacticsRating_Parms
{
	class AUnrealTeamInfo*                             UT;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.TeamTacticsRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamTacticsRating_Parms
{
	class UGameProfile*                                GP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.TeamArrayAgilityRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamArrayAgilityRating_Parms
{
	class TArray< struct FString >                     Players;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x0010 ( 0x0004
//	float                                              Count;                                            		// 0x0014 ( 0x0004
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x001C ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.wUtil.TeamInfoAgilityRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamInfoAgilityRating_Parms
{
	class AUnrealTeamInfo*                             UT;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.TeamAgilityRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamAgilityRating_Parms
{
	class UGameProfile*                                GP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.TeamArrayAggressivenessRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamArrayAggressivenessRating_Parms
{
	class TArray< struct FString >                     Players;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x0010 ( 0x0004
//	float                                              Count;                                            		// 0x0014 ( 0x0004
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x001C ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.wUtil.TeamInfoAggressivenessRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamInfoAggressivenessRating_Parms
{
	class AUnrealTeamInfo*                             UT;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.TeamAggressivenessRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamAggressivenessRating_Parms
{
	class UGameProfile*                                GP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.TeamArrayAccuracyRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamArrayAccuracyRating_Parms
{
	class TArray< struct FString >                     Players;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x0010 ( 0x0004
//	float                                              Count;                                            		// 0x0014 ( 0x0004
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x001C ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.wUtil.TeamInfoAccuracyRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamInfoAccuracyRating_Parms
{
	class AUnrealTeamInfo*                             UT;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.TeamAccuracyRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTeamAccuracyRating_Parms
{
	class UGameProfile*                                GP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lineupsize;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                retval;                                           		// 0x000C ( 0x0004
//	float                                              Count;                                            		// 0x0010 ( 0x0004
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0018 ( 0x00FC[ CPF_NeedCtorLink ]
//	int                                                numchars;                                         		// 0x0114 ( 0x0004
};

// Function WGame.wUtil.AggressivenessRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execAggressivenessRating_Parms
{
	struct FPlayerRecord                               PRE;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x00FC ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wUtil.TacticsRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execTacticsRating_Parms
{
	struct FPlayerRecord                               PRE;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x00FC ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wUtil.AgilityRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execAgilityRating_Parms
{
	struct FPlayerRecord                               PRE;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x00FC ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Add;                                              		// 0x0100 ( 0x0004
};

// Function WGame.wUtil.AccuracyRating
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execAccuracyRating_Parms
{
	struct FPlayerRecord                               PRE;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x00FC ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wUtil.RatingModifier
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execRatingModifier_Parms
{
	struct FString                                     CharacterName;                                    		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Hash;                                             		// 0x0010 ( 0x0004
};

// Function WGame.wUtil.GetFavoriteWeaponFor
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execGetFavoriteWeaponFor_Parms
{
	struct FPlayerRecord                               PRE;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x00FC ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class UClass*                                      WeaponClass;                                      		// 0x0108 ( 0x0004
};

// Function WGame.wUtil.GetSalaryFor
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execGetSalaryFor_Parms
{
	struct FPlayerRecord                               PRE;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x00FC ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Salary;                                           		// 0x0100 ( 0x0004
};

// Function WGame.wUtil.FindPlayerRecord
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct UwUtil_execFindPlayerRecord_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FPlayerRecord                               ReturnValue;                                      		// 0x000C ( 0x00FC[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FPlayerRecord                               PRE;                                              		// 0x0108 ( 0x00FC[ CPF_NeedCtorLink ]
//	class UClass*                                      PRClass;                                          		// 0x0204 ( 0x0004
};

// Function WGame.wUtil.GetMutatorList
// Flags: [ FUNC_Final ]
struct UwUtil_execGetMutatorList_Parms
{
	class TArray< struct FMutatorRecord >              MutatorRecords;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wUtil.LoadDecoText
// Flags: [ FUNC_Final | FUNC_Native ]
struct UwUtil_execLoadDecoText_Parms
{
	struct FString                                     PackageName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     DecoTextName;                                     		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ColumnCount;                                      		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UDecoText*                                   ReturnValue;                                      		// 0x001C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wUtil.FindUPLPlayerRecord
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
// iNative: 0x00000234 ( 564 )
struct UwUtil_execFindUPLPlayerRecord_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FPlayerRecord                               ReturnValue;                                      		// 0x000C ( 0x00FC[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wUtil.GetPlayerRecord
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
// iNative: 0x00000233 ( 563 )
struct UwUtil_execGetPlayerRecord_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FPlayerRecord                               ReturnValue;                                      		// 0x0004 ( 0x00FC[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wUtil.GetPlayerList
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
// iNative: 0x00000232 ( 562 )
struct UwUtil_execGetPlayerList_Parms
{
	class TArray< struct FPlayerRecord >               PlayerRecords;                                    		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function WGame.wEntryGameInfo.PrecacheGameSkeletalMeshes
// Flags: 
struct AwEntryGameInfo_execPrecacheGameSkeletalMeshes_Parms
{
	class ALevelInfo*                                  myLevel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wEntryGameInfo.PrecacheGameStaticMeshes
// Flags: 
struct AwEntryGameInfo_execPrecacheGameStaticMeshes_Parms
{
	class ALevelInfo*                                  myLevel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wEntryGameInfo.PrecacheGameTextures
// Flags: 
struct AwEntryGameInfo_execPrecacheGameTextures_Parms
{
	class ALevelInfo*                                  myLevel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wEntryGameInfo.PostLogin
// Flags: [ FUNC_Event ]
struct AwEntryGameInfo_eventPostLogin_Parms
{
	class APlayerController*                           NewPlayer;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.PlayerRecordClass.FillPlayerRecord
// Flags: [ FUNC_Simulated ]
struct UPlayerRecordClass_execFillPlayerRecord_Parms
{
	struct FPlayerRecord                               ReturnValue;                                      		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FPlayerRecord                               PRE;                                              		// 0x00FC ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.wPawn.AddIdentificationFriend
// Flags: [ FUNC_Simulated ]
struct AwPawn_execAddIdentificationFriend_Parms
{
};

// Function WGame.wPawn.reset_weapon
// Flags: [ FUNC_Exec ]
struct AwPawn_execreset_weapon_Parms
{
	class UwWeaponBaseParams*                          WBP;                                              		// 0x0000 ( 0x0004
	unsigned char                                      i;                                                		// 0x0004 ( 0x0001
};

// Function WGame.wPawn.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct AwPawn_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WGame.wPawn.SetBurning
// Flags: 
struct AwPawn_execSetBurning_Parms
{
	unsigned long                                      bBurn:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AwProjectile*                                proj;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.GetWeaponAttachmentInfo
// Flags: [ FUNC_Simulated ]
struct AwPawn_execGetWeaponAttachmentInfo_Parms
{
	unsigned char                                      byFlashCount;                                     		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      byFiringMode;                                     		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
};

// Function WGame.wPawn.SetWeaponQuickChange
// Flags: 
struct AwPawn_execSetWeaponQuickChange_Parms
{
	unsigned long                                      bOn:1;                                            		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPawn.SetWeaponQuickReload
// Flags: 
struct AwPawn_execSetWeaponQuickReload_Parms
{
	unsigned long                                      bOn:1;                                            		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AInventory*                                  Inv;                                              		// 0x0004 ( 0x0004
	int                                                Count;                                            		// 0x0008 ( 0x0004
};

// Function WGame.wPawn.SetWeaponQuickAimZoom
// Flags: 
struct AwPawn_execSetWeaponQuickAimZoom_Parms
{
	unsigned long                                      bOn:1;                                            		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AInventory*                                  Inv;                                              		// 0x0004 ( 0x0004
	int                                                Count;                                            		// 0x0008 ( 0x0004
};

// Function WGame.wPawn.AddWeaponMagazine
// Flags: 
struct AwPawn_execAddWeaponMagazine_Parms
{
	class AInventory*                                  Inv;                                              		// 0x0000 ( 0x0004
	int                                                Count;                                            		// 0x0004 ( 0x0004
};

// Function WGame.wPawn.SetRemoveWeaponSkill
// Flags: 
struct AwPawn_execSetRemoveWeaponSkill_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                j;                                                		// 0x0008 ( 0x0004
	int                                                iCount;                                           		// 0x000C ( 0x0004
	class UwWeaponCustomPartsParam*                    wcpp;                                             		// 0x0010 ( 0x0004
	int                                                iSightPartID;                                     		// 0x0014 ( 0x0004
	int                                                iSilencerPartID;                                  		// 0x0018 ( 0x0004
	int                                                iBarrelPartID;                                    		// 0x001C ( 0x0004
	int                                                iGunstockPartID;                                  		// 0x0020 ( 0x0004
	class TArray< int >                                PartSkillList;                                    		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPawn.SetAddWeaponSkill
// Flags: 
struct AwPawn_execSetAddWeaponSkill_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iaWeaponID;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                iPartsID;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x000C ( 0x0004
	int                                                iCheck;                                           		// 0x0010 ( 0x0004
	int                                                j;                                                		// 0x0014 ( 0x0004
	class UwSkillBase*                                 SkillBase;                                        		// 0x0018 ( 0x0004
	class UwWeaponCustomPartsParam*                    wcpp;                                             		// 0x001C ( 0x0004
	int                                                iSightPartID;                                     		// 0x0020 ( 0x0004
	int                                                iSilencerPartID;                                  		// 0x0024 ( 0x0004
	int                                                iBarrelPartID;                                    		// 0x0028 ( 0x0004
	int                                                iGunstockPartID;                                  		// 0x002C ( 0x0004
	class TArray< int >                                PartSkillList;                                    		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPawn.RenderFPWeaponAttachment
// Flags: [ FUNC_Simulated ]
struct AwPawn_execRenderFPWeaponAttachment_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.MakeShellEffect_Rechamber
// Flags: [ FUNC_Simulated ]
struct AwPawn_execMakeShellEffect_Rechamber_Parms
{
};

// Function WGame.wPawn.MakeShellEffect
// Flags: [ FUNC_Simulated ]
struct AwPawn_execMakeShellEffect_Parms
{
};

// Function WGame.wPawn.ServerCallNoWeaponMessage
// Flags: 
struct AwPawn_execServerCallNoWeaponMessage_Parms
{
	unsigned char                                      bySlot;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	class UwWeaponBaseParams*                          WBP;                                              		// 0x0008 ( 0x0004
	class UwItemResourceParam*                         resParam;                                         		// 0x000C ( 0x0004
};

// Function WGame.wPawn.AddNoWeaponChangeMessage
// Flags: [ FUNC_Simulated ]
struct AwPawn_execAddNoWeaponChangeMessage_Parms
{
	unsigned char                                      bySlot;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function WGame.wPawn.HandlePickup
// Flags: 
struct AwPawn_execHandlePickup_Parms
{
	class APickup*                                     pick;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwWeaponPickup*                              WPick;                                            		// 0x0004 ( 0x0004
	class AwWeapon*                                    W;                                                		// 0x0008 ( 0x0004
	class AwWeapon*                                    W2Drop;                                           		// 0x000C ( 0x0004
	class AInventory*                                  invW;                                             		// 0x0010 ( 0x0004
	class UwItemBaseParam*                             ItemParam;                                        		// 0x0014 ( 0x0004
};

// Function WGame.wPawn.PlayReload
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayReload_Parms
{
	struct FName                                       CurrentReload3rd;                                 		// 0x0000 ( 0x0004
};

// Function WGame.wPawn.PlayRechamber
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayRechamber_Parms
{
	struct FName                                       CurAnimName;                                      		// 0x0000 ( 0x0004
	class AwGun*                                       Gun;                                              		// 0x0004 ( 0x0004
};

// Function WGame.wPawn.PlayMelee
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayMelee_Parms
{
	unsigned long                                      bMeleeKnifeOrButt:1;                              		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FName                                       CurrentMelee3rd;                                  		// 0x0004 ( 0x0004
};

// Function WGame.wPawn.PostRender2D
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventPostRender2D_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ScreenLocX;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              ScreenLocY;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.SpawnSupplyItem
// Flags: 
struct AwPawn_execSpawnSupplyItem_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              fRandom;                                          		// 0x0004 ( 0x0004
//	class UwMapInfo*                                   mapInfo;                                          		// 0x0008 ( 0x0004
//	class AActor*                                      spawnedActor;                                     		// 0x000C ( 0x0004
//	int                                                spawnID;                                          		// 0x0010 ( 0x0004
//	class UwMatchMaker*                                kMM;                                              		// 0x0014 ( 0x0004
};

// Function WGame.wPawn.SpawnMedals
// Flags: 
struct AwPawn_execSpawnMedals_Parms
{
	class AActor*                                      spawnedActor;                                     		// 0x0000 ( 0x0004
	struct FVector                                     offset;                                           		// 0x0004 ( 0x000C
	struct FRotator                                    Rotation;                                         		// 0x0010 ( 0x000C
};

// Function WGame.wPawn.ClientSwitchToLastWeapon
// Flags: [ FUNC_Simulated ]
struct AwPawn_execClientSwitchToLastWeapon_Parms
{
	unsigned char                                      defuseSwitch;                                     		// 0x0000 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPawn.SetSpecialState
// Flags: 
struct AwPawn_execSetSpecialState_Parms
{
	unsigned char                                      byState;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function WGame.wPawn.ServerQSlotChangeCheck
// Flags: 
struct AwPawn_execServerQSlotChangeCheck_Parms
{
	int                                                PlayerID;                                         		// 0x0000 ( 0x0004
};

// Function WGame.wPawn.ClientQSlotChangeCheck
// Flags: [ FUNC_Simulated ]
struct AwPawn_execClientQSlotChangeCheck_Parms
{
};

// Function WGame.wPawn.AddBaseInvenWeapon
// Flags: 
struct AwPawn_execAddBaseInvenWeapon_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iPos;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x000C ( 0x0004
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0010 ( 0x0010
};

// Function WGame.wPawn.SetSelectedQuickSlotInventory
// Flags: 
struct AwPawn_execSetSelectedQuickSlotInventory_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bQuickslotChange:1;                               		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	int                                                j;                                                		// 0x000C ( 0x0004
	int                                                PlayerID;                                         		// 0x0010 ( 0x0004
	int                                                iSelectedQSlotIndex;                              		// 0x0014 ( 0x0004
	int                                                iPrevSelectedQSlotIndex;                          		// 0x0018 ( 0x0004
	int                                                iSlotPos;                                         		// 0x001C ( 0x0004
	struct FBtrDouble                                  targetUniqueID;                                   		// 0x0020 ( 0x0008
	class UwMatchMaker*                                kMM;                                              		// 0x0028 ( 0x0004
	struct FEquippedQSlotInfo                          curQSlot;                                         		// 0x002C ( 0x0084
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x00B0 ( 0x0010
	unsigned long                                      HasWeaponInSlot:1;                                		// 0x00C0 ( 0x0004 [0x00000001]
	unsigned long                                      bPermitWeaponChange:1;                            		// 0x00C4 ( 0x0004 [0x00000001]
	class UwWeaponBaseParams*                          WBP;                                              		// 0x00C8 ( 0x0004
};

// Function WGame.wPawn.AddWeaponByWeaponLimited
// Flags: 
struct AwPawn_execAddWeaponByWeaponLimited_Parms
{
	int                                                iWeaponID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iPartsID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FBtrDouble                                  UniqueID;                                         		// 0x0008 ( 0x0008[ CPF_Parm ]
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0010 ( 0x0010
};

// Function WGame.wPawn.SetInfiniteAmmoTutorial
// Flags: 
struct AwPawn_execSetInfiniteAmmoTutorial_Parms
{
	unsigned long                                      bDeleteGranade:1;                                 		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                iGranadeCount;                                    		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AInventory*                                  Inv;                                              		// 0x0008 ( 0x0004
	class AwWeapon*                                    W;                                                		// 0x000C ( 0x0004
	int                                                ammoCount;                                        		// 0x0010 ( 0x0004
	int                                                iAmmoAmount;                                      		// 0x0014 ( 0x0004
	unsigned long                                      bSetGR:1;                                         		// 0x0018 ( 0x0004 [0x00000001]
};

// Function WGame.wPawn.SetInfiniteAmmo
// Flags: 
struct AwPawn_execSetInfiniteAmmo_Parms
{
	int                                                ammoCount;                                        		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AInventory*                                  Inv;                                              		// 0x0004 ( 0x0004
	class AwWeapon*                                    W;                                                		// 0x0008 ( 0x0004
	class AwGun*                                       G;                                                		// 0x000C ( 0x0004
};

// Function WGame.wPawn.DoSortEquipedItems
// Flags: 
struct AwPawn_execDoSortEquipedItems_Parms
{
	class UwMatchUserInfo*                             kUserInfo;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FEquippedItemInfo                           temp;                                             		// 0x0004 ( 0x0024
	int                                                nLength;                                          		// 0x0028 ( 0x0004
	int                                                i;                                                		// 0x002C ( 0x0004
	int                                                j;                                                		// 0x0030 ( 0x0004
	class UwWeaponManager*                             WM;                                               		// 0x0034 ( 0x0004
	class UwWeaponBaseParams*                          kLWB;                                             		// 0x0038 ( 0x0004
	class UwWeaponBaseParams*                          kRWB;                                             		// 0x003C ( 0x0004
};

// Function WGame.wPawn.CheckWeaponBySubGameMode
// Flags: 
struct AwPawn_execCheckWeaponBySubGameMode_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0008 ( 0x0004
//	class UwWeaponBaseParams*                          WBP;                                              		// 0x000C ( 0x0004
//	class UwMyPlayerStatus*                            MyStatus;                                         		// 0x0010 ( 0x0004
//	int                                                iItemID;                                          		// 0x0014 ( 0x0004
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	class UwMatchMaker*                                kMM;                                              		// 0x001C ( 0x0004
};

// Function WGame.wPawn.AddDefaultInventoryDOA
// Flags: 
struct AwPawn_execAddDefaultInventoryDOA_Parms
{
	unsigned long                                      bQuickslotChange:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                PlayerID;                                         		// 0x0008 ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x000C ( 0x0004
	class UwMatchUserInfo*                             kUser;                                            		// 0x0010 ( 0x0004
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0014 ( 0x0010
};

// Function WGame.wPawn.SetGrenadlInvenByWeaponLimited
// Flags: 
struct AwPawn_execSetGrenadlInvenByWeaponLimited_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwMatchMaker*                                kMM;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwMatchUserInfo*                             kUser;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      IsQuick:1;                                        		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0010 ( 0x0010
	struct FEquippedQSlotInfo                          curQSlot;                                         		// 0x0020 ( 0x0084
	class UwWeaponBaseParams*                          WBP;                                              		// 0x00A4 ( 0x0004
	int                                                iItemID;                                          		// 0x00A8 ( 0x0004
	int                                                k;                                                		// 0x00AC ( 0x0004
};

// Function WGame.wPawn.SetFlameThrowerlInvenByWeaponLimited
// Flags: 
struct AwPawn_execSetFlameThrowerlInvenByWeaponLimited_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwMatchMaker*                                kMM;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwMatchUserInfo*                             kUser;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      IsQuick:1;                                        		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0010 ( 0x0010
	struct FEquippedQSlotInfo                          curQSlot;                                         		// 0x0020 ( 0x0084
	class UwWeaponBaseParams*                          WBP;                                              		// 0x00A4 ( 0x0004
	int                                                iItemID;                                          		// 0x00A8 ( 0x0004
};

// Function WGame.wPawn.SetMGlInvenByWeaponLimited
// Flags: 
struct AwPawn_execSetMGlInvenByWeaponLimited_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwMatchMaker*                                kMM;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwMatchUserInfo*                             kUser;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      IsQuick:1;                                        		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0010 ( 0x0010
	struct FEquippedQSlotInfo                          curQSlot;                                         		// 0x0020 ( 0x0084
	class UwWeaponBaseParams*                          WBP;                                              		// 0x00A4 ( 0x0004
	int                                                iItemID;                                          		// 0x00A8 ( 0x0004
};

// Function WGame.wPawn.SetShotGunlInvenByWeaponLimited
// Flags: 
struct AwPawn_execSetShotGunlInvenByWeaponLimited_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwMatchMaker*                                kMM;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwMatchUserInfo*                             kUser;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      IsQuick:1;                                        		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0010 ( 0x0010
	struct FEquippedQSlotInfo                          curQSlot;                                         		// 0x0020 ( 0x0084
	class UwWeaponBaseParams*                          WBP;                                              		// 0x00A4 ( 0x0004
	int                                                iItemID;                                          		// 0x00A8 ( 0x0004
};

// Function WGame.wPawn.SetPistolInvenByWeaponLimited
// Flags: 
struct AwPawn_execSetPistolInvenByWeaponLimited_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwMatchMaker*                                kMM;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwMatchUserInfo*                             kUser;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      IsQuick:1;                                        		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0010 ( 0x0010
	struct FEquippedQSlotInfo                          curQSlot;                                         		// 0x0020 ( 0x0084
	class UwWeaponBaseParams*                          WBP;                                              		// 0x00A4 ( 0x0004
	int                                                iItemID;                                          		// 0x00A8 ( 0x0004
};

// Function WGame.wPawn.AddDefaultInventory
// Flags: 
struct AwPawn_execAddDefaultInventory_Parms
{
	unsigned long                                      bQuickslotChange:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                PlayerID;                                         		// 0x0008 ( 0x0004
	int                                                PartsID;                                          		// 0x000C ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x0010 ( 0x0004
	class UwMatchUserInfo*                             kUser;                                            		// 0x0014 ( 0x0004
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x0018 ( 0x0010
};

// Function WGame.wPawn.RemoveAllInventory
// Flags: 
struct AwPawn_execRemoveAllInventory_Parms
{
};

// Function WGame.wPawn.ChangeInventoryByQSlot
// Flags: 
struct AwPawn_execChangeInventoryByQSlot_Parms
{
	class AInventory*                                  tmInv;                                            		// 0x0000 ( 0x0004
	class AInventory*                                  tmDel;                                            		// 0x0004 ( 0x0004
	class AInventory*                                  tmStart;                                          		// 0x0008 ( 0x0004
};

// Function WGame.wPawn.GetSlotPosbySkillID
// Flags: 
struct AwPawn_execGetSlotPosbySkillID_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iSkillID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function WGame.wPawn.GetInvenSkillIDbyPos
// Flags: 
struct AwPawn_execGetInvenSkillIDbyPos_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iPos;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
//	int                                                iResult;                                          		// 0x0010 ( 0x0004
//	class UwMatchMaker*                                kMM;                                              		// 0x0014 ( 0x0004
};

// Function WGame.wPawn.AddBaseInvenSkill
// Flags: 
struct AwPawn_execAddBaseInvenSkill_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iPos;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function WGame.wPawn.SetSelectedQuickSlotSkills
// Flags: 
struct AwPawn_execSetSelectedQuickSlotSkills_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                remList;                                          		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	struct FEquippedQSlotInfo                          curQSlot;                                         		// 0x0010 ( 0x0084
	int                                                i;                                                		// 0x0094 ( 0x0004
	int                                                j;                                                		// 0x0098 ( 0x0004
	unsigned long                                      bFind:1;                                          		// 0x009C ( 0x0004 [0x00000001]
	class UwSkillBase*                                 SkillBase;                                        		// 0x00A0 ( 0x0004
	class UwWeaponCustomPartsParam*                    wcpp;                                             		// 0x00A4 ( 0x0004
	int                                                iSightPartID;                                     		// 0x00A8 ( 0x0004
	int                                                iSilencerPartID;                                  		// 0x00AC ( 0x0004
	int                                                iBarrelPartID;                                    		// 0x00B0 ( 0x0004
	int                                                iGunstockPartID;                                  		// 0x00B4 ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x00B8 ( 0x0004
};

// Function WGame.wPawn.AddWeaponFromSkill
// Flags: 
struct AwPawn_execAddWeaponFromSkill_Parms
{
	struct FBtrDouble                                  iUniqueID;                                        		// 0x0000 ( 0x0008[ CPF_Parm ]
	int                                                iaWeaponID;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FsStartWeaponInfo                           sInfo;                                            		// 0x000C ( 0x0010
};

// Function WGame.wPawn.AddSkillByInventory
// Flags: 
struct AwPawn_execAddSkillByInventory_Parms
{
	class UwMatchUserInfo*                             kUser;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                j;                                                		// 0x0008 ( 0x0004
	class UwItemBaseParam*                             ItemParam;                                        		// 0x000C ( 0x0004
};

// Function WGame.wPawn.AddDefaultSkills
// Flags: 
struct AwPawn_execAddDefaultSkills_Parms
{
	unsigned long                                      bQuickslotChange:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x0008 ( 0x0004
	class UwMatchUserInfo*                             kUser;                                            		// 0x000C ( 0x0004
};

// Function WGame.wPawn.GetGibParts
// Flags: [ FUNC_Simulated ]
struct AwPawn_execGetGibParts_Parms
{
	int                                                iCollisionPart;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.SpawnGoreGiblet
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSpawnGoreGiblet_Parms
{
	int                                                iIndex;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FCoords                                     boneCoords;                                       		// 0x0004 ( 0x0030
	float                                              GibPerterbation;                                  		// 0x0034 ( 0x0004
	unsigned char                                      eTemp;                                            		// 0x0038 ( 0x0001
	struct FVector                                     direction;                                        		// 0x003C ( 0x000C
	struct FVector                                     Dummy;                                            		// 0x0048 ( 0x000C
	struct FVector                                     GibVelocity;                                      		// 0x0054 ( 0x000C
};

// Function WGame.wPawn.MakeGorePawn
// Flags: [ FUNC_Simulated ]
struct AwPawn_execMakeGorePawn_Parms
{
	int                                                iPart;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                j;                                                		// 0x0008 ( 0x0004
	class UMesh*                                       NewMesh;                                          		// 0x000C ( 0x0004
	unsigned char                                      eTemp;                                            		// 0x0010 ( 0x0001
	unsigned char                                      eTempAdd;                                         		// 0x0011 ( 0x0001
	int                                                iTeamNum;                                         		// 0x0014 ( 0x0004
	struct FName                                       Anim;                                             		// 0x0018 ( 0x0004
	float                                              frame;                                            		// 0x001C ( 0x0004
	float                                              Rate;                                             		// 0x0020 ( 0x0004
};

// Function WGame.wPawn.EndCrouch
// Flags: [ FUNC_Event ]
struct AwPawn_eventEndCrouch_Parms
{
	float                                              HeightAdjust;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.EndProne
// Flags: [ FUNC_Event ]
struct AwPawn_eventEndProne_Parms
{
	float                                              HeightAdjust;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.SetParts
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSetParts_Parms
{
	unsigned char                                      iPartsIndex;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UMesh*                                       resMesh;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UStaticMesh*                                 resStaticMesh;                                    		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     tmLoc;                                            		// 0x000C ( 0x000C
};

// Function WGame.wPawn.ResetAllParts
// Flags: [ FUNC_Simulated ]
struct AwPawn_execResetAllParts_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPawn.Died
// Flags: 
struct AwPawn_execDied_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0008 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                WeaponType;                                       		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bWallShot:1;                                      		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPawn.DoDerezEffect
// Flags: [ FUNC_Simulated ]
struct AwPawn_execDoDerezEffect_Parms
{
};

// Function WGame.wPawn.GetGibClass
// Flags: 
struct AwPawn_execGetGibClass_Parms
{
	unsigned char                                      gibType;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UClass*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.GetSound
// Flags: 
struct AwPawn_execGetSound_Parms
{
	unsigned char                                      soundType;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
	class USound*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.ResetPhysicsBasedAnim
// Flags: [ FUNC_Simulated ]
struct AwPawn_execResetPhysicsBasedAnim_Parms
{
};

// Function WGame.wPawn.Setup
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSetup_Parms
{
	struct FPlayerRecord                               Rec;                                              		// 0x0000 ( 0x00FC[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bLoadNow:1;                                       		// 0x00FC ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                iSideIndex;                                       		// 0x0100 ( 0x0004
	class UwPartsGroupParam*                           tmParam;                                          		// 0x0104 ( 0x0004
	int                                                BodyID;                                           		// 0x0108 ( 0x0004
	int                                                HeadID;                                           		// 0x010C ( 0x0004
	int                                                FaceID;                                           		// 0x0110 ( 0x0004
	int                                                AcceID;                                           		// 0x0114 ( 0x0004
	class UwItemResourceParam*                         resParam;                                         		// 0x0118 ( 0x0004
};

// Function WGame.wPawn.GetDefaultCharacter
// Flags: [ FUNC_Simulated ]
struct AwPawn_execGetDefaultCharacter_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wPawn.ForceDefaultCharacter
// Flags: [ FUNC_Simulated ]
struct AwPawn_execForceDefaultCharacter_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           P;                                                		// 0x0004 ( 0x0004
};

// Function WGame.wPawn.CheckValidMaleDefault
// Flags: [ FUNC_Simulated ]
struct AwPawn_execCheckValidMaleDefault_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.CheckValidFemaleDefault
// Flags: [ FUNC_Simulated ]
struct AwPawn_execCheckValidFemaleDefault_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.ClientReStart
// Flags: [ FUNC_Simulated ]
struct AwPawn_execClientReStart_Parms
{
};

// Function WGame.wPawn.PostNetReceive
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventPostNetReceive_Parms
{
};

// Function WGame.wPawn.NotifyTeamChanged
// Flags: [ FUNC_Simulated ]
struct AwPawn_execNotifyTeamChanged_Parms
{
};

// Function WGame.wPawn.DoJump
// Flags: 
struct AwPawn_execDoJump_Parms
{
	unsigned long                                      bUpdating:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.CanMultiJump
// Flags: 
struct AwPawn_execCanMultiJump_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.CanDoubleJump
// Flags: 
struct AwPawn_execCanDoubleJump_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.DoDoubleJump
// Flags: 
struct AwPawn_execDoDoubleJump_Parms
{
	unsigned long                                      bUpdating:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPawn.PerformDodge
// Flags: 
struct AwPawn_execPerformDodge_Parms
{
	unsigned char                                      DoubleClickMove;                                  		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FVector                                     Dir;                                              		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Cross;                                            		// 0x0010 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.Dodge
// Flags: 
struct AwPawn_execDodge_Parms
{
	unsigned char                                      DoubleClickMove;                                  		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.BotDodge
// Flags: 
struct AwPawn_execBotDodge_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.SetInvisibility
// Flags: 
struct AwPawn_execSetInvisibility_Parms
{
	float                                              Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.ServerChangedWeapon
// Flags: 
struct AwPawn_execServerChangedWeapon_Parms
{
	class AwWeapon*                                    OldWeapon;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwWeapon*                                    newWeapon;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.ChangedWeapon
// Flags: 
struct AwPawn_execChangedWeapon_Parms
{
};

// Function WGame.wPawn.SetWeaponOverlay
// Flags: 
struct AwPawn_execSetWeaponOverlay_Parms
{
	class UMaterial*                                   mat;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Time;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      override:1;                                       		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPawn.DisableUDamage
// Flags: 
struct AwPawn_execDisableUDamage_Parms
{
};

// Function WGame.wPawn.EnableUDamage
// Flags: 
struct AwPawn_execEnableUDamage_Parms
{
	float                                              Amount;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.HasUDamage
// Flags: [ FUNC_Simulated ]
struct AwPawn_execHasUDamage_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.DoCombo
// Flags: 
struct AwPawn_execDoCombo_Parms
{
	class UClass*                                      ComboClass;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.DoComboName
// Flags: 
struct AwPawn_execDoComboName_Parms
{
	struct FString                                     ComboClassName;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPawn.InCurrentCombo
// Flags: 
struct AwPawn_execInCurrentCombo_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.AddShieldStrength
// Flags: 
struct AwPawn_execAddShieldStrength_Parms
{
	int                                                ShieldAmount;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                OldShieldStrength;                                		// 0x0008 ( 0x0004
};

// Function WGame.wPawn.CanUseShield
// Flags: 
struct AwPawn_execCanUseShield_Parms
{
	int                                                ShieldAmount;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.GetShieldStrength
// Flags: 
struct AwPawn_execGetShieldStrength_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.GetShieldStrengthMax
// Flags: 
struct AwPawn_execGetShieldStrengthMax_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.TakeDamageSound
// Flags: 
struct AwPawn_execTakeDamageSound_Parms
{
	int                                                LeftHealth;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ActualDamage;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0008 ( 0x000C[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                WeaponType;                                       		// 0x001C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AController*                                 Killer;                                           		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPawn.PlayFootStepRight
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayFootStepRight_Parms
{
};

// Function WGame.wPawn.PlayFootStepLeft
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayFootStepLeft_Parms
{
};

// Function WGame.wPawn.FootStepping
// Flags: [ FUNC_Simulated ]
struct AwPawn_execFootStepping_Parms
{
	int                                                side;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                SurfaceNum;                                       		// 0x0004 ( 0x0004
	class AActor*                                      A;                                                		// 0x0008 ( 0x0004
	class UMaterial*                                   FloorMat;                                         		// 0x000C ( 0x0004
	struct FVector                                     HL;                                               		// 0x0010 ( 0x000C
	struct FVector                                     HN;                                               		// 0x001C ( 0x000C
	struct FVector                                     Start;                                            		// 0x0028 ( 0x000C
	struct FVector                                     End;                                              		// 0x0034 ( 0x000C
};

// Function WGame.wPawn.PlayEquipHitSound
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayEquipHitSound_Parms
{
};

// Function WGame.wPawn.PlayBreathSound
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayBreathSound_Parms
{
};

// Function WGame.wPawn.PlayDirectionalHit
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayDirectionalHit_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bUseHitStun:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bGoreChange:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     X;                                                		// 0x0014 ( 0x000C
	struct FVector                                     Y;                                                		// 0x0020 ( 0x000C
	struct FVector                                     Z;                                                		// 0x002C ( 0x000C
	struct FVector                                     Dir;                                              		// 0x0038 ( 0x000C
	struct FName                                       HitAnimName;                                      		// 0x0044 ( 0x0004
	int                                                iDir;                                             		// 0x0048 ( 0x0004
	unsigned long                                      bTmProned:1;                                      		// 0x004C ( 0x0004 [0x00000001]
	unsigned long                                      bTmCrouched:1;                                    		// 0x0050 ( 0x0004 [0x00000001]
};

// Function WGame.wPawn.PlayDirectionalDeath
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayDirectionalDeath_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     X;                                                		// 0x000C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0018 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0024 ( 0x000C
	struct FVector                                     Dir;                                              		// 0x0030 ( 0x000C
	unsigned long                                      bTmProned:1;                                      		// 0x003C ( 0x0004 [0x00000001]
	unsigned long                                      bTmCrouched:1;                                    		// 0x0040 ( 0x0004 [0x00000001]
};

// Function WGame.wPawn.KImpact
// Flags: [ FUNC_Event ]
struct AwPawn_eventKImpact_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     pos;                                              		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     impactVel;                                        		// 0x0010 ( 0x000C[ CPF_Parm ]
	struct FVector                                     impactNorm;                                       		// 0x001C ( 0x000C[ CPF_Parm ]
	int                                                numSounds;                                        		// 0x0028 ( 0x0004
	int                                                SoundNum;                                         		// 0x002C ( 0x0004
};

// Function WGame.wPawn.PlayTakeHit
// Flags: 
struct AwPawn_execPlayTakeHit_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	int                                                Damage;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.ClientDying
// Flags: 
struct AwPawn_execClientDying_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
};

// Function WGame.wPawn.SpawnGibs
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSpawnGibs_Parms
{
	struct FRotator                                    HitRotation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              ChunkPerterbation;                                		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.PlayDyingAnimation
// Flags: 
struct AwPawn_execPlayDyingAnimation_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLoc;                                           		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     shotDir;                                          		// 0x0010 ( 0x000C
	struct FVector                                     hitLocRel;                                        		// 0x001C ( 0x000C
	struct FVector                                     deathAngVel;                                      		// 0x0028 ( 0x000C
	struct FVector                                     shotStrength;                                     		// 0x0034 ( 0x000C
	float                                              maxDim;                                           		// 0x0040 ( 0x0004
	struct FString                                     RagSkelName;                                      		// 0x0044 ( 0x000C[ CPF_NeedCtorLink ]
	class UKarmaParamsSkel*                            skelParams;                                       		// 0x0050 ( 0x0004
	unsigned long                                      PlayersRagdoll:1;                                 		// 0x0054 ( 0x0004 [0x00000001]
	class APlayerController*                           PC;                                               		// 0x0058 ( 0x0004
};

// Function WGame.wPawn.PlayDying
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayDying_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLoc;                                           		// 0x0004 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              frame;                                            		// 0x0014 ( 0x0004
	float                                              Rate;                                             		// 0x0018 ( 0x0004
	struct FName                                       Seq;                                              		// 0x001C ( 0x0004
};

// Function WGame.wPawn.RandSpin
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct AwPawn_execRandSpin_Parms
{
	float                                              spinRate;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.KSkelConvulse
// Flags: [ FUNC_Event ]
struct AwPawn_eventKSkelConvulse_Parms
{
};

// Function WGame.wPawn.SetWeaponAttachment
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSetWeaponAttachment_Parms
{
	class AwWeaponAttachment*                          NewAtt;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.PlayVictoryAnimation
// Flags: 
struct AwPawn_execPlayVictoryAnimation_Parms
{
	int                                                tauntNum;                                         		// 0x0000 ( 0x0004
};

// Function WGame.wPawn.CheckProneAni
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventCheckProneAni_Parms
{
	unsigned long                                      bGoProne:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPawn.ServerThrowsWeaponAnim
// Flags: 
struct AwPawn_execServerThrowsWeaponAnim_Parms
{
	unsigned long                                      bQuick:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      hasBomb:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
	unsigned long                                      bEnableThrowBomb:1;                               		// 0x0008 ( 0x0004 [0x00000001]
	unsigned long                                      bDemopack:1;                                      		// 0x000C ( 0x0004 [0x00000001]
	struct FName                                       Anim;                                             		// 0x0010 ( 0x0004
	float                                              frame;                                            		// 0x0014 ( 0x0004
	float                                              Rate;                                             		// 0x0018 ( 0x0004
};

// Function WGame.wPawn.ServerPlayPutdownWeaponAnim
// Flags: 
struct AwPawn_execServerPlayPutdownWeaponAnim_Parms
{
	unsigned long                                      bQuick:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      hasBomb:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
	unsigned long                                      bDemopack:1;                                      		// 0x0008 ( 0x0004 [0x00000001]
	struct FName                                       Anim;                                             		// 0x000C ( 0x0004
	float                                              frame;                                            		// 0x0010 ( 0x0004
	float                                              Rate;                                             		// 0x0014 ( 0x0004
};

// Function WGame.wPawn.PlayWeaponSwitch
// Flags: 
struct AwPawn_execPlayWeaponSwitch_Parms
{
	class AwWeapon*                                    newWeapon;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.AnimEnd
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventAnimEnd_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       Anim;                                             		// 0x0004 ( 0x0004
	float                                              frame;                                            		// 0x0008 ( 0x0004
	float                                              Rate;                                             		// 0x000C ( 0x0004
	struct FString                                     strAnim;                                          		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPawn.ScriptPlayIdle
// Flags: [ FUNC_Simulated ]
struct AwPawn_execScriptPlayIdle_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.InitialPlayer
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventInitialPlayer_Parms
{
};

// Function WGame.wPawn.GetIsFiring
// Flags: [ FUNC_Simulated ]
struct AwPawn_execGetIsFiring_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.StopFiring
// Flags: [ FUNC_Simulated ]
struct AwPawn_execStopFiring_Parms
{
};

// Function WGame.wPawn.StartFiring
// Flags: [ FUNC_Simulated ]
struct AwPawn_execStartFiring_Parms
{
	unsigned long                                      bHeavy:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bRapid:1;                                         		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FName                                       FireAnim;                                         		// 0x0008 ( 0x0004
	unsigned long                                      bFrag:1;                                          		// 0x000C ( 0x0004 [0x00000001]
	unsigned long                                      hasBomb:1;                                        		// 0x0010 ( 0x0004 [0x00000001]
	unsigned char                                      byTeamNumber;                                     		// 0x0014 ( 0x0001
};

// Function WGame.wPawn.SetAnimAction
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventSetAnimAction_Parms
{
	struct FName                                       NewAction;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     strAction;                                        		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              fAnimRate;                                        		// 0x0010 ( 0x0004
	unsigned long                                      bDemopack:1;                                      		// 0x0014 ( 0x0004 [0x00000001]
};

// Function WGame.wPawn.FindValidTaunt
// Flags: [ FUNC_Simulated ]
struct AwPawn_execFindValidTaunt_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                j;                                                		// 0x000C ( 0x0004
};

// Function WGame.wPawn.PlayDoubleJump
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayDoubleJump_Parms
{
	struct FName                                       Anim;                                             		// 0x0000 ( 0x0004
};

// Function WGame.wPawn.GetAnimSequence
// Flags: [ FUNC_Simulated ]
struct AwPawn_execGetAnimSequence_Parms
{
	struct FName                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FName                                       Anim;                                             		// 0x0004 ( 0x0004
//	float                                              frame;                                            		// 0x0008 ( 0x0004
//	float                                              Rate;                                             		// 0x000C ( 0x0004
};

// Function WGame.wPawn.Landed
// Flags: [ FUNC_Event ]
struct AwPawn_eventLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function WGame.wPawn.PlayLandedSound
// Flags: [ FUNC_Event ]
struct AwPawn_eventPlayLandedSound_Parms
{
	int                                                SurfType;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.GetOffhandBoneFor
// Flags: 
struct AwPawn_execGetOffhandBoneFor_Parms
{
	class AInventory*                                  i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.GetWeaponBoneFor
// Flags: 
struct AwPawn_execGetWeaponBoneFor_Parms
{
	class AInventory*                                  i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.CheckReflect
// Flags: 
struct AwPawn_execCheckReflect_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     RefNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	int                                                Damage;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.PlayHit
// Flags: 
struct AwPawn_execPlayHit_Parms
{
	float                                              Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       instigatedBy;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0008 ( 0x000C[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     HitNormal;                                        		// 0x0028 ( 0x000C
	struct FVector                                     hitRay;                                           		// 0x0034 ( 0x000C
	struct FName                                       HitBone;                                          		// 0x0040 ( 0x0004
	float                                              HitBoneDist;                                      		// 0x0044 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0048 ( 0x0004
	unsigned long                                      bShowEffects:1;                                   		// 0x004C ( 0x0004 [0x00000001]
	unsigned long                                      bRecentHit:1;                                     		// 0x0050 ( 0x0004 [0x00000001]
};

// Function WGame.wPawn.PostNetBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPostNetBeginPlay_Parms
{
};

// Function WGame.wPawn.InitMyParam
// Flags: [ FUNC_Simulated ]
struct AwPawn_execInitMyParam_Parms
{
};

// Function WGame.wPawn.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPostBeginPlay_Parms
{
};

// Function WGame.wPawn.Tick
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.TestVersion_SetParameters
// Flags: [ FUNC_Simulated ]
struct AwPawn_execTestVersion_SetParameters_Parms
{
};

// Function WGame.wPawn.TickDeRes
// Flags: [ FUNC_Simulated ]
struct AwPawn_execTickDeRes_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.SetOverlayMaterial
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSetOverlayMaterial_Parms
{
	class UMaterial*                                   mat;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Time;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bOverride:1;                                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPawn.StartDeRes
// Flags: [ FUNC_Simulated ]
struct AwPawn_execStartDeRes_Parms
{
};

// Function WGame.wPawn.DoDamageFX
// Flags: 
struct AwPawn_execDoDamageFX_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Damage;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    R;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitLoc;                                           		// 0x0018 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPawn.GetBoneNameByCollisionID
// Flags: 
struct AwPawn_execGetBoneNameByCollisionID_Parms
{
	int                                                CollisionID;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WGame.wPawn.CalcHitLoc
// Flags: 
struct AwPawn_execCalcHitLoc_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     hitRay;                                           		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              dist;                                             		// 0x001C ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WGame.wPawn.HideBone
// Flags: [ FUNC_Simulated ]
struct AwPawn_execHideBone_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                BoneScaleSlot;                                    		// 0x0004 ( 0x0004
};

// Function WGame.wPawn.GetBloodHitClass
// Flags: [ FUNC_Simulated ]
struct AwPawn_execGetBloodHitClass_Parms
{
	unsigned long                                      bHeadShot:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UClass*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.ProcessHitFX
// Flags: [ FUNC_Simulated ]
struct AwPawn_execProcessHitFX_Parms
{
	struct FCoords                                     boneCoords;                                       		// 0x0000 ( 0x0030
	int                                                j;                                                		// 0x0030 ( 0x0004
};

// Function WGame.wPawn.SpawnGiblet
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSpawnGiblet_Parms
{
	class UClass*                                      GibClass;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Location;                                         		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    Rotation;                                         		// 0x0010 ( 0x000C[ CPF_Parm ]
	float                                              GibPerterbation;                                  		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FVector                                     GibVelocity;                                      		// 0x0020 ( 0x000C[ CPF_Parm ]
	class AGib*                                        Giblet;                                           		// 0x002C ( 0x0004
	struct FVector                                     direction;                                        		// 0x0030 ( 0x000C
	struct FVector                                     Dummy;                                            		// 0x003C ( 0x000C
};

// Function WGame.wPawn.SetHeadScale
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventSetHeadScale_Parms
{
	float                                              NewScale;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.AttachEffect
// Flags: [ FUNC_Simulated ]
struct AwPawn_execAttachEffect_Parms
{
	class UClass*                                      EmitterClass;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Location;                                         		// 0x0008 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    Rotation;                                         		// 0x0014 ( 0x000C[ CPF_Parm ]
	class AActor*                                      A;                                                		// 0x0020 ( 0x0004
	int                                                i;                                                		// 0x0024 ( 0x0004
};

// Function WGame.wPawn.StopDriving
// Flags: [ FUNC_Simulated ]
struct AwPawn_execStopDriving_Parms
{
	class AVehicle*                                    V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.StartDriving
// Flags: [ FUNC_Simulated ]
struct AwPawn_execStartDriving_Parms
{
	class AVehicle*                                    V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WGame.wPawn.TickDamage
// Flags: [ FUNC_Simulated ]
struct AwPawn_execTickDamage_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.TickFX
// Flags: [ FUNC_Simulated ]
struct AwPawn_execTickFX_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.RemovePowerups
// Flags: 
struct AwPawn_execRemovePowerups_Parms
{
};

// Function WGame.wPawn.GetTeam
// Flags: 
struct AwPawn_execGetTeam_Parms
{
	class ATeamInfo*                                   ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.GetTeamNum
// Flags: [ FUNC_Simulated ]
struct AwPawn_execGetTeamNum_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.GetKillerController
// Flags: 
struct AwPawn_execGetKillerController_Parms
{
	class AController*                                 ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.Gasp
// Flags: 
struct AwPawn_execGasp_Parms
{
};

// Function WGame.wPawn.PlayDyingSound
// Flags: 
struct AwPawn_execPlayDyingSound_Parms
{
};

// Function WGame.wPawn.PlayMoverHitSound
// Flags: 
struct AwPawn_execPlayMoverHitSound_Parms
{
};

// Function WGame.wPawn.PlayTeleportEffect
// Flags: 
struct AwPawn_execPlayTeleportEffect_Parms
{
	unsigned long                                      bOut:1;                                           		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bSound:1;                                         		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPawn.DeactivateSpawnProtection
// Flags: 
struct AwPawn_execDeactivateSpawnProtection_Parms
{
};

// Function WGame.wPawn.AdjustedStrength
// Flags: 
struct AwPawn_execAdjustedStrength_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.PhysicsVolumeChange
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPawn_eventPhysicsVolumeChange_Parms
{
	class APhysicsVolume*                              NewVolume;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.RemoveFlamingEffects
// Flags: [ FUNC_Simulated ]
struct AwPawn_execRemoveFlamingEffects_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPawn.Destroyed
// Flags: [ FUNC_Simulated ]
struct AwPawn_execDestroyed_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPawn.AssignInitialPose
// Flags: [ FUNC_Simulated ]
struct AwPawn_execAssignInitialPose_Parms
{
};

// Function WGame.wPawn.DoTranslocateOut
// Flags: 
struct AwPawn_execDoTranslocateOut_Parms
{
	struct FVector                                     PrevLocation;                                     		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function WGame.wPawn.WasPlayerPawn
// Flags: [ FUNC_Simulated ]
struct AwPawn_execWasPlayerPawn_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.UnPossessed
// Flags: 
struct AwPawn_execUnPossessed_Parms
{
};

// Function WGame.wPawn.PossessedBy
// Flags: 
struct AwPawn_execPossessedBy_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPawn.GetPlacedRoster
// Flags: 
struct AwPawn_execGetPlacedRoster_Parms
{
	class URosterEntry*                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawn.PlayWaiting
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayWaiting_Parms
{
};

// Function WGame.wPawn.AltFire
// Flags: [ FUNC_Simulated ]
struct AwPawn_execAltFire_Parms
{
	float                                              f;                                                		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPawn.Fire
// Flags: [ FUNC_Simulated ]
struct AwPawn_execFire_Parms
{
	float                                              f;                                                		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPawn.ClientWeaponReset
// Flags: [ FUNC_Simulated ]
struct AwPawn_execClientWeaponReset_Parms
{
};

// Function WGame.wPawn.SimulatedSetRotation
// Flags: [ FUNC_Simulated ]
struct AwPawn_execSimulatedSetRotation_Parms
{
	struct FRotator                                    R;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function WGame.wPawn.PlayTurretIdleAnim
// Flags: [ FUNC_Simulated ]
struct AwPawn_execPlayTurretIdleAnim_Parms
{
	unsigned long                                      UpDown:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPawnSoundGroup.GetEquipHitSound
// Flags: 
struct UwPawnSoundGroup_execGetEquipHitSound_Parms
{
	class USound*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawnSoundGroup.GetBreathSound
// Flags: 
struct UwPawnSoundGroup_execGetBreathSound_Parms
{
	class USound*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawnSoundGroup.GetSound
// Flags: 
struct UwPawnSoundGroup_execGetSound_Parms
{
	unsigned char                                      soundType;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
	class USound*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawnSoundGroup.GetLanedSound
// Flags: 
struct UwPawnSoundGroup_execGetLanedSound_Parms
{
	int                                                SurfType;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bFirstPerson:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	class USound*                                      ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawnSoundGroup.GetDeathSound
// Flags: 
struct UwPawnSoundGroup_execGetDeathSound_Parms
{
	class USound*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPawnSoundGroup.GetHitSound
// Flags: 
struct UwPawnSoundGroup_execGetHitSound_Parms
{
	class USound*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.AnimRate
// Flags: [ FUNC_Exec ]
struct AwPlayer_execAnimRate_Parms
{
	float                                              fAnimRate;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.UseRagdoll
// Flags: [ FUNC_Exec ]
struct AwPlayer_execUseRagdoll_Parms
{
	unsigned long                                      bUse:1;                                           		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPlayer.BodyRot_BR
// Flags: [ FUNC_Exec ]
struct AwPlayer_execBodyRot_BR_Parms
{
	float                                              fR;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.BodyRot_BL
// Flags: [ FUNC_Exec ]
struct AwPlayer_execBodyRot_BL_Parms
{
	float                                              fR;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.BodyRot_FR
// Flags: [ FUNC_Exec ]
struct AwPlayer_execBodyRot_FR_Parms
{
	float                                              fR;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.BodyRot_FL
// Flags: [ FUNC_Exec ]
struct AwPlayer_execBodyRot_FL_Parms
{
	float                                              fR;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.Rot_CBR
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_CBR_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Rot_CBL
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_CBL_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Rot_CFR
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_CFR_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Rot_CFL
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_CFL_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Rot_BR
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_BR_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Rot_BL
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_BL_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Rot_FR
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_FR_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Rot_FL
// Flags: [ FUNC_Exec ]
struct AwPlayer_execRot_FL_Parms
{
	struct FString                                     fX;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fY;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     fZ;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ShowRot
// Flags: [ FUNC_Exec ]
struct AwPlayer_execShowRot_Parms
{
};

// Function WGame.wPlayer.RenderSpectatorFPWeapon
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execRenderSpectatorFPWeapon_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bClearedZBuffer:1;                                		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPlayer.ChangeMouseSenseAim
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execChangeMouseSenseAim_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.ChangeMouseSense
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execChangeMouseSense_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.MouseSenseDownAim
// Flags: [ FUNC_Exec ]
struct AwPlayer_execMouseSenseDownAim_Parms
{
};

// Function WGame.wPlayer.MouseSenseUpAim
// Flags: [ FUNC_Exec ]
struct AwPlayer_execMouseSenseUpAim_Parms
{
};

// Function WGame.wPlayer.MouseSenseDown
// Flags: [ FUNC_Exec ]
struct AwPlayer_execMouseSenseDown_Parms
{
};

// Function WGame.wPlayer.MouseSenseUp
// Flags: [ FUNC_Exec ]
struct AwPlayer_execMouseSenseUp_Parms
{
};

// Function WGame.wPlayer.RemoveSkill_Client
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execRemoveSkill_Client_Parms
{
	int                                                iSkillID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.RemoveSkill
// Flags: 
struct AwPlayer_execRemoveSkill_Parms
{
	int                                                iSkillID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.ClientReStart
// Flags: 
struct AwPlayer_execClientReStart_Parms
{
	class APawn*                                       NewPawn;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.ServerSkillUsedByWeapon
// Flags: 
struct AwPlayer_execServerSkillUsedByWeapon_Parms
{
	int                                                iWeaponID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.SkillUsedByWeapon
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execSkillUsedByWeapon_Parms
{
	int                                                iWeaponID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.ApplySkill_Client
// Flags: 
struct AwPlayer_execApplySkill_Client_Parms
{
	int                                                iSkillID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WGame.wPlayer.AddSkill_Client
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execAddSkill_Client_Parms
{
	int                                                iSkillID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WGame.wPlayer.SkillInit_Server
// Flags: 
struct AwPlayer_execSkillInit_Server_Parms
{
	unsigned long                                      bQuickslotChange:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPlayer.AddSkill
// Flags: 
struct AwPlayer_execAddSkill_Parms
{
	int                                                iSkillID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.ShowResultMenu
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execShowResultMenu_Parms
{
};

// Function WGame.wPlayer.HIJTest00
// Flags: [ FUNC_Exec ]
struct AwPlayer_execHIJTest00_Parms
{
	int                                                iTest;                                            		// 0x0000 ( 0x0004
	class UwCharacterManager*                          tmMgr;                                            		// 0x0004 ( 0x0004
	class UwMyPlayerStatus*                            tmStatus;                                         		// 0x0008 ( 0x0004
	struct FString                                     strTemp0;                                         		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     strTemp1;                                         		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.PartsTest
// Flags: [ FUNC_Exec ]
struct AwPlayer_execPartsTest_Parms
{
	class UBTNetPlayerData*                            PlayerData;                                       		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function WGame.wPlayer.tT
// Flags: [ FUNC_Exec ]
struct AwPlayer_exectT_Parms
{
	float                                              fRate;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.TTT
// Flags: [ FUNC_Exec ]
struct AwPlayer_execTTT_Parms
{
};

// Function WGame.wPlayer.HIJ2
// Flags: [ FUNC_Exec ]
struct AwPlayer_execHIJ2_Parms
{
	class AwAIBotBase*                                 B;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.HIJ
// Flags: [ FUNC_Exec ]
struct AwPlayer_execHIJ_Parms
{
};

// Function WGame.wPlayer.ServerWarp
// Flags: 
struct AwPlayer_execServerWarp_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.Warp
// Flags: [ FUNC_Exec ]
struct AwPlayer_execWarp_Parms
{
};

// Function WGame.wPlayer.CallUAV
// Flags: 
struct AwPlayer_execCallUAV_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.UAV
// Flags: [ FUNC_Exec ]
struct AwPlayer_execUAV_Parms
{
};

// Function WGame.wPlayer.CallAirFire
// Flags: 
struct AwPlayer_execCallAirFire_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.ClipAirStrikeLocation
// Flags: 
struct AwPlayer_execClipAirStrikeLocation_Parms
{
	struct FVector                                     vMin;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     vMax;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	class TArray< struct FVector >                     vLocation;                                        		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FVector                                     ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0030 ( 0x0004
};

// Function WGame.wPlayer.DoAirStrikeFire
// Flags: 
struct AwPlayer_execDoAirStrikeFire_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AActor*                                      A;                                                		// 0x000C ( 0x0004
};

// Function WGame.wPlayer.IsActiveUAV
// Flags: 
struct AwPlayer_execIsActiveUAV_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.IsActiveHelicopter
// Flags: 
struct AwPlayer_execIsActiveHelicopter_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwHelicopter*                                P;                                                		// 0x0004 ( 0x0004
};

// Function WGame.wPlayer.IsActiveAirFire
// Flags: 
struct AwPlayer_execIsActiveAirFire_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.CallHelicopter
// Flags: 
struct AwPlayer_execCallHelicopter_Parms
{
	unsigned long                                      ignoreSupply:1;                                   		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwHelicopter*                                P;                                                		// 0x0008 ( 0x0004
};

// Function WGame.wPlayer.heli
// Flags: [ FUNC_Exec ]
struct AwPlayer_execheli_Parms
{
};

// Function WGame.wPlayer.c4
// Flags: [ FUNC_Exec ]
struct AwPlayer_execc4_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.art
// Flags: [ FUNC_Exec ]
struct AwPlayer_execart_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.ServerCallAirStrike
// Flags: 
struct AwPlayer_execServerCallAirStrike_Parms
{
	class AController*                                 Caller;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C
	class APlayerController*                           P;                                                		// 0x0010 ( 0x0004
};

// Function WGame.wPlayer.CalcAirStrikeLocation
// Flags: 
struct AwPlayer_execCalcAirStrikeLocation_Parms
{
	float                                              fMaxDist;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     vMin;                                             		// 0x0010 ( 0x000C
//	struct FVector                                     vMax;                                             		// 0x001C ( 0x000C
//	int                                                lp1;                                              		// 0x0028 ( 0x0004
//	int                                                lp2;                                              		// 0x002C ( 0x0004
//	int                                                lpCount;                                          		// 0x0030 ( 0x0004
//	class TArray< struct FVector >                     vLocationList;                                    		// 0x0034 ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< struct FVector >                     vUsalLocationList;                                		// 0x0040 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FVector                                     HitLocation;                                      		// 0x004C ( 0x000C
//	class TArray< class AActor* >                      wEnemys;                                          		// 0x0058 ( 0x000C[ CPF_NeedCtorLink ]
//	class UwMatchMaker*                                kMM;                                              		// 0x0064 ( 0x0004
//	class ANavigationPoint*                            naviPoint;                                        		// 0x0068 ( 0x0004
//	unsigned long                                      bCheck:1;                                         		// 0x006C ( 0x0004 [0x00000001]
//	class TArray< class ANavigationPoint* >            selectedRespawndPos;                              		// 0x0070 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ServerCallHelicopter
// Flags: 
struct AwPlayer_execServerCallHelicopter_Parms
{
	class APawn*                                       lastHeliPawn;                                     		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AController*                                 Caller;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AwHelicopter*                                lastHeli;                                         		// 0x0008 ( 0x0004
};

// Function WGame.wPlayer.Check
// Flags: [ FUNC_Exec ]
struct AwPlayer_execCheck_Parms
{
	class ADecoration*                                 D;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.ShowBindings
// Flags: [ FUNC_Simulated | FUNC_Exec ]
struct AwPlayer_execShowBindings_Parms
{
	class TArray< struct FString >                     output;                                           		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	class ASecurity*                                   S;                                                		// 0x000C ( 0x0004
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function WGame.wPlayer.ShowAliases
// Flags: [ FUNC_Simulated | FUNC_Exec ]
struct AwPlayer_execShowAliases_Parms
{
	class TArray< struct FString >                     output;                                           		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	class ASecurity*                                   S;                                                		// 0x000C ( 0x0004
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function WGame.wPlayer.InitializeVoiceChat
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execInitializeVoiceChat_Parms
{
};

// Function WGame.wPlayer.ClientReceiveBan
// Flags: 
struct AwPlayer_execClientReceiveBan_Parms
{
	struct FString                                     BanInfo;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ServerRequestBanInfo
// Flags: 
struct AwPlayer_execServerRequestBanInfo_Parms
{
	int                                                PlayerID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< class APlayerController* >           CArr;                                             		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function WGame.wPlayer.ServerSpecViewGoal
// Flags: 
struct AwPlayer_execServerSpecViewGoal_Parms
{
	class AActor*                                      NewGoal;                                          		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.SpecViewGoal
// Flags: [ FUNC_Exec ]
struct AwPlayer_execSpecViewGoal_Parms
{
};

// Function WGame.wPlayer.ServerRequestPlayerInfo
// Flags: 
struct AwPlayer_execServerRequestPlayerInfo_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class AwPlayer*                                    xPC;                                              		// 0x0004 ( 0x0004
};

// Function WGame.wPlayer.AdminMenu
// Flags: [ FUNC_Exec ]
struct AwPlayer_execAdminMenu_Parms
{
	struct FString                                     CommandLine;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.PostNetReceive
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPlayer_eventPostNetReceive_Parms
{
	struct FPlayerRecord                               Rec;                                              		// 0x0000 ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.NeedNetNotify
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execNeedNetNotify_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.ChangeCharacter
// Flags: [ FUNC_Exec ]
struct AwPlayer_execChangeCharacter_Parms
{
	struct FString                                     newCharacter;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.Possess
// Flags: 
struct AwPlayer_execPossess_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwPawn*                                      xp;                                               		// 0x0004 ( 0x0004
};

// Function WGame.wPlayer.SetPawnFemale
// Flags: 
struct AwPlayer_execSetPawnFemale_Parms
{
};

// Function WGame.wPlayer.SetPlayerEquipInfo
// Flags: 
struct AwPlayer_execSetPlayerEquipInfo_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                j;                                                		// 0x0004 ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x0008 ( 0x0004
	class UwMatchUserInfo*                             kUser;                                            		// 0x000C ( 0x0004
	int                                                iBody[ 0x02 ];                                    		// 0x0010 ( 0x0008
	int                                                iHead;                                            		// 0x0018 ( 0x0004
	int                                                iHelmet;                                          		// 0x001C ( 0x0004
	int                                                iAcce;                                            		// 0x0020 ( 0x0004
};

// Function WGame.wPlayer.SetPawnClass
// Flags: 
struct AwPlayer_execSetPawnClass_Parms
{
	struct FString                                     inClass;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InCharacter;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      pClass;                                           		// 0x0018 ( 0x0004
};

// Function WGame.wPlayer.PawnDied
// Flags: 
struct AwPlayer_execPawnDied_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.CameraTrack
// Flags: 
struct AwPlayer_execCameraTrack_Parms
{
	class APawn*                                       Target;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              DeltaTime;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              dist;                                             		// 0x0014 ( 0x0004
//	struct FVector                                     lead;                                             		// 0x0018 ( 0x000C
//	float                                              MinZoomDist;                                      		// 0x0024 ( 0x0004
//	float                                              MaxZoomDist;                                      		// 0x0028 ( 0x0004
//	float                                              ViewAngle;                                        		// 0x002C ( 0x0004
//	float                                              viewwidth;                                        		// 0x0030 ( 0x0004
};

// Function WGame.wPlayer.LineOfSight
// Flags: 
struct AwPlayer_execLineOfSight_Parms
{
	int                                                C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       Target;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     v1;                                               		// 0x000C ( 0x000C
//	struct FVector                                     v2;                                               		// 0x0018 ( 0x000C
//	class AAttractCamera*                              cam;                                              		// 0x0024 ( 0x0004
//	struct FVector                                     HitLoc;                                           		// 0x0028 ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0034 ( 0x000C
};

// Function WGame.wPlayer.PickNextBot
// Flags: 
struct AwPlayer_execPickNextBot_Parms
{
	class APawn*                                       Current;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AController*                                 con;                                              		// 0x0008 ( 0x0004
//	int                                                B;                                                		// 0x000C ( 0x0004
};

// Function WGame.wPlayer.FindFloatingCam
// Flags: 
struct AwPlayer_execFindFloatingCam_Parms
{
	class APawn*                                       Target;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     v1;                                               		// 0x0010 ( 0x000C
//	struct FVector                                     v2;                                               		// 0x001C ( 0x000C
//	struct FVector                                     D;                                                		// 0x0028 ( 0x000C
//	struct FRotator                                    R;                                                		// 0x0034 ( 0x000C
//	struct FVector                                     HitLoc;                                           		// 0x0040 ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x004C ( 0x000C
//	class AActor*                                      HitActor;                                         		// 0x0058 ( 0x0004
//	int                                                tries;                                            		// 0x005C ( 0x0004
};

// Function WGame.wPlayer.FindFixedCam
// Flags: 
struct AwPlayer_execFindFixedCam_Parms
{
	class APawn*                                       Target;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                newcam;                                           		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                C;                                                		// 0x000C ( 0x0004
//	int                                                bestc;                                            		// 0x0010 ( 0x0004
//	float                                              dist;                                             		// 0x0014 ( 0x0004
//	float                                              BestDist;                                         		// 0x0018 ( 0x0004
};

// Function WGame.wPlayer.FillCameraList
// Flags: 
struct AwPlayer_execFillCameraList_Parms
{
	class AAttractCamera*                              cam;                                              		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.ServerDoCombo
// Flags: 
struct AwPlayer_execServerDoCombo_Parms
{
	class UClass*                                      ComboClass;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.DoCombo
// Flags: 
struct AwPlayer_execDoCombo_Parms
{
	class UClass*                                      ComboClass;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.ServerPlayWeaponNullSound
// Flags: 
struct AwPlayer_execServerPlayWeaponNullSound_Parms
{
	class AwWeapon*                                    Wpn;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      UseStereo:1;                                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPlayer.ProcessQuickGrenadeKey2
// Flags: 
struct AwPlayer_execProcessQuickGrenadeKey2_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.ProcessQuickGrenadeKey
// Flags: 
struct AwPlayer_execProcessQuickGrenadeKey_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wPlayer.ProcessSwitchDemoPack
// Flags: 
struct AwPlayer_execProcessSwitchDemoPack_Parms
{
	unsigned char                                      byUsed;                                           		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      hasBomb:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bSettingBomb:1;                                   		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AUseObjective*                               UO;                                               		// 0x000C ( 0x0004
	unsigned long                                      bTraceGeom:1;                                     		// 0x0010 ( 0x0004 [0x00000001]
};

// Function WGame.wPlayer.ProcessSetObjective
// Flags: 
struct AwPlayer_execProcessSetObjective_Parms
{
	unsigned long                                      hasBomb:1;                                        		// 0x0000 ( 0x0004 [0x00000001]
	unsigned long                                      bSettingBomb:1;                                   		// 0x0004 ( 0x0004 [0x00000001]
	unsigned long                                      bUsed:1;                                          		// 0x0008 ( 0x0004 [0x00000001]
	unsigned char                                      byUsed;                                           		// 0x000C ( 0x0001
};

// Function WGame.wPlayer.ProcessUseKey
// Flags: 
struct AwPlayer_execProcessUseKey_Parms
{
	unsigned long                                      bHasDemoPack:1;                                   		// 0x0000 ( 0x0004 [0x00000001]
};

// Function WGame.wPlayer.PlayerTick
// Flags: [ FUNC_Event ]
struct AwPlayer_eventPlayerTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.NotifyTakeHit
// Flags: 
struct AwPlayer_execNotifyTakeHit_Parms
{
	class APawn*                                       instigatedBy;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	int                                                Damage;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPlayer.ClientReceiveCombo
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execClientReceiveCombo_Parms
{
	struct FString                                     NewCombo;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function WGame.wPlayer.ServerSetClassicTrans
// Flags: 
struct AwPlayer_execServerSetClassicTrans_Parms
{
	unsigned long                                      B:1;                                              		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPlayer.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPlayer_eventPostNetBeginPlay_Parms
{
};

// Function WGame.wPlayer.PostBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPlayer_eventPostBeginPlay_Parms
{
};

// Function WGame.wPlayer.MakeItemBox
// Flags: [ FUNC_Exec ]
struct AwPlayer_execMakeItemBox_Parms
{
	struct FString                                     t;                                                		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class AActor*                                      spawnedActor;                                     		// 0x000C ( 0x0004
};

// Function WGame.wPlayer.L33TPhrase
// Flags: [ FUNC_Exec ]
struct AwPlayer_execL33TPhrase_Parms
{
	int                                                PhraseNum;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.RateWeapon
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execRateWeapon_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.PlayBeepSound
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execPlayBeepSound_Parms
{
};

// Function WGame.wPlayer.StopFiring
// Flags: 
struct AwPlayer_execStopFiring_Parms
{
};

// Function WGame.wPlayer.ClientReceiveMapName
// Flags: 
struct AwPlayer_execClientReceiveMapName_Parms
{
	struct FString                                     NewMap;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ServerRequestMapList
// Flags: 
struct AwPlayer_execServerRequestMapList_Parms
{
	int                                                X;                                                		// 0x0000 ( 0x0004
	class TArray< struct FString >                     MapList;                                          		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ClientReceiveResultMenu
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execClientReceiveResultMenu_Parms
{
	struct FString                                     MenuClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ClientReceiveRule
// Flags: 
struct AwPlayer_execClientReceiveRule_Parms
{
	struct FString                                     NewRule;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ServerRequestRules
// Flags: 
struct AwPlayer_execServerRequestRules_Parms
{
	struct FServerResponseLine                         Response;                                         		// 0x0000 ( 0x0070[ CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0070 ( 0x0004
};

// Function WGame.wPlayer.GetPhysicsString
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execGetPhysicsString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     t;                                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.GetRoleString
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execGetRoleString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     t;                                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.DebugMessage
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execDebugMessage_Parms
{
	struct FString                                     DebugString;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FName                                       Type;                                             		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wPlayer.CheckPriority
// Flags: [ FUNC_Exec ]
struct AwPlayer_execCheckPriority_Parms
{
	class AInventory*                                  Inv;                                              		// 0x0000 ( 0x0004
	int                                                Count;                                            		// 0x0004 ( 0x0004
};

// Function WGame.wPlayer.InInventoryRebuildSkipList
// Flags: 
struct AwPlayer_execInInventoryRebuildSkipList_Parms
{
	class AwWeapon*                                    W;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function WGame.wPlayer.ServerRequestWeapon
// Flags: 
struct AwPlayer_execServerRequestWeapon_Parms
{
	int                                                iWeaponID;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	class UwMatchMaker*                                kMM;                                              		// 0x0008 ( 0x0004
	class UwMatchUserInfo*                             kUser;                                            		// 0x000C ( 0x0004
	unsigned long                                      added:1;                                          		// 0x0010 ( 0x0004 [0x00000001]
	class AwWeapon*                                    W;                                                		// 0x0014 ( 0x0004
	class AwWeapon*                                    ow;                                               		// 0x0018 ( 0x0004
};

// Function WGame.wPlayer.SetSpeed
// Flags: [ FUNC_Exec ]
struct AwPlayer_execSetSpeed_Parms
{
	float                                              factor;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.ResetNames
// Flags: [ FUNC_Exec ]
struct AwPlayer_execResetNames_Parms
{
};

// Function WGame.wPlayer.setcmd
// Flags: [ FUNC_Exec ]
struct AwPlayer_execsetcmd_Parms
{
	struct FString                                     targetName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class AController*                                 C;                                                		// 0x000C ( 0x0004
};

// Function WGame.wPlayer.Cmd
// Flags: [ FUNC_Exec ]
struct AwPlayer_execCmd_Parms
{
	struct FString                                     P1;                                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     P2;                                               		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     p3;                                               		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     p4;                                               		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     p5;                                               		// 0x0030 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.SetDoTraceNativeInstant
// Flags: [ FUNC_Exec ]
struct AwPlayer_execSetDoTraceNativeInstant_Parms
{
	unsigned long                                      val:1;                                            		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wPlayer.SetFovSpeed
// Flags: [ FUNC_Exec ]
struct AwPlayer_execSetFovSpeed_Parms
{
	float                                              V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wPlayer.GetFovSpeed
// Flags: 
struct AwPlayer_execGetFovSpeed_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayer.ShowPathToActor
// Flags: [ FUNC_Simulated ]
struct AwPlayer_execShowPathToActor_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      WWclass;                                          		// 0x0004 ( 0x0004
	class AActor*                                      Path;                                             		// 0x0008 ( 0x0004
};

// Function WGame.wPlayer.ProcessMapName
// Flags: 
struct AwPlayer_execProcessMapName_Parms
{
	struct FString                                     NewMap;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayer.ProcessRule
// Flags: 
struct AwPlayer_execProcessRule_Parms
{
	struct FString                                     NewRule;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wHealthPack.GetHealMax
// Flags: 
struct AwHealthPack_execGetHealMax_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wHealthPack.Reset
// Flags: 
struct AwHealthPack_execReset_Parms
{
};

// Function WGame.wHealthPack.DisplayEvent
// Flags: 
struct AwHealthPack_execDisplayEvent_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PlayerOwner;                                      		// 0x0004 ( 0x0004
	float                                              fTime;                                            		// 0x0008 ( 0x0004
};

// Function WGame.wHealthPack.DeleteSuppliesPositions
// Flags: 
struct AwHealthPack_execDeleteSuppliesPositions_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function WGame.wHealthPack.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwHealthPack_eventPostNetBeginPlay_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function WGame.wHealthPack.UpdateHUD
// Flags: [ FUNC_Simulated ]
struct AwHealthPack_execUpdateHUD_Parms
{
	class AHUD*                                        H;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              fTime;                                            		// 0x0004 ( 0x0004
};

// Function WGame.wSupplyPack.Landed
// Flags: [ FUNC_Event ]
struct AwSupplyPack_eventLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    R;                                                		// 0x000C ( 0x000C
};

// Function WGame.wUAVPack.CanAdUAVpack
// Flags: 
struct AwUAVPack_execCanAdUAVpack_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wUAVPack.AnnouncePickup
// Flags: 
struct AwUAVPack_execAnnouncePickup_Parms
{
	class APawn*                                       Receiver;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wUAVPack.Reset
// Flags: 
struct AwUAVPack_execReset_Parms
{
};

// Function WGame.wUAVPack.DeleteSuppliesPositions
// Flags: 
struct AwUAVPack_execDeleteSuppliesPositions_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function WGame.wUAVPack.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwUAVPack_eventPostNetBeginPlay_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function WGame.wUAVPack.DisplayEvent
// Flags: 
struct AwUAVPack_execDisplayEvent_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PlayerOwner;                                      		// 0x0004 ( 0x0004
	float                                              fTime;                                            		// 0x0008 ( 0x0004
};

// Function WGame.wUAVPack.UpdateHUD
// Flags: [ FUNC_Simulated ]
struct AwUAVPack_execUpdateHUD_Parms
{
	class AHUD*                                        H;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              fTime;                                            		// 0x0004 ( 0x0004
};

// Function WGame.wHeliPack.CanAddHelipack
// Flags: 
struct AwHeliPack_execCanAddHelipack_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wHeliPack.AnnouncePickup
// Flags: 
struct AwHeliPack_execAnnouncePickup_Parms
{
	class APawn*                                       Receiver;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wHeliPack.Reset
// Flags: 
struct AwHeliPack_execReset_Parms
{
};

// Function WGame.wHeliPack.DeleteSuppliesPositions
// Flags: 
struct AwHeliPack_execDeleteSuppliesPositions_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function WGame.wHeliPack.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwHeliPack_eventPostNetBeginPlay_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function WGame.wHeliPack.DisplayEvent
// Flags: 
struct AwHeliPack_execDisplayEvent_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PlayerOwner;                                      		// 0x0004 ( 0x0004
	float                                              fTime;                                            		// 0x0008 ( 0x0004
};

// Function WGame.wHeliPack.UpdateHUD
// Flags: [ FUNC_Simulated ]
struct AwHeliPack_execUpdateHUD_Parms
{
	class AHUD*                                        H;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              fTime;                                            		// 0x0004 ( 0x0004
};

// Function WGame.wArtilleryPack.CanAddArtilleryPack
// Flags: 
struct AwArtilleryPack_execCanAddArtilleryPack_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AInventory*                                  Inv;                                              		// 0x0008 ( 0x0004
//	class AwWeapon*                                    Wpn;                                              		// 0x000C ( 0x0004
};

// Function WGame.wArtilleryPack.AnnouncePickup
// Flags: 
struct AwArtilleryPack_execAnnouncePickup_Parms
{
	class APawn*                                       Receiver;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wArtilleryPack.Reset
// Flags: 
struct AwArtilleryPack_execReset_Parms
{
};

// Function WGame.wArtilleryPack.DeleteSuppliesPositions
// Flags: 
struct AwArtilleryPack_execDeleteSuppliesPositions_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function WGame.wArtilleryPack.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwArtilleryPack_eventPostNetBeginPlay_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function WGame.wArtilleryPack.UpdateHUD
// Flags: [ FUNC_Simulated ]
struct AwArtilleryPack_execUpdateHUD_Parms
{
	class AHUD*                                        H;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              fTime;                                            		// 0x0004 ( 0x0004
};

// Function WGame.wMedalPack.Reset
// Flags: 
struct AwMedalPack_execReset_Parms
{
};

// Function WGame.wMedalPack.DisplayEvent
// Flags: 
struct AwMedalPack_execDisplayEvent_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PlayerOwner;                                      		// 0x0004 ( 0x0004
};

// Function WGame.wMedalPack.DeleteSuppliesPositions
// Flags: 
struct AwMedalPack_execDeleteSuppliesPositions_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function WGame.wMedalPack.PostNetBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwMedalPack_eventPostNetBeginPlay_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
};

// Function WGame.wMedalPack.UpdateHUD
// Flags: [ FUNC_Simulated ]
struct AwMedalPack_execUpdateHUD_Parms
{
	class AHUD*                                        H;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.GameHasEnded
// Flags: 
struct AwBotVehicleController_execGameHasEnded_Parms
{
};

// Function WGame.wBotVehicleController.Stopped
// Flags: 
struct AwBotVehicleController_execStopped_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.IsHunting
// Flags: 
struct AwBotVehicleController_execIsHunting_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.IsStrafing
// Flags: 
struct AwBotVehicleController_execIsStrafing_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.DefendMelee
// Flags: 
struct AwBotVehicleController_execDefendMelee_Parms
{
	float                                              dist;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.DoTacticalMove
// Flags: 
struct AwBotVehicleController_execDoTacticalMove_Parms
{
};

// Function WGame.wBotVehicleController.DoCharge
// Flags: 
struct AwBotVehicleController_execDoCharge_Parms
{
};

// Function WGame.wBotVehicleController.DoStakeOut
// Flags: 
struct AwBotVehicleController_execDoStakeOut_Parms
{
};

// Function WGame.wBotVehicleController.Celebrate
// Flags: 
struct AwBotVehicleController_execCelebrate_Parms
{
};

// Function WGame.wBotVehicleController.Formation
// Flags: 
struct AwBotVehicleController_execFormation_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.NotifyTakeHit
// Flags: 
struct AwBotVehicleController_execNotifyTakeHit_Parms
{
	class APawn*                                       instigatedBy;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	int                                                Damage;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wBotVehicleController.GetTeamNum
// Flags: [ FUNC_Simulated ]
struct AwBotVehicleController_execGetTeamNum_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.GetNextPathForMoveTarget
// Flags: 
struct AwBotVehicleController_execGetNextPathForMoveTarget_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wBotVehicleController.GetHeli
// Flags: 
struct AwBotVehicleController_execGetHeli_Parms
{
	class AwHelicopter*                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.damageAttitudeTo
// Flags: 
struct AwBotVehicleController_execdamageAttitudeTo_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Damage;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.Desireability
// Flags: [ FUNC_Event ]
struct AwBotVehicleController_eventDesireability_Parms
{
	class APickup*                                     P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.FaceActor
// Flags: 
struct AwBotVehicleController_execFaceActor_Parms
{
	float                                              StrafingModifier;                                 		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              RelativeDir;                                      		// 0x0008 ( 0x0004
};

// Function WGame.wBotVehicleController.ShouldStrafeTo
// Flags: 
struct AwBotVehicleController_execShouldStrafeTo_Parms
{
	class AActor*                                      WayPoint;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ANavigationPoint*                            N;                                                		// 0x0008 ( 0x0004
};

// Function WGame.wBotVehicleController.FaceMoveTarget
// Flags: 
struct AwBotVehicleController_execFaceMoveTarget_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.NotifyKilled
// Flags: 
struct AwBotVehicleController_execNotifyKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       KilledPawn;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.TryToDuck
// Flags: 
struct AwBotVehicleController_execTryToDuck_Parms
{
	struct FVector                                     duckDir;                                          		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bReversed:1;                                      		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     HitLocation;                                      		// 0x0014 ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0020 ( 0x000C
//	struct FVector                                     Extent;                                           		// 0x002C ( 0x000C
//	class AActor*                                      HitActor;                                         		// 0x0038 ( 0x0004
//	unsigned long                                      bSuccess:1;                                       		// 0x003C ( 0x0004 [0x00000001]
//	unsigned long                                      bDuckLeft:1;                                      		// 0x0040 ( 0x0004 [0x00000001]
};

// Function WGame.wBotVehicleController.ReceiveWarning
// Flags: 
struct AwBotVehicleController_execReceiveWarning_Parms
{
	class APawn*                                       shooter;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              projSpeed;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     FireDir;                                          		// 0x0008 ( 0x000C[ CPF_Parm ]
	float                                              enemyDist;                                        		// 0x0014 ( 0x0004
	float                                              DodgeSkill;                                       		// 0x0018 ( 0x0004
	struct FVector                                     X;                                                		// 0x001C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0028 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0034 ( 0x000C
	struct FVector                                     enemyDir;                                         		// 0x0040 ( 0x000C
};

// Function WGame.wBotVehicleController.AdjustAim
// Flags: 
struct AwBotVehicleController_execAdjustAim_Parms
{
	struct FFireProperties                             FiredAmmunition;                                  		// 0x0000 ( 0x0014[ CPF_Parm ]
	struct FVector                                     projStart;                                        		// 0x0014 ( 0x000C[ CPF_Parm ]
	int                                                AimError;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FRotator                                    FireRotation;                                     		// 0x0030 ( 0x000C
//	struct FRotator                                    TargetLook;                                       		// 0x003C ( 0x000C
//	float                                              FireDist;                                         		// 0x0048 ( 0x0004
//	float                                              TargetDist;                                       		// 0x004C ( 0x0004
//	float                                              projSpeed;                                        		// 0x0050 ( 0x0004
//	class AActor*                                      HitActor;                                         		// 0x0054 ( 0x0004
//	struct FVector                                     FireSpot;                                         		// 0x0058 ( 0x000C
//	struct FVector                                     FireDir;                                          		// 0x0064 ( 0x000C
//	struct FVector                                     TargetVel;                                        		// 0x0070 ( 0x000C
//	struct FVector                                     HitLocation;                                      		// 0x007C ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0088 ( 0x000C
//	int                                                realYaw;                                          		// 0x0094 ( 0x0004
//	unsigned long                                      bDefendMelee:1;                                   		// 0x0098 ( 0x0004 [0x00000001]
//	unsigned long                                      bClean:1;                                         		// 0x009C ( 0x0004 [0x00000001]
//	unsigned long                                      bLeadTargetNow:1;                                 		// 0x00A0 ( 0x0004 [0x00000001]
};

// Function WGame.wBotVehicleController.AdjustAimError
// Flags: 
struct AwBotVehicleController_execAdjustAimError_Parms
{
	float                                              AimError;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              TargetDist;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bDefendMelee:1;                                   		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bInstantProj:1;                                   		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bLeadTargetNow:1;                                 		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.CheckFutureSight
// Flags: 
struct AwBotVehicleController_execCheckFutureSight_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     FutureLoc;                                        		// 0x0008 ( 0x000C
};

// Function WGame.wBotVehicleController.NearWall
// Flags: 
struct AwBotVehicleController_execNearWall_Parms
{
	float                                              walldist;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      HitActor;                                         		// 0x0008 ( 0x0004
//	struct FVector                                     HitLocation;                                      		// 0x000C ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0018 ( 0x000C
//	struct FVector                                     ViewSpot;                                         		// 0x0024 ( 0x000C
//	struct FVector                                     ViewDist;                                         		// 0x0030 ( 0x000C
//	struct FVector                                     LookDir;                                          		// 0x003C ( 0x000C
};

// Function WGame.wBotVehicleController.NeedToTurn
// Flags: 
struct AwBotVehicleController_execNeedToTurn_Parms
{
	struct FVector                                     targ;                                             		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     LookDir;                                          		// 0x0010 ( 0x000C
//	struct FVector                                     AimDir;                                           		// 0x001C ( 0x000C
};

// Function WGame.wBotVehicleController.FindBestPathToward
// Flags: 
struct AwBotVehicleController_execFindBestPathToward_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bCheckedReach:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bAllowDetour:1;                                   		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.NotifyLanded
// Flags: 
struct AwBotVehicleController_execNotifyLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     Vel2D;                                            		// 0x0010 ( 0x000C
};

// Function WGame.wBotVehicleController.SetFall
// Flags: 
struct AwBotVehicleController_execSetFall_Parms
{
};

// Function WGame.wBotVehicleController.NotifyBump
// Flags: [ FUNC_Event ]
struct AwBotVehicleController_eventNotifyBump_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       P;                                                		// 0x0008 ( 0x0004
};

// Function WGame.wBotVehicleController.AdjustAround
// Flags: 
struct AwBotVehicleController_execAdjustAround_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Speed;                                            		// 0x0008 ( 0x0004
//	struct FVector                                     VelDir;                                           		// 0x000C ( 0x000C
//	struct FVector                                     OtherDir;                                         		// 0x0018 ( 0x000C
//	struct FVector                                     SideDir;                                          		// 0x0024 ( 0x000C
};

// Function WGame.wBotVehicleController.CancelCampFor
// Flags: 
struct AwBotVehicleController_execCancelCampFor_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.Restart
// Flags: 
struct AwBotVehicleController_execRestart_Parms
{
};

// Function WGame.wBotVehicleController.TestDirection
// Flags: 
struct AwBotVehicleController_execTestDirection_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     pick;                                             		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     HitLocation;                                      		// 0x001C ( 0x000C
//	struct FVector                                     HitNormal;                                        		// 0x0028 ( 0x000C
//	struct FVector                                     dist;                                             		// 0x0034 ( 0x000C
//	class AActor*                                      HitActor;                                         		// 0x0040 ( 0x0004
};

// Function WGame.wBotVehicleController.FindRoamDest
// Flags: 
struct AwBotVehicleController_execFindRoamDest_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      BestPath;                                         		// 0x0004 ( 0x0004
};

// Function WGame.wBotVehicleController.SoakStop
// Flags: [ FUNC_Event ]
struct AwBotVehicleController_eventSoakStop_Parms
{
	struct FString                                     problem;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class AUnrealPlayer*                               PC;                                               		// 0x000C ( 0x0004
};

// Function WGame.wBotVehicleController.DoRangedAttackOn
// Flags: 
struct AwBotVehicleController_execDoRangedAttackOn_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.EnemyVisible
// Flags: 
struct AwBotVehicleController_execEnemyVisible_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.DoWaitForLanding
// Flags: 
struct AwBotVehicleController_execDoWaitForLanding_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.ExecuteWhatToDoNext
// Flags: 
struct AwBotVehicleController_execExecuteWhatToDoNext_Parms
{
};

// Function WGame.wBotVehicleController.GetEnemyName
// Flags: 
struct AwBotVehicleController_execGetEnemyName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wBotVehicleController.GetOldEnemyName
// Flags: 
struct AwBotVehicleController_execGetOldEnemyName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wBotVehicleController.TryToWalk
// Flags: 
struct AwBotVehicleController_execTryToWalk_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C
	struct FVector                                     Extent;                                           		// 0x0018 ( 0x000C
	class AActor*                                      HitActor;                                         		// 0x0024 ( 0x0004
};

// Function WGame.wBotVehicleController.WhatToDoNext
// Flags: 
struct AwBotVehicleController_execWhatToDoNext_Parms
{
	unsigned char                                      CallingByte;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.SetPeripheralVision
// Flags: 
struct AwBotVehicleController_execSetPeripheralVision_Parms
{
};

// Function WGame.wBotVehicleController.SetMaxDesiredSpeed
// Flags: 
struct AwBotVehicleController_execSetMaxDesiredSpeed_Parms
{
};

// Function WGame.wBotVehicleController.ResetSkill
// Flags: 
struct AwBotVehicleController_execResetSkill_Parms
{
	float                                              AdjustedYaw;                                      		// 0x0000 ( 0x0004
};

// Function WGame.wBotVehicleController.InitializeSkill
// Flags: 
struct AwBotVehicleController_execInitializeSkill_Parms
{
	float                                              InSkill;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.Possess
// Flags: 
struct AwBotVehicleController_execPossess_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.NotifyMissedJump
// Flags: [ FUNC_Event ]
struct AwBotVehicleController_eventNotifyMissedJump_Parms
{
};

// Function WGame.wBotVehicleController.NotifyPhysicsVolumeChange
// Flags: 
struct AwBotVehicleController_execNotifyPhysicsVolumeChange_Parms
{
	class APhysicsVolume*                              NewVolume;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     jumpDir;                                          		// 0x0008 ( 0x000C
};

// Function WGame.wBotVehicleController.StrafeFromDamage
// Flags: 
struct AwBotVehicleController_execStrafeFromDamage_Parms
{
	float                                              Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bFindDest:1;                                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.EnemyChanged
// Flags: 
struct AwBotVehicleController_execEnemyChanged_Parms
{
	unsigned long                                      bNewEnemyVisible:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wBotVehicleController.SetEnemyInfo
// Flags: 
struct AwBotVehicleController_execSetEnemyInfo_Parms
{
	unsigned long                                      bNewEnemyVisible:1;                               		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wBotVehicleController.Trigger
// Flags: 
struct AwBotVehicleController_execTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.CheckIfShouldCrouch
// Flags: 
struct AwBotVehicleController_execCheckIfShouldCrouch_Parms
{
	struct FVector                                     StartPosition;                                    		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     TargetPosition;                                   		// 0x000C ( 0x000C[ CPF_Parm ]
	float                                              Probability;                                      		// 0x0018 ( 0x0004[ CPF_Parm ]
	class AActor*                                      HitActor;                                         		// 0x001C ( 0x0004
	struct FVector                                     HitNormal;                                        		// 0x0020 ( 0x000C
	struct FVector                                     HitLocation;                                      		// 0x002C ( 0x000C
	struct FVector                                     X;                                                		// 0x0038 ( 0x000C
	struct FVector                                     Y;                                                		// 0x0044 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0050 ( 0x000C
	struct FVector                                     projStart;                                        		// 0x005C ( 0x000C
};

// Function WGame.wBotVehicleController.ClearShot
// Flags: 
struct AwBotVehicleController_execClearShot_Parms
{
	struct FVector                                     TargetLoc;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bImmediateFire:1;                                 		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      bSeeTarget:1;                                     		// 0x0014 ( 0x0004 [0x00000001]
};

// Function WGame.wBotVehicleController.SeePlayer
// Flags: [ FUNC_Event ]
struct AwBotVehicleController_eventSeePlayer_Parms
{
	class APawn*                                       SeenPlayer;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.HearNoise
// Flags: 
struct AwBotVehicleController_execHearNoise_Parms
{
	float                                              Loudness;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      NoiseMaker;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.SetEnemy
// Flags: 
struct AwBotVehicleController_execSetEnemy_Parms
{
	class APawn*                                       NewEnemy;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bHateMonster:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              enemyDist;                                        		// 0x000C ( 0x0004
//	unsigned long                                      bNewMonsterEnemy:1;                               		// 0x0010 ( 0x0004 [0x00000001]
};

// Function WGame.wBotVehicleController.ChangeEnemy
// Flags: 
struct AwBotVehicleController_execChangeEnemy_Parms
{
	class APawn*                                       NewEnemy;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bCanSeeNewEnemy:1;                                		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wBotVehicleController.FindNewEnemy
// Flags: 
struct AwBotVehicleController_execFindNewEnemy_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       BestEnemy;                                        		// 0x0004 ( 0x0004
//	unsigned long                                      bSeeNew:1;                                        		// 0x0008 ( 0x0004 [0x00000001]
//	unsigned long                                      bSeeBest:1;                                       		// 0x000C ( 0x0004 [0x00000001]
//	float                                              BestDist;                                         		// 0x0010 ( 0x0004
//	float                                              newdist;                                          		// 0x0014 ( 0x0004
//	class AController*                                 C;                                                		// 0x0018 ( 0x0004
};

// Function WGame.wBotVehicleController.DisplayDebug
// Flags: 
struct AwBotVehicleController_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     S;                                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.wBotVehicleController.StopFiring
// Flags: 
struct AwBotVehicleController_execStopFiring_Parms
{
};

// Function WGame.wBotVehicleController.CanAttack
// Flags: 
struct AwBotVehicleController_execCanAttack_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.FireWeaponAt
// Flags: 
struct AwBotVehicleController_execFireWeaponAt_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicleController.TimedFireWeaponAtEnemy
// Flags: 
struct AwBotVehicleController_execTimedFireWeaponAtEnemy_Parms
{
};

// Function WGame.wBotVehicleController.WaitForMover
// Flags: 
struct AwBotVehicleController_execWaitForMover_Parms
{
	class AMover*                                      M;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.SetCombatTimer
// Flags: 
struct AwBotVehicleController_execSetCombatTimer_Parms
{
};

// Function WGame.wBotVehicleController.FearThisSpot
// Flags: 
struct AwBotVehicleController_execFearThisSpot_Parms
{
	class AAvoidMarker*                                aSpot;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicleController.PostBeginPlay
// Flags: 
struct AwBotVehicleController_execPostBeginPlay_Parms
{
};

// Function WGame.Combo.Tick
// Flags: [ FUNC_Simulated ]
struct ACombo_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004
};

// Function WGame.Combo.StopEffect
// Flags: 
struct ACombo_execStopEffect_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.Combo.StartEffect
// Flags: 
struct ACombo_execStartEffect_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.Combo.Destroyed
// Flags: 
struct ACombo_execDestroyed_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004
};

// Function WGame.Combo.AdrenalineEmpty
// Flags: 
struct ACombo_execAdrenalineEmpty_Parms
{
};

// Function WGame.Combo.PostBeginPlay
// Flags: 
struct ACombo_execPostBeginPlay_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004
};

// Function WGame.wWeaponAttachment.Timer
// Flags: [ FUNC_Simulated ]
struct AwWeaponAttachment_execTimer_Parms
{
};

// Function WGame.wWeaponAttachment.InitFor
// Flags: 
struct AwWeaponAttachment_execInitFor_Parms
{
	class AInventory*                                  i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wWeaponAttachment.WeaponLight
// Flags: [ FUNC_Simulated ]
struct AwWeaponAttachment_execWeaponLight_Parms
{
};

// Function WGame.wWeaponAttachment.GetTipLocation
// Flags: [ FUNC_Simulated ]
struct AwWeaponAttachment_execGetTipLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FCoords                                     C;                                                		// 0x000C ( 0x0030
};

// Function WGame.wWeaponAttachment.PostNetBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwWeaponAttachment_execPostNetBeginPlay_Parms
{
};

// Function WGame.wWeaponAttachment.ThirdPersonEffects
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwWeaponAttachment_eventThirdPersonEffects_Parms
{
};

// Function WGame.wWeaponAttachment.UpdateHit
// Flags: 
struct AwWeaponAttachment_execUpdateHit_Parms
{
	class AActor*                                      HitActor;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     HitNormal;                                        		// 0x0010 ( 0x000C[ CPF_Parm ]
	class UMaterial*                                   HitMaterial;                                      		// 0x001C ( 0x0004[ CPF_Parm ]
};

// Function WGame.wWeaponAttachment.UpdatePenetrateHit
// Flags: 
struct AwWeaponAttachment_execUpdatePenetrateHit_Parms
{
	class AActor*                                      mHitActor[ 0x06 ];                                		// 0x0000 ( 0x0018[ CPF_Parm ]
	struct FVector                                     mHitLocation[ 0x06 ];                             		// 0x0018 ( 0x0048[ CPF_Parm ]
	struct FVector                                     mHitNormal[ 0x06 ];                               		// 0x0060 ( 0x0048[ CPF_Parm ]
	class UMaterial*                                   mHitMaterial[ 0x06 ];                             		// 0x00A8 ( 0x0018[ CPF_Parm ]
	int                                                mLastHitIdx;                                      		// 0x00C0 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wWeaponAttachment.Hide
// Flags: [ FUNC_Simulated ]
struct AwWeaponAttachment_execHide_Parms
{
	unsigned long                                      NewbHidden:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WGame.wWeaponAttachment.GetHitInfo
// Flags: [ FUNC_Simulated ]
struct AwWeaponAttachment_execGetHitInfo_Parms
{
	int                                                nIndex;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0008 ( 0x000C
	struct FVector                                     offset;                                           		// 0x0014 ( 0x000C
};

// Function WGame.wWeaponAttachment.MakeSpawnShell
// Flags: [ FUNC_Simulated ]
struct AwWeaponAttachment_execMakeSpawnShell_Parms
{
	unsigned long                                      bRechamber:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wRosterEntry.InitBot
// Flags: 
struct UwRosterEntry_execInitBot_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wRosterEntry.PrecacheRosterFor
// Flags: 
struct UwRosterEntry_execPrecacheRosterFor_Parms
{
	class AUnrealTeamInfo*                             t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wRosterEntry.CreateRosterEntryCharacter
// Flags: 
struct UwRosterEntry_execCreateRosterEntryCharacter_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UwRosterEntry*                               ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwRosterEntry*                               xre;                                              		// 0x0010 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x0014 ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.wRosterEntry.CreateRosterEntry
// Flags: 
struct UwRosterEntry_execCreateRosterEntry_Parms
{
	int                                                prIdx;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwRosterEntry*                               ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwRosterEntry*                               xre;                                              		// 0x0008 ( 0x0004
//	struct FPlayerRecord                               pR;                                               		// 0x000C ( 0x00FC[ CPF_NeedCtorLink ]
};

// Function WGame.SPECIES_Merc.GetRagSkelName
// Flags: 
struct USPECIES_Merc_execGetRagSkelName_Parms
{
	struct FString                                     MeshName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wBot.Possess
// Flags: 
struct AwBot_execPossess_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBot.SetPawnClass
// Flags: 
struct AwBot_execSetPawnClass_Parms
{
	struct FString                                     inClass;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     InCharacter;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      pClass;                                           		// 0x0018 ( 0x0004
};

// Function WGame.wHelicopter.Call
// Flags: 
struct AwHelicopter_execCall_Parms
{
	class ALevelInfo*                                  Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwHelicopter*                                lastHeli;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AController*                                 Caller;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UClass*                                      mClass;                                           		// 0x0010 ( 0x0004
//	class AwBotVehicle*                                wHeli;                                            		// 0x0014 ( 0x0004
//	class ANavigationPoint*                            N;                                                		// 0x0018 ( 0x0004
//	struct FVector                                     loc;                                              		// 0x001C ( 0x000C
//	struct FVector                                     focal;                                            		// 0x0028 ( 0x000C
//	int                                                iCurrentPoint;                                    		// 0x0034 ( 0x0004
//	int                                                Health;                                           		// 0x0038 ( 0x0004
//	struct FRotator                                    Rotation;                                         		// 0x003C ( 0x000C
};

// Function WGame.wHelicopter.GetFlyingPathNode
// Flags: 
struct AwHelicopter_execGetFlyingPathNode_Parms
{
	class ALevelInfo*                                  Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                idx;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                RegenLoc;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ANavigationPoint*                            N;                                                		// 0x0010 ( 0x0004
};

// Function WGame.wHelicopter.TossWeapon
// Flags: 
struct AwHelicopter_execTossWeapon_Parms
{
	struct FVector                                     TossVel;                                          		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function WGame.wHelicopter.GetBloodHitClass
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execGetBloodHitClass_Parms
{
	unsigned long                                      bHeadShot:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UClass*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wHelicopter.deleOnReachedDestination
// Flags: 
struct AwHelicopter_execdeleOnReachedDestination_Parms
{
	struct FVector                                     Dir;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AActor*                                      GoalActor;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Size;                                             		// 0x0014 ( 0x0004
};

// Function WGame.wHelicopter.GetWeaponBoneFor
// Flags: 
struct AwHelicopter_execGetWeaponBoneFor_Parms
{
	class AInventory*                                  i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wHelicopter.PoundDamageTarget
// Flags: 
struct AwHelicopter_execPoundDamageTarget_Parms
{
};

// Function WGame.wHelicopter.PunchDamageTarget
// Flags: 
struct AwHelicopter_execPunchDamageTarget_Parms
{
};

// Function WGame.wHelicopter.GetFireStart
// Flags: 
struct AwHelicopter_execGetFireStart_Parms
{
	struct FVector                                     X;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Y;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Z;                                                		// 0x0018 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wHelicopter.SpawnBelch
// Flags: 
struct AwHelicopter_execSpawnBelch_Parms
{
};

// Function WGame.wHelicopter.PlayVictory
// Flags: 
struct AwHelicopter_execPlayVictory_Parms
{
};

// Function WGame.wHelicopter.PlayDirectionalHit
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execPlayDirectionalHit_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bUseHitStun:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bGoreChange:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wHelicopter.PlayDirectionalDeath
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execPlayDirectionalDeath_Parms
{
	struct FVector                                     HitLoc;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function WGame.wHelicopter.Falling
// Flags: 
struct AwHelicopter_execFalling_Parms
{
};

// Function WGame.wHelicopter.SetMovementPhysics
// Flags: 
struct AwHelicopter_execSetMovementPhysics_Parms
{
};

// Function WGame.wHelicopter.Dodge
// Flags: 
struct AwHelicopter_execDodge_Parms
{
	unsigned char                                      DoubleClickMove;                                  		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     X;                                                		// 0x0008 ( 0x000C
//	struct FVector                                     Y;                                                		// 0x0014 ( 0x000C
//	struct FVector                                     Z;                                                		// 0x0020 ( 0x000C
//	struct FVector                                     duckDir;                                          		// 0x002C ( 0x000C
};

// Function WGame.wHelicopter.RangedAttack
// Flags: 
struct AwHelicopter_execRangedAttack_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Adjust;                                           		// 0x0004 ( 0x000C
};

// Function WGame.wHelicopter.PostBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwHelicopter_eventPostBeginPlay_Parms
{
};

// Function WGame.wHelicopter.ClientPlayStaySound
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execClientPlayStaySound_Parms
{
};

// Function WGame.wHelicopter.ClientPlayMoveSound
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execClientPlayMoveSound_Parms
{
};

// Function WGame.wHelicopter.ClientStopAllHeliSound
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execClientStopAllHeliSound_Parms
{
};

// Function WGame.wHelicopter.StopAllHeliSound
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execStopAllHeliSound_Parms
{
};

// Function WGame.wHelicopter.Destroyed
// Flags: [ FUNC_Event ]
struct AwHelicopter_eventDestroyed_Parms
{
};

// Function WGame.wHelicopter.RemoveLevelHelicopter
// Flags: [ FUNC_Simulated ]
struct AwHelicopter_execRemoveLevelHelicopter_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function WGame.wBotVehicle.StartDeRes
// Flags: [ FUNC_Simulated ]
struct AwBotVehicle_execStartDeRes_Parms
{
};

// Function WGame.wBotVehicle.SetCaller
// Flags: 
struct AwBotVehicle_execSetCaller_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicle.CreateGib
// Flags: 
struct AwBotVehicle_execCreateGib_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    R;                                                		// 0x0008 ( 0x000C[ CPF_Parm ]
};

// Function WGame.wBotVehicle.SetAnimAction
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwBotVehicle_eventSetAnimAction_Parms
{
	struct FName                                       NewAction;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicle.PlayVictoryAnimation
// Flags: 
struct AwBotVehicle_execPlayVictoryAnimation_Parms
{
};

// Function WGame.wBotVehicle.MeleeDamageTarget
// Flags: 
struct AwBotVehicle_execMeleeDamageTarget_Parms
{
	int                                                hitdamage;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     pushdir;                                          		// 0x0004 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.PlayDyingSound
// Flags: 
struct AwBotVehicle_execPlayDyingSound_Parms
{
};

// Function WGame.wBotVehicle.PlayDying
// Flags: [ FUNC_Simulated ]
struct AwBotVehicle_execPlayDying_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLoc;                                           		// 0x0004 ( 0x000C[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.wBotVehicle.PlayTakeHit
// Flags: 
struct AwBotVehicle_execPlayTakeHit_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	int                                                Damage;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicle.IsPlayerPawn
// Flags: 
struct AwBotVehicle_execIsPlayerPawn_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.SetMovementPhysics
// Flags: 
struct AwBotVehicle_execSetMovementPhysics_Parms
{
};

// Function WGame.wBotVehicle.AnimEnd
// Flags: [ FUNC_Simulated ]
struct AwBotVehicle_execAnimEnd_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.wBotVehicle.PlayVictory
// Flags: 
struct AwBotVehicle_execPlayVictory_Parms
{
};

// Function WGame.wBotVehicle.Destroyed
// Flags: 
struct AwBotVehicle_execDestroyed_Parms
{
};

// Function WGame.wBotVehicle.PlayChallengeSound
// Flags: 
struct AwBotVehicle_execPlayChallengeSound_Parms
{
};

// Function WGame.wBotVehicle.AssignInitialPose
// Flags: [ FUNC_Simulated ]
struct AwBotVehicle_execAssignInitialPose_Parms
{
};

// Function WGame.wBotVehicle.SameSpeciesAs
// Flags: 
struct AwBotVehicle_execSameSpeciesAs_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.LandThump
// Flags: 
struct AwBotVehicle_execLandThump_Parms
{
};

// Function WGame.wBotVehicle.SpawnGiblet
// Flags: [ FUNC_Simulated ]
struct AwBotVehicle_execSpawnGiblet_Parms
{
	class UClass*                                      GibClass;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     Location;                                         		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    Rotation;                                         		// 0x0010 ( 0x000C[ CPF_Parm ]
	float                                              GibPerterbation;                                  		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FVector                                     GibVelocity;                                      		// 0x0020 ( 0x000C[ CPF_Parm ]
	class AGib*                                        Giblet;                                           		// 0x002C ( 0x0004
	struct FVector                                     direction;                                        		// 0x0030 ( 0x000C
	struct FVector                                     Dummy;                                            		// 0x003C ( 0x000C
};

// Function WGame.wBotVehicle.PostBeginPlay
// Flags: [ FUNC_Event ]
struct AwBotVehicle_eventPostBeginPlay_Parms
{
};

// Function WGame.wBotVehicle.FireProjectile
// Flags: 
struct AwBotVehicle_execFireProjectile_Parms
{
	struct FVector                                     FireStart;                                        		// 0x0000 ( 0x000C
	struct FVector                                     X;                                                		// 0x000C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0018 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0024 ( 0x000C
	class AwProjectile*                                P;                                                		// 0x0030 ( 0x0004
};

// Function WGame.wBotVehicle.GetFireStart
// Flags: 
struct AwBotVehicle_execGetFireStart_Parms
{
	struct FVector                                     X;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Y;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Z;                                                		// 0x0018 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.RangedAttackTime
// Flags: 
struct AwBotVehicle_execRangedAttackTime_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.HasRangedAttack
// Flags: 
struct AwBotVehicle_execHasRangedAttack_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.PreferMelee
// Flags: 
struct AwBotVehicle_execPreferMelee_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.Fire
// Flags: 
struct AwBotVehicle_execFire_Parms
{
	float                                              f;                                                		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class AActor*                                      BestTarget;                                       		// 0x0004 ( 0x0004
	float                                              bestAim;                                          		// 0x0008 ( 0x0004
	float                                              BestDist;                                         		// 0x000C ( 0x0004
	struct FVector                                     FireDir;                                          		// 0x0010 ( 0x000C
	struct FVector                                     X;                                                		// 0x001C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0028 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0034 ( 0x000C
};

// Function WGame.wBotVehicle.IsHeadShot
// Flags: 
struct AwBotVehicle_execIsHeadShot_Parms
{
	struct FVector                                     loc;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ray;                                              		// 0x000C ( 0x000C[ CPF_Parm ]
	float                                              AdditionalScale;                                  		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     HeadLoc;                                          		// 0x0020 ( 0x000C
//	struct FVector                                     B;                                                		// 0x002C ( 0x000C
//	struct FVector                                     M;                                                		// 0x0038 ( 0x000C
//	struct FVector                                     diff;                                             		// 0x0044 ( 0x000C
//	float                                              t;                                                		// 0x0050 ( 0x0004
//	float                                              DotMM;                                            		// 0x0054 ( 0x0004
//	float                                              Distance;                                         		// 0x0058 ( 0x0004
};

// Function WGame.wBotVehicle.ForceDefaultCharacter
// Flags: [ FUNC_Simulated ]
struct AwBotVehicle_execForceDefaultCharacter_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.TurnOff
// Flags: [ FUNC_Simulated ]
struct AwBotVehicle_execTurnOff_Parms
{
};

// Function WGame.wBotVehicle.RecommendSplashDamage
// Flags: 
struct AwBotVehicle_execRecommendSplashDamage_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.GetDamageRadius
// Flags: 
struct AwBotVehicle_execGetDamageRadius_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.SplashDamage
// Flags: 
struct AwBotVehicle_execSplashDamage_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.StopFiring
// Flags: 
struct AwBotVehicle_execStopFiring_Parms
{
};

// Function WGame.wBotVehicle.CanAttack
// Flags: 
struct AwBotVehicle_execCanAttack_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wBotVehicle.RangedAttack
// Flags: 
struct AwBotVehicle_execRangedAttack_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.ComboMessage.ClientReceive
// Flags: [ FUNC_Simulated ]
struct AComboMessage_execClientReceive_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WGame.ComboMessage.GetString
// Flags: 
struct AComboMessage_execGetString_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayerReplicationInfo.GetPortrait
// Flags: [ FUNC_Simulated ]
struct AwPlayerReplicationInfo_execGetPortrait_Parms
{
	class UMaterial*                                   ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.wPlayerReplicationInfo.UpdateCharacter
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwPlayerReplicationInfo_eventUpdateCharacter_Parms
{
};

// Function WGame.wPlayerReplicationInfo.SetCharacterName
// Flags: [ FUNC_Simulated ]
struct AwPlayerReplicationInfo_execSetCharacterName_Parms
{
	struct FString                                     S;                                                		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.wPlayerReplicationInfo.UpdatePrecacheMaterials
// Flags: [ FUNC_Simulated ]
struct AwPlayerReplicationInfo_execUpdatePrecacheMaterials_Parms
{
};

// Function WGame.Goal.SetFocus
// Flags: 
struct UGoal_execSetFocus_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal.SetFocusValue
// Flags: 
struct UGoal_execSetFocusValue_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal.SetFocusValueToTarget
// Flags: 
struct UGoal_execSetFocusValueToTarget_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal.ToString
// Flags: 
struct UGoal_execToString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.Goal.DisplayDebug
// Flags: 
struct UGoal_execDisplayDebug_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Level;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function WGame.Goal.HandleMessage
// Flags: 
struct UGoal_execHandleMessage_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.Goal.End
// Flags: 
struct UGoal_execEnd_Parms
{
};

// Function WGame.Goal.ProcessSubGoals
// Flags: 
struct UGoal_execProcessSubGoals_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      gs;                                               		// 0x0005 ( 0x0001
//	unsigned long                                      atomicSubgoal:1;                                  		// 0x0008 ( 0x0004 [0x00000001]
};

// Function WGame.Goal.ActualWork
// Flags: 
struct UGoal_execActualWork_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal.Process
// Flags: 
struct UGoal_execProcess_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal.StartIfNotStarted
// Flags: 
struct UGoal_execStartIfNotStarted_Parms
{
};

// Function WGame.Goal.Start
// Flags: 
struct UGoal_execStart_Parms
{
};

// Function WGame.Goal.ClearSubgoals
// Flags: 
struct UGoal_execClearSubgoals_Parms
{
	unsigned long                                      free:1;                                           		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
};

// Function WGame.Goal.AddSubgoal
// Flags: 
struct UGoal_execAddSubgoal_Parms
{
	class UGoal*                                       inGoal;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.Goal.NotifyDestroyed
// Flags: 
struct UGoal_execNotifyDestroyed_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.Goal.ClearReferences
// Flags: 
struct UGoal_execClearReferences_Parms
{
};

// Function WGame.Goal.InitBase
// Flags: 
struct UGoal_execInitBase_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.Goal_PlanAndExec.ToString
// Flags: 
struct UGoal_PlanAndExec_execToString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.Goal_PlanAndExec.HandleMessage
// Flags: 
struct UGoal_PlanAndExec_execHandleMessage_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WGame.Goal_PlanAndExec.ActualWork
// Flags: 
struct UGoal_PlanAndExec_execActualWork_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      gs;                                               		// 0x0005 ( 0x0001
//	class UMemoryItem*                                 temp;                                             		// 0x0008 ( 0x0004
};

// Function WGame.Goal_PlanAndExec.Start
// Flags: 
struct UGoal_PlanAndExec_execStart_Parms
{
};

// Function WGame.Goal_PlanAndExec.LogFlag
// Flags: 
struct UGoal_PlanAndExec_execLogFlag_Parms
{
};

// Function WGame.Goal_PlanAndExec.LogPlan
// Flags: 
struct UGoal_PlanAndExec_execLogPlan_Parms
{
	int                                                tries;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              planScore;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UwActionContainer*                           Plan;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                lp1;                                              		// 0x000C ( 0x0004
};

// Function WGame.Goal_PlanAndExec.LookForBetterPlan
// Flags: 
struct UGoal_PlanAndExec_execLookForBetterPlan_Parms
{
	int                                                tries;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwActionContainer*                           Plan;                                             		// 0x0004 ( 0x0004
	float                                              planScore;                                        		// 0x0008 ( 0x0004
	float                                              currentPlanDecayedScore;                          		// 0x000C ( 0x0004
};

// Function WGame.Goal_PlanAndExec.Replan
// Flags: 
struct UGoal_PlanAndExec_execReplan_Parms
{
};

// Function WGame.Goal_PlanAndExec.DecidePurposeToActivate
// Flags: 
struct UGoal_PlanAndExec_execDecidePurposeToActivate_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
	class UwPurpose*                                   bestPurpose;                                      		// 0x0004 ( 0x0004
	class UwPurpose*                                   P;                                                		// 0x0008 ( 0x0004
	float                                              bestScore;                                        		// 0x000C ( 0x0004
	float                                              Score;                                            		// 0x0010 ( 0x0004
};

// Function WGame.Goal_PlanAndExec.InitPurposes
// Flags: 
struct UGoal_PlanAndExec_execInitPurposes_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
	class TArray< class UObject* >                     objPurposes;                                      		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WGame.Goal_PlanAndExec.ClearReferences
// Flags: 
struct UGoal_PlanAndExec_execClearReferences_Parms
{
};

// Function WGame.Goal_PlanAndExec.Init
// Flags: 
struct UGoal_PlanAndExec_execInit_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwActionPlanner*                             inPlaner;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UGoal_PlanAndExec*                           ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal_Fire.ToString
// Flags: 
struct UGoal_Fire_execToString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.Goal_Fire.End
// Flags: 
struct UGoal_Fire_execEnd_Parms
{
};

// Function WGame.Goal_Fire.ActualWork
// Flags: 
struct UGoal_Fire_execActualWork_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      CurrentAim:1;                                     		// 0x0008 ( 0x0004 [0x00000001]
//	unsigned long                                      Visible:1;                                        		// 0x000C ( 0x0004 [0x00000001]
//	class UMemoryItem*                                 MI;                                               		// 0x0010 ( 0x0004
};

// Function WGame.Goal_Fire.Start
// Flags: 
struct UGoal_Fire_execStart_Parms
{
};

// Function WGame.Goal_Fire.SetFocusValue
// Flags: 
struct UGoal_Fire_execSetFocusValue_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal_Fire.NotifyDestroyed
// Flags: 
struct UGoal_Fire_execNotifyDestroyed_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.Goal_Fire.ClearReferences
// Flags: 
struct UGoal_Fire_execClearReferences_Parms
{
};

// Function WGame.Goal_Fire.Init
// Flags: 
struct UGoal_Fire_execInit_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      inTarget;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      inDoAim:1;                                        		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                inFireCount;                                      		// 0x000C ( 0x0004[ CPF_Parm ]
	class UGoal_Fire*                                  ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal_MovePathToward.NotifyDestroyed
// Flags: 
struct UGoal_MovePathToward_execNotifyDestroyed_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WGame.Goal_MovePathToward.ToString
// Flags: 
struct UGoal_MovePathToward_execToString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.Goal_MovePathToward.AddGoalMoveToward
// Flags: 
struct UGoal_MovePathToward_execAddGoalMoveToward_Parms
{
	int                                                stackLevel;                                       		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AActor*                                      Next;                                             		// 0x0008 ( 0x0004
//	class AActor*                                      Focus;                                            		// 0x000C ( 0x0004
//	class AActor*                                      temp;                                             		// 0x0010 ( 0x0004
};

// Function WGame.Goal_MovePathToward.ActualWork
// Flags: 
struct UGoal_MovePathToward_execActualWork_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      gs;                                               		// 0x0005 ( 0x0001
};

// Function WGame.Goal_MovePathToward.Start
// Flags: 
struct UGoal_MovePathToward_execStart_Parms
{
};

// Function WGame.Goal_MovePathToward.ClearReferences
// Flags: 
struct UGoal_MovePathToward_execClearReferences_Parms
{
};

// Function WGame.Goal_MovePathToward.Init
// Flags: 
struct UGoal_MovePathToward_execInit_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      inDestination;                                    		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              inReachRadius;                                    		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UGoal_MovePathToward*                        ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal_Roam.ToString
// Flags: 
struct UGoal_Roam_execToString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.Goal_Roam.AddGoalMovePathToward
// Flags: 
struct UGoal_Roam_execAddGoalMovePathToward_Parms
{
};

// Function WGame.Goal_Roam.ActualWork
// Flags: 
struct UGoal_Roam_execActualWork_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      gs;                                               		// 0x0005 ( 0x0001
};

// Function WGame.Goal_Roam.Start
// Flags: 
struct UGoal_Roam_execStart_Parms
{
};

// Function WGame.Goal_Roam.Init
// Flags: 
struct UGoal_Roam_execInit_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGoal_Roam*                                  ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WGame.Goal_Shoot.ToString
// Flags: 
struct UGoal_Shoot_execToString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WGame.Goal_Shoot.ActualWork
// Flags: 
struct UGoal_Shoot_execActualWork_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      ReturnValue;                                      		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      CurrentAim:1;                                     		// 0x0008 ( 0x0004 [0x00000001]
};

// Function WGame.Goal_Shoot.Start
// Flags: 
struct UGoal_Shoot_execStart_Parms
{
};

// Function WGame.Goal_Shoot.ClearReferences
// Flags: 
struct UGoal_Shoot_execClearReferences_Parms
{
};

// Function WGame.Goal_Shoot.Init
// Flags: 
struct UGoal_Shoot_execInit_Parms
{
	class AwAIBotBase*                                 inOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      inTarget;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      inDoAim:1;                                        		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
