#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : XInterface
# >    File : Classes.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Constants
# ======================================================================================== #
*/

#define CONST_DoCounter                                          1
#define CONST_QBTN_YesNoCancel                                   50
#define CONST_QBTN_YesNo                                         48
#define CONST_QBTN_AbortRetry                                    68
#define CONST_QBTN_OkCancel                                      3
#define CONST_QBTN_Ignore                                        128
#define CONST_QBTN_Abort                                         64
#define CONST_QBTN_No                                            32
#define CONST_QBTN_Yes                                           16
#define CONST_QBTN_Continue                                      8
#define CONST_QBTN_Retry                                         4
#define CONST_QBTN_Cancel                                        2

	DM_Waiting                                         = 1,
	DM_GameMode                                        = 2,
	DM_Go                                              = 3,
	DM_HostChange                                      = 4,
	DM_End                                             = 5
};

// Enum XInterface.wHudPart_DisplayEvent.SKILL_ARRAY
enum SKILL_ARRAY
{
	SKILL_ARRAY_C4                                     = 0,
	SKILL_ARRAY_RPG7                                   = 1,
	SKILL_ARRAY_HELICOPTER                             = 2,
	SKILL_ARRAY_AIRSTIRKE                              = 3,
	SKILL_ARRAY_UAV                                    = 4,
	SKILL_ARRAY_HELICOPTER_REQUIRE                     = 5,
	SKILL_ARRAY_AIRSTIRKE_REQUIRE                      = 6,
	SKILL_ARRAY_UAV_REQUIRE                            = 7,
	SKILL_ARRAY_HellFire                               = 8,
	SKILL_ARRAY_HellFire_Require                       = 9,
	SKILL_ARRAY_PinpointFire                           = 10,
	SKILL_ARRAY_PinpointFire_Require                   = 11,
	SKILL_ARRAY_Incen                                  = 12,
	SKILL_ARRAY_Incen_Require                          = 13,
	SKILL_ARRAY_SpiltGrenade                           = 14,
	SKILL_ARRAY_SpiltGrenade_Require                   = 15,
	SKILL_ARRAY_NONE                                   = 16
};

// Enum XInterface.wHudPart_DisplayEvent.ESD_STATE
enum ESD_STATE
{
	SET_ENABLE                                         = 0,
	SET_DOING                                          = 1,
	SET_DONE                                           = 2,
	DIFFUSE_ENABLE                                     = 3,
	DIFFUSE_DOING                                      = 4,
	DIFFUSE_DONE                                       = 5
};

// Enum XInterface.xScoreBoardTeamGame.GOAL_SCORE
enum GOAL_SCORE
{
	GOAL_100                                           = 0
};

// Enum XInterface.xScoreBoardTeamGame.SBGT
enum SBGT
{
	GT_TD                                              = 0,
	GT_DOMI                                            = 1,
	GT_SD                                              = 2
};

// Enum XInterface.wHudPart_RadioMessage.ERMType
enum ERMType
{
	ERMT_SELLECT                                       = 0,
	ERMT_COMMAND                                       = 1,
	ERMT_STATEMENT                                     = 2,
	ERMT_RESPON                                        = 3,
	ERMT_NONE                                          = 4
};

// Enum XInterface.GUIScrollText.eScrollState
enum eScrollState
{
	STS_None                                           = 0,
	STS_Initial                                        = 1,
	STS_Char                                           = 2,
	STS_EOL                                            = 3,
	STS_Repeat                                         = 4
};


/*
# ======================================================================================== #
# > Classes
# ======================================================================================== #
*/

// Class XInterface.GUI
class DLL_IMPORT UGUI : public UObject
{
public:
	class UGUIController*                              Controller;                                       		// 0x002C ( 0x0004 ) [ CPF_NoExport ]
	struct FPlane                                      SaveModulation;                                   		// 0x0030 ( 0x0010 ) [ CPF_NoExport ]
	float                                              SaveX;                                            		// 0x0040 ( 0x0004 ) [ CPF_NoExport ]
	float                                              SaveY;                                            		// 0x0044 ( 0x0004 ) [ CPF_NoExport ]
	class FColor                                       SaveColor;                                        		// 0x0048 ( 0x0004 ) [ CPF_NoExport ]
	class UFont*                                       SaveFont;                                         		// 0x004C ( 0x0004 ) [ CPF_NoExport ]
	unsigned char                                      SaveStyle;                                        		// 0x0050 ( 0x0001 ) [ CPF_NoExport ]

	// UScript Functions
	 class UMaterial*          GetModLogo ( struct FString ModDir );             		// [ FUNC_Native ] XInterface.GUI.GetModLogo
	 struct FString            GetModValue ( struct FString ModDir, struct FString ModKey );		// [ FUNC_Native ] XInterface.GUI.GetModValue
	 void                      GetModList ( class TArray< struct FString >* ModDirs, class TArray< struct FString >* ModTitles );		// [ FUNC_Native ] XInterface.GUI.GetModList
	 void                      Profile ( struct FString ProfileName );           		// [ FUNC_Native ] XInterface.GUI.Profile
	 struct FString            JoinArray ( class TArray< struct FString > StringArray, struct FString Delim, bool bIgnoreBlanks );		// [ FUNC_Final ] XInterface.GUI.JoinArray
	 bool                      IsDigit ( struct FString Test, bool bAllowDecimal );		//  XInterface.GUI.IsDigit

	// Public Imports
	UGUI(class UGUI const &);
	UGUI(void);
	class UGUI &  operator=(class UGUI const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0028

// Class XInterface.GUIComponent
class DLL_IMPORT UGUIComponent : public UGUI
{
public:
	class TArray< struct FTimerData >                  Timers;                                           		// 0x0054 ( 0x000C ) [ CPF_Const | CPF_NeedCtorLink ]
	class UGUIPage*                                    PageOwner;                                        		// 0x0060 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUIComponent*                               MenuOwner;                                        		// 0x0064 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUIComponent*                               FocusInstead;                                     		// 0x0068 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	unsigned char                                      MenuState;                                        		// 0x006C ( 0x0001 ) [ CPF_Edit | CPF_NoExport ]
	unsigned char                                      LastMenuState;                                    		// 0x006D ( 0x0001 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	unsigned char                                      DropState;                                        		// 0x006E ( 0x0001 ) [ CPF_Edit | CPF_NoExport ]
	unsigned char                                      FontScale;                                        		// 0x006F ( 0x0001 ) [ CPF_Edit ]
	class UCanvas*                                     CurrentCanvas;                                    		// 0x0070 ( 0x0004 ) 
	struct FString                                     IniOption;                                        		// 0x0074 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     IniDefault;                                       		// 0x0080 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     StyleName;                                        		// 0x008C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     Hint;                                             		// 0x0098 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	class UGUILabel*                                   FriendlyLabel;                                    		// 0x00A4 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	float                                              WinTop;                                           		// 0x00A8 ( 0x0004 ) [ CPF_Edit ]
	float                                              WinLeft;                                          		// 0x00AC ( 0x0004 ) [ CPF_Edit ]
	float                                              WinWidth;                                         		// 0x00B0 ( 0x0004 ) [ CPF_Edit ]
	float                                              WinHeight;                                        		// 0x00B4 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bUseAWinPos:1;                                    		// 0x00B8 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	struct FFloatBox                                   AWinPos;                                          		// 0x00BC ( 0x0010 ) [ CPF_Edit ]
	struct FFloatBox                                   RWinPos;                                          		// 0x00CC ( 0x0010 ) [ CPF_Edit ]
	struct FFloatBox                                   AWinFrame;                                        		// 0x00DC ( 0x0010 ) [ CPF_Edit ]
	float                                              RenderWeight;                                     		// 0x00EC ( 0x0004 ) [ CPF_Edit ]
	int                                                MouseCursorIndex;                                 		// 0x00F0 ( 0x0004 ) [ CPF_Edit ]
	int                                                TabOrder;                                         		// 0x00F4 ( 0x0004 ) [ CPF_Edit ]
	int                                                Tag;                                              		// 0x00F8 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bDebugging:1;                                     		// 0x00FC ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bTabStop:1;                                       		// 0x00FC ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bFocusOnWatch:1;                                  		// 0x00FC ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bBoundToParent:1;                                 		// 0x00FC ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bScaleToParent:1;                                 		// 0x00FC ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned long                                      bHasFocus:1;                                      		// 0x00FC ( 0x0004 )  [0x00000020][ CPF_Edit | CPF_NoExport ]
	unsigned long                                      bVisible:1;                                       		// 0x00FC ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned long                                      bAcceptsInput:1;                                  		// 0x00FC ( 0x0004 )  [0x00000080][ CPF_Edit ]
	unsigned long                                      bCaptureTabs:1;                                   		// 0x00FC ( 0x0004 )  [0x00000100][ CPF_Edit ]
	unsigned long                                      bCaptureMouse:1;                                  		// 0x00FC ( 0x0004 )  [0x00000200][ CPF_Edit ]
	unsigned long                                      bNeverFocus:1;                                    		// 0x00FC ( 0x0004 )  [0x00000400][ CPF_Edit ]
	unsigned long                                      bRepeatClick:1;                                   		// 0x00FC ( 0x0004 )  [0x00000800][ CPF_Edit ]
	unsigned long                                      bRequireReleaseClick:1;                           		// 0x00FC ( 0x0004 )  [0x00001000][ CPF_Edit ]
	unsigned long                                      bMouseOverSound:1;                                		// 0x00FC ( 0x0004 )  [0x00002000][ CPF_Edit ]
	unsigned long                                      bDropSource:1;                                    		// 0x00FC ( 0x0004 )  [0x00004000][ CPF_Edit ]
	unsigned long                                      bDropTarget:1;                                    		// 0x00FC ( 0x0004 )  [0x00008000][ CPF_Edit ]
	unsigned long                                      bPendingFocus:1;                                  		// 0x00FC ( 0x0004 )  [0x00010000][ CPF_Edit | CPF_NoExport ]
	unsigned long                                      bInit:1;                                          		// 0x00FC ( 0x0004 )  [0x00020000][ CPF_Edit ]
	unsigned long                                      bNeverScale:1;                                    		// 0x00FC ( 0x0004 )  [0x00040000][ CPF_Edit ]
	unsigned long                                      bRequiresStyle:1;                                 		// 0x00FC ( 0x0004 )  [0x00080000][ CPF_Const | CPF_NoExport ]
	unsigned long                                      bPositioned:1;                                    		// 0x00FC ( 0x0004 )  [0x00100000][ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NoExport ]
	unsigned long                                      bAnimating:1;                                     		// 0x00FC ( 0x0004 )  [0x00200000][ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	unsigned long                                      bTravelling:1;                                    		// 0x00FC ( 0x0004 )  [0x00400000][ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NoExport ]
	unsigned long                                      bSizing:1;                                        		// 0x00FC ( 0x0004 )  [0x00800000][ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NoExport ]
	class TArray< struct FVector >                     MotionFrame;                                      		// 0x0100 ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport ]
	class TArray< struct FVector >                     SizeFrame;                                        		// 0x010C ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport ]
	float                                              Bounds[ 0x04 ];                                   		// 0x0118 ( 0x0010 ) [ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NoExport ]
	float                                              ClientBounds[ 0x04 ];                             		// 0x0128 ( 0x0010 ) [ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NoExport ]
	unsigned long                                      bTimerRepeat:1;                                   		// 0x0138 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	int                                                TimerIndex;                                       		// 0x013C ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NoExport ]
	float                                              TimerCountdown;                                   		// 0x0140 ( 0x0004 ) [ CPF_Edit ]
	float                                              TimerInterval;                                    		// 0x0144 ( 0x0004 ) [ CPF_Edit ]
	float                                              MouseOffset[ 0x04 ];                              		// 0x0148 ( 0x0010 ) [ CPF_Const | CPF_NoExport ]
	class UGUIContextMenu*                             ContextMenu;                                      		// 0x0158 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIToolTip*                                 ToolTip;                                          		// 0x015C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline ]
	class FColor                                       WhiteColor;                                       		// 0x0160 ( 0x0004 ) [ CPF_Const | CPF_NoExport ]
	class UGUIStyles*                                  Style;                                            		// 0x0164 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	unsigned char                                      OnClickSound;                                     		// 0x0168 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      BoundingType;                                     		// 0x0169 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      ScalingType;                                      		// 0x016A ( 0x0001 ) [ CPF_Edit ]
	unsigned long                                      bStandardized:1;                                  		// 0x016C ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              StandardHeight;                                   		// 0x0170 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bFlicker:1;                                       		// 0x0174 ( 0x0004 )  [0x00000001]
	int                                                PreDrawCount;                                     		// 0x0178 ( 0x0004 ) [ CPF_Const | CPF_EditConst | CPF_NoExport ]
	int                                                DrawCount;                                        		// 0x017C ( 0x0004 ) [ CPF_Const | CPF_EditConst | CPF_NoExport ]
	int                                                OnRenderCount;                                    		// 0x0180 ( 0x0004 ) [ CPF_EditConst | CPF_NoExport ]
	int                                                OnRenderedCount;                                  		// 0x0184 ( 0x0004 ) [ CPF_EditConst | CPF_NoExport ]
	int                                                OnPreDrawCount;                                   		// 0x0188 ( 0x0004 ) [ CPF_EditConst | CPF_NoExport ]
	int                                                OnDrawCount;                                      		// 0x018C ( 0x0004 ) [ CPF_EditConst | CPF_NoExport ]
	unsigned long                                      bIsDisableHover:1;                                		// 0x0190 ( 0x0004 )  [0x00000001]
	unsigned long                                      bAlwaysFocus:1;                                   		// 0x0190 ( 0x0004 )  [0x00000002]
	struct FScriptDelegate                             __OnArrival__Delegate;                            		// 0x0194 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnEndAnimation__Delegate;                       		// 0x019C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnPreDraw__Delegate;                            		// 0x01A4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDraw__Delegate;                               		// 0x01AC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnRender__Delegate;                             		// 0x01B4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnRendered__Delegate;                           		// 0x01BC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnActivate__Delegate;                           		// 0x01C4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDeActivate__Delegate;                         		// 0x01CC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnWatch__Delegate;                              		// 0x01D4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnHitTest__Delegate;                            		// 0x01DC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnMessage__Delegate;                            		// 0x01E4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnHide__Delegate;                               		// 0x01EC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnShow__Delegate;                               		// 0x01F4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnBeginTooltip__Delegate;                       		// 0x01FC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnEndTooltip__Delegate;                         		// 0x0204 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnInvalidate__Delegate;                         		// 0x020C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnHover__Delegate;                              		// 0x0214 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnClick__Delegate;                              		// 0x021C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDblClick__Delegate;                           		// 0x0224 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnRightClick__Delegate;                         		// 0x022C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnMousePressed__Delegate;                       		// 0x0234 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnMouseRelease__Delegate;                       		// 0x023C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnTimer__Delegate;                              		// 0x0244 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnChange__Delegate;                             		// 0x024C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnKeyType__Delegate;                            		// 0x0254 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnKeyEvent__Delegate;                           		// 0x025C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDesignModeKeyEvent__Delegate;                 		// 0x0264 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnCapturedMouseMove__Delegate;                  		// 0x026C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnLoadINI__Delegate;                            		// 0x0274 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnSaveINI__Delegate;                            		// 0x027C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnMultiSelect__Delegate;                        		// 0x0284 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnBeginDrag__Delegate;                          		// 0x028C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnEndDrag__Delegate;                            		// 0x0294 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDragDrop__Delegate;                           		// 0x029C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDragEnter__Delegate;                          		// 0x02A4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDragLeave__Delegate;                          		// 0x02AC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDragOver__Delegate;                           		// 0x02B4 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 class UCanvas*            GetCurrentCanvas (  );                            		//  XInterface.GUIComponent.GetCurrentCanvas
	 void                      DebugTabOrder (  );                               		//  XInterface.GUIComponent.DebugTabOrder
	 void                      LevelChanged (  );                                		//  XInterface.GUIComponent.LevelChanged
	 void                      SetEnabled ( bool Value );                        		//  XInterface.GUIComponent.SetEnabled
	 void                      DisableMe (  );                                   		//  XInterface.GUIComponent.DisableMe
	 void                      EnableMe (  );                                    		//  XInterface.GUIComponent.EnableMe
	 void                      SetFlicker ( bool Value );                        		//  XInterface.GUIComponent.SetFlicker
	 void                      DisableComponent ( class UGUIComponent* Comp );   		// [ FUNC_Final ] XInterface.GUIComponent.DisableComponent
	 void                      EnableComponent ( class UGUIComponent* Comp );    		// [ FUNC_Final ] XInterface.GUIComponent.EnableComponent
	 void                      KillAnimation (  );                               		//  XInterface.GUIComponent.KillAnimation
	 void                      DAnimate ( float NewLeft, float NewTop, float NewWidth, float NewHeight, float PositionTime, float DimensionTime );		//  XInterface.GUIComponent.DAnimate
	 void                      Resize ( float NewWidth, float NewHeight, float Time );		//  XInterface.GUIComponent.Resize
	 void                      Animate ( float NewLeft, float NewTop, float Time );		//  XInterface.GUIComponent.Animate
	 void                      eventEndAnimation ( class UGUIComponent* Animating, unsigned char Type );		// [ FUNC_Event ] XInterface.GUIComponent.EndAnimation
	 void                      eventBeginAnimation ( class UGUIComponent* Animating );		// [ FUNC_Event ] XInterface.GUIComponent.BeginAnimation
	 class UGUIPage*           eventOwnerPage (  );                              		// [ FUNC_Event ] XInterface.GUIComponent.OwnerPage
	 void                      DebugFocusPosition ( class UGUIComponent* Who, bool Last );		// [ FUNC_Final ] XInterface.GUIComponent.DebugFocusPosition
	 void                      DebugFocus ( class UGUIComponent* Who, bool bLose );		// [ FUNC_Final ] XInterface.GUIComponent.DebugFocus
	 void                      SetTooltip ( class UGUIToolTip* InTooltip );      		//  XInterface.GUIComponent.SetTooltip
	 void                      SetToolTipText ( struct FString NewToolTipText ); 		//  XInterface.GUIComponent.SetToolTipText
	 void                      SetHint ( struct FString NewHint );               		//  XInterface.GUIComponent.SetHint
	 void                      SetFriendlyLabel ( class UGUILabel* NewLabel );   		//  XInterface.GUIComponent.SetFriendlyLabel
	 void                      SetFocusInstead ( class UGUIComponent* InFocusComp );		//  XInterface.GUIComponent.SetFocusInstead
	 void                      eventShow (  );                                   		// [ FUNC_Event ] XInterface.GUIComponent.Show
	 void                      eventHide (  );                                   		// [ FUNC_Event ] XInterface.GUIComponent.Hide
	 void                      CenterMouse (  );                                 		//  XInterface.GUIComponent.CenterMouse
	 void                      eventSetVisibility ( bool bIsVisible );           		// [ FUNC_Event ] XInterface.GUIComponent.SetVisibility
	 void                      FillOwner (  );                                   		//  XInterface.GUIComponent.FillOwner
	 bool                      eventPrevPage (  );                               		// [ FUNC_Event ] XInterface.GUIComponent.PrevPage
	 bool                      eventNextPage (  );                               		// [ FUNC_Event ] XInterface.GUIComponent.NextPage
	 bool                      eventPrevControl ( class UGUIComponent* Sender ); 		// [ FUNC_Event ] XInterface.GUIComponent.PrevControl
	 bool                      eventNextControl ( class UGUIComponent* Sender ); 		// [ FUNC_Event ] XInterface.GUIComponent.NextControl
	 bool                      eventFocusLast ( class UGUIComponent* Sender );   		// [ FUNC_Event ] XInterface.GUIComponent.FocusLast
	 bool                      eventFocusFirst ( class UGUIComponent* Sender );  		// [ FUNC_Event ] XInterface.GUIComponent.FocusFirst
	 void                      eventLoseFocus ( class UGUIComponent* Sender );   		// [ FUNC_Event ] XInterface.GUIComponent.LoseFocus
	 void                      eventSetFocus ( class UGUIComponent* Who );       		// [ FUNC_Event ] XInterface.GUIComponent.SetFocus
	 bool                      eventCanAcceptFocus (  );                         		// [ FUNC_Event ] XInterface.GUIComponent.CanAcceptFocus
	 bool                      IsInClientBounds (  );                            		//  XInterface.GUIComponent.IsInClientBounds
	 bool                      IsInBounds (  );                                  		//  XInterface.GUIComponent.IsInBounds
	 void                      TraversalApplyAWinPos (  );                       		//  XInterface.GUIComponent.TraversalApplyAWinPos
	 void                      ApplyAWinPos (  );                                		//  XInterface.GUIComponent.ApplyAWinPos
	 class UGUIComponent*      GetTopMenuOwner (  );                             		//  XInterface.GUIComponent.GetTopMenuOwner
	 void                      eventInitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		// [ FUNC_Event ] XInterface.GUIComponent.InitComponent
	 void                      eventDropStateChange ( unsigned char NewState );  		// [ FUNC_Event ] XInterface.GUIComponent.DropStateChange
	 bool                      eventIsMultiSelect (  );                          		// [ FUNC_Event ] XInterface.GUIComponent.IsMultiSelect
	 void                      eventMenuStateChange ( unsigned char NewState );  		// [ FUNC_Event ] XInterface.GUIComponent.MenuStateChange
	 struct FString            MakeColorCode ( class FColor NewColor );          		//  XInterface.GUIComponent.MakeColorCode
	 struct FString            StripColorCodes ( struct FString InString );      		//  XInterface.GUIComponent.StripColorCodes
	 void                      SaveINI ( struct FString Value );                 		//  XInterface.GUIComponent.SaveINI
	 struct FString            LoadINI (  );                                     		//  XInterface.GUIComponent.LoadINI
	 void                      eventfree (  );                                   		// [ FUNC_Event ] XInterface.GUIComponent.free
	 void                      eventClosed ( class UGUIComponent* Sender, bool bCancelled );		// [ FUNC_Event ] XInterface.GUIComponent.Closed
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] XInterface.GUIComponent.Opened
	 void                      eventTimer (  );                                  		// [ FUNC_Event ] XInterface.GUIComponent.Timer
	 struct FString            eventAdditionalDebugString (  );                  		// [ FUNC_Event ] XInterface.GUIComponent.AdditionalDebugString
	 bool                      SpecialHit ( bool bForce );                       		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x033D ] XInterface.GUIComponent.SpecialHit
	 struct FString            GetMenuPath (  );                                 		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x033C ] XInterface.GUIComponent.GetMenuPath
	 bool                      IsInIncompleteLetter ( struct FString strUserName );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIComponent.IsInIncompleteLetter
	 int                       IsCorrectUserName_THAILAND ( struct FString strUserName );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIComponent.IsCorrectUserName_THAILAND
	 int                       IsCorrectUserName_China ( struct FString strUserName );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIComponent.IsCorrectUserName_China
	 int                       IsCorrectUserName ( struct FString strUserName ); 		// [ FUNC_Final | FUNC_Native ] XInterface.GUIComponent.IsCorrectUserName
	 void                      SetPosition ( float NewLeft, float NewTop, float NewWidth, float NewHeight, bool bForceRelative );		//  XInterface.GUIComponent.SetPosition
	 void                      eventResolutionChanged ( int ResX, int ResY );    		// [ FUNC_Event ] XInterface.GUIComponent.ResolutionChanged
	 float                     RelativeHeight ( float RealHeight, bool bForce ); 		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x033B ] XInterface.GUIComponent.RelativeHeight
	 float                     RelativeWidth ( float RealWidth, bool bForce );   		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x033A ] XInterface.GUIComponent.RelativeWidth
	 float                     RelativeTop ( float RealTop, bool bForce );       		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0339 ] XInterface.GUIComponent.RelativeTop
	 float                     RelativeLeft ( float RealLeft, bool bForce );     		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0338 ] XInterface.GUIComponent.RelativeLeft
	 float                     ActualTop ( float val, bool bForce );             		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0337 ] XInterface.GUIComponent.ActualTop
	 float                     ActualLeft ( float val, bool bForce );            		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0336 ] XInterface.GUIComponent.ActualLeft
	 float                     ActualHeight ( float val, bool bForce );          		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0335 ] XInterface.GUIComponent.ActualHeight
	 float                     ActualWidth ( float val, bool bForce );           		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0334 ] XInterface.GUIComponent.ActualWidth
	 void                      UpdateBounds (  );                                		// [ FUNC_Final | FUNC_Native ] XInterface.GUIComponent.UpdateBounds
	 void                      UpdateOffset ( float PosX, float PosY, float PosW, float PosH );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0331 ] XInterface.GUIComponent.UpdateOffset
	 void                      AutoPositionOn ( class TArray< class UGUIComponent* > Components, class UGUIComponent* frame, float LeftPadPerc, float UpperPadPerc, float RightPadPerc, float LowerPadPerc, int NumberOfColumns, float ColumnPadding );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0330 ] XInterface.GUIComponent.AutoPositionOn
	 void                      AutoPosition ( class TArray< class UGUIComponent* > Components, float LeftBound, float UpperBound, float RightBound, float LowerBound, float LeftPad, float UpperPad, float RightPad, float LowerPad, int NumberOfColumns, float ColumnPadding );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x032F ] XInterface.GUIComponent.AutoPosition
	 void                      KillTimer ( struct FName TimerFunc );             		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x032E ] XInterface.GUIComponent.KillTimer
	 void                      SetTimer ( float Interval, bool bRepeat, struct FName TimerFunc );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x032D ] XInterface.GUIComponent.SetTimer
	 class APlayerController*  PlayerOwner (  );                                 		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x032C ] XInterface.GUIComponent.PlayerOwner
	 void                      OnDragOver ( class UGUIComponent* Sender );       		//  XInterface.GUIComponent.OnDragOver
	 void                      OnDragLeave ( class UGUIComponent* Sender );      		//  XInterface.GUIComponent.OnDragLeave
	 void                      OnDragEnter ( class UGUIComponent* Sender );      		//  XInterface.GUIComponent.OnDragEnter
	 bool                      OnDragDrop ( class UGUIComponent* Sender );       		//  XInterface.GUIComponent.OnDragDrop
	 void                      OnEndDrag ( class UGUIComponent* Sender, bool bAccepted );		//  XInterface.GUIComponent.OnEndDrag
	 bool                      OnBeginDrag ( class UGUIComponent* Sender );      		//  XInterface.GUIComponent.OnBeginDrag
	 bool                      OnMultiSelect ( class UGUIComponent* Sender );    		//  XInterface.GUIComponent.OnMultiSelect
	 struct FString            OnSaveINI ( class UGUIComponent* Sender );        		//  XInterface.GUIComponent.OnSaveINI
	 void                      OnLoadINI ( class UGUIComponent* Sender, struct FString S );		//  XInterface.GUIComponent.OnLoadINI
	 bool                      OnCapturedMouseMove ( float deltaX, float deltaY );		//  XInterface.GUIComponent.OnCapturedMouseMove
	 bool                      OnDesignModeKeyEvent ( unsigned char key, unsigned char State );		//  XInterface.GUIComponent.OnDesignModeKeyEvent
	 bool                      OnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  XInterface.GUIComponent.OnKeyEvent
	 bool                      OnKeyType ( struct FString Unicode, unsigned char* key );		//  XInterface.GUIComponent.OnKeyType
	 void                      OnChange ( class UGUIComponent* Sender );         		//  XInterface.GUIComponent.OnChange
	 void                      OnTimer ( class UGUIComponent* Sender );          		//  XInterface.GUIComponent.OnTimer
	 void                      OnMouseRelease ( class UGUIComponent* Sender );   		//  XInterface.GUIComponent.OnMouseRelease
	 void                      OnMousePressed ( class UGUIComponent* Sender, bool bRepeat );		//  XInterface.GUIComponent.OnMousePressed
	 bool                      OnRightClick ( class UGUIComponent* Sender );     		//  XInterface.GUIComponent.OnRightClick
	 bool                      OnDblClick ( class UGUIComponent* Sender );       		//  XInterface.GUIComponent.OnDblClick
	 bool                      OnClick ( class UGUIComponent* Sender );          		//  XInterface.GUIComponent.OnClick
	 bool                      OnHover ( class UGUIComponent* Sender );          		//  XInterface.GUIComponent.OnHover
	 void                      OnInvalidate ( class UGUIComponent* Who );        		//  XInterface.GUIComponent.OnInvalidate
	 bool                      OnEndTooltip (  );                                		//  XInterface.GUIComponent.OnEndTooltip
	 class UGUIToolTip*        OnBeginTooltip (  );                              		//  XInterface.GUIComponent.OnBeginTooltip
	 void                      OnShow (  );                                      		//  XInterface.GUIComponent.OnShow
	 void                      OnHide (  );                                      		//  XInterface.GUIComponent.OnHide
	 void                      OnMessage ( struct FString Msg, float MsgLife );  		//  XInterface.GUIComponent.OnMessage
	 void                      OnHitTest ( float MouseX, float MouseY );         		//  XInterface.GUIComponent.OnHitTest
	 void                      OnWatch (  );                                     		//  XInterface.GUIComponent.OnWatch
	 void                      OnDeActivate (  );                                		//  XInterface.GUIComponent.OnDeActivate
	 void                      OnActivate (  );                                  		//  XInterface.GUIComponent.OnActivate
	 void                      OnRendered ( class UCanvas* Canvas );             		//  XInterface.GUIComponent.OnRendered
	 void                      OnRender ( class UCanvas* Canvas );               		//  XInterface.GUIComponent.OnRender
	 bool                      OnDraw ( class UCanvas* Canvas );                 		//  XInterface.GUIComponent.OnDraw
	 bool                      OnPreDraw ( class UCanvas* Canvas );              		//  XInterface.GUIComponent.OnPreDraw
	 void                      OnEndAnimation ( class UGUIComponent* Sender, unsigned char Type );		//  XInterface.GUIComponent.OnEndAnimation
	 void                      OnArrival ( class UGUIComponent* Sender, unsigned char Type );		//  XInterface.GUIComponent.OnArrival

	// Public Imports
	UGUIComponent(class UGUIComponent const &);
	UGUIComponent(void);
	class UGUIComponent &  operator=(class UGUIComponent const &);
	float  ActualHeight(float,int)const ;
	float  ActualLeft(float,int)const ;
	float  ActualTop(float,int)const ;
	float  ActualWidth(float,int)const ;
	unsigned short *  GetMenuPath(unsigned short *)const ;
	static void  InternalConstructor(void *);
	float  RelativeHeight(float,int)const ;
	float  RelativeLeft(float,int)const ;
	float  RelativeTop(float,int)const ;
	float  RelativeWidth(float,int)const ;
	static class UClass *  StaticClass(void);
	int  WithinBounds(float,float)const ;
	void  delegateOnActivate(void);
	void  delegateOnArrival(class UGUIComponent *,unsigned char);
	unsigned long  delegateOnBeginDrag(class UGUIComponent *);
	class UGUIToolTip *  delegateOnBeginTooltip(void);
	unsigned long  delegateOnCapturedMouseMove(float,float);
	void  delegateOnChange(class UGUIComponent *);
	unsigned long  delegateOnClick(class UGUIComponent *);
	unsigned long  delegateOnDblClick(class UGUIComponent *);
	void  delegateOnDeActivate(void);
	unsigned long  delegateOnDesignModeKeyEvent(unsigned char,unsigned char);
	unsigned long  delegateOnDragDrop(class UGUIComponent *);
	void  delegateOnDragEnter(class UGUIComponent *);
	void  delegateOnDragLeave(class UGUIComponent *);
	void  delegateOnDragOver(class UGUIComponent *);
	unsigned long  delegateOnDraw(class UCanvas *);
	void  delegateOnEndAnimation(class UGUIComponent *,unsigned char);
	void  delegateOnEndDrag(class UGUIComponent *,unsigned long);
	unsigned long  delegateOnEndTooltip(void);
	void  delegateOnHide(void);
	void  delegateOnHitTest(float,float);
	unsigned long  delegateOnHover(class UGUIComponent *);
	void  delegateOnInvalidate(class UGUIComponent *);
	unsigned long  delegateOnKeyEvent(unsigned char &,unsigned char &,float);
	unsigned long  delegateOnKeyType(unsigned char &,class FString const &);
	void  delegateOnLoadINI(class UGUIComponent *,class FString const &);
	void  delegateOnMessage(class FString const &,float);
	void  delegateOnMousePressed(class UGUIComponent *,unsigned long);
	void  delegateOnMouseRelease(class UGUIComponent *);
	unsigned long  delegateOnMultiSelect(class UGUIComponent *);
	unsigned long  delegateOnPreDraw(class UCanvas *);
	void  delegateOnRender(class UCanvas *);
	void  delegateOnRendered(class UCanvas *);
	unsigned long  delegateOnRightClick(class UGUIComponent *);
	class FString  delegateOnSaveINI(class UGUIComponent *);
	void  delegateOnShow(void);
	void  delegateOnTimer(class UGUIComponent *);
	void  delegateOnWatch(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0268

// Class XInterface.GUIMultiComponent
class DLL_IMPORT UGUIMultiComponent : public UGUIComponent
{
public:
	class TArray< class UGUIComponent* >               Controls;                                         		// 0x02BC ( 0x000C ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIComponent*                               FocusedControl;                                   		// 0x02C8 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class TArray< class UGUIComponent* >               Components;                                       		// 0x02CC ( 0x000C ) [ CPF_Edit | CPF_ConstRef | CPF_NeedCtorLink | CPF_NoExport ]
	int                                                AnimationCount;                                   		// 0x02D8 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	unsigned long                                      PropagateVisibility:1;                            		// 0x02DC ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bOldStyleMenus:1;                                 		// 0x02DC ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bDrawFocusedLast:1;                               		// 0x02DC ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bAlwaysAutomate:1;                                		// 0x02DC ( 0x0004 )  [0x00000008][ CPF_Edit ]
	struct FScriptDelegate                             __HandleContextMenuOpen__Delegate;                		// 0x02E0 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __HandleContextMenuClose__Delegate;               		// 0x02E8 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __NotifyContextSelect__Delegate;                  		// 0x02F0 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnCreateComponent__Delegate;                    		// 0x02F8 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      RecursiveActiveOwner ( class UGUIComponent* checkComponent );		//  XInterface.GUIMultiComponent.RecursiveActiveOwner
	 void                      TraversalApplyAWinPos (  );                       		//  XInterface.GUIMultiComponent.TraversalApplyAWinPos
	 class UGUIComponent*      NewComponent ( class UGUIComponent* newcompo, struct FFloatBox fbNewCompo, float RenderWeight, class UGUIMultiComponent* ParentComponent );		//  XInterface.GUIMultiComponent.NewComponent
	 void                      CheckDuplicateTabOrder (  );                      		//  XInterface.GUIMultiComponent.CheckDuplicateTabOrder
	 void                      CheckInvalidTabOrder (  );                        		//  XInterface.GUIMultiComponent.CheckInvalidTabOrder
	 void                      DebugTabOrder (  );                               		//  XInterface.GUIMultiComponent.DebugTabOrder
	 void                      CenterMouse (  );                                 		//  XInterface.GUIMultiComponent.CenterMouse
	 void                      LevelChanged (  );                                		//  XInterface.GUIMultiComponent.LevelChanged
	 void                      eventEndAnimation ( class UGUIComponent* Animating, unsigned char Type );		// [ FUNC_Event ] XInterface.GUIMultiComponent.EndAnimation
	 void                      eventBeginAnimation ( class UGUIComponent* Animating );		// [ FUNC_Event ] XInterface.GUIMultiComponent.BeginAnimation
	 void                      eventfree (  );                                   		// [ FUNC_Event ] XInterface.GUIMultiComponent.free
	 void                      eventClosed ( class UGUIComponent* Sender, bool bCancelled );		// [ FUNC_Event ] XInterface.GUIMultiComponent.Closed
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] XInterface.GUIMultiComponent.Opened
	 void                      eventSetVisibility ( bool bIsVisible );           		// [ FUNC_Event ] XInterface.GUIMultiComponent.SetVisibility
	 void                      DisableMe (  );                                   		//  XInterface.GUIMultiComponent.DisableMe
	 void                      EnableMe (  );                                    		//  XInterface.GUIMultiComponent.EnableMe
	 bool                      eventPrevControl ( class UGUIComponent* Sender ); 		// [ FUNC_Event ] XInterface.GUIMultiComponent.PrevControl
	 bool                      eventNextControl ( class UGUIComponent* Sender ); 		// [ FUNC_Event ] XInterface.GUIMultiComponent.NextControl
	 bool                      eventFocusLast ( class UGUIComponent* Sender );   		// [ FUNC_Event ] XInterface.GUIMultiComponent.FocusLast
	 bool                      eventFocusFirst ( class UGUIComponent* Sender );  		// [ FUNC_Event ] XInterface.GUIMultiComponent.FocusFirst
	 bool                      CanAcceptFocus (  );                              		//  XInterface.GUIMultiComponent.CanAcceptFocus
	 void                      eventLoseFocus ( class UGUIComponent* Sender );   		// [ FUNC_Event ] XInterface.GUIMultiComponent.LoseFocus
	 void                      eventSetFocus ( class UGUIComponent* Who );       		// [ FUNC_Event ] XInterface.GUIMultiComponent.SetFocus
	 void                      SetFocusInstead ( class UGUIComponent* InFocusComp );		//  XInterface.GUIMultiComponent.SetFocusInstead
	 bool                      eventRemoveComponent ( class UGUIComponent* Comp, bool SkipRemap );		// [ FUNC_Event ] XInterface.GUIMultiComponent.RemoveComponent
	 class UGUIComponent*      eventAppendComponent ( class UGUIComponent* NewComp, bool SkipRemap );		// [ FUNC_Event ] XInterface.GUIMultiComponent.AppendComponent
	 class UGUIComponent*      eventInsertComponent ( class UGUIComponent* NewComp, int Index, bool SkipRemap );		// [ FUNC_Event ] XInterface.GUIMultiComponent.InsertComponent
	 class UGUIComponent*      eventAddComponent ( struct FString ComponentClass, bool SkipRemap );		// [ FUNC_Event ] XInterface.GUIMultiComponent.AddComponent
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIMultiComponent.InitComponent
	 void                      InternalOnShow (  );                              		//  XInterface.GUIMultiComponent.InternalOnShow
	 int                       FindComponentIndex ( class UGUIComponent* Who );  		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiComponent.FindComponentIndex
	 void                      RemapComponents (  );                             		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiComponent.RemapComponents
	 void                      InitializeControls (  );                          		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiComponent.InitializeControls
	 void                      OnCreateComponent ( class UGUIComponent* NewComponent, class UGUIComponent* Sender );		//  XInterface.GUIMultiComponent.OnCreateComponent
	 bool                      NotifyContextSelect ( class UGUIContextMenu* Sender, int ClickIndex );		//  XInterface.GUIMultiComponent.NotifyContextSelect
	 bool                      HandleContextMenuClose ( class UGUIContextMenu* Sender );		//  XInterface.GUIMultiComponent.HandleContextMenuClose
	 bool                      HandleContextMenuOpen ( class UGUIComponent* Sender, class UGUIContextMenu* Menu, class UGUIComponent* ContextMenuOwner );		//  XInterface.GUIMultiComponent.HandleContextMenuOpen

	// Public Imports
	UGUIMultiComponent(class UGUIMultiComponent const &);
	UGUIMultiComponent(void);
	class UGUIMultiComponent &  operator=(class UGUIMultiComponent const &);
	void  DrawControls(class UCanvas *);
	static void  InternalConstructor(void *);
	void  PreDrawControls(class UCanvas *);
	static class UClass *  StaticClass(void);
	unsigned long  delegateHandleContextMenuClose(class UGUIContextMenu *);
	unsigned long  delegateHandleContextMenuOpen(class UGUIComponent *,class UGUIContextMenu *,class UGUIComponent *);
	unsigned long  delegateNotifyContextSelect(class UGUIContextMenu *,int);
	void  delegateOnCreateComponent(class UGUIComponent *,class UGUIComponent *);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0044

// Class XInterface.GUIPage
class DLL_IMPORT UGUIPage : public UGUIMultiComponent
{
public:
	unsigned long                                      bRenderWorld:1;                                   		// 0x0300 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bPauseIfPossible:1;                               		// 0x0300 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bCheckResolution:1;                               		// 0x0300 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bCaptureInput:1;                                  		// 0x0300 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bRequire640x480:1;                                		// 0x0300 ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned long                                      bPersistent:1;                                    		// 0x0300 ( 0x0004 )  [0x00000020][ CPF_Edit ]
	unsigned long                                      bDisconnectOnOpen:1;                              		// 0x0300 ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned long                                      bAllowedAsLast:1;                                 		// 0x0300 ( 0x0004 )  [0x00000080][ CPF_Edit ]
	unsigned long                                      bRestorable:1;                                    		// 0x0300 ( 0x0004 )  [0x00000100][ CPF_Edit ]
	class UGUIPage*                                    ParentPage;                                       		// 0x0304 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UMaterial*                                   Background;                                       		// 0x0308 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       BackgroundColor;                                  		// 0x030C ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       InactiveFadeColor;                                		// 0x0310 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       ActiveFadeColor;                                  		// 0x0314 ( 0x0004 ) [ CPF_Edit ]
	class USound*                                      OpenSound;                                        		// 0x0318 ( 0x0004 ) [ CPF_Edit ]
	class USound*                                      CloseSound;                                       		// 0x031C ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      BackgroundRStyle;                                 		// 0x0320 ( 0x0001 ) [ CPF_Edit ]
	struct FScriptDelegate                             __OnOpen__Delegate;                               		// 0x0324 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnReOpen__Delegate;                             		// 0x032C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnClose__Delegate;                              		// 0x0334 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnCanClose__Delegate;                           		// 0x033C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __FadedIn__Delegate;                              		// 0x0344 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __FadedOut__Delegate;                             		// 0x034C ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      FadedOut (  );                                    		//  XInterface.GUIPage.FadedOut
	 void                      FadedIn (  );                                     		//  XInterface.GUIPage.FadedIn
	 void                      FadeOut ( bool bTranslate, bool bChangeAlpha );   		//  XInterface.GUIPage.FadeOut
	 void                      FadeIn ( bool bTranslate, bool bChangeAlpha );    		//  XInterface.GUIPage.FadeIn
	 bool                      AllowOpen ( struct FString MenuClass );           		//  XInterface.GUIPage.AllowOpen
	 bool                      IsOpen (  );                                      		// [ FUNC_Final ] XInterface.GUIPage.IsOpen
	 void                      eventfree (  );                                   		// [ FUNC_Event ] XInterface.GUIPage.free
	 bool                      NotifyLevelChange (  );                           		//  XInterface.GUIPage.NotifyLevelChange
	 void                      SetDataString ( struct FString str );             		//  XInterface.GUIPage.SetDataString
	 struct FString            GetDataString (  );                               		//  XInterface.GUIPage.GetDataString
	 void                      HandleObject ( class UObject* obj, class UObject* OptionalObj_1, class UObject* OptionalObj_2 );		//  XInterface.GUIPage.HandleObject
	 bool                      GetRestoreParams ( struct FString* Param1, struct FString* Param2 );		//  XInterface.GUIPage.GetRestoreParams
	 void                      eventHandleParameters ( struct FString Param1, struct FString Param2 );		// [ FUNC_Event ] XInterface.GUIPage.HandleParameters
	 void                      eventSetFocus ( class UGUIComponent* Who );       		// [ FUNC_Event ] XInterface.GUIPage.SetFocus
	 void                      eventChangeHint ( struct FString NewHint );       		// [ FUNC_Event ] XInterface.GUIPage.ChangeHint
	 void                      CheckResolution ( bool Closing, class UGUIController* InController );		//  XInterface.GUIPage.CheckResolution
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIPage.InitComponent
	 void                      PlayCloseSound (  );                              		//  XInterface.GUIPage.PlayCloseSound
	 void                      PlayOpenSound (  );                               		//  XInterface.GUIPage.PlayOpenSound
	 void                      eventClosed ( class UGUIComponent* Sender, bool bCancelled );		// [ FUNC_Event ] XInterface.GUIPage.Closed
	 bool                      OnCanClose ( bool bCancelled );                   		//  XInterface.GUIPage.OnCanClose
	 void                      OnClose ( bool bCancelled );                      		//  XInterface.GUIPage.OnClose
	 void                      OnReOpen (  );                                    		//  XInterface.GUIPage.OnReOpen
	 void                      OnOpen (  );                                      		//  XInterface.GUIPage.OnOpen

	// Public Imports
	UGUIPage(class UGUIPage const &);
	UGUIPage(void);
	class UGUIPage &  operator=(class UGUIPage const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  UpdateTimers(float);
	void  delegateFadedIn(void);
	void  delegateFadedOut(void);
	unsigned long  delegateOnCanClose(unsigned long);
	void  delegateOnClose(unsigned long);
	void  delegateOnOpen(void);
	void  delegateOnReOpen(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0054

// Class XInterface.GUIQuestionPage
class DLL_IMPORT UGUIQuestionPage : public UGUIPage
{
public:
	class UGUILabel*                                   lMessage;                                         		// 0x0354 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UMaterial*                                   MessageIcon;                                      		// 0x0358 ( 0x0004 ) 
	class TArray< struct FString >                     ButtonNames;                                      		// 0x035C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class TArray< class UGUIButton* >                  Buttons;                                          		// 0x0368 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UGUIButton*                                  DefaultButton;                                    		// 0x0374 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIButton*                                  CancelButton;                                     		// 0x0378 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FScriptDelegate                             __OnButtonClick__Delegate;                        		// 0x037C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __NewOnButtonClick__Delegate;                     		// 0x0384 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      RemoveButtons (  );                               		//  XInterface.GUIQuestionPage.RemoveButtons
	 struct FString            Replace ( struct FString Src, struct FString Tag, struct FString Value );		//  XInterface.GUIQuestionPage.Replace
	 bool                      ButtonClick ( class UGUIComponent* Sender );      		//  XInterface.GUIQuestionPage.ButtonClick
	 void                      LayoutButtons ( unsigned char ActiveButton );     		//  XInterface.GUIQuestionPage.LayoutButtons
	 class UGUIButton*         AddButton ( unsigned char idesc );                		//  XInterface.GUIQuestionPage.AddButton
	 void                      SetupQuestion ( struct FString Question, unsigned char bButtons, unsigned char ActiveButton, bool bClearFirst );		//  XInterface.GUIQuestionPage.SetupQuestion
	 bool                      InternalOnPreDraw ( class UCanvas* C );           		//  XInterface.GUIQuestionPage.InternalOnPreDraw
	 void                      InitComponent ( class UGUIController* pMyController, class UGUIComponent* myOwner );		//  XInterface.GUIQuestionPage.InitComponent
	 bool                      NewOnButtonClick ( unsigned char bButton );       		//  XInterface.GUIQuestionPage.NewOnButtonClick
	 void                      OnButtonClick ( unsigned char bButton );          		//  XInterface.GUIQuestionPage.OnButtonClick
}; // Size: 0x0038

// Class XInterface.HudBase
class DLL_IMPORT AHudBase : public AHUD
{
public:
	int                                                SpecPlayerLevel;                                  		// 0x06B4 ( 0x0004 ) 
	int                                                SpecPlayerLevelMarkID;                            		// 0x06B8 ( 0x0004 ) 
	struct FString                                     strSpectating;                                    		// 0x06BC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     strSpectateHelp;                                  		// 0x06C8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FFloatBox                                   fbSpectateLevel;                                  		// 0x06D4 ( 0x0010 ) 
	struct FFloatBox                                   fbSpectateUser;                                   		// 0x06E4 ( 0x0010 ) 
	struct FFloatBox                                   fbSpectateHelp;                                   		// 0x06F4 ( 0x0010 ) 
	struct FFloatBox                                   fbSpectatingBack;                                 		// 0x0704 ( 0x0010 ) 
	float                                              NametagFactorZ;                                   		// 0x0714 ( 0x0004 ) [ CPF_Edit ]
	float                                              NametagExtraZ;                                    		// 0x0718 ( 0x0004 ) [ CPF_Edit ]
	int                                                NametagFontSize;                                  		// 0x071C ( 0x0004 ) [ CPF_Edit ]
	float                                              NametagRadius;                                    		// 0x0720 ( 0x0004 ) [ CPF_Edit ]
	int                                                NametagShadowX;                                   		// 0x0724 ( 0x0004 ) [ CPF_Edit ]
	int                                                NametagShadowY;                                   		// 0x0728 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       NametagShadowColor;                               		// 0x072C ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     NameTagInvulnerablePost;                          		// 0x0730 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	float                                              NameTagVisUpdateTime;                             		// 0x073C ( 0x0004 ) 
	struct FSpriteWidget                               IconDefendBombHolder;                             		// 0x0740 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               IconInvulnerable;                                 		// 0x0780 ( 0x0040 ) [ CPF_Edit ]
	int                                                TeamIndex;                                        		// 0x07C0 ( 0x0004 ) [ CPF_Edit | CPF_Transient ]
	unsigned char                                      PassStyle;                                        		// 0x07C4 ( 0x0001 ) [ CPF_Edit | CPF_Transient ]
	class TArray< class AHudBase* >                    ChildHudParts;                                    		// 0x07C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FHudLocalizedMessage                        LocalMessages[ 0x08 ];                            		// 0x07D4 ( 0x0260 ) [ CPF_Edit | CPF_Transient | CPF_NeedCtorLink ]
	class UClass*                                      VoteMenuClass;                                    		// 0x0A34 ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   TargetMaterial;                                   		// 0x0A38 ( 0x0004 ) 
	unsigned long                                      bShowTargeting:1;                                 		// 0x0A3C ( 0x0004 )  [0x00000001][ CPF_Transient ]
	struct FVector                                     TargetingLocation;                                		// 0x0A40 ( 0x000C ) [ CPF_Transient ]
	float                                              TargetingSize;                                    		// 0x0A4C ( 0x0004 ) [ CPF_Transient ]
	struct FString                                     InstructionText;                                  		// 0x0A50 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     InstructionKeyText;                               		// 0x0A5C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	float                                              InstructTextBorderX;                              		// 0x0A68 ( 0x0004 ) [ CPF_Edit ]
	float                                              InstructTextBorderY;                              		// 0x0A6C ( 0x0004 ) [ CPF_Edit ]
	float                                              InstrDelta;                                       		// 0x0A70 ( 0x0004 ) [ CPF_Edit ]
	float                                              InstrRate;                                        		// 0x0A74 ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     InstructionFontName;                              		// 0x0A78 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class UFont*                                       InstructionFontFont;                              		// 0x0A84 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bUsingCustomHUDColor:1;                           		// 0x0A88 ( 0x0004 )  [0x00000001]
	unsigned long                                      DoCropping:1;                                     		// 0x0A88 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bIsCinematic:1;                                   		// 0x0A88 ( 0x0004 )  [0x00000004]
	unsigned char                                      FontsPrecached;                                   		// 0x0A8C ( 0x0001 ) 
	unsigned long                                      bHideWeaponName:1;                                		// 0x0A90 ( 0x0004 )  [0x00000001]
	float                                              CroppingAmount;                                   		// 0x0A94 ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   CroppingMaterial;                                 		// 0x0A98 ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     LastWeaponName;                                   		// 0x0A9C ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              WeaponDrawTimer;                                  		// 0x0AA8 ( 0x0004 ) 
	class FColor                                       WeaponDrawColor;                                  		// 0x0AAC ( 0x0004 ) 
	struct FString                                     Text;                                             		// 0x0AB0 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     LevelActionLoading;                               		// 0x0ABC ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     LevelActionPaused;                                		// 0x0AC8 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     LevelActionFontName;                              		// 0x0AD4 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     WonMatchPrefix;                                   		// 0x0AE0 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     WonMatchPostFix;                                  		// 0x0AEC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     WaitingToSpawn;                                   		// 0x0AF8 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     AtMenus;                                          		// 0x0B04 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     YouveWonTheMatch;                                 		// 0x0B10 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     YouveLostTheMatch;                                		// 0x0B1C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     NowViewing;                                       		// 0x0B28 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     ScoreText;                                        		// 0x0B34 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     InitialViewingString;                             		// 0x0B40 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class UMaterial*                                   LocationDot;                                      		// 0x0B4C ( 0x0004 ) 
	class UMaterial*                                   DefaultCrosshair;                                 		// 0x0B50 ( 0x0004 ) 
	class UMaterial*                                   TargetCrosshair;                                  		// 0x0B54 ( 0x0004 ) 
	class FColor                                       DamageFlash[ 0x04 ];                              		// 0x0B58 ( 0x0010 ) 
	float                                              DamageTime[ 0x04 ];                               		// 0x0B68 ( 0x0010 ) 
	unsigned char                                      Emphasized[ 0x04 ];                               		// 0x0B78 ( 0x0004 ) [ CPF_Edit ]
	int                                                DamageGot;                                        		// 0x0B7C ( 0x0004 ) 
	float                                              fPainSoundLastPlayed;                             		// 0x0B80 ( 0x0004 ) 
	float                                              fStartTime;                                       		// 0x0B84 ( 0x0004 ) 
	struct FSpriteWidget                               WAttackedBG;                                      		// 0x0B88 ( 0x0040 ) 
	unsigned long                                      bAttacked:1;                                      		// 0x0BC8 ( 0x0004 )  [0x00000001]
	class TArray< struct FSpriteWidget >               Crosshairs;                                       		// 0x0BCC ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class FColor                                       CustomHUDColor;                                   		// 0x0BD8 ( 0x0004 ) 
	unsigned long                                      bUseCustomWeaponCrosshairs:1;                     		// 0x0BDC ( 0x0004 )  [0x00000001]
	float                                              ScreenRatioX;                                     		// 0x0BE0 ( 0x0004 ) 
	float                                              ScreenRatioY;                                     		// 0x0BE4 ( 0x0004 ) 
	float                                              ScreenRatioXEx;                                   		// 0x0BE8 ( 0x0004 ) 
	float                                              ScreenRatioYEx;                                   		// 0x0BEC ( 0x0004 ) 
	float                                              _rX;                                              		// 0x0BF0 ( 0x0004 ) 
	float                                              _rY;                                              		// 0x0BF4 ( 0x0004 ) 
	float                                              _reX;                                             		// 0x0BF8 ( 0x0004 ) 
	float                                              _reY;                                             		// 0x0BFC ( 0x0004 ) 
	unsigned long                                      IsDrawModeMessage:1;                              		// 0x0C00 ( 0x0004 )  [0x00000001]
	unsigned long                                      IsDrawSystemMessage:1;                            		// 0x0C00 ( 0x0004 )  [0x00000002]
	class TArray< struct FString >                     BaseTeamName;                                     		// 0x0C04 ( 0x000C ) [ CPF_NeedCtorLink ]
	class FColor                                       BaseTeamColorAlly;                                		// 0x0C10 ( 0x0004 ) [ CPF_Edit ]
	class TArray< class FColor >                       BaseTeamColor;                                    		// 0x0C14 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class FColor                                       FriendlyColor;                                    		// 0x0C20 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       MyselfColor;                                      		// 0x0C24 ( 0x0004 ) [ CPF_Edit ]
	int                                                TimeMinutes;                                      		// 0x0C28 ( 0x0004 ) 
	int                                                TimeSeconds;                                      		// 0x0C2C ( 0x0004 ) 
	unsigned long                                      AlreadyGotMessage17_PlayerCantStart:1;            		// 0x0C30 ( 0x0004 )  [0x00000001]
	struct FString                                     KillerName;                                       		// 0x0C34 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              KillerMarkTimeToRemove;                           		// 0x0C40 ( 0x0004 ) 
	struct FSpriteWidget                               KillerSprite;                                     		// 0x0C44 ( 0x0040 ) [ CPF_Edit ]

	// UScript Functions
	 int                       GetCurGameTime (  );                              		//  XInterface.HudBase.GetCurGameTime
	 void                      execclearkilllog (  );                            		// [ FUNC_Exec ] XInterface.HudBase.clearkilllog
	 void                      execuserzone ( struct FString szPath, struct FString szCommand );		// [ FUNC_Exec ] XInterface.HudBase.userzone
	 void                      execusermove ( struct FString szPath, struct FString szCommand, int nCombatNum );		// [ FUNC_Exec ] XInterface.HudBase.usermove
	 void                      execkilllog ( struct FString szPath, struct FString szCommand );		// [ FUNC_Exec ] XInterface.HudBase.killlog
	 void                      eventWorldSpaceOverlays (  );                     		// [ FUNC_Simulated | FUNC_Event ] XInterface.HudBase.WorldSpaceOverlays
	 void                      PlayHUDSound ( class APlayerController* PC, unsigned char soundType );		//  XInterface.HudBase.PlayHUDSound
	 struct FVector            CalcNametagPos ( class APawn* curPawn );          		//  XInterface.HudBase.CalcNametagPos
	 struct FVector            CalcNametagPosNative ( class APawn* curPawn );    		// [ FUNC_Native ] XInterface.HudBase.CalcNametagPosNative
	 class FColor              GetNametagColor ( class APlayerReplicationInfo* Info );		//  XInterface.HudBase.GetNametagColor
	 void                      RefreshKillerName ( struct FString mKillerName ); 		//  XInterface.HudBase.RefreshKillerName
	 void                      DrawNameTag ( class UCanvas* C, class AwPawn* curPawn );		//  XInterface.HudBase.DrawNameTag
	 void                      DrawMissionIcon ( class UCanvas* C, class AwPawn* curPawn );		//  XInterface.HudBase.DrawMissionIcon
	 void                      DrawNametagsScript ( class UCanvas* C, bool bSpectateMode, bool drawAlways );		//  XInterface.HudBase.DrawNametagsScript
	 void                      DrawNametags ( class UCanvas* C, bool bSpectateMode, bool drawAlways );		//  XInterface.HudBase.DrawNametags
	 void                      DrawNametagsNative ( class UCanvas* C, bool bSpectateMode, bool drawAlways );		// [ FUNC_Native ] XInterface.HudBase.DrawNametagsNative
	 void                      DrawHudSpectating ( class UCanvas* C );           		//  XInterface.HudBase.DrawHudSpectating
	 void                      DrawGMHudSpectating ( class UCanvas* C );         		//  XInterface.HudBase.DrawGMHudSpectating
	 class APlayerReplicationInfo* FindPRI ( class APawn* P );                       		//  XInterface.HudBase.FindPRI
	 class FColor              GetBaseTeamColor ( int viewerTeamIndex, int targetTeamIndex );		//  XInterface.HudBase.GetBaseTeamColor
	 struct FString            GetBaseTeamName ( int TeamIndex );                		//  XInterface.HudBase.GetBaseTeamName
	 void                      DrawWarfareCrosshairExtNative ( class UCanvas* C, int Spread );		// [ FUNC_Native ] XInterface.HudBase.DrawWarfareCrosshairExtNative
	 void                      CalculateCoordinateDigitEx ( class UCanvas* C, struct FDigitSet W, struct FNumericWidget N, float fWidth, float fHeight, int Index, struct FCalCoordsW* coordsW );		// [ FUNC_Native ] XInterface.HudBase.CalculateCoordinateDigitEx
	 void                      CalculateCoordinateDigit ( class UCanvas* C, struct FDigitSet W, struct FNumericWidget N, float fWidth, float fHeight, int Index, struct FCalCoordsW* coordsW );		// [ FUNC_Native ] XInterface.HudBase.CalculateCoordinateDigit
	 void                      CalculateCoordinateEx ( class UCanvas* C, struct FSpriteWidget W, float fWidth, float fHeight, struct FCalCoordsW* coordsW );		// [ FUNC_Native ] XInterface.HudBase.CalculateCoordinateEx
	 void                      CalculateCoordinate ( class UCanvas* C, struct FSpriteWidget W, float fWidth, float fHeight, struct FCalCoordsW* coordsW );		// [ FUNC_Native ] XInterface.HudBase.CalculateCoordinate
	 void                      DrawTileFromSpriteWidget2 ( class UCanvas* C, struct FSpriteWidget SW, float W, float H );		// [ FUNC_Native ] XInterface.HudBase.DrawTileFromSpriteWidget2
	 void                      DrawTileFromSpriteWidget ( class UCanvas* C, struct FSpriteWidget SW );		// [ FUNC_Native ] XInterface.HudBase.DrawTileFromSpriteWidget
	 void                      ClipScreenCoords ( class UCanvas* C, float XL, float YL, float* X, float* Y );		//  XInterface.HudBase.ClipScreenCoords
	 bool                      IsTargetInFrontOfPlayer2 ( class UCanvas* C, struct FVector TargetPos, struct FVector camLoc, struct FRotator camRot, struct FVector* ScreenPos );		//  XInterface.HudBase.IsTargetInFrontOfPlayer2
	 bool                      IsTargetInFrontOfPlayer ( class UCanvas* C, class AActor* Target, struct FVector camLoc, struct FRotator camRot, struct FVector* ScreenPos );		//  XInterface.HudBase.IsTargetInFrontOfPlayer
	 void                      DrawIntroSubtitles ( class UCanvas* C );          		// [ FUNC_Simulated ] XInterface.HudBase.DrawIntroSubtitles
	 void                      DrawCinematicHUD ( class UCanvas* C );            		// [ FUNC_Simulated ] XInterface.HudBase.DrawCinematicHUD
	 void                      DrawVehicleName ( class UCanvas* C );             		//  XInterface.HudBase.DrawVehicleName
	 void                      DrawWeaponName ( class UCanvas* C );              		// [ FUNC_Simulated ] XInterface.HudBase.DrawWeaponName
	 class UFont*              LoadInstructionFont (  );                         		// [ FUNC_Simulated ] XInterface.HudBase.LoadInstructionFont
	 void                      SetInstructionKeyText ( struct FString Text );    		// [ FUNC_Simulated ] XInterface.HudBase.SetInstructionKeyText
	 void                      SetInstructionText ( struct FString Text );       		// [ FUNC_Simulated ] XInterface.HudBase.SetInstructionText
	 void                      DrawInstructionKeyText ( class UCanvas* C );      		// [ FUNC_Simulated ] XInterface.HudBase.DrawInstructionKeyText
	 void                      DrawInstructionText ( class UCanvas* C );         		// [ FUNC_Simulated ] XInterface.HudBase.DrawInstructionText
	 void                      DrawInstructionGfx ( class UCanvas* C );          		// [ FUNC_Simulated ] XInterface.HudBase.DrawInstructionGfx
	 void                      SetCropping ( bool Active );                      		// [ FUNC_Simulated ] XInterface.HudBase.SetCropping
	 void                      DrawTargeting ( class UCanvas* C );               		// [ FUNC_Simulated ] XInterface.HudBase.DrawTargeting
	 void                      SetTargeting ( bool bShow, struct FVector TargetLocation, float Size );		// [ FUNC_Simulated ] XInterface.HudBase.SetTargeting
	 void                      Draw2DLocationDot ( class UCanvas* C, struct FVector loc, float OffsetX, float OffsetY, float ScaleX, float ScaleY );		//  XInterface.HudBase.Draw2DLocationDot
	 void                      CreateKeyMenus (  );                              		// [ FUNC_Simulated ] XInterface.HudBase.CreateKeyMenus
	 void                      DisplayLocalMessages ( class UCanvas* C );        		// [ FUNC_Simulated ] XInterface.HudBase.DisplayLocalMessages
	 void                      DrawMessageWithTexture ( class UCanvas* C, int i, float PosX, float PosY, float* dx, float* dy );		// [ FUNC_Simulated ] XInterface.HudBase.DrawMessageWithTexture
	 void                      DrawMessage ( class UCanvas* C, int i, float PosX, float PosY, float* dx, float* dy );		// [ FUNC_Simulated ] XInterface.HudBase.DrawMessage
	 void                      GetScreenCoords ( float PosX, float PosY, class UCanvas* C, float* ScreenX, float* ScreenY, struct FHudLocalizedMessage* Message );		// [ FUNC_Simulated ] XInterface.HudBase.GetScreenCoords
	 void                      LayoutMessage ( class UCanvas* C, struct FHudLocalizedMessage* Message );		// [ FUNC_Simulated ] XInterface.HudBase.LayoutMessage
	 void                      GetLocalStatsScreen (  );                         		//  XInterface.HudBase.GetLocalStatsScreen
	 class FColor              GetTeamColor ( unsigned char TeamNum );           		//  XInterface.HudBase.GetTeamColor
	 void                      LocalizedMessage2 ( class UClass* Message, int Switch, struct FString CriticalString );		// [ FUNC_Simulated ] XInterface.HudBase.LocalizedMessage2
	 void                      LocalizedMessage ( class UClass* Message, int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject, struct FString CriticalString );		// [ FUNC_Simulated ] XInterface.HudBase.LocalizedMessage
	 void                      Message ( class APlayerReplicationInfo* PRI, struct FString Msg, struct FName MsgType );		// [ FUNC_Simulated ] XInterface.HudBase.Message
	 void                      ClearMessage ( struct FHudLocalizedMessage* M );  		// [ FUNC_Simulated ] XInterface.HudBase.ClearMessage
	 void                      AddChildHudPart ( class AHudBase* Child );        		// [ FUNC_Simulated ] XInterface.HudBase.AddChildHudPart
	 void                      DrawDigitSet ( class UCanvas* C, float X, float Y, float OffsetX, float XL, float YL, int Value, struct FDigitSet dSet, int totalDigits, struct FString paddingChar );		// [ FUNC_Simulated ] XInterface.HudBase.DrawDigitSet
	 void                      DrawCSReviw ( class UCanvas* C );                 		// [ FUNC_Simulated ] XInterface.HudBase.DrawCSReviw
//	 void                      DrawNumericWidget ( class UCanvas* C, struct FNumericWidget* W, struct FDigitSet* D );		// [ FUNC_Simulated | FUNC_Native ] XInterface.HudBase.DrawNumericWidget
//	 void                      DrawSpriteWidget ( class UCanvas* C, struct FSpriteWidget* W );		// [ FUNC_Simulated | FUNC_Native ] XInterface.HudBase.DrawSpriteWidget
	 void                      DrawHUD ( class UCanvas* C );                     		// [ FUNC_Simulated ] XInterface.HudBase.DrawHUD
	 void                      UpdateScreenRatios ( class UCanvas* C );          		//  XInterface.HudBase.UpdateScreenRatios
	 void                      DrawAttacked ( class UCanvas* C );                		//  XInterface.HudBase.DrawAttacked
	 void                      DrawHeadShotSphere (  );                          		// [ FUNC_Simulated ] XInterface.HudBase.DrawHeadShotSphere
	 void                      Tick ( float DeltaTime );                         		// [ FUNC_Simulated ] XInterface.HudBase.Tick
	 void                      PlayPainSound ( class UCanvas* C );               		//  XInterface.HudBase.PlayPainSound
	 void                      DrawDamageIndicators ( class UCanvas* C );        		//  XInterface.HudBase.DrawDamageIndicators
	 void                      DisplayHit ( struct FVector HitDir, int Damage, class UClass* DamageType );		//  XInterface.HudBase.DisplayHit
	 void                      DrawMiniMap ( class AwHudPart_MinimapBase* Minimap, class UCanvas* C );		//  XInterface.HudBase.DrawMiniMap
	 void                      SetCustomHUDColor (  );                           		//  XInterface.HudBase.SetCustomHUDColor
	 bool                      CustomHUDColorAllowed (  );                       		//  XInterface.HudBase.CustomHUDColorAllowed
	 void                      PostBeginPlay (  );                               		//  XInterface.HudBase.PostBeginPlay
	 void                      PrecacheFonts ( class UCanvas* C );               		// [ FUNC_Simulated ] XInterface.HudBase.PrecacheFonts
	 void                      DrawHudPassD ( class UCanvas* C );                		// [ FUNC_Simulated ] XInterface.HudBase.DrawHudPassD
	 void                      DrawHudPassC ( class UCanvas* C );                		// [ FUNC_Simulated ] XInterface.HudBase.DrawHudPassC
	 void                      DrawHudPassB ( class UCanvas* C );                		// [ FUNC_Simulated ] XInterface.HudBase.DrawHudPassB
	 void                      DrawHudPassA ( class UCanvas* C );                		// [ FUNC_Simulated ] XInterface.HudBase.DrawHudPassA
	 void                      UpdateHUD (  );                                   		// [ FUNC_Simulated ] XInterface.HudBase.UpdateHUD
	 void                      DoUpdateTime (  );                                		//  XInterface.HudBase.DoUpdateTime

	// Public Imports
	AHudBase(class AHudBase const &);
	AHudBase(void);
	class AHudBase &  operator=(class AHudBase const &);
	class FVector  CalcNametagPosNativeImp(class APawn *);
	void  CalcPivotCoords(enum EDrawPivot,float &,float &,float,float);
	void  DrawNameTagNativeImp(class UCanvas *,class APawn *);
	void  DrawNumericWidget(class UCanvas *,struct FNumericWidget *,struct FDigitSet *);
	void  DrawSpriteWidget(class UCanvas *,struct FSpriteWidget *);
	void  DrawTileFromSpriteWidget2(class UCanvas *,struct FSpriteWidget const &,float,float);
	void  DrawTileFromSpriteWidget(class UCanvas *,struct FSpriteWidget const &);
	class FColor  GetNametagColorNativeImp(class APlayerReplicationInfo *);
	static void  InternalConstructor(void *);
	bool  IsTargetInFrontOfPlayer2NativeImp(class UCanvas *,class FVector,class FVector *,class FVector,class FRotator);
	int  MemoryIsZero(void const *,unsigned int);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x05D0

// Class XInterface.wHudPart_KillMessage
class DLL_IMPORT AwHudPart_KillMessage : public AHudBase
{
public:
	class AHudBase*                                    HudOwner;                                         		// 0x0C84 ( 0x0004 ) 
	class ALevelInfo*                                  LevelOwner;                                       		// 0x0C88 ( 0x0004 ) 
	class TArray< struct FKillMessageItem >            KillMessages;                                     		// 0x0C8C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UMaterial*                                   RelatedBG;                                        		// 0x0C98 ( 0x0004 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponAirStrike;                            		// 0x0C9C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponAR;                                   		// 0x0CDC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponFlameThrower;                         		// 0x0D1C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponGR;                                   		// 0x0D5C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponHeadshot;                             		// 0x0D9C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponMG;                                   		// 0x0DDC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponPistol;                               		// 0x0E1C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponRPG;                                  		// 0x0E5C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponSMG;                                  		// 0x0E9C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponSR;                                   		// 0x0EDC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponMelee;                                		// 0x0F1C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponHelicopter;                           		// 0x0F5C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponUnknown;                              		// 0x0F9C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponHelicopterKill;                       		// 0x0FDC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponFell;                                 		// 0x101C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteWeaponStepOn;                               		// 0x105C ( 0x0040 ) [ CPF_Edit ]
	int                                                CacheClipX;                                       		// 0x109C ( 0x0004 ) 
	int                                                CacheClipY;                                       		// 0x10A0 ( 0x0004 ) 
	float                                              MessageDuration;                                  		// 0x10A4 ( 0x0004 ) 
	int                                                MaxMessages;                                      		// 0x10A8 ( 0x0004 ) 
	int                                                FontSize;                                         		// 0x10AC ( 0x0004 ) 
	float                                              KillMessageWordSpacing;                           		// 0x10B0 ( 0x0004 ) 
	float                                              KillMessageLineSpacing;                           		// 0x10B4 ( 0x0004 ) 
	float                                              MarginXFromRight;                                 		// 0x10B8 ( 0x0004 ) 
	float                                              MarginYFromTop;                                   		// 0x10BC ( 0x0004 ) 
	int                                                ShadowX;                                          		// 0x10C0 ( 0x0004 ) 
	int                                                ShadowY;                                          		// 0x10C4 ( 0x0004 ) 
	class FColor                                       ShadowColor;                                      		// 0x10C8 ( 0x0004 ) 
	struct FIntBoxWH                                   Icon_KillSuccession[ 0x0F ];                      		// 0x10CC ( 0x00F0 ) 
	struct FIntBoxWH                                   Icon_HeadShot;                                    		// 0x11BC ( 0x0010 ) 
	struct FIntBoxWH                                   Icon_AimShot;                                     		// 0x11CC ( 0x0010 ) 
	class UMaterial*                                   Icon_OptionalKillInfo;                            		// 0x11DC ( 0x0004 ) 

	// UScript Functions
	 void                      Draw ( class UCanvas* C );                        		//  XInterface.wHudPart_KillMessage.Draw
	 void                      DrawOnlyImage ( class UCanvas* C );               		//  XInterface.wHudPart_KillMessage.DrawOnlyImage
	 void                      DrawOnlyText ( class UCanvas* C );                		//  XInterface.wHudPart_KillMessage.DrawOnlyText
	 void                      UpdateCache ( class UCanvas* C );                 		//  XInterface.wHudPart_KillMessage.UpdateCache
	 void                      End ( class UCanvas* C );                         		//  XInterface.wHudPart_KillMessage.End
	 void                      Begin ( class UCanvas* C );                       		//  XInterface.wHudPart_KillMessage.Begin
	 void                      DrawNative ( class UCanvas* C );                  		// [ FUNC_Native ] XInterface.wHudPart_KillMessage.DrawNative
	 void                      Update (  );                                      		//  XInterface.wHudPart_KillMessage.Update
	 void                      AddKillMessageItem ( struct FKillMessageItem Item );		//  XInterface.wHudPart_KillMessage.AddKillMessageItem
	 void                      AddKillMessage ( class APlayerReplicationInfo* KillerPRI, class APlayerReplicationInfo* victimPRI, class UClass* DamageType, int Switch );		//  XInterface.wHudPart_KillMessage.AddKillMessage
	 class FColor              GetNameColor ( class APlayerReplicationInfo* PRI );		//  XInterface.wHudPart_KillMessage.GetNameColor
	 struct FKillMessageItem   MakeKillMessageItem ( class APlayerReplicationInfo* KillerPRI, class APlayerReplicationInfo* victimPRI, struct FString KillerName, struct FString VictimName, class UClass* DamageType, int Switch, bool NoKillerName, bool NoVictimName, class UMaterial* overrideImage );		//  XInterface.wHudPart_KillMessage.MakeKillMessageItem
	 void                      Initialize ( class AHudBase* myOwner, class ALevelInfo* myLevel );		//  XInterface.wHudPart_KillMessage.Initialize
	 void                      Precache (  );                                    		//  XInterface.wHudPart_KillMessage.Precache

	// Public Imports
	AwHudPart_KillMessage(class AwHudPart_KillMessage const &);
	AwHudPart_KillMessage(void);
	class AwHudPart_KillMessage &  operator=(class AwHudPart_KillMessage const &);
	void  DrawNativeImp(class UCanvas *);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x055C

// Class XInterface.GUIListBoxBase
class DLL_IMPORT UGUIListBoxBase : public UGUIMultiComponent
{
public:
	struct FString                                     SelectedStyleName;                                		// 0x0300 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     SectionStyleName;                                 		// 0x030C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     OutlineStyleName;                                 		// 0x0318 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     DefaultListClass;                                 		// 0x0324 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class UGUIScrollBarBase*                           MyScrollBar;                                      		// 0x0330 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIListBase*                                MyList;                                           		// 0x0334 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bVisibleWhenEmpty:1;                              		// 0x0338 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bSorted:1;                                        		// 0x0338 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bInitializeList:1;                                		// 0x0338 ( 0x0004 )  [0x00000004][ CPF_Edit ]

	// UScript Functions
	 void                      SetFriendlyLabel ( class UGUILabel* NewLabel );   		//  XInterface.GUIListBoxBase.SetFriendlyLabel
	 void                      SetScrollBarStyle ( bool changeScrollZoneStyle, class UGUIStyles* scrollZoneStyle, bool changeIncreaseButtonStyle, class UGUIStyles* increaseButtonStyle, bool changeIncreaseButtonGraphic, class UMaterial* increaseButtonGraphic, bool changeDecreaseButtonStyle, class UGUIStyles* decreaseButtonStyle, bool changeDecreaseButtonGraphic, class UMaterial* decreaseButtonGraphic, bool changeGripButtonStyle, class UGUIStyles* gripButtonStyle );		//  XInterface.GUIListBoxBase.SetScrollBarStyle
	 void                      InternalOnCreateComponent ( class UGUIComponent* NewComp, class UGUIComponent* Sender );		//  XInterface.GUIListBoxBase.InternalOnCreateComponent
	 void                      SetHint ( struct FString NewHint );               		//  XInterface.GUIListBoxBase.SetHint
	 void                      InitBaseList ( class UGUIListBase* LocalList );   		//  XInterface.GUIListBoxBase.InitBaseList
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIListBoxBase.InitComponent

	// Public Imports
	UGUIListBoxBase(class UGUIListBoxBase const &);
	UGUIListBoxBase(void);
	class UGUIListBoxBase &  operator=(class UGUIListBoxBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x003C

// Class XInterface.GUIListBox
class DLL_IMPORT UGUIListBox : public UGUIListBoxBase
{
public:
	class UGUIList*                                    List;                                             		// 0x033C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 bool                      MyClose ( class UGUIContextMenu* Sender );        		//  XInterface.GUIListBox.MyClose
	 bool                      MyOpen ( class UGUIContextMenu* Menu );           		//  XInterface.GUIListBox.MyOpen
	 int                       ItemCount (  );                                   		//  XInterface.GUIListBox.ItemCount
	 void                      InternalOnChange ( class UGUIComponent* Sender ); 		//  XInterface.GUIListBox.InternalOnChange
	 bool                      InternalOnDblClick ( class UGUIComponent* Sender );		//  XInterface.GUIListBox.InternalOnDblClick
	 bool                      InternalOnClick ( class UGUIComponent* Sender );  		//  XInterface.GUIListBox.InternalOnClick
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIListBox.InitComponent
	 void                      InitBaseList ( class UGUIListBase* LocalList );   		//  XInterface.GUIListBox.InitBaseList

	// Public Imports
	UGUIListBox(class UGUIListBox const &);
	class UGUIListBox &  operator=(class UGUIListBox const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0004

// Class XInterface.GUIScrollTextBox
class DLL_IMPORT UGUIScrollTextBox : public UGUIListBoxBase
{
public:
	class UGUIScrollText*                              MyScrollText;                                     		// 0x033C ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRepeat:1;                                        		// 0x0340 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bNoTeletype:1;                                    		// 0x0340 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bStripColors:1;                                   		// 0x0340 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	float                                              InitialDelay;                                     		// 0x0344 ( 0x0004 ) [ CPF_Edit ]
	float                                              CharDelay;                                        		// 0x0348 ( 0x0004 ) [ CPF_Edit ]
	float                                              EOLDelay;                                         		// 0x034C ( 0x0004 ) [ CPF_Edit ]
	float                                              RepeatDelay;                                      		// 0x0350 ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      TextAlign;                                        		// 0x0354 ( 0x0001 ) [ CPF_Edit ]
	struct FString                                     Separator;                                        		// 0x0358 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     ESC;                                              		// 0x0364 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     Comma;                                            		// 0x0370 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      AddText ( struct FString NewText );               		//  XInterface.GUIScrollTextBox.AddText
	 struct FString            StripColors ( struct FString MyString );          		//  XInterface.GUIScrollTextBox.StripColors
	 bool                      IsNumber ( struct FString Num );                  		//  XInterface.GUIScrollTextBox.IsNumber
	 void                      InternalOnAdjustTop ( class UGUIComponent* Sender );		//  XInterface.GUIScrollTextBox.InternalOnAdjustTop
	 void                      Stop (  );                                        		//  XInterface.GUIScrollTextBox.Stop
	 void                      Restart (  );                                     		//  XInterface.GUIScrollTextBox.Restart
	 void                      SetContent ( struct FString NewContent, struct FString sep );		//  XInterface.GUIScrollTextBox.SetContent
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIScrollTextBox.InitComponent
	 void                      InitBaseList ( class UGUIListBase* LocalList );   		//  XInterface.GUIScrollTextBox.InitBaseList
	 void                      InternalOnCreateComponent ( class UGUIComponent* NewComp, class UGUIComponent* Sender );		//  XInterface.GUIScrollTextBox.InternalOnCreateComponent
	 void                      eventCreated (  );                                		// [ FUNC_Event ] XInterface.GUIScrollTextBox.Created

	// Public Imports
	UGUIScrollTextBox(class UGUIScrollTextBox const &);
	class UGUIScrollTextBox &  operator=(class UGUIScrollTextBox const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0040

// Class XInterface.GUIMultiColumnListBox
class DLL_IMPORT UGUIMultiColumnListBox : public UGUIListBoxBase
{
public:
	class UGUIMultiColumnListHeader*                   Header;                                           		// 0x033C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	unsigned long                                      bDisplayHeader:1;                                 		// 0x0340 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	class UGUIMultiColumnList*                         List;                                             		// 0x0344 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< float >                              HeaderColumnPerc;                                 		// 0x0348 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ColumnHeadings;                                   		// 0x0354 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	int                                                OffsetBetweenHeaderAndList;                       		// 0x0360 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bFullHeightStyle:1;                               		// 0x0364 ( 0x0004 )  [0x00000001][ CPF_Edit ]

	// UScript Functions
	 void                      SetHeaderStyle ( bool changeStyle, struct FString stylez, bool changeBarStyle, struct FString barStylez );		//  XInterface.GUIMultiColumnListBox.SetHeaderStyle
	 void                      InternalOnColumnSized ( int Column );             		//  XInterface.GUIMultiColumnListBox.InternalOnColumnSized
	 void                      InternalOnCreateComponent ( class UGUIComponent* NewComp, class UGUIComponent* Sender );		//  XInterface.GUIMultiColumnListBox.InternalOnCreateComponent
	 void                      InternalOnLoadINI ( class UGUIComponent* Sender, struct FString S );		//  XInterface.GUIMultiColumnListBox.InternalOnLoadINI
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIMultiColumnListBox.InitComponent
	 void                      InitBaseList ( class UGUIListBase* LocalList );   		//  XInterface.GUIMultiColumnListBox.InitBaseList

	// Public Imports
	UGUIMultiColumnListBox(class UGUIMultiColumnListBox const &);
	UGUIMultiColumnListBox(void);
	class UGUIMultiColumnListBox &  operator=(class UGUIMultiColumnListBox const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x002C

// Class XInterface.GUITreeListBox
class DLL_IMPORT UGUITreeListBox : public UGUIListBoxBase
{
public:
	unsigned char                                      _0x033C[ 0x04 ];                                  		// 0x033C ( 0x0004 )

	// Public Imports
	UGUITreeListBox(class UGUITreeListBox const &);
	UGUITreeListBox(void);
	class UGUITreeListBox &  operator=(class UGUITreeListBox const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0004

// Class XInterface.GUIListBase
class DLL_IMPORT UGUIListBase : public UGUIComponent
{
public:
	unsigned long                                      bSorted:1;                                        		// 0x02BC ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bHotTrack:1;                                      		// 0x02BC ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bHotTrackSound:1;                                 		// 0x02BC ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bHotTrackStrictMode:1;                            		// 0x02BC ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bHotTrackOnInactive:1;                            		// 0x02BC ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned long                                      bDrawSelectionBorder:1;                           		// 0x02BC ( 0x0004 )  [0x00000020][ CPF_Edit ]
	unsigned long                                      bVisibleWhenEmpty:1;                              		// 0x02BC ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned long                                      bNotify:1;                                        		// 0x02BC ( 0x0004 )  [0x00000080][ CPF_Edit ]
	unsigned long                                      bInitializeList:1;                                		// 0x02BC ( 0x0004 )  [0x00000100][ CPF_Edit ]
	unsigned long                                      bMultiSelect:1;                                   		// 0x02BC ( 0x0004 )  [0x00000200][ CPF_Edit ]
	unsigned long                                      bAllowEmptyItems:1;                               		// 0x02BC ( 0x0004 )  [0x00000400][ CPF_Edit ]
	class UGUIScrollBarBase*                           MyScrollBar;                                      		// 0x02C0 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	unsigned long                                      bAlwaysShowScrollbar:1;                           		// 0x02C4 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bForceScrollBarPosition:1;                        		// 0x02C4 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	float                                              ForcedScrollbarWinLeft;                           		// 0x02C8 ( 0x0004 ) [ CPF_Edit ]
	float                                              ForcedScrollbarWinTop;                            		// 0x02CC ( 0x0004 ) [ CPF_Edit ]
	float                                              ForcedScrollbarWinWidth;                          		// 0x02D0 ( 0x0004 ) [ CPF_Edit ]
	float                                              ForcedScrollbarWinHeight;                         		// 0x02D4 ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     SelectedStyleName;                                		// 0x02D8 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     SectionStyleName;                                 		// 0x02E4 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     OutlineStyleName;                                 		// 0x02F0 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class UGUIStyles*                                  SelectedStyle;                                    		// 0x02FC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUIStyles*                                  SectionStyle;                                     		// 0x0300 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUIStyles*                                  OutlineStyle;                                     		// 0x0304 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	unsigned char                                      SectionJustification;                             		// 0x0308 ( 0x0001 ) [ CPF_Edit ]
	class UMaterial*                                   SelectedImage;                                    		// 0x030C ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       SelectedBKColor;                                  		// 0x0310 ( 0x0004 ) [ CPF_Edit ]
	int                                                Top;                                              		// 0x0314 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	int                                                Index;                                            		// 0x0318 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	int                                                ItemsPerPage;                                     		// 0x031C ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NoExport ]
	float                                              ItemHeight;                                       		// 0x0320 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	float                                              ItemWidth;                                        		// 0x0324 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	int                                                ItemCount;                                        		// 0x0328 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	class TArray< int >                                SelectedItems;                                    		// 0x032C ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport ]
	int                                                LastSelected;                                     		// 0x0338 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	int                                                LastPressX;                                       		// 0x033C ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	int                                                LastPressY;                                       		// 0x0340 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	int                                                DropIndex;                                        		// 0x0344 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	int                                                MightRemove;                                      		// 0x0348 ( 0x0004 ) [ CPF_Edit | CPF_EditConst | CPF_NoExport ]
	class TArray< class UGUIComponent* >               LinkedObjects;                                    		// 0x034C ( 0x000C ) [ CPF_Edit | CPF_ConstRef | CPF_NeedCtorLink | CPF_NoExport ]
	unsigned long                                      bMousePress:1;                                    		// 0x0358 ( 0x0004 )  [0x00000001]
	unsigned long                                      bMouseRelease:1;                                  		// 0x0358 ( 0x0004 )  [0x00000002]
	struct FScriptDelegate                             __OnScrollBy__Delegate;                           		// 0x035C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDrawItem__Delegate;                           		// 0x0364 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnAdjustTop__Delegate;                          		// 0x036C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnTrack__Delegate;                              		// 0x0374 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __CheckLinkedObjects__Delegate;                   		// 0x037C ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      SetOutlineAlpha ( int NewAlpha );                 		//  XInterface.GUIListBase.SetOutlineAlpha
	 bool                      eventIsMultiSelect (  );                          		// [ FUNC_Event ] XInterface.GUIListBase.IsMultiSelect
	 void                      InternalOnDragLeave ( class UGUIComponent* Sender );		//  XInterface.GUIListBase.InternalOnDragLeave
	 void                      InternalOnDragEnter ( class UGUIComponent* Sender );		//  XInterface.GUIListBase.InternalOnDragEnter
	 void                      InternalOnDragOver ( class UGUIComponent* Sender );		//  XInterface.GUIListBase.InternalOnDragOver
	 bool                      InternalOnDragDrop ( class UGUIComponent* Sender );		//  XInterface.GUIListBase.InternalOnDragDrop
	 void                      InternalOnEndDrag ( class UGUIComponent* Accepting, bool bAccepted );		//  XInterface.GUIListBase.InternalOnEndDrag
	 bool                      InternalOnRightClick ( class UGUIComponent* Sender );		//  XInterface.GUIListBase.InternalOnRightClick
	 void                      CheckDragSelect (  );                             		//  XInterface.GUIListBase.CheckDragSelect
	 bool                      InternalOnBeginDrag ( class UGUIComponent* Sender );		//  XInterface.GUIListBase.InternalOnBeginDrag
	 void                      InternalOnMouseRelease ( class UGUIComponent* Sender );		//  XInterface.GUIListBase.InternalOnMouseRelease
	 void                      InternalOnMousePressed ( class UGUIComponent* Sender, bool IsRepeat );		//  XInterface.GUIListBase.InternalOnMousePressed
	 void                      End (  );                                         		//  XInterface.GUIListBase.End
	 void                      home (  );                                        		//  XInterface.GUIListBase.home
	 void                      PgDn (  );                                        		//  XInterface.GUIListBase.PgDn
	 void                      PgUp (  );                                        		//  XInterface.GUIListBase.PgUp
	 void                      WheelDown (  );                                   		//  XInterface.GUIListBase.WheelDown
	 void                      WheelUp (  );                                     		//  XInterface.GUIListBase.WheelUp
	 bool                      MoveLeft (  );                                    		//  XInterface.GUIListBase.MoveLeft
	 bool                      MoveRight (  );                                   		//  XInterface.GUIListBase.MoveRight
	 bool                      Down (  );                                        		//  XInterface.GUIListBase.Down
	 bool                      Up (  );                                          		//  XInterface.GUIListBase.Up
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* KeyState );		//  XInterface.GUIListBase.InternalOnKeyEvent
	 class TArray< struct FString > GetPendingItems ( bool bGuarantee );              		//  XInterface.GUIListBase.GetPendingItems
	 struct FString            GetItemAtIndex ( int idx );                       		//  XInterface.GUIListBase.GetItemAtIndex
	 struct FString            eventAdditionalDebugString (  );                  		// [ FUNC_Event ] XInterface.GUIListBase.AdditionalDebugString
	 bool                      IsValidIndex ( int i );                           		//  XInterface.GUIListBase.IsValidIndex
	 bool                      IsValid (  );                                     		//  XInterface.GUIListBase.IsValid
	 void                      DisableLinkedObjects (  );                        		//  XInterface.GUIListBase.DisableLinkedObjects
	 void                      EnableLinkedObjects (  );                         		//  XInterface.GUIListBase.EnableLinkedObjects
	 void                      InitLinkObjects ( class TArray< class UGUIComponent* > NewObj, bool bNoCheck );		//  XInterface.GUIListBase.InitLinkObjects
	 int                       AddLinkObject ( class UGUIComponent* NewObj, bool bNoCheck );		//  XInterface.GUIListBase.AddLinkObject
	 void                      SetTopItem ( int Item );                          		//  XInterface.GUIListBase.SetTopItem
	 void                      MakeVisible ( float perc );                       		//  XInterface.GUIListBase.MakeVisible
	 void                      Clear (  );                                       		//  XInterface.GUIListBase.Clear
	 void                      ClearPendingElements (  );                        		//  XInterface.GUIListBase.ClearPendingElements
	 void                      IndexChanged ( class UGUIComponent* Sender );     		//  XInterface.GUIListBase.IndexChanged
	 int                       SetIndex ( int NewIndex );                        		//  XInterface.GUIListBase.SetIndex
	 int                       eventMultiCalculateIndex ( bool bRequireValidIndex );		// [ FUNC_Event ] XInterface.GUIListBase.MultiCalculateIndex
	 int                       eventCalculateIndex ( bool bRequireValidIndex );  		// [ FUNC_Event ] XInterface.GUIListBase.CalculateIndex
	 int                       SilentSetIndex ( int NewIndex );                  		//  XInterface.GUIListBase.SilentSetIndex
	 void                      Sort (  );                                        		//  XInterface.GUIListBase.Sort
	 void                      eventUpdateScrollbarForcedPosition (  );          		// [ FUNC_Event ] XInterface.GUIListBase.UpdateScrollbarForcedPosition
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIListBase.InitComponent
	 void                      CheckLinkedObjects ( class UGUIListBase* List );  		//  XInterface.GUIListBase.CheckLinkedObjects
	 void                      OnTrack ( class UGUIComponent* Sender, int LastIndex );		//  XInterface.GUIListBase.OnTrack
	 void                      OnAdjustTop ( class UGUIComponent* Sender );      		//  XInterface.GUIListBase.OnAdjustTop
	 void                      OnDrawItem ( class UCanvas* Canvas, int Item, float X, float Y, float W, float HT, bool bSelected, bool bPending );		//  XInterface.GUIListBase.OnDrawItem
	 void                      OnScrollBy ( class UGUIComponent* Sender );       		//  XInterface.GUIListBase.OnScrollBy

	// Public Imports
	UGUIListBase(class UGUIListBase const &);
	UGUIListBase(void);
	class UGUIListBase &  operator=(class UGUIListBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  delegateCheckLinkedObjects(class UGUIListBase *);
	void  delegateOnAdjustTop(class UGUIComponent *);
	void  delegateOnDrawItem(class UCanvas *,int,float,float,float,float,unsigned long,unsigned long);
	void  delegateOnScrollBy(class UGUIComponent *);
	void  delegateOnTrack(class UGUIComponent *,int);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x00C8

// Class XInterface.GUIVertList
class DLL_IMPORT UGUIVertList : public UGUIListBase
{
public:
	unsigned long                                      CallDrawItemForPlaceHoldingItems:1;               		// 0x0384 ( 0x0004 )  [0x00000001]
	struct FScriptDelegate                             __GetItemHeight__Delegate;                        		// 0x0388 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      PgDn (  );                                        		//  XInterface.GUIVertList.PgDn
	 void                      PgUp (  );                                        		//  XInterface.GUIVertList.PgUp
	 void                      End (  );                                         		//  XInterface.GUIVertList.End
	 void                      home (  );                                        		//  XInterface.GUIVertList.home
	 bool                      Down (  );                                        		//  XInterface.GUIVertList.Down
	 bool                      Up (  );                                          		//  XInterface.GUIVertList.Up
	 void                      WheelDown (  );                                   		//  XInterface.GUIVertList.WheelDown
	 void                      WheelUp (  );                                     		//  XInterface.GUIVertList.WheelUp
	 bool                      InternalOnKeyType ( struct FString Unicode, unsigned char* key );		//  XInterface.GUIVertList.InternalOnKeyType
	 bool                      InternalOnClick ( class UGUIComponent* Sender );  		//  XInterface.GUIVertList.InternalOnClick
	 int                       eventMultiCalculateIndex ( bool bRequireValidIndex );		// [ FUNC_Event ] XInterface.GUIVertList.MultiCalculateIndex
	 int                       eventCalculateIndex ( bool bRequireValidIndex );  		// [ FUNC_Event ] XInterface.GUIVertList.CalculateIndex
	 void                      CenterMouse (  );                                 		//  XInterface.GUIVertList.CenterMouse
	 float                     GetItemHeight ( class UCanvas* C );               		//  XInterface.GUIVertList.GetItemHeight

	// Public Imports
	UGUIVertList(class UGUIVertList const &);
	UGUIVertList(void);
	class UGUIVertList &  operator=(class UGUIVertList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	float  delegateGetItemHeight(class UCanvas *);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x000C

// Class XInterface.GUIList
class DLL_IMPORT UGUIList : public UGUIVertList
{
public:
	unsigned char                                      TextAlign;                                        		// 0x0390 ( 0x0001 ) [ CPF_Edit ]
	class TArray< struct FGUIListElem >                Elements;                                         		// 0x0394 ( 0x000C ) [ CPF_Edit | CPF_ConstRef | CPF_EditConst | CPF_NeedCtorLink ]
	class TArray< struct FGUIListElem >                SelectedElements;                                 		// 0x03A0 ( 0x000C ) [ CPF_Edit | CPF_ConstRef | CPF_EditConst | CPF_NeedCtorLink ]
	class FColor                                       OfficialColor;                                    		// 0x03AC ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       Official2004Color;                                		// 0x03B0 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       BonusPackColor;                                   		// 0x03B4 ( 0x0004 ) [ CPF_Edit ]
	struct FScriptDelegate                             __CompareItem__Delegate;                          		// 0x03B8 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 class TArray< struct FGUIListElem > GetPendingElements ( bool bGuarantee );           		//  XInterface.GUIList.GetPendingElements
	 void                      ClearPendingElements (  );                        		//  XInterface.GUIList.ClearPendingElements
	 bool                      InternalOnDragDrop ( class UGUIComponent* Sender );		//  XInterface.GUIList.InternalOnDragDrop
	 void                      InternalOnEndDrag ( class UGUIComponent* Accepting, bool bAccepted );		//  XInterface.GUIList.InternalOnEndDrag
	 int                       FindIndex ( struct FString Test, bool bExact, bool bExtra, class UObject* TestObject );		//  XInterface.GUIList.FindIndex
	 int                       FindItemObject ( class UObject* obj );            		//  XInterface.GUIList.FindItemObject
	 int                       FindExtra ( struct FString Text, bool bExact );   		//  XInterface.GUIList.FindExtra
	 struct FString            Find ( struct FString Text, bool bExact, bool bExtra );		//  XInterface.GUIList.Find
	 void                      RemoveExtra ( struct FString str );               		//  XInterface.GUIList.RemoveExtra
	 void                      RemoveObject ( class UObject* obj );              		//  XInterface.GUIList.RemoveObject
	 void                      RemoveItem ( struct FString Item );               		//  XInterface.GUIList.RemoveItem
	 void                      SetExtraAtIndex ( int i, struct FString NewExtra );		//  XInterface.GUIList.SetExtraAtIndex
	 void                      SetObjectAtIndex ( int i, class UObject* NewObject );		//  XInterface.GUIList.SetObjectAtIndex
	 void                      SetItemAtIndex ( int i, struct FString NewItem ); 		//  XInterface.GUIList.SetItemAtIndex
	 void                      GetAtIndex ( int i, struct FString* ItemStr, class UObject** ExtraObj, struct FString* ExtraStr );		//  XInterface.GUIList.GetAtIndex
	 struct FString            GetExtraAtIndex ( int i );                        		//  XInterface.GUIList.GetExtraAtIndex
	 class UObject*            GetObjectAtIndex ( int i );                       		//  XInterface.GUIList.GetObjectAtIndex
	 struct FString            GetItemAtIndex ( int i );                         		//  XInterface.GUIList.GetItemAtIndex
	 bool                      IsSection (  );                                   		//  XInterface.GUIList.IsSection
	 struct FString            GetExtra (  );                                    		//  XInterface.GUIList.GetExtra
	 class UObject*            GetObject (  );                                   		//  XInterface.GUIList.GetObject
	 struct FString            Get ( bool bGuarantee );                          		//  XInterface.GUIList.Get
	 struct FString            SelectedText (  );                                		//  XInterface.GUIList.SelectedText
	 void                      Clear (  );                                       		//  XInterface.GUIList.Clear
	 int                       RemoveElement ( struct FGUIListElem elem, int Count, bool bNoSort );		//  XInterface.GUIList.RemoveElement
	 int                       RemoveSilent ( int i, int Count );                		//  XInterface.GUIList.RemoveSilent
	 int                       Remove ( int i, int Count, bool bNoSort );        		//  XInterface.GUIList.Remove
	 void                      LoadFrom ( class UGUIList* Source, bool bClearFirst );		//  XInterface.GUIList.LoadFrom
	 void                      eventSwap ( int IndexA, int IndexB );             		// [ FUNC_Event ] XInterface.GUIList.Swap
	 void                      InsertElement ( int i, struct FGUIListElem NewElem, bool bNoSort );		//  XInterface.GUIList.InsertElement
	 void                      Insert ( int i, struct FString NewItem, class UObject* obj, struct FString str, bool bNoSort, bool bSection );		//  XInterface.GUIList.Insert
	 void                      Replace ( int i, struct FString NewItem, class UObject* obj, struct FString str, bool bNoSort );		//  XInterface.GUIList.Replace
	 void                      AddElement ( struct FGUIListElem NewElem );       		//  XInterface.GUIList.AddElement
	 void                      Add ( struct FString NewItem, class UObject* obj, struct FString str, bool bSection );		//  XInterface.GUIList.Add
	 int                       CompareItem ( struct FGUIListElem ElemA, struct FGUIListElem ElemB );		//  XInterface.GUIList.CompareItem
	 void                      Sort (  );                                        		//  XInterface.GUIList.Sort
	 void                      SortList (  );                                    		// [ FUNC_Final | FUNC_Native ] XInterface.GUIList.SortList

	// Public Imports
	UGUIList(class UGUIList const &);
	UGUIList(void);
	class UGUIList &  operator=(class UGUIList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	int  delegateCompareItem(struct FGUIListElem,struct FGUIListElem);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0030

// Class XInterface.GUIScrollText
class DLL_IMPORT UGUIScrollText : public UGUIList
{
public:
	int                                                MaxHistory;                                       		// 0x03C0 ( 0x0004 ) [ CPF_Edit | CPF_EditConst ]
	struct FString                                     NewText;                                          		// 0x03C4 ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink ]
	struct FString                                     ClickedString;                                    		// 0x03D0 ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink ]
	struct FString                                     Content;                                          		// 0x03DC ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink ]
	struct FString                                     Separator;                                        		// 0x03E8 ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink ]
	int                                                VisibleLines;                                     		// 0x03F4 ( 0x0004 ) [ CPF_Edit | CPF_EditConst ]
	int                                                VisibleChars;                                     		// 0x03F8 ( 0x0004 ) [ CPF_Edit | CPF_EditConst ]
	float                                              oldWidth;                                         		// 0x03FC ( 0x0004 ) [ CPF_Edit | CPF_EditConst ]
	unsigned char                                      ScrollState;                                      		// 0x0400 ( 0x0001 ) [ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bNewContent:1;                                    		// 0x0404 ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bStopped:1;                                       		// 0x0404 ( 0x0004 )  [0x00000002][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bReceivedNewContent:1;                            		// 0x0404 ( 0x0004 )  [0x00000004][ CPF_Const | CPF_EditConst ]
	unsigned long                                      bRepeat:1;                                        		// 0x0404 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bNoTeletype:1;                                    		// 0x0404 ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned long                                      bClickText:1;                                     		// 0x0404 ( 0x0004 )  [0x00000020][ CPF_Edit ]
	float                                              InitialDelay;                                     		// 0x0408 ( 0x0004 ) [ CPF_Edit ]
	float                                              CharDelay;                                        		// 0x040C ( 0x0004 ) [ CPF_Edit ]
	float                                              EOLDelay;                                         		// 0x0410 ( 0x0004 ) [ CPF_Edit ]
	float                                              RepeatDelay;                                      		// 0x0414 ( 0x0004 ) [ CPF_Edit ]
	class TArray< struct FString >                     StringElements;                                   		// 0x0418 ( 0x000C ) [ CPF_Edit | CPF_ConstRef | CPF_EditConst | CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnEndOfLine__Delegate;                          		// 0x0424 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      IsValid (  );                                     		//  XInterface.GUIScrollText.IsValid
	 void                      EndScrolling (  );                                		//  XInterface.GUIScrollText.EndScrolling
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  XInterface.GUIScrollText.InternalOnKeyEvent
	 bool                      InternalOnKeyType ( struct FString Unicode, unsigned char* key );		//  XInterface.GUIScrollText.InternalOnKeyType
	 bool                      InternalOnClick ( class UGUIComponent* Sender );  		//  XInterface.GUIScrollText.InternalOnClick
	 void                      eventTimer (  );                                  		// [ FUNC_Event ] XInterface.GUIScrollText.Timer
	 bool                      SkipChar (  );                                    		//  XInterface.GUIScrollText.SkipChar
	 void                      Restart (  );                                     		//  XInterface.GUIScrollText.Restart
	 void                      Stop (  );                                        		//  XInterface.GUIScrollText.Stop
	 void                      SetContent ( struct FString NewContent, struct FString sep );		//  XInterface.GUIScrollText.SetContent
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIScrollText.InitComponent
	 void                      Dump (  );                                        		//  XInterface.GUIScrollText.Dump
	 void                      OnEndOfLine (  );                                 		//  XInterface.GUIScrollText.OnEndOfLine
	 struct FString            GetWordUnderCursor (  );                          		// [ FUNC_Final | FUNC_Native ] XInterface.GUIScrollText.GetWordUnderCursor

	// Public Imports
	UGUIScrollText(class UGUIScrollText const &);
	UGUIScrollText(void);
	class UGUIScrollText &  operator=(class UGUIScrollText const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	int  WrapURL(class FString &)const ;
	void  delegateOnEndOfLine(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x006C

// Class XInterface.GUIMultiOptionList
class DLL_IMPORT UGUIMultiOptionList : public UGUIVertList
{
public:
	unsigned char                                      _0x0390[ 0x2C ];                                  		// 0x0390 ( 0x002C )

	// Public Imports
	UGUIMultiOptionList(class UGUIMultiOptionList const &);
	UGUIMultiOptionList(void);
	class UGUIMultiOptionList &  operator=(class UGUIMultiOptionList const &);
	int  CalculateIndex(int);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  delegateOnCreateComponent(class UGUIMenuOption *,class UGUIMultiOptionList *);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x002C

// Class XInterface.GUITreeList
class DLL_IMPORT UGUITreeList : public UGUIVertList
{
public:
	unsigned char                                      _0x0390[ 0x34 ];                                  		// 0x0390 ( 0x0034 )

	// Public Imports
	UGUITreeList(class UGUITreeList const &);
	UGUITreeList(void);
	class UGUITreeList &  operator=(class UGUITreeList const &);
	int  FindParentIndex(int)const ;
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  UpdateVisibleCount(void);
	int  delegateCompareItem(struct FGUITreeNode,struct FGUITreeNode);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0034

// Class XInterface.GUIHorzList
class DLL_IMPORT UGUIHorzList : public UGUIListBase
{
public:

	// Public Imports
	UGUIHorzList(class UGUIHorzList const &);
	UGUIHorzList(void);
	class UGUIHorzList &  operator=(class UGUIHorzList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0000

// Class XInterface.GUICircularList
class DLL_IMPORT UGUICircularList : public UGUIListBase
{
public:
	unsigned char                                      _0x0384[ 0x0C ];                                  		// 0x0384 ( 0x000C )

	// Public Imports
	UGUICircularList(class UGUICircularList const &);
	UGUICircularList(void);
	class UGUICircularList &  operator=(class UGUICircularList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x000C

// Class XInterface.GUICharacterList
class DLL_IMPORT UGUICharacterList : public UGUICircularList
{
public:
	unsigned char                                      _0x0390[ 0x20 ];                                  		// 0x0390 ( 0x0020 )

	// Public Imports
	UGUICharacterList(class UGUICharacterList const &);
	UGUICharacterList(void);
	class UGUICharacterList &  operator=(class UGUICharacterList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0020

// Class XInterface.GUIMultiColumnListHeader
class DLL_IMPORT UGUIMultiColumnListHeader : public UGUIComponent
{
public:
	class UGUIMultiColumnList*                         MyList;                                           		// 0x02BC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                SizingCol;                                        		// 0x02C0 ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_EditConst ]
	int                                                ClickingCol;                                      		// 0x02C4 ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_EditConst ]
	unsigned long                                      UseManualHeight:1;                                		// 0x02C8 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              ManualHeight;                                     		// 0x02CC ( 0x0004 ) [ CPF_Edit ]
	class UGUIStyles*                                  BarStyle;                                         		// 0x02D0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     BarStyleName;                                     		// 0x02D4 ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIMultiColumnListHeader.InitComponent

	// Public Imports
	UGUIMultiColumnListHeader(class UGUIMultiColumnListHeader const &);
	UGUIMultiColumnListHeader(void);
	class UGUIMultiColumnListHeader &  operator=(class UGUIMultiColumnListHeader const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0024

// Class XInterface.MultiSelectList
class DLL_IMPORT UMultiSelectList : public UGUIList
{
public:
	unsigned char                                      _0x03C0[ 0x0C ];                                  		// 0x03C0 ( 0x000C )

	// Public Imports
	UMultiSelectList(class UMultiSelectList const &);
	UMultiSelectList(void);
	class UMultiSelectList &  operator=(class UMultiSelectList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x000C

// Class XInterface.GUICircularImageList
class DLL_IMPORT UGUICircularImageList : public UGUICircularList
{
public:
	unsigned char                                      _0x0390[ 0x0C ];                                  		// 0x0390 ( 0x000C )

	// Public Imports
	UGUICircularImageList(class UGUICircularImageList const &);
	UGUICircularImageList(void);
	class UGUICircularImageList &  operator=(class UGUICircularImageList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x000C

// Class XInterface.GUIVertImageList
class DLL_IMPORT UGUIVertImageList : public UGUIVertList
{
public:
	unsigned char                                      CellStyle;                                        		// 0x0390 ( 0x0001 ) [ CPF_Edit ]
	float                                              ImageScale;                                       		// 0x0394 ( 0x0004 ) [ CPF_Edit ]
	int                                                NoVisibleRows;                                    		// 0x0398 ( 0x0004 ) [ CPF_Edit ]
	int                                                NoVisibleCols;                                    		// 0x039C ( 0x0004 ) [ CPF_Edit ]
	int                                                HorzBorder;                                       		// 0x03A0 ( 0x0004 ) [ CPF_Edit ]
	int                                                VertBorder;                                       		// 0x03A4 ( 0x0004 ) [ CPF_Edit ]
	class TArray< struct FImageListElem >              Elements;                                         		// 0x03A8 ( 0x000C ) [ CPF_Edit | CPF_ConstRef | CPF_EditConst | CPF_NeedCtorLink ]
	class TArray< struct FImageListElem >              SelectedElements;                                 		// 0x03B4 ( 0x000C ) [ CPF_Edit | CPF_ConstRef | CPF_EditConst | CPF_NeedCtorLink ]
	class UMaterial*                                   LockedMat;                                        		// 0x03C0 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      CallDrawItemForPlaceHoldingItemsInFixedCountCellStyle:1;		// 0x03C4 ( 0x0004 )  [0x00000001]
	float                                              LastValidClickTime;                               		// 0x03C8 ( 0x0004 ) 
	struct FScriptDelegate                             __OnItemDblClick__Delegate;                       		// 0x03CC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnIsSelectibleIndex__Delegate;                  		// 0x03D4 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      InternalOnDragDrop ( class UGUIComponent* Sender );		//  XInterface.GUIVertImageList.InternalOnDragDrop
	 void                      InternalOnEndDrag ( class UGUIComponent* Accepting, bool bAccepted );		//  XInterface.GUIVertImageList.InternalOnEndDrag
	 int                       FindItem ( int Item );                            		//  XInterface.GUIVertImageList.FindItem
	 int                       FindImage ( class UMaterial* Image );             		//  XInterface.GUIVertImageList.FindImage
	 void                      RemoveItem ( int Item );                          		//  XInterface.GUIVertImageList.RemoveItem
	 void                      RemoveImage ( class UMaterial* Image );           		//  XInterface.GUIVertImageList.RemoveImage
	 void                      SetItemAtIndex ( int i, int NewItem );            		//  XInterface.GUIVertImageList.SetItemAtIndex
	 void                      SetImageAtIndex ( int i, class UMaterial* NewImage );		//  XInterface.GUIVertImageList.SetImageAtIndex
	 class TArray< struct FImageListElem > GetPendingElements ( bool bGuarantee );           		//  XInterface.GUIVertImageList.GetPendingElements
	 void                      ClearPendingElements (  );                        		//  XInterface.GUIVertImageList.ClearPendingElements
	 bool                      IsLocked (  );                                    		//  XInterface.GUIVertImageList.IsLocked
	 bool                      IndexLocked ( int i );                            		//  XInterface.GUIVertImageList.IndexLocked
	 void                      GetAtIndex ( int i, class UMaterial** Image, int* Item, int* Locked );		//  XInterface.GUIVertImageList.GetAtIndex
	 int                       GetItemIntAtIndex ( int i );                      		//  XInterface.GUIVertImageList.GetItemIntAtIndex
	 struct FString            GetItemAtIndex ( int i );                         		//  XInterface.GUIVertImageList.GetItemAtIndex
	 class UMaterial*          GetImageAtIndex ( int i );                        		//  XInterface.GUIVertImageList.GetImageAtIndex
	 int                       GetItem (  );                                     		//  XInterface.GUIVertImageList.GetItem
	 class UMaterial*          Get ( bool bGuarantee );                          		//  XInterface.GUIVertImageList.Get
	 void                      Clear (  );                                       		//  XInterface.GUIVertImageList.Clear
	 int                       RemoveElement ( struct FImageListElem elem, int Count );		//  XInterface.GUIVertImageList.RemoveElement
	 int                       RemoveSilent ( int i, int Count );                		//  XInterface.GUIVertImageList.RemoveSilent
	 int                       Remove ( int i, int Count );                      		//  XInterface.GUIVertImageList.Remove
	 void                      LoadFrom ( class UGUIVertImageList* Source, bool bClearFirst );		//  XInterface.GUIVertImageList.LoadFrom
	 void                      eventSwap ( int IndexA, int IndexB );             		// [ FUNC_Event ] XInterface.GUIVertImageList.Swap
	 void                      InsertElement ( int i, struct FImageListElem NewElem, int Locked );		//  XInterface.GUIVertImageList.InsertElement
	 void                      Insert ( int i, class UMaterial* NewImage, int NewItem, int Locked );		//  XInterface.GUIVertImageList.Insert
	 void                      Replace ( int i, class UMaterial* NewImage, int NewItem, int Locked );		//  XInterface.GUIVertImageList.Replace
	 void                      AddImage ( struct FImageListElem NewElem, int Locked );		//  XInterface.GUIVertImageList.AddImage
	 void                      Add ( class UMaterial* Image, int Item, int Locked );		//  XInterface.GUIVertImageList.Add
	 void                      SetTopItem ( int Item );                          		//  XInterface.GUIVertImageList.SetTopItem
	 void                      MakeVisible ( float perc );                       		//  XInterface.GUIVertImageList.MakeVisible
	 void                      PgDn (  );                                        		//  XInterface.GUIVertImageList.PgDn
	 void                      PgUp (  );                                        		//  XInterface.GUIVertImageList.PgUp
	 void                      End (  );                                         		//  XInterface.GUIVertImageList.End
	 void                      home (  );                                        		//  XInterface.GUIVertImageList.home
	 bool                      MoveLeft (  );                                    		//  XInterface.GUIVertImageList.MoveLeft
	 bool                      MoveRight (  );                                   		//  XInterface.GUIVertImageList.MoveRight
	 bool                      Down (  );                                        		//  XInterface.GUIVertImageList.Down
	 bool                      Up (  );                                          		//  XInterface.GUIVertImageList.Up
	 int                       SetIndex ( int NewIndex );                        		//  XInterface.GUIVertImageList.SetIndex
	 bool                      InternalOnClick ( class UGUIComponent* Sender );  		//  XInterface.GUIVertImageList.InternalOnClick
	 bool                      OnIsSelectibleIndex ( class UGUIComponent* Sender, int Index );		//  XInterface.GUIVertImageList.OnIsSelectibleIndex
	 bool                      OnItemDblClick ( class UGUIComponent* Sender );   		//  XInterface.GUIVertImageList.OnItemDblClick
	 int                       eventCalculateIndex ( bool bRequireValidIndex );  		// [ FUNC_Event ] XInterface.GUIVertImageList.CalculateIndex

	// Public Imports
	UGUIVertImageList(class UGUIVertImageList const &);
	UGUIVertImageList(void);
	class UGUIVertImageList &  operator=(class UGUIVertImageList const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	unsigned long  delegateOnIsSelectibleIndex(class UGUIComponent *,int);
	unsigned long  delegateOnItemDblClick(class UGUIComponent *);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x004C

// Class XInterface.GUIMultiColumnList
class DLL_IMPORT UGUIMultiColumnList : public UGUIVertList
{
public:
	class TArray< struct FString >                     ColumnHeadings;                                   		// 0x0390 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	class TArray< float >                              InitColumnPerc;                                   		// 0x039C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ColumnHeadingHints;                               		// 0x03A8 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	class TArray< struct FMultiColumnSortData >        SortData;                                         		// 0x03B4 ( 0x000C ) [ CPF_Const | CPF_NeedCtorLink ]
	class TArray< int >                                InvSortData;                                      		// 0x03C0 ( 0x000C ) [ CPF_Const | CPF_NeedCtorLink ]
	class TArray< float >                              ColumnWidths;                                     		// 0x03CC ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink ]
	float                                              CellSpacing;                                      		// 0x03D8 ( 0x0004 ) [ CPF_Edit ]
	int                                                SortColumn;                                       		// 0x03DC ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      NeedsSorting:1;                                   		// 0x03E0 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      SortDescending:1;                                 		// 0x03E0 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      ExpandLastColumn:1;                               		// 0x03E0 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	int                                                NoVisibleRows;                                    		// 0x03E4 ( 0x0004 ) [ CPF_Edit ]
	int                                                NoVisibleCols;                                    		// 0x03E8 ( 0x0004 ) [ CPF_Edit ]
	struct FScriptDelegate                             __OnColumnSized__Delegate;                        		// 0x03EC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __GetSortString__Delegate;                        		// 0x03F4 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      SetTopItem ( int Item );                          		//  XInterface.GUIMultiColumnList.SetTopItem
	 void                      Dump (  );                                        		//  XInterface.GUIMultiColumnList.Dump
	 void                      Sort (  );                                        		//  XInterface.GUIMultiColumnList.Sort
	 void                      GetCellLeftWidth ( int Column, float* Left, float* width );		//  XInterface.GUIMultiColumnList.GetCellLeftWidth
	 bool                      InternalOnPreDraw ( class UCanvas* C );           		//  XInterface.GUIMultiColumnList.InternalOnPreDraw
	 void                      eventInitializeColumns ( class UCanvas* C );      		// [ FUNC_Event ] XInterface.GUIMultiColumnList.InitializeColumns
	 void                      ResolutionChanged ( int ResX, int ResY );         		//  XInterface.GUIMultiColumnList.ResolutionChanged
	 void                      RemovedCurrent (  );                              		//  XInterface.GUIMultiColumnList.RemovedCurrent
	 void                      Clear (  );                                       		//  XInterface.GUIMultiColumnList.Clear
	 void                      eventOnSortChanged (  );                          		// [ FUNC_Event ] XInterface.GUIMultiColumnList.OnSortChanged
	 int                       CurrentListId (  );                               		//  XInterface.GUIMultiColumnList.CurrentListId
	 struct FString            GetSortString ( int YourArrayIndex );             		//  XInterface.GUIMultiColumnList.GetSortString
	 void                      AddedItem ( int YourArrayIndex );                 		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiColumnList.AddedItem
	 void                      RemovedItem ( int YourArrayIndex );               		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiColumnList.RemovedItem
	 void                      UpdatedItem ( int YourArrayIndex );               		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiColumnList.UpdatedItem
	 void                      SortList (  );                                    		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiColumnList.SortList
	 void                      ChangeSortOrder (  );                             		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiColumnList.ChangeSortOrder
	 int                       GetListIndex ( int YourArrayIndex );              		// [ FUNC_Final | FUNC_Native ] XInterface.GUIMultiColumnList.GetListIndex
	 void                      OnColumnSized ( int Column );                     		//  XInterface.GUIMultiColumnList.OnColumnSized

	// Public Imports
	UGUIMultiColumnList(class UGUIMultiColumnList const &);
	UGUIMultiColumnList(void);
	class UGUIMultiColumnList &  operator=(class UGUIMultiColumnList const &);
	int  FindSortIndex(int)const ;
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	class FString  delegateGetSortString(int);
	void  delegateOnColumnSized(int);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x006C

// Class XInterface.GUIMultiColumnListDerived
class DLL_IMPORT UGUIMultiColumnListDerived : public UGUIMultiColumnList
{
public:

	// Public Imports
	UGUIMultiColumnListDerived(class UGUIMultiColumnListDerived const &);
	UGUIMultiColumnListDerived(void);
	class UGUIMultiColumnListDerived &  operator=(class UGUIMultiColumnListDerived const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0000

// Class XInterface.BTTcpHandler_DS_Script
class DLL_IMPORT UBTTcpHandler_DS_Script : public UBTTcpHandler_DS_Script_Interface
{
public:
	unsigned char                                      _0x0034[ 0x10 ];                                  		// 0x0034 ( 0x0010 )

	// Public Imports
	UBTTcpHandler_DS_Script(class UBTTcpHandler_DS_Script const &);
	class UBTTcpHandler_DS_Script &  operator=(class UBTTcpHandler_DS_Script const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class XInterface.GUILabel
class DLL_IMPORT UGUILabel : public UGUIComponent
{
public:
	struct FString                                     Caption;                                          		// 0x02BC ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	unsigned char                                      TextAlign;                                        		// 0x02C8 ( 0x0001 ) [ CPF_Edit ]
	class FColor                                       TextColor;                                        		// 0x02CC ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       FocusedTextColor;                                 		// 0x02D0 ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      TextStyle;                                        		// 0x02D4 ( 0x0001 ) [ CPF_Edit ]
	struct FString                                     TextFont;                                         		// 0x02D8 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	unsigned long                                      bTransparent:1;                                   		// 0x02E4 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bMultiLine:1;                                     		// 0x02E4 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned char                                      VertAlign;                                        		// 0x02E8 ( 0x0001 ) [ CPF_Edit ]
	class FColor                                       BackColor;                                        		// 0x02EC ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       ShadowColor;                                      		// 0x02F0 ( 0x0004 ) [ CPF_Edit ]
	float                                              ShadowOffsetX;                                    		// 0x02F4 ( 0x0004 ) [ CPF_Edit ]
	float                                              ShadowOffsetY;                                    		// 0x02F8 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       HilightColor;                                     		// 0x02FC ( 0x0004 ) [ CPF_Edit ]
	float                                              HilightOffsetX;                                   		// 0x0300 ( 0x0004 ) [ CPF_Edit ]
	float                                              HilightOffsetY;                                   		// 0x0304 ( 0x0004 ) [ CPF_Edit ]
	int                                                FontSize;                                         		// 0x0308 ( 0x0004 ) [ CPF_Edit ]

	// Public Imports
	UGUILabel(class UGUILabel const &);
	UGUILabel(void);
	class UGUILabel &  operator=(class UGUILabel const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0050

// Class XInterface.GUIBorder
class DLL_IMPORT UGUIBorder : public UGUIMultiComponent
{
public:
	struct FString                                     Caption;                                          		// 0x0300 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	unsigned char                                      Justification;                                    		// 0x030C ( 0x0001 ) [ CPF_Edit ]
	int                                                TextIndent;                                       		// 0x0310 ( 0x0004 ) [ CPF_Edit ]

	// UScript Functions
	 struct FString            GetCaption (  );                                  		//  XInterface.GUIBorder.GetCaption
	 void                      SetCaption ( struct FString NewCaption );         		//  XInterface.GUIBorder.SetCaption

	// Public Imports
	UGUIBorder(class UGUIBorder const &);
	UGUIBorder(void);
	class UGUIBorder &  operator=(class UGUIBorder const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0014

// Class XInterface.GUITitleBar
class DLL_IMPORT UGUITitleBar : public UGUIBorder
{
public:
	class UGUITabControl*                              DockedTabs;                                       		// 0x0314 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned char                                      DockAlign;                                        		// 0x0318 ( 0x0001 ) [ CPF_Edit ]
	unsigned long                                      bUseTextHeight:1;                                 		// 0x031C ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bDockTop:1;                                       		// 0x031C ( 0x0004 )  [0x00000002][ CPF_Edit ]
	class UMaterial*                                   Effect;                                           		// 0x0320 ( 0x0004 ) [ CPF_Const ]

	// Public Imports
	UGUITitleBar(class UGUITitleBar const &);
	UGUITitleBar(void);
	class UGUITitleBar &  operator=(class UGUITitleBar const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class XInterface.GUITabControl
class DLL_IMPORT UGUITabControl : public UGUIMultiComponent
{
public:
	unsigned long                                      bFillSpace:1;                                     		// 0x0300 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bDockPanels:1;                                    		// 0x0300 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bDrawTabAbove:1;                                  		// 0x0300 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bFillBackground:1;                                		// 0x0300 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	class FColor                                       FillColor;                                        		// 0x0304 ( 0x0004 ) [ CPF_Edit ]
	float                                              FadeInTime;                                       		// 0x0308 ( 0x0004 ) [ CPF_Edit ]
	float                                              TabHeight;                                        		// 0x030C ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     BackgroundStyleName;                              		// 0x0310 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class UMaterial*                                   BackgroundImage;                                  		// 0x031C ( 0x0004 ) [ CPF_Edit ]
	class TArray< class UGUITabButton* >               TabStack;                                         		// 0x0320 ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport ]
	class UGUITabButton*                               ActiveTab;                                        		// 0x032C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUITabButton*                               PendingTab;                                       		// 0x0330 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUIStyles*                                  BackgroundStyle;                                  		// 0x0334 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUIBorder*                                  MyFooter;                                         		// 0x0338 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	unsigned long                                      bForceManualTabButtonStyle:1;                     		// 0x033C ( 0x0004 )  [0x00000001][ CPF_Edit ]
	struct FString                                     ManualTabButtonStyleName;                         		// 0x0340 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]

	// UScript Functions
	 void                      LevelChanged (  );                                		//  XInterface.GUITabControl.LevelChanged
	 void                      eventfree (  );                                   		// [ FUNC_Event ] XInterface.GUITabControl.free
	 void                      CenterMouse (  );                                 		//  XInterface.GUITabControl.CenterMouse
	 bool                      FocusLast ( class UGUIComponent* Sender );        		//  XInterface.GUITabControl.FocusLast
	 bool                      FocusFirst ( class UGUIComponent* Sender );       		//  XInterface.GUITabControl.FocusFirst
	 void                      InternalOnActivate (  );                          		//  XInterface.GUITabControl.InternalOnActivate
	 void                      SetVisibility ( bool bIsVisible );                		//  XInterface.GUITabControl.SetVisibility
	 class UGUITabPanel*       BorrowPanel ( struct FString Caption );           		//  XInterface.GUITabControl.BorrowPanel
	 class UGUITabPanel*       FindPanelClass ( class UClass* PanelClass );      		//  XInterface.GUITabControl.FindPanelClass
	 int                       TabIndex ( struct FString tabname );              		//  XInterface.GUITabControl.TabIndex
	 bool                      eventPrevControl ( class UGUIComponent* Sender ); 		// [ FUNC_Event ] XInterface.GUITabControl.PrevControl
	 bool                      eventNextControl ( class UGUIComponent* Sender ); 		// [ FUNC_Event ] XInterface.GUITabControl.NextControl
	 bool                      eventPrevPage (  );                               		// [ FUNC_Event ] XInterface.GUITabControl.PrevPage
	 bool                      eventNextPage (  );                               		// [ FUNC_Event ] XInterface.GUITabControl.NextPage
	 bool                      InternalTabClick ( class UGUIComponent* Sender ); 		//  XInterface.GUITabControl.InternalTabClick
	 bool                      ActivateTabByPanel ( class UGUITabPanel* Panel, bool bFocusPanel );		//  XInterface.GUITabControl.ActivateTabByPanel
	 bool                      ActivateTabByName ( struct FString tabname, bool bFocusPanel );		//  XInterface.GUITabControl.ActivateTabByName
	 bool                      ActivateTab ( class UGUITabButton* Who, bool bFocusPanel );		//  XInterface.GUITabControl.ActivateTab
	 void                      eventMakeTabActive ( class UGUITabButton* Who );  		// [ FUNC_Event ] XInterface.GUITabControl.MakeTabActive
	 bool                      LostActiveTab (  );                               		//  XInterface.GUITabControl.LostActiveTab
	 void                      RemoveTab ( struct FString Caption, class UGUITabButton* Who );		//  XInterface.GUITabControl.RemoveTab
	 class UGUITabPanel*       ReplaceTab ( class UGUITabButton* Which, struct FString Caption, struct FString PanelClass, class UGUITabPanel* ExistingPanel, struct FString InHint, bool bForceActive );		//  XInterface.GUITabControl.ReplaceTab
	 class UGUITabPanel*       InsertTab ( int pos, struct FString Caption, struct FString PanelClass, class UGUITabPanel* ExistingPanel, struct FString InHint, bool bForceActive );		//  XInterface.GUITabControl.InsertTab
	 class UGUITabPanel*       AddTab ( struct FString InCaption, struct FString PanelClass, class UGUITabPanel* ExistingPanel, struct FString InHint, bool bForceActive );		//  XInterface.GUITabControl.AddTab
	 class UGUITabPanel*       AddTabItem ( struct FGUITabItem Item );           		//  XInterface.GUITabControl.AddTabItem
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  XInterface.GUITabControl.InternalOnKeyEvent
	 void                      eventClosed ( class UGUIComponent* Sender, bool bCancelled );		// [ FUNC_Event ] XInterface.GUITabControl.Closed
	 void                      eventOpened ( class UGUIComponent* Sender );      		// [ FUNC_Event ] XInterface.GUITabControl.Opened
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUITabControl.InitComponent

	// Public Imports
	UGUITabControl(class UGUITabControl const &);
	UGUITabControl(void);
	class UGUITabControl &  operator=(class UGUITabControl const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x004C

// Class XInterface.GUIButton
class DLL_IMPORT UGUIButton : public UGUIComponent
{
public:
	unsigned char                                      CaptionAlign;                                     		// 0x02BC ( 0x0001 ) [ CPF_Edit ]
	class UGUIStyles*                                  CaptionEffectStyle;                               		// 0x02C0 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     CaptionEffectStyleName;                           		// 0x02C4 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     Caption;                                          		// 0x02D0 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	struct FPaddingPercent                             AutoSizePadding;                                  		// 0x02DC ( 0x0008 ) [ CPF_Edit ]
	struct FString                                     SizingCaption;                                    		// 0x02E4 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	unsigned long                                      bAutoSize:1;                                      		// 0x02F0 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bAutoShrink:1;                                    		// 0x02F0 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bWrapCaption:1;                                   		// 0x02F0 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bUseCaptionHeight:1;                              		// 0x02F0 ( 0x0004 )  [0x00000008][ CPF_Edit ]

	// UScript Functions
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  XInterface.GUIButton.InternalOnKeyEvent
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIButton.InitComponent

	// Public Imports
	UGUIButton(class UGUIButton const &);
	UGUIButton(void);
	class UGUIButton &  operator=(class UGUIButton const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0038

// Class XInterface.GUITabButton
class DLL_IMPORT UGUITabButton : public UGUIButton
{
public:
	unsigned long                                      bForceFlash:1;                                    		// 0x02F4 ( 0x0004 )  [0x00000001]
	unsigned long                                      bActive:1;                                        		// 0x02F4 ( 0x0004 )  [0x00000002]
	class UGUITabPanel*                                MyPanel;                                          		// 0x02F8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]

	// UScript Functions
	 bool                      CanShowPanel (  );                                		//  XInterface.GUITabButton.CanShowPanel
	 bool                      ChangeActiveState ( bool IsActive, bool bFocusPanel );		//  XInterface.GUITabButton.ChangeActiveState
	 void                      eventSetFocus ( class UGUIComponent* Who );       		// [ FUNC_Event ] XInterface.GUITabButton.SetFocus

	// Public Imports
	UGUITabButton(class UGUITabButton const &);
	UGUITabButton(void);
	class UGUITabButton &  operator=(class UGUITabButton const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0008

// Class XInterface.GUIPanel
class DLL_IMPORT UGUIPanel : public UGUIMultiComponent
{
public:
	class UMaterial*                                   Background;                                       		// 0x0300 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      SetControlsBoundToParent:1;                       		// 0x0304 ( 0x0004 )  [0x00000001]
	unsigned long                                      SetControlsScaleToParent:1;                       		// 0x0304 ( 0x0004 )  [0x00000002]
	struct FScriptDelegate                             __OnPostDraw__Delegate;                           		// 0x0308 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIPanel.InitComponent
	 bool                      OnPostDraw ( class UCanvas* Canvas );             		//  XInterface.GUIPanel.OnPostDraw

	// Public Imports
	UGUIPanel(class UGUIPanel const &);
	UGUIPanel(void);
	class UGUIPanel &  operator=(class UGUIPanel const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	unsigned long  delegateOnPostDraw(class UCanvas *);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class XInterface.GUITabPanel
class DLL_IMPORT UGUITabPanel : public UGUIPanel
{
public:
	struct FString                                     PanelCaption;                                     		// 0x0310 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	unsigned long                                      bFillHeight:1;                                    		// 0x031C ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              FadeInTime;                                       		// 0x0320 ( 0x0004 ) [ CPF_Edit ]
	class UGUITabButton*                               MyButton;                                         		// 0x0324 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	float                                              CursorUSize;                                      		// 0x0328 ( 0x0004 ) 
	float                                              CursorVSize;                                      		// 0x032C ( 0x0004 ) 

	// UScript Functions
	 struct FFloatBox          GetTooltipPos ( int tooltipWidth, int tooltipHeight, int nOffsetX, int nOffsetY );		//  XInterface.GUITabPanel.GetTooltipPos
	 bool                      CanShowPanel (  );                                		//  XInterface.GUITabPanel.CanShowPanel
	 void                      ShowPanel ( bool bShow );                         		//  XInterface.GUITabPanel.ShowPanel
	 void                      eventfree (  );                                   		// [ FUNC_Event ] XInterface.GUITabPanel.free
	 void                      OnDestroyPanel ( bool bCancelled );               		//  XInterface.GUITabPanel.OnDestroyPanel
	 void                      InitPanel (  );                                   		//  XInterface.GUITabPanel.InitPanel
	 void                      Refresh (  );                                     		//  XInterface.GUITabPanel.Refresh

	// Public Imports
	UGUITabPanel(class UGUITabPanel const &);
	class UGUITabPanel &  operator=(class UGUITabPanel const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0020

// Class XInterface.GUIGFXButton
class DLL_IMPORT UGUIGFXButton : public UGUIButton
{
public:
	int                                                ImageIndex;                                       		// 0x02F4 ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   Graphic;                                          		// 0x02F8 ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      Position;                                         		// 0x02FC ( 0x0001 ) [ CPF_Edit ]
	unsigned long                                      bCheckBox:1;                                      		// 0x0300 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bClientBound:1;                                   		// 0x0300 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bChecked:1;                                       		// 0x0300 ( 0x0004 )  [0x00000004]

	// UScript Functions
	 bool                      InternalOnClick ( class UGUIComponent* Sender );  		//  XInterface.GUIGFXButton.InternalOnClick
	 void                      SetChecked ( bool bNewChecked );                  		//  XInterface.GUIGFXButton.SetChecked
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIGFXButton.InitComponent

	// Public Imports
	UGUIGFXButton(class UGUIGFXButton const &);
	UGUIGFXButton(void);
	class UGUIGFXButton &  operator=(class UGUIGFXButton const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class XInterface.GUICheckBoxButton
class DLL_IMPORT UGUICheckBoxButton : public UGUIGFXButton
{
public:
	unsigned char                                      _0x0304[ 0x2C ];                                  		// 0x0304 ( 0x002C )

	// Public Imports
	UGUICheckBoxButton(class UGUICheckBoxButton const &);
	UGUICheckBoxButton(void);
	class UGUICheckBoxButton &  operator=(class UGUICheckBoxButton const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x002C

// Class XInterface.GUISpinnerButton
class DLL_IMPORT UGUISpinnerButton : public UGUIButton
{
public:
	unsigned char                                      _0x02F4[ 0x10 ];                                  		// 0x02F4 ( 0x0010 )

	// Public Imports
	UGUISpinnerButton(class UGUISpinnerButton const &);
	UGUISpinnerButton(void);
	class UGUISpinnerButton &  operator=(class UGUISpinnerButton const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	unsigned long  delegateOnMinusClick(class UGUIComponent *);
	unsigned long  delegateOnPlusClick(class UGUIComponent *);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class XInterface.GUIEditBox
class DLL_IMPORT UGUIEditBox : public UGUIButton
{
public:
	int                                                MaxTextStrNum;                                    		// 0x02F4 ( 0x0004 ) 
	struct FString                                     IMEText;                                          		// 0x02F8 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                IMESelPosStart;                                   		// 0x0304 ( 0x0004 ) 
	int                                                IMESelPosEnd;                                     		// 0x0308 ( 0x0004 ) 
	int                                                IMECompSize;                                      		// 0x030C ( 0x0004 ) 
	struct FString                                     TextStr;                                          		// 0x0310 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     AllowedCharSet;                                   		// 0x031C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	unsigned long                                      bMaskText:1;                                      		// 0x0328 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bIntOnly:1;                                       		// 0x0328 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bFloatOnly:1;                                     		// 0x0328 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bIncludeSign:1;                                   		// 0x0328 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bConvertSpaces:1;                                 		// 0x0328 ( 0x0004 )  [0x00000010][ CPF_Edit ]
	int                                                MaxWidth;                                         		// 0x032C ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      TextCase;                                         		// 0x0330 ( 0x0001 ) [ CPF_Edit ]
	int                                                BorderOffsets[ 0x04 ];                            		// 0x0334 ( 0x0010 ) [ CPF_Edit ]
	unsigned long                                      bReadOnly:1;                                      		// 0x0344 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bAlwaysNotify:1;                                  		// 0x0344 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	int                                                CaretPos;                                         		// 0x0348 ( 0x0004 ) 
	int                                                FirstVis;                                         		// 0x034C ( 0x0004 ) 
	int                                                LastSizeX;                                        		// 0x0350 ( 0x0004 ) 
	int                                                LastCaret;                                        		// 0x0354 ( 0x0004 ) 
	int                                                LastLength;                                       		// 0x0358 ( 0x0004 ) 
	unsigned long                                      bAllSelected:1;                                   		// 0x035C ( 0x0004 )  [0x00000001]
	unsigned char                                      LastKey;                                          		// 0x0360 ( 0x0001 ) 
	float                                              DelayTime;                                        		// 0x0364 ( 0x0004 ) [ CPF_Edit ]

	// UScript Functions
	 void                      IMEInputCancel (  );                              		//  XInterface.GUIEditBox.IMEInputCancel
	 void                      InternalDeactivate (  );                          		//  XInterface.GUIEditBox.InternalDeactivate
	 void                      InternalActivate (  );                            		//  XInterface.GUIEditBox.InternalActivate
	 void                      TextChanged (  );                                 		//  XInterface.GUIEditBox.TextChanged
	 struct FString            GetText (  );                                     		//  XInterface.GUIEditBox.GetText
	 struct FString            ConvertIllegal ( struct FString inputstr );       		//  XInterface.GUIEditBox.ConvertIllegal
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  XInterface.GUIEditBox.InternalOnKeyEvent
	 bool                      InternalOnKeyType ( struct FString Unicode, unsigned char* key );		//  XInterface.GUIEditBox.InternalOnKeyType
	 void                      DeleteChar (  );                                  		//  XInterface.GUIEditBox.DeleteChar
	 void                      eventSetText ( struct FString NewText );          		// [ FUNC_Event ] XInterface.GUIEditBox.SetText
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIEditBox.InitComponent
	 bool                      OnIME_Notify ( int Type, int LangID, struct FString strText, int nStartPos, int nSize );		// [ FUNC_Native ] XInterface.GUIEditBox.OnIME_Notify

	// Public Imports
	UGUIEditBox(class UGUIEditBox const &);
	UGUIEditBox(void);
	class UGUIEditBox &  operator=(class UGUIEditBox const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0074

// Class XInterface.GUINumericEdit
class DLL_IMPORT UGUINumericEdit : public UGUIMultiComponent
{
public:
	unsigned char                                      _0x0300[ 0x28 ];                                  		// 0x0300 ( 0x0028 )

	// Public Imports
	UGUINumericEdit(class UGUINumericEdit const &);
	UGUINumericEdit(void);
	class UGUINumericEdit &  operator=(class UGUINumericEdit const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0028

// Class XInterface.GUIFloatEdit
class DLL_IMPORT UGUIFloatEdit : public UGUIMultiComponent
{
public:
	unsigned char                                      _0x0300[ 0x28 ];                                  		// 0x0300 ( 0x0028 )

	// Public Imports
	UGUIFloatEdit(class UGUIFloatEdit const &);
	UGUIFloatEdit(void);
	class UGUIFloatEdit &  operator=(class UGUIFloatEdit const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0028

// Class XInterface.GUIScrollBarBase
class DLL_IMPORT UGUIScrollBarBase : public UGUIMultiComponent
{
public:
	unsigned char                                      Orientation;                                      		// 0x0300 ( 0x0001 ) [ CPF_Edit ]
	int                                                Step;                                             		// 0x0304 ( 0x0004 ) [ CPF_Edit ]
	float                                              GripPos;                                          		// 0x0308 ( 0x0004 ) 
	float                                              GripSize;                                         		// 0x030C ( 0x0004 ) 
	float                                              GrabOffset;                                       		// 0x0310 ( 0x0004 ) 
	int                                                MinGripPixels;                                    		// 0x0314 ( 0x0004 ) [ CPF_Edit ]
	class UGUIListBase*                                MyList;                                           		// 0x0318 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                BigStep;                                          		// 0x031C ( 0x0004 ) [ CPF_Edit ]
	int                                                ItemCount;                                        		// 0x0320 ( 0x0004 ) [ CPF_Edit ]
	int                                                ItemsPerPage;                                     		// 0x0324 ( 0x0004 ) [ CPF_Edit ]
	int                                                CurPos;                                           		// 0x0328 ( 0x0004 ) 
	unsigned long                                      bScrollStyle:1;                                   		// 0x032C ( 0x0004 )  [0x00000001]
	class UGUIScrollZoneBase*                          MyScrollZone;                                     		// 0x0330 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIScrollButtonBase*                        MyIncreaseButton;                                 		// 0x0334 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIScrollButtonBase*                        MyDecreaseButton;                                 		// 0x0338 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIGripButtonBase*                          MyGripButton;                                     		// 0x033C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	struct FScriptDelegate                             __PositionChanged__Delegate;                      		// 0x0340 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __MoveGripBy__Delegate;                           		// 0x0348 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __AlignThumb__Delegate;                           		// 0x0350 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      SetFriendlyLabel ( class UGUILabel* NewLabel );   		//  XInterface.GUIScrollBarBase.SetFriendlyLabel
	 bool                      GripPreDraw ( class UGUIComponent* Sender );      		//  XInterface.GUIScrollBarBase.GripPreDraw
	 void                      Refocus ( class UGUIComponent* Who );             		//  XInterface.GUIScrollBarBase.Refocus
	 void                      AlignThumb (  );                                  		//  XInterface.GUIScrollBarBase.AlignThumb
	 void                      WheelDown (  );                                   		//  XInterface.GUIScrollBarBase.WheelDown
	 void                      WheelUp (  );                                     		//  XInterface.GUIScrollBarBase.WheelUp
	 bool                      IncreaseClick ( class UGUIComponent* Sender );    		//  XInterface.GUIScrollBarBase.IncreaseClick
	 bool                      DecreaseClick ( class UGUIComponent* Sender );    		//  XInterface.GUIScrollBarBase.DecreaseClick
	 void                      MoveGripBy ( int items );                         		//  XInterface.GUIScrollBarBase.MoveGripBy
	 void                      UpdateGripPosition ( float NewPos );              		//  XInterface.GUIScrollBarBase.UpdateGripPosition
	 void                      SetList ( class UGUIListBase* List );             		//  XInterface.GUIScrollBarBase.SetList
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIScrollBarBase.InitComponent
	 void                      PositionChanged ( int NewPos );                   		//  XInterface.GUIScrollBarBase.PositionChanged

	// Public Imports
	UGUIScrollBarBase(class UGUIScrollBarBase const &);
	UGUIScrollBarBase(void);
	class UGUIScrollBarBase &  operator=(class UGUIScrollBarBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  delegateAlignThumb(void);
	void  delegateMoveGripBy(int);
	void  delegatePositionChanged(int);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0058

// Class XInterface.GUIScrollButtonBase
class DLL_IMPORT UGUIScrollButtonBase : public UGUIGFXButton
{
public:
	unsigned long                                      bIncreaseButton:1;                                		// 0x0304 ( 0x0004 )  [0x00000001][ CPF_Edit ]

	// Public Imports
	UGUIScrollButtonBase(class UGUIScrollButtonBase const &);
	class UGUIScrollButtonBase &  operator=(class UGUIScrollButtonBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0004

// Class XInterface.GUIScrollZoneBase
class DLL_IMPORT UGUIScrollZoneBase : public UGUIComponent
{
public:
	struct FScriptDelegate                             __OnScrollZoneClick__Delegate;                    		// 0x02BC ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      InternalOnClick ( class UGUIComponent* Sender );  		//  XInterface.GUIScrollZoneBase.InternalOnClick
	 void                      OnScrollZoneClick ( float Delta );                		//  XInterface.GUIScrollZoneBase.OnScrollZoneClick

	// Public Imports
	UGUIScrollZoneBase(class UGUIScrollZoneBase const &);
	UGUIScrollZoneBase(void);
	class UGUIScrollZoneBase &  operator=(class UGUIScrollZoneBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  delegateOnScrollZoneClick(float);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0008

// Class XInterface.GUIGripButtonBase
class DLL_IMPORT UGUIGripButtonBase : public UGUIGFXButton
{
public:

	// Public Imports
	UGUIGripButtonBase(class UGUIGripButtonBase const &);
	class UGUIGripButtonBase &  operator=(class UGUIGripButtonBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0000

// Class XInterface.GUIComboBox
class DLL_IMPORT UGUIComboBox : public UGUIMultiComponent
{
public:
	unsigned long                                      bReadOnly:1;                                      		// 0x0300 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bValueReadOnly:1;                                 		// 0x0300 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bIgnoreChangeWhenTyping:1;                        		// 0x0300 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bShowListOnFocus:1;                               		// 0x0300 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	int                                                MaxVisibleItems;                                  		// 0x0304 ( 0x0004 ) [ CPF_Edit ]
	int                                                Index;                                            		// 0x0308 ( 0x0004 ) [ CPF_Edit | CPF_EditConst ]
	struct FString                                     TextStr;                                          		// 0x030C ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink ]
	class UGUIList*                                    List;                                             		// 0x0318 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIEditBox*                                 Edit;                                             		// 0x031C ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIScrollButtonBase*                        MyShowListBtn;                                    		// 0x0320 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UGUIListBox*                                 MyListBox;                                        		// 0x0324 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_EditInlineNotify ]
	class UMaterial*                                   GraphicOnShow;                                    		// 0x0328 ( 0x0004 ) 
	class UMaterial*                                   GraphicOnHide;                                    		// 0x032C ( 0x0004 ) 
	struct FScriptDelegate                             __OnShowList__Delegate;                           		// 0x0330 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnHideList__Delegate;                           		// 0x0338 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      FocusLast ( class UGUIComponent* Sender );        		//  XInterface.GUIComboBox.FocusLast
	 bool                      FocusFirst ( class UGUIComponent* Sender );       		//  XInterface.GUIComboBox.FocusFirst
	 void                      LoseFocus ( class UGUIComponent* Sender );        		//  XInterface.GUIComboBox.LoseFocus
	 void                      SetFriendlyLabel ( class UGUILabel* NewLabel );   		//  XInterface.GUIComboBox.SetFriendlyLabel
	 void                      CenterMouse (  );                                 		//  XInterface.GUIComboBox.CenterMouse
	 void                      Clear (  );                                       		//  XInterface.GUIComboBox.Clear
	 void                      InternalOnMousePressed ( class UGUIComponent* Sender, bool bRepeat );		//  XInterface.GUIComboBox.InternalOnMousePressed
	 void                      ReadOnly ( bool B );                              		//  XInterface.GUIComboBox.ReadOnly
	 int                       ItemCount (  );                                   		//  XInterface.GUIComboBox.ItemCount
	 int                       FindIndex ( struct FString Test, bool bExact, bool bExtra, class UObject* obj );		//  XInterface.GUIComboBox.FindIndex
	 int                       FindExtra ( struct FString Text, bool bExact );   		//  XInterface.GUIComboBox.FindExtra
	 struct FString            Find ( struct FString Text, bool bExact, bool bExtra );		//  XInterface.GUIComboBox.Find
	 class UObject*            GetItemObject ( int Index );                      		//  XInterface.GUIComboBox.GetItemObject
	 struct FString            GetItem ( int Index );                            		//  XInterface.GUIComboBox.GetItem
	 void                      RemoveItem ( int Item, int Count );               		//  XInterface.GUIComboBox.RemoveItem
	 void                      AddItem ( struct FString Item, class UObject* Extra, struct FString str );		//  XInterface.GUIComboBox.AddItem
	 int                       GetIndex (  );                                    		//  XInterface.GUIComboBox.GetIndex
	 void                      SetIndex ( int i );                               		//  XInterface.GUIComboBox.SetIndex
	 struct FString            GetExtra (  );                                    		//  XInterface.GUIComboBox.GetExtra
	 class UObject*            GetObject (  );                                   		//  XInterface.GUIComboBox.GetObject
	 struct FString            GetText (  );                                     		//  XInterface.GUIComboBox.GetText
	 struct FString            Get (  );                                         		//  XInterface.GUIComboBox.Get
	 void                      SetExtra ( struct FString NewExtra, bool bListItemsOnly );		//  XInterface.GUIComboBox.SetExtra
	 void                      SetText ( struct FString NewText, bool bListItemsOnly );		//  XInterface.GUIComboBox.SetText
	 void                      TextChanged ( class UGUIComponent* Sender );      		//  XInterface.GUIComboBox.TextChanged
	 void                      ItemChanged ( class UGUIComponent* Sender );      		//  XInterface.GUIComboBox.ItemChanged
	 bool                      ShowListBox ( class UGUIComponent* Sender );      		//  XInterface.GUIComboBox.ShowListBox
	 void                      eventSetVisibility ( bool bIsVisible );           		// [ FUNC_Event ] XInterface.GUIComboBox.SetVisibility
	 void                      HideListBox (  );                                 		//  XInterface.GUIComboBox.HideListBox
	 void                      InternalOnLoadINI ( class UGUIComponent* Sender, struct FString S );		//  XInterface.GUIComboBox.InternalOnLoadINI
	 struct FString            InternalOnSaveINI ( class UGUIComponent* Sender );		//  XInterface.GUIComboBox.InternalOnSaveINI
	 bool                      InternalListClick ( class UGUIComponent* Sender );		//  XInterface.GUIComboBox.InternalListClick
	 void                      InternalEditPressed ( class UGUIComponent* Sender, bool bRepeat );		//  XInterface.GUIComboBox.InternalEditPressed
	 void                      InternalOnInvalidate ( class UGUIComponent* Who );		//  XInterface.GUIComboBox.InternalOnInvalidate
	 void                      InternalListDeActivate (  );                      		//  XInterface.GUIComboBox.InternalListDeActivate
	 bool                      InternalOnKeyEvent ( float Delta, unsigned char* key, unsigned char* State );		//  XInterface.GUIComboBox.InternalOnKeyEvent
	 void                      SetHint ( struct FString NewHint );               		//  XInterface.GUIComboBox.SetHint
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIComboBox.InitComponent
	 void                      OnHideList (  );                                  		//  XInterface.GUIComboBox.OnHideList
	 void                      OnShowList (  );                                  		//  XInterface.GUIComboBox.OnShowList

	// Public Imports
	UGUIComboBox(class UGUIComboBox const &);
	UGUIComboBox(void);
	class UGUIComboBox &  operator=(class UGUIComboBox const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  delegateOnHideList(void);
	void  delegateOnShowList(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0040

// Class XInterface.GUIMenuOption
class DLL_IMPORT UGUIMenuOption : public UGUIMultiComponent
{
public:
	unsigned long                                      bIgnoreChange:1;                                  		// 0x0300 ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_EditConst ]
	unsigned long                                      bValueReadOnly:1;                                 		// 0x0300 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bAutoSizeCaption:1;                               		// 0x0300 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bHeightFromComponent:1;                           		// 0x0300 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bFlipped:1;                                       		// 0x0300 ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned long                                      bSquare:1;                                        		// 0x0300 ( 0x0004 )  [0x00000020][ CPF_Edit ]
	unsigned long                                      bVerticalLayout:1;                                		// 0x0300 ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned char                                      LabelJustification;                               		// 0x0304 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      ComponentJustification;                           		// 0x0305 ( 0x0001 ) [ CPF_Edit ]
	float                                              CaptionWidth;                                     		// 0x0308 ( 0x0004 ) [ CPF_Edit ]
	float                                              ComponentWidth;                                   		// 0x030C ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     Caption;                                          		// 0x0310 ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     ComponentClassName;                               		// 0x031C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     LabelFont;                                        		// 0x0328 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     LabelStyleName;                                   		// 0x0334 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class FColor                                       LabelColor;                                       		// 0x0340 ( 0x0004 ) [ CPF_Edit ]
	class UGUILabel*                                   MyLabel;                                          		// 0x0344 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	class UGUIComponent*                               MyComponent;                                      		// 0x0348 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]

	// UScript Functions
	 void                      SetFriendlyLabel ( class UGUILabel* NewLabel );   		//  XInterface.GUIMenuOption.SetFriendlyLabel
	 void                      CenterMouse (  );                                 		//  XInterface.GUIMenuOption.CenterMouse
	 void                      InternalOnCreateComponent ( class UGUIComponent* NewComp, class UGUIComponent* Sender );		//  XInterface.GUIMenuOption.InternalOnCreateComponent
	 void                      InternalOnChange ( class UGUIComponent* Sender ); 		//  XInterface.GUIMenuOption.InternalOnChange
	 bool                      MenuOptionClicked ( class UGUIComponent* Sender );		//  XInterface.GUIMenuOption.MenuOptionClicked
	 void                      SetCaption ( struct FString NewCaption );         		//  XInterface.GUIMenuOption.SetCaption
	 void                      SetHint ( struct FString NewHint );               		//  XInterface.GUIMenuOption.SetHint
	 void                      SetReadOnly ( bool bValue );                      		//  XInterface.GUIMenuOption.SetReadOnly
	 void                      ResetComponent (  );                              		//  XInterface.GUIMenuOption.ResetComponent
	 struct FString            GetComponentValue (  );                           		//  XInterface.GUIMenuOption.GetComponentValue
	 void                      SetComponentValue ( struct FString NewValue, bool bNoChange );		//  XInterface.GUIMenuOption.SetComponentValue
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIMenuOption.InitComponent

	// Public Imports
	UGUIMenuOption(class UGUIMenuOption const &);
	UGUIMenuOption(void);
	class UGUIMenuOption &  operator=(class UGUIMenuOption const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x004C

// Class XInterface.GUISplitter
class DLL_IMPORT UGUISplitter : public UGUIPanel
{
public:
	unsigned char                                      _0x0310[ 0x3C ];                                  		// 0x0310 ( 0x003C )

	// Public Imports
	UGUISplitter(class UGUISplitter const &);
	UGUISplitter(void);
	class UGUISplitter &  operator=(class UGUISplitter const &);
	static void  InternalConstructor(void *);
	void  SplitterUpdatePositions(void);
	static class UClass *  StaticClass(void);
	void  delegateOnReleaseSplitter(class UGUIComponent *,float);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x003C

// Class XInterface.GUISlider
class DLL_IMPORT UGUISlider : public UGUIComponent
{
public:
	unsigned char                                      _0x02BC[ 0x50 ];                                  		// 0x02BC ( 0x0050 )

	// Public Imports
	UGUISlider(class UGUISlider const &);
	UGUISlider(void);
	class UGUISlider &  operator=(class UGUISlider const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	float  delegateCalcMarkerPosition(void);
	class FString  delegateOnDrawCaption(void);
	unsigned long  delegateOnPreDrawCaption(float &,float &,float &,float &,unsigned char &);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0050

// Class XInterface.GUIImage
class DLL_IMPORT UGUIImage : public UGUIComponent
{
public:
	class UMaterial*                                   Image;                                            		// 0x02BC ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   DropShadow;                                       		// 0x02C0 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       ImageColor;                                       		// 0x02C4 ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      ImageStyle;                                       		// 0x02C8 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      ImageRenderStyle;                                 		// 0x02C9 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      ImageAlign;                                       		// 0x02CA ( 0x0001 ) [ CPF_Edit ]
	int                                                X1;                                               		// 0x02CC ( 0x0004 ) [ CPF_Edit ]
	int                                                Y1;                                               		// 0x02D0 ( 0x0004 ) [ CPF_Edit ]
	int                                                X2;                                               		// 0x02D4 ( 0x0004 ) [ CPF_Edit ]
	int                                                Y2;                                               		// 0x02D8 ( 0x0004 ) [ CPF_Edit ]
	int                                                DropShadowX;                                      		// 0x02DC ( 0x0004 ) [ CPF_Edit ]
	int                                                DropShadowY;                                      		// 0x02E0 ( 0x0004 ) [ CPF_Edit ]
	float                                              BorderOffsets[ 0x04 ];                            		// 0x02E4 ( 0x0010 ) [ CPF_Edit ]
	float                                              X3;                                               		// 0x02F4 ( 0x0004 ) [ CPF_Edit ]
	float                                              y3;                                               		// 0x02F8 ( 0x0004 ) [ CPF_Edit ]

	// UScript Functions
	 struct FString            eventAdditionalDebugString (  );                  		// [ FUNC_Event ] XInterface.GUIImage.AdditionalDebugString

	// Public Imports
	UGUIImage(class UGUIImage const &);
	UGUIImage(void);
	class UGUIImage &  operator=(class UGUIImage const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0040

// Class XInterface.GUISectionBackground
class DLL_IMPORT UGUISectionBackground : public UGUIImage
{
public:
	class UGUIStyles*                                  CaptionStyle;                                     		// 0x02FC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	struct FString                                     CaptionStyleName;                                 		// 0x0300 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	int                                                AltCaptionOffset[ 0x04 ];                         		// 0x030C ( 0x0010 ) [ CPF_Edit ]
	unsigned char                                      AltCaptionAlign;                                  		// 0x031C ( 0x0001 ) [ CPF_Edit ]
	unsigned long                                      bAltCaption:1;                                    		// 0x0320 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bRemapStack:1;                                    		// 0x0320 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bFillClient:1;                                    		// 0x0320 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	class TArray< class UGUIComponent* >               AlignStack;                                       		// 0x0324 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline | CPF_EditInlineNotify ]
	class UMaterial*                                   HeaderTop;                                        		// 0x0330 ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   HeaderBar;                                        		// 0x0334 ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   HeaderBase;                                       		// 0x0338 ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     Caption;                                          		// 0x033C ( 0x000C ) [ CPF_Edit | CPF_Localized | CPF_NeedCtorLink ]
	float                                              ColPadding;                                       		// 0x0348 ( 0x0004 ) [ CPF_Edit ]
	float                                              LeftPadding;                                      		// 0x034C ( 0x0004 ) [ CPF_Edit ]
	float                                              RightPadding;                                     		// 0x0350 ( 0x0004 ) [ CPF_Edit ]
	float                                              TopPadding;                                       		// 0x0354 ( 0x0004 ) [ CPF_Edit ]
	float                                              BottomPadding;                                    		// 0x0358 ( 0x0004 ) [ CPF_Edit ]
	float                                              ImageOffset[ 0x04 ];                              		// 0x035C ( 0x0010 ) [ CPF_Edit ]
	int                                                NumColumns;                                       		// 0x036C ( 0x0004 ) [ CPF_Edit ]
	int                                                MaxPerColumn;                                     		// 0x0370 ( 0x0004 ) [ CPF_Edit ]

	// UScript Functions
	 void                      SetPosition ( float NewLeft, float NewTop, float NewWidth, float NewHeight, bool bRelative );		//  XInterface.GUISectionBackground.SetPosition
	 void                      eventResolutionChanged ( int ResX, int ResY );    		// [ FUNC_Event ] XInterface.GUISectionBackground.ResolutionChanged
	 bool                      InternalPreDraw ( class UCanvas* C );             		//  XInterface.GUISectionBackground.InternalPreDraw
	 void                      Reset (  );                                       		//  XInterface.GUISectionBackground.Reset
	 int                       FindComponentIndex ( class UGUIComponent* Comp ); 		//  XInterface.GUISectionBackground.FindComponentIndex
	 bool                      UnmanageComponent ( class UGUIComponent* Comp );  		//  XInterface.GUISectionBackground.UnmanageComponent
	 bool                      ManageComponent ( class UGUIComponent* Component );		//  XInterface.GUISectionBackground.ManageComponent
	 void                      eventSetVisibility ( bool bIsVisible );           		// [ FUNC_Event ] XInterface.GUISectionBackground.SetVisibility
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUISectionBackground.InitComponent

	// Public Imports
	UGUISectionBackground(class UGUISectionBackground const &);
	UGUISectionBackground(void);
	class UGUISectionBackground &  operator=(class UGUISectionBackground const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0078

// Class XInterface.CoolImage
class DLL_IMPORT UCoolImage : public UGUIComponent
{
public:
	unsigned char                                      _0x02BC[ 0x30 ];                                  		// 0x02BC ( 0x0030 )

	// Public Imports
	UCoolImage(class UCoolImage const &);
	UCoolImage(void);
	class UCoolImage &  operator=(class UCoolImage const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0030

// Class XInterface.GUIProgressBar
class DLL_IMPORT UGUIProgressBar : public UGUIComponent
{
public:
	unsigned char                                      _0x02BC[ 0x58 ];                                  		// 0x02BC ( 0x0058 )

	// Public Imports
	UGUIProgressBar(class UGUIProgressBar const &);
	UGUIProgressBar(void);
	class UGUIProgressBar &  operator=(class UGUIProgressBar const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0058

// Class XInterface.GUIContextMenu
class DLL_IMPORT UGUIContextMenu : public UGUIComponent
{
public:
	class TArray< struct FString >                     ContextItems;                                     		// 0x02BC ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	int                                                ItemIndex;                                        		// 0x02C8 ( 0x0004 ) 
	struct FString                                     SelectionStyleName;                               		// 0x02CC ( 0x000C ) [ CPF_NeedCtorLink ]
	class UGUIStyles*                                  SelectionStyle;                                   		// 0x02D8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                ItemHeight;                                       		// 0x02DC ( 0x0004 ) 
	unsigned long                                      bAutoItemHeight:1;                                		// 0x02E0 ( 0x0004 )  [0x00000001]
	struct FScriptDelegate                             __OnOpen__Delegate;                               		// 0x02E4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnClose__Delegate;                              		// 0x02EC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnSelect__Delegate;                             		// 0x02F4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnContextHitTest__Delegate;                     		// 0x02FC ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      ReplaceItem ( int Index, struct FString NewItem );		//  XInterface.GUIContextMenu.ReplaceItem
	 bool                      RemoveItemByIndex ( int Index );                  		//  XInterface.GUIContextMenu.RemoveItemByIndex
	 bool                      RemoveItemByName ( struct FString ItemName );     		//  XInterface.GUIContextMenu.RemoveItemByName
	 int                       InsertItem ( struct FString NewItem, int Index ); 		//  XInterface.GUIContextMenu.InsertItem
	 int                       AddItem ( struct FString NewItem );               		//  XInterface.GUIContextMenu.AddItem
	 bool                      OnContextHitTest ( float MouseX, float MouseY );  		//  XInterface.GUIContextMenu.OnContextHitTest
	 void                      OnSelect ( class UGUIContextMenu* Sender, int ClickIndex );		//  XInterface.GUIContextMenu.OnSelect
	 bool                      OnClose ( class UGUIContextMenu* Sender );        		//  XInterface.GUIContextMenu.OnClose
	 bool                      OnOpen ( class UGUIContextMenu* Sender );         		//  XInterface.GUIContextMenu.OnOpen

	// Public Imports
	UGUIContextMenu(class UGUIContextMenu const &);
	UGUIContextMenu(void);
	class UGUIContextMenu &  operator=(class UGUIContextMenu const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	unsigned long  delegateOnClose(class UGUIContextMenu *);
	unsigned long  delegateOnContextHitTest(float,float);
	unsigned long  delegateOnOpen(class UGUIContextMenu *);
	void  delegateOnSelect(class UGUIContextMenu *,int);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0048

// Class XInterface.GUIToolTip
class DLL_IMPORT UGUIToolTip : public UGUIComponent
{
public:
	unsigned long                                      bResetPosition:1;                                 		// 0x02BC ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bTrackMouse:1;                                    		// 0x02BC ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bMultiLine:1;                                     		// 0x02BC ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bTrackInput:1;                                    		// 0x02BC ( 0x0004 )  [0x00000008][ CPF_Edit ]
	struct FString                                     Text;                                             		// 0x02C0 ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Lines;                                            		// 0x02CC ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_NeedCtorLink ]
	float                                              StartTime;                                        		// 0x02D8 ( 0x0004 ) [ CPF_Edit | CPF_NoExport ]
	float                                              CurrentTime;                                      		// 0x02DC ( 0x0004 ) [ CPF_Edit | CPF_NoExport ]
	float                                              MaxWidth;                                         		// 0x02E0 ( 0x0004 ) [ CPF_Edit | CPF_Config | CPF_GlobalConfig ]
	float                                              InitialDelay;                                     		// 0x02E4 ( 0x0004 ) [ CPF_Edit | CPF_Config | CPF_GlobalConfig ]
	float                                              ExpirationSeconds;                                		// 0x02E8 ( 0x0004 ) [ CPF_Edit | CPF_Config | CPF_GlobalConfig ]
	struct FScriptDelegate                             __EnterArea__Delegate;                            		// 0x02EC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __LeaveArea__Delegate;                            		// 0x02F4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __Tick__Delegate;                                 		// 0x02FC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __ShowToolTip__Delegate;                          		// 0x0304 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __HideToolTip__Delegate;                          		// 0x030C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __GetLeft__Delegate;                              		// 0x0314 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __GetTop__Delegate;                               		// 0x031C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __GetWidth__Delegate;                             		// 0x0324 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __GetHeight__Delegate;                            		// 0x032C ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      SetTip ( struct FString NewTip );                 		// [ FUNC_Final | FUNC_Native ] XInterface.GUIToolTip.SetTip
	 float                     GetTopBelowCursor ( class UCanvas* C );           		//  XInterface.GUIToolTip.GetTopBelowCursor
	 float                     GetTopAboveCursor ( class UCanvas* C );           		//  XInterface.GUIToolTip.GetTopAboveCursor
	 float                     GetHeight ( class UCanvas* C );                   		//  XInterface.GUIToolTip.GetHeight
	 float                     GetWidth ( class UCanvas* C );                    		//  XInterface.GUIToolTip.GetWidth
	 float                     GetTop ( class UCanvas* C );                      		//  XInterface.GUIToolTip.GetTop
	 float                     GetLeft ( class UCanvas* C );                     		//  XInterface.GUIToolTip.GetLeft
	 void                      eventUpdatePosition ( class UCanvas* C );         		// [ FUNC_Event ] XInterface.GUIToolTip.UpdatePosition
	 void                      HideToolTip (  );                                 		//  XInterface.GUIToolTip.HideToolTip
	 void                      ShowToolTip (  );                                 		//  XInterface.GUIToolTip.ShowToolTip
	 void                      Tick ( float RealSeconds );                       		//  XInterface.GUIToolTip.Tick
	 bool                      InternalLeaveArea (  );                           		//  XInterface.GUIToolTip.InternalLeaveArea
	 bool                      LeaveArea (  );                                   		//  XInterface.GUIToolTip.LeaveArea
	 class UGUIToolTip*        InternalEnterArea (  );                           		//  XInterface.GUIToolTip.InternalEnterArea
	 class UGUIToolTip*        EnterArea (  );                                   		//  XInterface.GUIToolTip.EnterArea

	// Public Imports
	UGUIToolTip(class UGUIToolTip const &);
	UGUIToolTip(void);
	class UGUIToolTip &  operator=(class UGUIToolTip const &);
	static void  InternalConstructor(void *);
	void  SetTip(class FString &);
	static class UClass *  StaticClass(void);
	class UGUIToolTip *  delegateEnterArea(void);
	float  delegateGetHeight(class UCanvas *);
	float  delegateGetLeft(class UCanvas *);
	float  delegateGetTop(class UCanvas *);
	float  delegateGetWidth(class UCanvas *);
	void  delegateHideToolTip(void);
	unsigned long  delegateLeaveArea(void);
	void  delegateShowToolTip(void);
	void  delegateTick(float);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0078

// Class XInterface.StateButton
class DLL_IMPORT UStateButton : public UGUIButton
{
public:
	unsigned char                                      _0x02F4[ 0x18 ];                                  		// 0x02F4 ( 0x0018 )

	// Public Imports
	UStateButton(class UStateButton const &);
	UStateButton(void);
	class UStateButton &  operator=(class UStateButton const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0018

// Class XInterface.GUIController
class DLL_IMPORT UGUIController : public UBaseGUIController
{
public:
	class UGUIPage*                                    SaveFadeOutPage;                                  		// 0x0070 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bSaveCancelled:1;                                 		// 0x0074 ( 0x0004 )  [0x00000001]
	class UBTTcpLink_Channel*                          TcpHandler;                                       		// 0x0078 ( 0x0004 ) 
	int                                                FONT_NUM;                                         		// 0x007C ( 0x0004 ) [ CPF_Const ]
	int                                                STYLE_NUM;                                        		// 0x0080 ( 0x0004 ) [ CPF_Const ]
	int                                                CURSOR_NUM;                                       		// 0x0084 ( 0x0004 ) [ CPF_Const ]
	class TArray< struct FProfileStruct >              Profilers;                                        		// 0x0088 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FFloatBox                                   MouseCursorBounds;                                		// 0x0094 ( 0x0010 ) [ CPF_Const ]
	class TArray< struct FVector >                     MouseCursorOffset;                                		// 0x00A4 ( 0x000C ) [ CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UGUIPage* >                    MenuStack;                                        		// 0x00B0 ( 0x000C ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UGUIPage* >                    PersistentStack;                                  		// 0x00BC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UGUIFont* >                    FontStack;                                        		// 0x00C8 ( 0x000C ) [ CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UGUIStyles* >                  StyleStack;                                       		// 0x00D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UMaterial* >                   MouseCursors;                                     		// 0x00E0 ( 0x000C ) [ CPF_NeedCtorLink | CPF_EditInline ]
	class TArray< class UMaterial* >                   ImageList;                                        		// 0x00EC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     DefaultStyleNames;                                		// 0x00F8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     StyleNames;                                       		// 0x0104 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FAutoLoadMenu >               AutoLoad;                                         		// 0x0110 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FRestoreMenuItem >            RestoreMenus;                                     		// 0x011C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FDesignModeHint >             DesignModeHints;                                  		// 0x0128 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              MenuMouseSens;                                    		// 0x0134 ( 0x0004 ) 
	float                                              MouseX;                                           		// 0x0138 ( 0x0004 ) 
	float                                              MouseY;                                           		// 0x013C ( 0x0004 ) 
	float                                              LastMouseX;                                       		// 0x0140 ( 0x0004 ) 
	float                                              LastMouseY;                                       		// 0x0144 ( 0x0004 ) 
	float                                              DblClickWindow;                                   		// 0x0148 ( 0x0004 ) 
	float                                              LastClickTime;                                    		// 0x014C ( 0x0004 ) 
	float                                              ButtonRepeatDelay;                                		// 0x0150 ( 0x0004 ) 
	float                                              RepeatDelta;                                      		// 0x0154 ( 0x0004 ) 
	float                                              RepeatTime;                                       		// 0x0158 ( 0x0004 ) 
	float                                              CursorFade;                                       		// 0x015C ( 0x0004 ) 
	float                                              FastCursorFade;                                   		// 0x0160 ( 0x0004 ) 
	int                                                MaxSimultaneousPings;                             		// 0x0164 ( 0x0004 ) 
	int                                                FastCursorStep;                                   		// 0x0168 ( 0x0004 ) 
	int                                                ResX;                                             		// 0x016C ( 0x0004 ) [ CPF_Const ]
	int                                                ResY;                                             		// 0x0170 ( 0x0004 ) [ CPF_Const ]
	int                                                LastClickX;                                       		// 0x0174 ( 0x0004 ) 
	int                                                LastClickY;                                       		// 0x0178 ( 0x0004 ) 
	int                                                CursorStep;                                       		// 0x017C ( 0x0004 ) 
	void*                                              Designer;                                         		// 0x0180 ( 0x0004 ) [ CPF_Const | CPF_Transient ]
	void*                                              PawnDesigner;                                     		// 0x0184 ( 0x0004 ) [ CPF_Const | CPF_Transient ]
	void*                                              WeaponDesigner;                                   		// 0x0188 ( 0x0004 ) [ CPF_Const | CPF_Transient ]
	class USound*                                      MouseOverSound;                                   		// 0x018C ( 0x0004 ) 
	class USound*                                      ClickSound;                                       		// 0x0190 ( 0x0004 ) 
	class USound*                                      EditSound;                                        		// 0x0194 ( 0x0004 ) 
	class USound*                                      UpSound;                                          		// 0x0198 ( 0x0004 ) 
	class USound*                                      DownSound;                                        		// 0x019C ( 0x0004 ) 
	class USound*                                      DragSound;                                        		// 0x01A0 ( 0x0004 ) 
	class USound*                                      FadeSound;                                        		// 0x01A4 ( 0x0004 ) 
	class USound*                                      ItemEquipSuccessSound;                            		// 0x01A8 ( 0x0004 ) 
	class USound*                                      ItemEquipFailSound;                               		// 0x01AC ( 0x0004 ) 
	class USound*                                      ItemTakeoffSound;                                 		// 0x01B0 ( 0x0004 ) 
	class USound*                                      ItemAddPartsSound;                                		// 0x01B4 ( 0x0004 ) 
	class USound*                                      ItemRepairSound;                                  		// 0x01B8 ( 0x0004 ) 
	class USound*                                      ItemClickSound;                                   		// 0x01BC ( 0x0004 ) 
	class USound*                                      ItemBuySound;                                     		// 0x01C0 ( 0x0004 ) 
	class USound*                                      ItemSellSound;                                    		// 0x01C4 ( 0x0004 ) 
	class USound*                                      TrophyWindowSound;                                		// 0x01C8 ( 0x0004 ) 
	class USound*                                      TrophyReceiverUserSound;                          		// 0x01CC ( 0x0004 ) 
	class UGUIPage*                                    ActivePage;                                       		// 0x01D0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               FocusedControl;                                   		// 0x01D4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               ActiveControl;                                    		// 0x01D8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               SkipControl;                                      		// 0x01DC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline | CPF_Deprecated ]
	class UGUIComponent*                               MoveControl;                                      		// 0x01E0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               DropSource;                                       		// 0x01E4 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               DropTarget;                                       		// 0x01E8 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIContextMenu*                             ContextMenu;                                      		// 0x01EC ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIToolTip*                                 MouseOver;                                        		// 0x01F0 ( 0x0004 ) [ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	class UMaterial*                                   WhiteBorder;                                      		// 0x01F4 ( 0x0004 ) 
	struct FString                                     GameResolution;                                   		// 0x01F8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     LastGameType;                                     		// 0x0204 ( 0x000C ) [ CPF_Transient | CPF_NeedCtorLink ]
	struct FString                                     RequestDataMenu;                                  		// 0x0210 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ArrayPropertyMenu;                                		// 0x021C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     DynArrayPropertyMenu;                             		// 0x0228 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     FilterMenu;                                       		// 0x0234 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     MapVotingMenu;                                    		// 0x0240 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     KickVotingMenu;                                   		// 0x024C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     MatchSetupMenu;                                   		// 0x0258 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     EditFavoriteMenu;                                 		// 0x0264 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     MainMenuOptions;                                  		// 0x0270 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     DesignerMenu;                                     		// 0x027C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      RepeatKey;                                        		// 0x0288 ( 0x0001 ) 
	unsigned long                                      bIgnoreNextRelease:1;                             		// 0x028C ( 0x0004 )  [0x00000001]
	unsigned long                                      ShiftPressed:1;                                   		// 0x028C ( 0x0004 )  [0x00000002]
	unsigned long                                      AltPressed:1;                                     		// 0x028C ( 0x0004 )  [0x00000004]
	unsigned long                                      CtrlPressed:1;                                    		// 0x028C ( 0x0004 )  [0x00000008]
	unsigned long                                      bModulateStackedMenus:1;                          		// 0x028C ( 0x0004 )  [0x00000010]
	unsigned long                                      bQuietMenu:1;                                     		// 0x028C ( 0x0004 )  [0x00000020]
	unsigned long                                      bNoToolTips:1;                                    		// 0x028C ( 0x0004 )  [0x00000040]
	unsigned long                                      bDesignModeToolTips:1;                            		// 0x028C ( 0x0004 )  [0x00000080]
	unsigned long                                      bAutoRefreshBrowser:1;                            		// 0x028C ( 0x0004 )  [0x00000100]
	unsigned long                                      bModAuthor:1;                                     		// 0x028C ( 0x0004 )  [0x00000200]
	unsigned long                                      bExpertMode:1;                                    		// 0x028C ( 0x0004 )  [0x00000400]
	unsigned long                                      bDesignMode:1;                                    		// 0x028C ( 0x0004 )  [0x00000800]
	unsigned long                                      bInteractiveMode:1;                               		// 0x028C ( 0x0004 )  [0x00001000]
	unsigned long                                      bHighlightCurrent:1;                              		// 0x028C ( 0x0004 )  [0x00002000]
	unsigned long                                      bDrawFullPaths:1;                                 		// 0x028C ( 0x0004 )  [0x00004000]
	unsigned long                                      MainNotWanted:1;                                  		// 0x028C ( 0x0004 )  [0x00008000]
	unsigned long                                      bCurMenuInitialized:1;                            		// 0x028C ( 0x0004 )  [0x00010000]
	unsigned long                                      bForceMouseCheck:1;                               		// 0x028C ( 0x0004 )  [0x00020000]
	unsigned long                                      bIgnoreUntilPress:1;                              		// 0x028C ( 0x0004 )  [0x00040000]
	unsigned long                                      bSnapCursor:1;                                    		// 0x028C ( 0x0004 )  [0x00080000]
	float                                              RenderDelta;                                      		// 0x0290 ( 0x0004 ) 
	float                                              LastRenderTime;                                   		// 0x0294 ( 0x0004 ) 
	unsigned long                                      bFixedMouseSize:1;                                		// 0x0298 ( 0x0004 )  [0x00000001]
	unsigned char                                      KeyDown[ 0xFF ];                                  		// 0x029C ( 0x00FF ) [ CPF_Const ]
	class TArray< class UClass* >                      RegisteredClasses;                                		// 0x039C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bECEEdition:1;                                    		// 0x03A8 ( 0x0004 )  [0x00000001]
	int                                                iTempWeaponId;                                    		// 0x03AC ( 0x0004 ) 
	class TArray< class UGUIPage* >                    SavedPage;                                        		// 0x03B0 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnNeedRawKeyPress__Delegate;                    		// 0x03BC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __AddBuddy__Delegate;                             		// 0x03C4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __PressedCloseWndBtn__Delegate;                   		// 0x03CC ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 class UGUIQuestionPage*   ShowQuestionDialog ( struct FString Question, unsigned char Buttons, unsigned char defButton );		//  XInterface.GUIController.ShowQuestionDialog
	 bool                      KeyPressed ( unsigned char iKey );                		// [ FUNC_Final ] XInterface.GUIController.KeyPressed
	 bool                      SearchBinds ( struct FString BindAliasMask, class TArray< struct FString >* BindAliases );		// [ FUNC_Final ] XInterface.GUIController.SearchBinds
	 bool                      GetAssignedKeys ( struct FString BindAlias, class TArray< struct FString >* BindKeyNames, class TArray< struct FString >* LocalizedBindKeyNames );		// [ FUNC_Final ] XInterface.GUIController.GetAssignedKeys
	 bool                      GetCurrentBind ( struct FString BindKeyName, struct FString* BindKeyValue );		// [ FUNC_Final ] XInterface.GUIController.GetCurrentBind
	 bool                      KeyNameFromIndex ( unsigned char iKey, struct FString* KeyName, struct FString* LocalizedKeyName );		// [ FUNC_Final ] XInterface.GUIController.KeyNameFromIndex
	 bool                      SetKeyBind ( struct FString BindKeyName, struct FString BindKeyValue );		// [ FUNC_Final ] XInterface.GUIController.SetKeyBind
	 struct FString            GetQuitPage (  );                                 		//  XInterface.GUIController.GetQuitPage
	 struct FString            GetSettingsPage (  );                             		//  XInterface.GUIController.GetSettingsPage
	 struct FString            GetModPage (  );                                  		//  XInterface.GUIController.GetModPage
	 struct FString            GetInstantActionPage (  );                        		//  XInterface.GUIController.GetInstantActionPage
	 struct FString            GetMultiplayerPage (  );                          		//  XInterface.GUIController.GetMultiplayerPage
	 struct FString            GetServerBrowserPage (  );                        		//  XInterface.GUIController.GetServerBrowserPage
	 struct FString            GetSinglePlayerPage (  );                         		//  XInterface.GUIController.GetSinglePlayerPage
	 struct FString            GetMainMenuClass (  );                            		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.GetMainMenuClass
	 void                      eventValidate (  );                               		// [ FUNC_Event ] XInterface.GUIController.Validate
	 void                      ConsolidateMenus (  );                            		//  XInterface.GUIController.ConsolidateMenus
	 void                      PurgeComponentClasses (  );                       		//  XInterface.GUIController.PurgeComponentClasses
	 void                      PurgeObjectReferences (  );                       		//  XInterface.GUIController.PurgeObjectReferences
	 void                      VerifyStack (  );                                 		//  XInterface.GUIController.VerifyStack
	 void                      CloseOverlays (  );                               		//  XInterface.GUIController.CloseOverlays
	 void                      eventNotifyLevelChange (  );                      		// [ FUNC_Event ] XInterface.GUIController.NotifyLevelChange
	 void                      eventSetRequiredGameResolution ( struct FString GameRes );		// [ FUNC_Event ] XInterface.GUIController.SetRequiredGameResolution
	 bool                      eventNeedsMenuResolution (  );                    		// [ FUNC_Event ] XInterface.GUIController.NeedsMenuResolution
	 bool                      eventCanShowHints (  );                           		// [ FUNC_Event ] XInterface.GUIController.CanShowHints
////	 bool                      HasMouseMoved ( float ErrorMargin );              		//  XInterface.GUIController.HasMouseMoved
	 void                      eventMoveFocused ( class UGUIComponent* C, int bmLeft, int bmTop, int bmWidth, int bmHeight, float ClipX, float ClipY, float val );		// [ FUNC_Event ] XInterface.GUIController.MoveFocused
	 void                      ResetFocus (  );                                  		//  XInterface.GUIController.ResetFocus
	 void                      eventChangeFocus ( class UGUIComponent* Who );    		// [ FUNC_Event ] XInterface.GUIController.ChangeFocus
	 void                      SetControllerStatus ( bool On );                  		//  XInterface.GUIController.SetControllerStatus
	 void                      PerformRestore (  );                              		//  XInterface.GUIController.PerformRestore
	 void                      SaveRestorePages (  );                            		//  XInterface.GUIController.SaveRestorePages
	 int                       Count (  );                                       		//  XInterface.GUIController.Count
	 void                      eventCloseAll ( bool bCancel, bool bForced );     		// [ FUNC_Event ] XInterface.GUIController.CloseAll
	 bool                      ClickCloseWndBtn (  );                            		//  XInterface.GUIController.ClickCloseWndBtn
	 void                      PressedCloseWndBtn (  );                          		//  XInterface.GUIController.PressedCloseWndBtn
	 bool                      eventCloseMenu ( bool bCancelled );               		// [ FUNC_Event ] XInterface.GUIController.CloseMenu
	 bool                      eventRemoveMenu ( class UGUIPage* Menu, bool bCancelled );		// [ FUNC_Event ] XInterface.GUIController.RemoveMenu
	 bool                      RemoveMenuAt ( int Index, bool bCancelled );      		//  XInterface.GUIController.RemoveMenuAt
	 void                      eventPopMenu ( int Index, class UGUIPage* CurMenu, bool bCancelled );		// [ FUNC_Event ] XInterface.GUIController.PopMenu
	 void                      eventPushMenu ( int Index, class UGUIPage* NewMenu, struct FString Param1, struct FString Param2 );		// [ FUNC_Event ] XInterface.GUIController.PushMenu
	 void                      ReplaceMenu2 ( struct FString NewMenuName, bool bCancelled );		//  XInterface.GUIController.ReplaceMenu2
	 void                      ReplaceMenu2_FadedOut (  );                       		//  XInterface.GUIController.ReplaceMenu2_FadedOut
	 void                      CloseMenuPage ( class UGUIPage* SelectPage, bool bCancelled );		//  XInterface.GUIController.CloseMenuPage
	 bool                      eventReplaceMenu ( struct FString NewMenuName, struct FString Param1, struct FString Param2, bool bCancelled );		// [ FUNC_Event ] XInterface.GUIController.ReplaceMenu
	 void                      eventAutoLoadMenus (  );                          		// [ FUNC_Event ] XInterface.GUIController.AutoLoadMenus
	 bool                      OpenMenuByObject ( class UGUIPage* NewMenu, struct FString Param1, struct FString Param2 );		//  XInterface.GUIController.OpenMenuByObject
	 bool                      eventOpenMenu ( struct FString NewMenuName, struct FString Param1, struct FString Param2 );		// [ FUNC_Event ] XInterface.GUIController.OpenMenu
	 class UGUIPage*           eventCreateMenu ( struct FString NewMenuName );   		// [ FUNC_Event ] XInterface.GUIController.CreateMenu
	 class UGUIPage*           GetLastMenu (  );                                 		//  XInterface.GUIController.GetLastMenu
	 void                      LogControlInfo ( class UGUIComponent* Sender );   		//  XInterface.GUIController.LogControlInfo
	 void                      LogControllerInfo (  );                           		//  XInterface.GUIController.LogControllerInfo
	 void                      LogMenuStack (  );                                		//  XInterface.GUIController.LogMenuStack
	 class UGUIPage*           GetMenuByIndex ( int Index );                     		//  XInterface.GUIController.GetMenuByIndex
	 class UGUIPage*           FindMenuByClass ( class UClass* PageClass );      		//  XInterface.GUIController.FindMenuByClass
	 class UGUIPage*           FindPersistentMenuByClass ( class UClass* PageClass );		//  XInterface.GUIController.FindPersistentMenuByClass
	 int                       eventFindPersistentMenuIndex ( class UGUIPage* Menu );		// [ FUNC_Event ] XInterface.GUIController.FindPersistentMenuIndex
	 int                       eventFindMenuIndex ( class UGUIPage* Menu );      		// [ FUNC_Event ] XInterface.GUIController.FindMenuIndex
	 int                       eventFindMenuIndexByName ( struct FString MenuClass );		// [ FUNC_Event ] XInterface.GUIController.FindMenuIndexByName
	 class UGUIPage*           eventFindPersistentMenuByName ( struct FString MenuClass );		// [ FUNC_Event ] XInterface.GUIController.FindPersistentMenuByName
	 class UClass*             eventAddComponentClass ( struct FString ClassName );		// [ FUNC_Event ] XInterface.GUIController.AddComponentClass
	 bool                      RegisterStyle ( class UClass* StyleClass, bool bTemporary );		//  XInterface.GUIController.RegisterStyle
	 void                      PrecachePlayerRecords (  );                       		//  XInterface.GUIController.PrecachePlayerRecords
	 void                      eventInitializeController (  );                   		// [ FUNC_Event ] XInterface.GUIController.InitializeController
	 class UGUIPage*           TopPage (  );                                     		//  XInterface.GUIController.TopPage
	 void                      GetTeamSymbolList ( bool bNoSinglePlayer, class TArray< struct FString >* SymbolNames );		// [ FUNC_Final ] XInterface.GUIController.GetTeamSymbolList
	 struct FString            LoadDecoText ( struct FString PackageName, struct FString DecoTextName );		//  XInterface.GUIController.LoadDecoText
	 bool                      CheckForECE (  );                                 		// [ FUNC_Native ] XInterface.GUIController.CheckForECE
	 bool                      AuthroizeFirewall (  );                           		// [ FUNC_Native ] XInterface.GUIController.AuthroizeFirewall
	 bool                      CheckFirewall (  );                               		// [ FUNC_Native ] XInterface.GUIController.CheckFirewall
	 void                      LaunchURL ( struct FString URL );                 		// [ FUNC_Native ] XInterface.GUIController.LaunchURL
	 void                      GetMapList ( struct FString Prefix, class UGUIList* List, bool bDecoText );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.GetMapList
	 void                      GetWeaponList ( class TArray< class UClass* >* WeaponClass, class TArray< struct FString >* WeaponDesc );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.GetWeaponList
	 void                      SaveOwnageList ( class TArray< struct FeOwnageMap > Maps );		// [ FUNC_Native ] XInterface.GUIController.SaveOwnageList
	 void                      GetOwnageList ( class TArray< int >* RLevel, class TArray< struct FString >* MNames, class TArray< struct FString >* MDesc, class TArray< struct FString >* mURL );		// [ FUNC_Native ] XInterface.GUIController.GetOwnageList
	 bool                      GetDEMHeader ( struct FString DemoName, struct FString* MapName, struct FString* GameType, int* ScoreLimit, int* TimeLimit, int* ClientSide, struct FString* RecordedBy, struct FString* TimeStamp, struct FString* ReqPackages );		// [ FUNC_Native ] XInterface.GUIController.GetDEMHeader
	 void                      GetDEMList ( class TArray< struct FString >* DEMFiles );		// [ FUNC_Native ] XInterface.GUIController.GetDEMList
	 void                      Profile ( struct FString ProfileName );           		// [ FUNC_Native ] XInterface.GUIController.Profile
//	 void                      SetMoveControl ( class UGUIComponent* C );        		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.SetMoveControl
	 void                      PlayInterfaceSound ( unsigned char soundType );   		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.PlayInterfaceSound
	 void                      GetOGGList ( class TArray< struct FString >* OGGFiles );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.GetOGGList
	 void                      ResetKeyboard (  );                               		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.ResetKeyboard
	 void                      GetProfileList ( struct FString Prefix, class TArray< struct FString >* ProfileList );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.GetProfileList
	 void                      ResetInput (  );                                  		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.ResetInput
//	 void                      ResetDesigner (  );                               		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.ResetDesigner
	 bool                      SetRenderDevice ( struct FString NewRenderDevice );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.SetRenderDevice
	 struct FString            GetCurrentRes (  );                               		// [ FUNC_Final | FUNC_Native ] XInterface.GUIController.GetCurrentRes
	 class UGUIStyles*         eventGetStyle ( struct FString StyleName, unsigned char* FontScale );		// [ FUNC_Event | FUNC_Native ] XInterface.GUIController.GetStyle
	 class UGUIFont*           eventGetMenuFont ( struct FString FontName );     		// [ FUNC_Event | FUNC_Native ] XInterface.GUIController.GetMenuFont
	 void                      AddBuddy ( struct FString NewBuddyName );         		//  XInterface.GUIController.AddBuddy
	 bool                      OnNeedRawKeyPress ( unsigned char NewKey );       		//  XInterface.GUIController.OnNeedRawKeyPress
	 void                      PopPage (  );                                     		//  XInterface.GUIController.PopPage
	 void                      PushPage (  );                                    		//  XInterface.GUIController.PushPage

	// Public Imports
	UGUIController(class UGUIController const &);
	UGUIController(void);
	class UGUIController &  operator=(class UGUIController const &);
	void  CreatePropertyWindow(unsigned char);
	int  DesignKeyEvent(unsigned char,unsigned char,float);
	int  DesignerVisible(unsigned char);
	void  FocusToPropertyWindow(unsigned char,bool);
	void  GetCursorPos(int &,int &);
	int  HasMouseMoved(float);
	void  HidePropertyWindow(void);
	static void  InternalConstructor(void *);
	void  PlayComponentSound(unsigned char);
	void  PlayInterfaceSound(class USound *);
	void  Profile(class FString &);
	void  RenderDesignMode(class UCanvas *);
	void  ResetDesigner(void);
	void  SetMoveControl(class UGUIComponent *);
	int  ShowProperties(class UGUIComponent *,unsigned char);
	static class UClass *  StaticClass(void);
	class UGUIComponent *  UnderCursor(float,float);
	void  delegateAddBuddy(class FString const &);
	unsigned long  delegateOnNeedRawKeyPress(unsigned char);
	void  delegatePressedCloseWndBtn(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0364

// Class XInterface.GUIFont
class DLL_IMPORT UGUIFont : public UGUI
{
public:
	struct FString                                     KeyName;                                          		// 0x0054 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	unsigned long                                      bFixedSize:1;                                     		// 0x0060 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bScaled:1;                                        		// 0x0060 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	int                                                NormalXRes;                                       		// 0x0064 ( 0x0004 ) [ CPF_Edit ]
	int                                                FallBackRes;                                      		// 0x0068 ( 0x0004 ) [ CPF_Edit ]
	class TArray< struct FString >                     FontArrayNames;                                   		// 0x006C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class TArray< class UFont* >                       FontArrayFonts;                                   		// 0x0078 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]

	// UScript Functions
	 class UFont*              LoadFont ( int i );                               		//  XInterface.GUIFont.LoadFont
	 class UFont*              LoadFontStatic ( int i );                         		//  XInterface.GUIFont.LoadFontStatic
	 class UFont*              eventGetFont ( int XRes );                        		// [ FUNC_Event | FUNC_Native ] XInterface.GUIFont.GetFont

	// Public Imports
	UGUIFont(class UGUIFont const &);
	class UGUIFont &  operator=(class UGUIFont const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0030

// Class XInterface.GUIStyles
class DLL_IMPORT UGUIStyles : public UGUI
{
public:
	struct FString                                     KeyName;                                          		// 0x0054 ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_NeedCtorLink ]
	struct FString                                     AlternateKeyName[ 0x02 ];                         		// 0x0060 ( 0x0018 ) [ CPF_Edit | CPF_Const | CPF_NeedCtorLink ]
	struct FString                                     FontNames[ 0x0F ];                                		// 0x0078 ( 0x00B4 ) [ CPF_Edit | CPF_NeedCtorLink | CPF_NoExport ]
	class UGUIFont*                                    Fonts[ 0x0F ];                                    		// 0x012C ( 0x003C ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_NoExport | CPF_EditInline ]
	int                                                FontSizes[ 0x05 ];                                		// 0x0168 ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	class FColor                                       FontColors[ 0x05 ];                               		// 0x017C ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	class FColor                                       FontBKColors[ 0x05 ];                             		// 0x0190 ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	class FColor                                       FontShadowColor[ 0x05 ];                          		// 0x01A4 ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	int                                                FontShadowOffset[ 0x05 ];                         		// 0x01B8 ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	class FColor                                       ImgColors[ 0x05 ];                                		// 0x01CC ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	unsigned char                                      RStyles[ 0x05 ];                                  		// 0x01E0 ( 0x0005 ) [ CPF_Edit | CPF_NoExport ]
	class UMaterial*                                   Images[ 0x05 ];                                   		// 0x01E8 ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	unsigned char                                      ImgStyle[ 0x05 ];                                 		// 0x01FC ( 0x0005 ) [ CPF_Edit | CPF_NoExport ]
	float                                              ImgWidths[ 0x05 ];                                		// 0x0204 ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	float                                              ImgHeights[ 0x05 ];                               		// 0x0218 ( 0x0014 ) [ CPF_Edit | CPF_NoExport ]
	int                                                BorderOffsets[ 0x04 ];                            		// 0x022C ( 0x0010 ) [ CPF_Edit | CPF_NoExport ]
	unsigned long                                      bTemporary:1;                                     		// 0x023C ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_NoExport ]
	struct FScriptDelegate                             __OnDraw__Delegate;                               		// 0x0240 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnDrawText__Delegate;                           		// 0x0248 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      eventInitialize (  );                             		// [ FUNC_Event ] XInterface.GUIStyles.Initialize
	 void                      btrDrawTextStyles ( class UCanvas* Canvas, unsigned char MenuState, float Left, float Top, float width, float Height, unsigned char Align, struct FString Text, unsigned char FontScale, int FontSize, float R, float G, float B, float A );		// [ FUNC_Native ] XInterface.GUIStyles.btrDrawTextStyles
	 void                      btrTextSizeStyles ( class UCanvas* Canvas, unsigned char MenuState, struct FString Text, unsigned char FontScale, int FontSize, float* XL, float* YL );		// [ FUNC_Native ] XInterface.GUIStyles.btrTextSizeStyles
	 void                      TextSize ( class UCanvas* Canvas, unsigned char MenuState, struct FString Text, unsigned char FontScale, float* XL, float* YL );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIStyles.TextSize
	 void                      DrawText ( class UCanvas* Canvas, unsigned char MenuState, float Left, float Top, float width, float Height, unsigned char Align, struct FString Text, unsigned char FontScale );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIStyles.DrawText
//	 void                      Draw ( class UCanvas* Canvas, unsigned char MenuState, float Left, float Top, float width, float Height );		// [ FUNC_Final | FUNC_Native ] XInterface.GUIStyles.Draw
	 bool                      OnDrawText ( class UCanvas* Canvas, unsigned char MenuState, float Left, float Top, float width, float Height, unsigned char Align, struct FString Text, unsigned char FontScale );		//  XInterface.GUIStyles.OnDrawText
	 bool                      OnDraw ( class UCanvas* Canvas, unsigned char MenuState, float Left, float Top, float width, float Height );		//  XInterface.GUIStyles.OnDraw

	// Public Imports
	UGUIStyles(class UGUIStyles const &);
	UGUIStyles(void);
	class UGUIStyles &  operator=(class UGUIStyles const &);
	void  Draw(class UCanvas *,unsigned char,float,float,float,float);
	void  DrawTextW(class UCanvas *,unsigned char,float,float,float,float,unsigned char,unsigned short const *,unsigned char);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  TextSize(class UCanvas *,unsigned char,unsigned short const *,float &,float &,unsigned char);
	void  btrDrawTextStyles(class UCanvas *,unsigned char,float,float,float,float,unsigned char,unsigned short const *,unsigned char);
	void  btrTextSizeStyles(class UCanvas *,unsigned char,unsigned short const *,float &,float &,unsigned char,int);
	unsigned long  delegateOnDraw(class UCanvas *,unsigned char,float,float,float,float);
	unsigned long  delegateOnDrawText(class UCanvas *,unsigned char,float,float,float,float,unsigned char,class FString const &,unsigned char);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x01FC

// Class XInterface.PropertyManagerBase
class DLL_IMPORT UPropertyManagerBase : public UObject
{
public:
	unsigned char                                      _0x002C[ 0x04 ];                                  		// 0x002C ( 0x0004 )

	// Public Imports
	UPropertyManagerBase(class UPropertyManagerBase const &);
	UPropertyManagerBase(void);
	class UPropertyManagerBase &  operator=(class UPropertyManagerBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0004

// Class XInterface.UT2MenuFont
class DLL_IMPORT UUT2MenuFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2DefaultFont
class DLL_IMPORT UUT2DefaultFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2LargeFont
class DLL_IMPORT UUT2LargeFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2HeaderFont
class DLL_IMPORT UUT2HeaderFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2SmallFont
class DLL_IMPORT UUT2SmallFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2MidGameFont
class DLL_IMPORT UUT2MidGameFont : public UGUIFont
{
public:
	int                                                FontScreenWidth[ 0x07 ];                          		// 0x0084 ( 0x001C ) 

	// UScript Functions
	 class UFont*              eventGetFont ( int XRes );                        		// [ FUNC_Event ] XInterface.UT2MidGameFont.GetFont
	 class UFont*              GetMidGameFont ( int XRes );                      		//  XInterface.UT2MidGameFont.GetMidGameFont
}; // Size: 0x001C

// Class XInterface.UT2SmallHeaderFont
class DLL_IMPORT UUT2SmallHeaderFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2ServerListFont
class DLL_IMPORT UUT2ServerListFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2IRCFont
class DLL_IMPORT UUT2IRCFont : public UGUIFont
{
public:
}; // Size: 0x0000

// Class XInterface.UT2K4GUIPage
class DLL_IMPORT UUT2K4GUIPage : public UGUIPage
{
public:
	class USound*                                      PopInSound;                                       		// 0x0354 ( 0x0004 ) 
	class USound*                                      SlideInSound;                                     		// 0x0358 ( 0x0004 ) 
	class USound*                                      FadeInSound;                                      		// 0x035C ( 0x0004 ) 
	class USound*                                      BeepSound;                                        		// 0x0360 ( 0x0004 ) 
}; // Size: 0x0010

// Class XInterface.FloatingImage
class DLL_IMPORT UFloatingImage : public UGUIImage
{
public:
}; // Size: 0x0000

// Class XInterface.GUIHeader
class DLL_IMPORT UGUIHeader : public UGUITitleBar
{
public:
}; // Size: 0x0000

// Class XInterface.GUIVertScrollBar
class DLL_IMPORT UGUIVertScrollBar : public UGUIScrollBarBase
{
public:

	// UScript Functions
	 void                      ZoneClick ( float Delta );                        		//  XInterface.GUIVertScrollBar.ZoneClick
	 bool                      GripPreDraw ( class UGUIComponent* Sender );      		//  XInterface.GUIVertScrollBar.GripPreDraw
	 void                      GripPressed ( class UGUIComponent* Sender, bool IsRepeat );		//  XInterface.GUIVertScrollBar.GripPressed
}; // Size: 0x0000

// Class XInterface.GUIVertScrollZone
class DLL_IMPORT UGUIVertScrollZone : public UGUIScrollZoneBase
{
public:

	// UScript Functions
	 bool                      InternalOnClick ( class UGUIComponent* Sender );  		//  XInterface.GUIVertScrollZone.InternalOnClick
}; // Size: 0x0000

// Class XInterface.GUIVertScrollButton
class DLL_IMPORT UGUIVertScrollButton : public UGUIScrollButtonBase
{
public:

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.GUIVertScrollButton.InitComponent
}; // Size: 0x0000

// Class XInterface.GUIVertGripButton
class DLL_IMPORT UGUIVertGripButton : public UGUIGripButtonBase
{
public:

	// UScript Functions
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* MyComponent );		//  XInterface.GUIVertGripButton.InitComponent
}; // Size: 0x0000

// Class XInterface.STY_ListSelection
class DLL_IMPORT USTY_ListSelection : public UGUIStyles
{
public:

	// UScript Functions
	 void                      eventInitialize (  );                             		// [ FUNC_Event ] XInterface.STY_ListSelection.Initialize
}; // Size: 0x0000

// Class XInterface.ExtendedConsole
class DLL_IMPORT UExtendedConsole : public UConsole
{
public:
	int                                                MaxScrollbackSize;                                		// 0x045C ( 0x0004 ) 
	class TArray< struct FString >                     Scrollback;                                       		// 0x0460 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                SBHead;                                           		// 0x046C ( 0x0004 ) 
	int                                                SBPos;                                            		// 0x0470 ( 0x0004 ) 
	unsigned long                                      bCtrl:1;                                          		// 0x0474 ( 0x0004 )  [0x00000001]
	unsigned long                                      bAlt:1;                                           		// 0x0474 ( 0x0004 )  [0x00000002]
	unsigned long                                      bShift:1;                                         		// 0x0474 ( 0x0004 )  [0x00000004]
	unsigned long                                      bConsoleHotKey:1;                                 		// 0x0474 ( 0x0004 )  [0x00000008]
	float                                              ConsoleSoundVol;                                  		// 0x0478 ( 0x0004 ) 
	struct FString                                     AddedCurrentHead;                                 		// 0x047C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     AddedCurrentTail;                                 		// 0x0488 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     ServerFullMsg;                                    		// 0x0494 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	float                                              SMLineSpace;                                      		// 0x04A0 ( 0x0004 ) 
	unsigned char                                      SMState;                                          		// 0x04A4 ( 0x0001 ) 
	struct FName                                       SMType;                                           		// 0x04A8 ( 0x0004 ) 
	int                                                SMIndex;                                          		// 0x04AC ( 0x0004 ) 
	struct FString                                     SMCallsign;                                       		// 0x04B0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                SMOffset;                                         		// 0x04BC ( 0x0004 ) 
	struct FString                                     SMNameArray[ 0x30 ];                              		// 0x04C0 ( 0x0240 ) [ CPF_NeedCtorLink ]
	int                                                SMIndexArray[ 0x30 ];                             		// 0x0700 ( 0x00C0 ) 
	int                                                SMArraySize;                                      		// 0x07C0 ( 0x0004 ) 
	float                                              SMOriginX;                                        		// 0x07C4 ( 0x0004 ) 
	float                                              SMOriginY;                                        		// 0x07C8 ( 0x0004 ) 
	float                                              SMMargin;                                         		// 0x07CC ( 0x0004 ) 
	float                                              SMTab;                                            		// 0x07D0 ( 0x0004 ) 
	struct FString                                     SMStateName[ 0x0A ];                              		// 0x07D4 ( 0x0078 ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     SMChannelOptions[ 0x03 ];                         		// 0x084C ( 0x0024 ) [ CPF_Localized | CPF_NeedCtorLink ]
	class TArray< class AVoiceChatRoom* >              VoiceChannels;                                    		// 0x0870 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     SMAllString;                                      		// 0x087C ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	struct FString                                     SMMoreString;                                     		// 0x0888 ( 0x000C ) [ CPF_Localized | CPF_NeedCtorLink ]
	class USound*                                      SMOpenSound;                                      		// 0x0894 ( 0x0004 ) 
	class USound*                                      SMAcceptSound;                                    		// 0x0898 ( 0x0004 ) 
	class USound*                                      SMDenySound;                                      		// 0x089C ( 0x0004 ) 
	unsigned char                                      LetterKeys[ 0x0A ];                               		// 0x08A0 ( 0x000A ) 
	unsigned char                                      NumberKeys[ 0x0A ];                               		// 0x08AA ( 0x000A ) 
	unsigned long                                      bSpeechMenuUseLetters:1;                          		// 0x08B4 ( 0x0004 )  [0x00000001]
	unsigned long                                      bSpeechMenuUseMouseWheel:1;                       		// 0x08B4 ( 0x0004 )  [0x00000002]
	unsigned long                                      bSpeechMenuLocked:1;                              		// 0x08B4 ( 0x0004 )  [0x00000004]
	int                                                HighlightRow;                                     		// 0x08B8 ( 0x0004 ) 
	class TArray< struct FServerFavorite >             Favorites;                                        		// 0x08BC ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class TArray< struct FStoredPassword >             SavedPasswords;                                   		// 0x08C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     PasswordPromptMenu;                               		// 0x08D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     LastConnectedServer;                              		// 0x08E0 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     LastURL;                                          		// 0x08EC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FChatStruct >                 ChatMessages;                                     		// 0x08F8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ChatMenuClass;                                    		// 0x0904 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UGUIPage*                                    ChatMenu;                                         		// 0x0910 ( 0x0004 ) [ CPF_ExportObject | CPF_Transient | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bTeamChatOnly:1;                                  		// 0x0914 ( 0x0004 )  [0x00000001]
	class UUT2MusicManager*                            MusicManager;                                     		// 0x0918 ( 0x0004 ) [ CPF_ExportObject | CPF_Transient | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     StatsPromptMenuClass;                             		// 0x091C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     MusicManagerClassName;                            		// 0x0928 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     WaitingGameClassName;                             		// 0x0934 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     NeedPasswordMenuClass;                            		// 0x0940 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ServerInfoMenu;                                   		// 0x094C ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              FadeClock;                                        		// 0x0958 ( 0x0004 ) 
	float                                              FadeTime;                                         		// 0x095C ( 0x0004 ) 
	class TArray< float >                              DemoPlaybackSpeeds;                               		// 0x0960 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     PlaybackText;                                     		// 0x096C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bDemoJogKeys:1;                                   		// 0x0978 ( 0x0004 )  [0x00000001]
	struct FScriptDelegate                             __OnChat__Delegate;                               		// 0x097C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnChatMessage__Delegate;                        		// 0x0984 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnExecAddFavorite__Delegate;                    		// 0x098C ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      execDebugTabOrder (  );                           		// [ FUNC_Exec ] XInterface.ExtendedConsole.DebugTabOrder
	 void                      execDumpLoadingHints ( struct FString Param );    		// [ FUNC_Exec ] XInterface.ExtendedConsole.DumpLoadingHints
	 void                      execDLO ( struct FString ClassName, struct FString ClassType );		// [ FUNC_Exec ] XInterface.ExtendedConsole.DLO
	 bool                      VoiceChatAllowed (  );                            		//  XInterface.ExtendedConsole.VoiceChatAllowed
	 void                      DumpCacheRecords ( struct FString CacheType );    		// [ FUNC_Final ] XInterface.ExtendedConsole.DumpCacheRecords
	 void                      AddMessage ( struct FString Mesg );               		// [ FUNC_Final ] XInterface.ExtendedConsole.AddMessage
	 void                      execDumpRecords ( struct FString Type );          		// [ FUNC_Exec ] XInterface.ExtendedConsole.DumpRecords
	 void                      execDumpPlayInfo ( struct FString Group );        		// [ FUNC_Exec ] XInterface.ExtendedConsole.DumpPlayInfo
	 void                      execMusicMenu (  );                               		// [ FUNC_Exec ] XInterface.ExtendedConsole.MusicMenu
	 void                      execPlayWaitingGame (  );                         		// [ FUNC_Exec ] XInterface.ExtendedConsole.PlayWaitingGame
	 void                      execTeamChatOnly (  );                            		// [ FUNC_Exec ] XInterface.ExtendedConsole.TeamChatOnly
	 void                      execServerInfo (  );                              		// [ FUNC_Exec ] XInterface.ExtendedConsole.ServerInfo
	 void                      execIngameChat (  );                              		// [ FUNC_Exec ] XInterface.ExtendedConsole.IngameChat
	 void                      execSpeechMenuToggle (  );                        		// [ FUNC_Exec ] XInterface.ExtendedConsole.SpeechMenuToggle
	 void                      SaveFavorites (  );                               		//  XInterface.ExtendedConsole.SaveFavorites
	 void                      GetFavorites ( class TArray< struct FServerFavorite >* List );		//  XInterface.ExtendedConsole.GetFavorites
	 bool                      RemoveFavorite ( struct FString IP, int Port, int QueryPort );		//  XInterface.ExtendedConsole.RemoveFavorite
	 bool                      AddFavorite ( struct FServerFavorite NewFav );    		//  XInterface.ExtendedConsole.AddFavorite
	 bool                      InFavorites ( struct FServerFavorite Fav );       		//  XInterface.ExtendedConsole.InFavorites
	 void                      execAddCurrentToFavorites (  );                   		// [ FUNC_Exec ] XInterface.ExtendedConsole.AddCurrentToFavorites
	 void                      OnExecAddFavorite ( struct FServerFavorite Fav ); 		//  XInterface.ExtendedConsole.OnExecAddFavorite
	 void                      execConsoleToggle (  );                           		// [ FUNC_Exec ] XInterface.ExtendedConsole.ConsoleToggle
	 void                      execConsoleClose (  );                            		// [ FUNC_Exec ] XInterface.ExtendedConsole.ConsoleClose
	 void                      execConsoleOpen (  );                             		// [ FUNC_Exec ] XInterface.ExtendedConsole.ConsoleOpen
	 void                      eventNativeConsoleOpen (  );                      		// [ FUNC_Event ] XInterface.ExtendedConsole.NativeConsoleOpen
	 void                      PlayConsoleSound ( class USound* S );             		//  XInterface.ExtendedConsole.PlayConsoleSound
	 bool                      eventKeyEvent ( unsigned char key, unsigned char Action, float Delta );		// [ FUNC_Event ] XInterface.ExtendedConsole.KeyEvent
	 void                      GetNewPlaybackSpeed ( int Dir );                  		//  XInterface.ExtendedConsole.GetNewPlaybackSpeed
	 void                      eventMessage ( struct FString Msg, float MsgLife );		// [ FUNC_Event ] XInterface.ExtendedConsole.Message
	 void                      OnChatMessage ( struct FString Msg );             		//  XInterface.ExtendedConsole.OnChatMessage
	 void                      Chat ( struct FString Msg, float MsgLife, class APlayerReplicationInfo* PRI );		//  XInterface.ExtendedConsole.Chat
	 void                      PostRender ( class UCanvas* Canvas );             		//  XInterface.ExtendedConsole.PostRender
	 void                      execcls (  );                                     		// [ FUNC_Exec ] XInterface.ExtendedConsole.cls
	 void                      eventNotifyLevelChange (  );                      		// [ FUNC_Event ] XInterface.ExtendedConsole.NotifyLevelChange
	 void                      eventConnectFailure ( struct FString FailCode, struct FString URL );		// [ FUNC_Event ] XInterface.ExtendedConsole.ConnectFailure
	 void                      OnStatsConfigured (  );                           		//  XInterface.ExtendedConsole.OnStatsConfigured
	 void                      OnStatsClosed ( bool bCancelled );                		//  XInterface.ExtendedConsole.OnStatsClosed
	 void                      OnChat ( struct FString Msg, int TeamIndex );     		//  XInterface.ExtendedConsole.OnChat
}; // Size: 0x0538

// Class XInterface.UT2MusicManager
class DLL_IMPORT UUT2MusicManager : public UGUIPage
{
public:
	struct FPlayListStruct                             Playlist;                                         		// 0x0354 ( 0x001C ) [ CPF_Config | CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      NotifyLevelChange (  );                           		//  XInterface.UT2MusicManager.NotifyLevelChange
	 void                      MusicChanged (  );                                		//  XInterface.UT2MusicManager.MusicChanged
	 struct FString            SetInitialMusic ( struct FString NewSong );       		//  XInterface.UT2MusicManager.SetInitialMusic
	 void                      SetMusic ( struct FString NewSong );              		//  XInterface.UT2MusicManager.SetMusic
	 void                      InitComponent ( class UGUIController* MyController, class UGUIComponent* myOwner );		//  XInterface.UT2MusicManager.InitComponent
}; // Size: 0x001C

// Class XInterface.HudCDeathmatch
class DLL_IMPORT AHudCDeathmatch : public AHudBase
{
public:
	float                                              UAVLastBeginScanLevelSeconds;                     		// 0x0C84 ( 0x0004 ) 
	float                                              UAVOneScanTime;                                   		// 0x0C88 ( 0x0004 ) 
	float                                              UAVOneScanTimeExtra;                              		// 0x0C8C ( 0x0004 ) 
	float                                              UAVOneScanMin;                                    		// 0x0C90 ( 0x0004 ) 
	float                                              UAVOneScanMax;                                    		// 0x0C94 ( 0x0004 ) 
	class AwHudPart_MinimapBase*                       UAVMinimapBase;                                   		// 0x0C98 ( 0x0004 ) 
	int                                                UAVScanOffset;                                    		// 0x0C9C ( 0x0004 ) 
	float                                              UAVIconPosXAlly;                                  		// 0x0CA0 ( 0x0004 ) 
	float                                              UAVIconPosYAlly;                                  		// 0x0CA4 ( 0x0004 ) 
	float                                              UAVIconPosXEnemy;                                 		// 0x0CA8 ( 0x0004 ) 
	float                                              UAVIconPosYEnemy;                                 		// 0x0CAC ( 0x0004 ) 
	float                                              UAVIconWidth;                                     		// 0x0CB0 ( 0x0004 ) 
	float                                              UAVIconHeight;                                    		// 0x0CB4 ( 0x0004 ) 
	float                                              UAVIconTextPosXAlly;                              		// 0x0CB8 ( 0x0004 ) 
	float                                              UAVIconTextPosYAlly;                              		// 0x0CBC ( 0x0004 ) 
	float                                              UAVIconTextPosXEnemy;                             		// 0x0CC0 ( 0x0004 ) 
	float                                              UAVIconTextPosYEnemy;                             		// 0x0CC4 ( 0x0004 ) 
	float                                              UAVIconTextOffsetX;                               		// 0x0CC8 ( 0x0004 ) 
	float                                              UAVIconTextXL;                                    		// 0x0CCC ( 0x0004 ) 
	float                                              UAVIconTextYL;                                    		// 0x0CD0 ( 0x0004 ) 
	class FColor                                       UAVIconColor;                                     		// 0x0CD4 ( 0x0004 ) 
	float                                              AFStringLeftTopX;                                 		// 0x0CD8 ( 0x0004 ) 
	float                                              AFStringLeftTopY;                                 		// 0x0CDC ( 0x0004 ) 
	float                                              AFStringRightBottomX;                             		// 0x0CE0 ( 0x0004 ) 
	float                                              AFStringRightBottomY;                             		// 0x0CE4 ( 0x0004 ) 
	float                                              AFSurvivedUserCountLeftTopX;                      		// 0x0CE8 ( 0x0004 ) 
	float                                              AFSurvivedUserCountLeftTopY;                      		// 0x0CEC ( 0x0004 ) 
	float                                              AFSurvivedUserCountRightBottomX;                  		// 0x0CF0 ( 0x0004 ) 
	float                                              AFSurvivedUserCountRightBottomY;                  		// 0x0CF4 ( 0x0004 ) 
	float                                              RSAStringLeftTopX;                                		// 0x0CF8 ( 0x0004 ) 
	float                                              RSAStringLeftTopY;                                		// 0x0CFC ( 0x0004 ) 
	float                                              RSAStringRightBottomX;                            		// 0x0D00 ( 0x0004 ) 
	float                                              RSAStringRightBottomY;                            		// 0x0D04 ( 0x0004 ) 
	float                                              RSASurvivedUserCountLeftTopX;                     		// 0x0D08 ( 0x0004 ) 
	float                                              RSASurvivedUserCountLeftTopY;                     		// 0x0D0C ( 0x0004 ) 
	float                                              RSASurvivedUserCountRightBottomX;                 		// 0x0D10 ( 0x0004 ) 
	float                                              RSASurvivedUserCountRightBottomY;                 		// 0x0D14 ( 0x0004 ) 
	struct FDigitSet                                   WDigitsSmall;                                     		// 0x0D18 ( 0x00B4 ) [ CPF_Edit ]
	struct FDigitSet                                   WDigitsMid;                                       		// 0x0DCC ( 0x00B4 ) [ CPF_Edit ]
	struct FDigitSet                                   WDigitsTime;                                      		// 0x0E80 ( 0x00B4 ) [ CPF_Edit ]
	struct FDigitSet                                   WDigitsTimeRedAlert;                              		// 0x0F34 ( 0x00B4 ) [ CPF_Edit ]
	struct FSpriteWidget                               ScoreBgLine;                                      		// 0x0FE8 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               ScoreBg;                                          		// 0x1028 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               ScoreBGMine;                                      		// 0x1068 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               ScoreBGMyLine;                                    		// 0x10A8 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               DetectedBomb;                                     		// 0x10E8 ( 0x0040 ) 
	float                                              DetectedBombDrawDistance;                         		// 0x1128 ( 0x0004 ) 
	struct FNumericWidget                              DigitsScoreL;                                     		// 0x112C ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsScoreR;                                     		// 0x115C ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsScoreU;                                     		// 0x118C ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsScoreD;                                     		// 0x11BC ( 0x0030 ) [ CPF_Edit ]
	unsigned long                                      OverdrawDigitsScoreL:1;                           		// 0x11EC ( 0x0004 )  [0x00000001]
	unsigned long                                      OverdrawDigitsScoreR:1;                           		// 0x11EC ( 0x0004 )  [0x00000002]
	class UTexRotator*                                 outArrow;                                         		// 0x11F0 ( 0x0004 ) 
	float                                              OutArrowSize;                                     		// 0x11F4 ( 0x0004 ) [ CPF_Config ]
	unsigned long                                      bRendNavExtra:1;                                  		// 0x11F8 ( 0x0004 )  [0x00000001]
	float                                              fRendNavExtraFactor;                              		// 0x11FC ( 0x0004 ) 
	unsigned long                                      bRendVisCount:1;                                  		// 0x1200 ( 0x0004 )  [0x00000001]
	float                                              fRendVisCountFactor;                              		// 0x1204 ( 0x0004 ) 
	float                                              fRendViscountBoxSize;                             		// 0x1208 ( 0x0004 ) 
	unsigned long                                      bRendInfluence:1;                                 		// 0x120C ( 0x0004 )  [0x00000001]
	float                                              fInfluenceBoxSize;                                		// 0x1210 ( 0x0004 ) 
	unsigned long                                      bRendCoverAngle:1;                                		// 0x1214 ( 0x0004 )  [0x00000001]
	float                                              fRendCoverAngleSize;                              		// 0x1218 ( 0x0004 ) 
	unsigned long                                      bRendSDFrontLine:1;                               		// 0x121C ( 0x0004 )  [0x00000001]
	float                                              fSDFrontLineSize;                                 		// 0x1220 ( 0x0004 ) 
	unsigned long                                      bRendSDFrontLineFull:1;                           		// 0x1224 ( 0x0004 )  [0x00000001]
	unsigned long                                      bRendRadius:1;                                    		// 0x1224 ( 0x0004 )  [0x00000002]
	class TArray< class FColor >                       RainbowColors;                                    		// 0x1228 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class FColor >                       DangerColors;                                     		// 0x1234 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class FColor >                       RedBlueColors;                                    		// 0x1240 ( 0x000C ) [ CPF_NeedCtorLink ]
	class FColor                                       color_Shadow;                                     		// 0x124C ( 0x0004 ) 
	unsigned long                                      bShowTimer1:1;                                    		// 0x1250 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bShowTimer1WithDigitRedAlert:1;                   		// 0x1250 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	struct FSpriteWidget                               WTimerBG;                                         		// 0x1254 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteTimerHalf;                                  		// 0x1294 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteTimerHalf_RedAlert;                         		// 0x12D4 ( 0x0040 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsTimerMin;                                   		// 0x1314 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsTimerSec;                                   		// 0x1344 ( 0x0030 ) [ CPF_Edit ]
	unsigned long                                      bShowTimer2NotScoreD:1;                           		// 0x1374 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bShowTimer2WithDigitRedAlert:1;                   		// 0x1374 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	struct FSpriteWidget                               SpriteTimerHalf2;                                 		// 0x1378 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               SpriteTimerHalf2_RedAlert;                        		// 0x13B8 ( 0x0040 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsTimerMin2;                                  		// 0x13F8 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsTimerSec2;                                  		// 0x1428 ( 0x0030 ) [ CPF_Edit ]
	float                                              NetLastTimeSeconds;                               		// 0x1458 ( 0x0004 ) 
	float                                              NetElapsedTime;                                   		// 0x145C ( 0x0004 ) 
	float                                              NetInterval;                                      		// 0x1460 ( 0x0004 ) 
	int                                                NetRecvMax;                                       		// 0x1464 ( 0x0004 ) 
	int                                                NetRecv;                                          		// 0x1468 ( 0x0004 ) 
	int                                                NetSendMax;                                       		// 0x146C ( 0x0004 ) 
	int                                                NetSend;                                          		// 0x1470 ( 0x0004 ) 
	int                                                NetTotal;                                         		// 0x1474 ( 0x0004 ) 
	struct FSpriteWidget                               AmmoIcon;                                         		// 0x1478 ( 0x0040 ) [ CPF_Edit ]
	struct FNumericWidget                              AdrenalineCount;                                  		// 0x14B8 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              mySpread;                                         		// 0x14E8 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              myRank;                                           		// 0x1518 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              MyScore;                                          		// 0x1548 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              TimerHours;                                       		// 0x1578 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              TimerMinutes;                                     		// 0x15A8 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              TimerSeconds;                                     		// 0x15D8 ( 0x0030 ) [ CPF_Edit ]
	struct FSpriteWidget                               TimerDigitSpacer[ 0x02 ];                         		// 0x1608 ( 0x0080 ) [ CPF_Edit ]
	struct FSpriteWidget                               TimerIcon;                                        		// 0x1688 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               TimerBackground;                                  		// 0x16C8 ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               TimerBackgroundDisc;                              		// 0x1708 ( 0x0040 ) [ CPF_Edit ]
	class UFont*                                       LevelActionFontFont;                              		// 0x1748 ( 0x0004 ) [ CPF_Edit ]
	class FColor                                       LevelActionFontColor;                             		// 0x174C ( 0x0004 ) [ CPF_Edit ]
	float                                              LevelActionPositionX;                             		// 0x1750 ( 0x0004 ) [ CPF_Edit ]
	float                                              LevelActionPositionY;                             		// 0x1754 ( 0x0004 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsHealth;                                     		// 0x1758 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsVehicleHealth;                              		// 0x1788 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsTotalAmmo;                                  		// 0x17B8 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsMagazineAmmo;                               		// 0x17E8 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsMagazineAmmoShortage;                       		// 0x1818 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsShield;                                     		// 0x1848 ( 0x0030 ) [ CPF_Edit ]
	struct FNumericWidget                              DigitsSprint;                                     		// 0x1878 ( 0x0030 ) [ CPF_Edit ]
	unsigned long                                      bPrevMatchOver:1;                                 		// 0x18A8 ( 0x0004 )  [0x00000001]
	struct FSpriteWidget                               HpStaminaBackground;                              		// 0x18AC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               HpBarBackground;                                  		// 0x18EC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               HpBar;                                            		// 0x192C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               DamageBar;                                        		// 0x196C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               RecoveryBar;                                      		// 0x19AC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               StaminaBarBackground;                             		// 0x19EC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               StaminaBar;                                       		// 0x1A2C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               StaminaBarWarn;                                   		// 0x1A6C ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               HPIcon;                                           		// 0x1AAC ( 0x0040 ) [ CPF_Edit ]
	struct FSpriteWidget                               HpGauBlink;                                       		// 0x1AEC ( 0x0040 ) [ CPF_Edit ]
