#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : XInterface
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function XInterface.GUIQuestionPage.RemoveButtons
// Flags: 
struct UGUIQuestionPage_execRemoveButtons_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIQuestionPage.Replace
// Flags: 
struct UGUIQuestionPage_execReplace_Parms
{
	struct FString                                     Src;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Tag;                                              		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Value;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIQuestionPage.ButtonClick
// Flags: 
struct UGUIQuestionPage_execButtonClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                t;                                                		// 0x0008 ( 0x0004
//	class UGUIController*                              C;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIQuestionPage.LayoutButtons
// Flags: 
struct UGUIQuestionPage_execLayoutButtons_Parms
{
	unsigned char                                      ActiveButton;                                     		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	float                                              Left;                                             		// 0x0008 ( 0x0004
	float                                              colw;                                             		// 0x000C ( 0x0004
	float                                              btnw;                                             		// 0x0010 ( 0x0004
};

// Function XInterface.GUIQuestionPage.AddButton
// Flags: 
struct UGUIQuestionPage_execAddButton_Parms
{
	unsigned char                                      idesc;                                            		// 0x0000 ( 0x0001[ CPF_Parm | CPF_CoerceParm ]
	class UGUIButton*                                  ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UGUIButton*                                  btn;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	unsigned char                                      Mask;                                             		// 0x000C ( 0x0001
//	int                                                cnt;                                              		// 0x0010 ( 0x0004
};

// Function XInterface.GUIQuestionPage.SetupQuestion
// Flags: 
struct UGUIQuestionPage_execSetupQuestion_Parms
{
	struct FString                                     Question;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      bButtons;                                         		// 0x000C ( 0x0001[ CPF_Parm | CPF_CoerceParm ]
	unsigned char                                      ActiveButton;                                     		// 0x000D ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bClearFirst:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIQuestionPage.InternalOnPreDraw
// Flags: 
struct UGUIQuestionPage_execInternalOnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              XL;                                               		// 0x0008 ( 0x0004
//	float                                              YL;                                               		// 0x000C ( 0x0004
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	class TArray< struct FString >                     MsgArray;                                         		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIQuestionPage.InitComponent
// Flags: 
struct UGUIQuestionPage_execInitComponent_Parms
{
	class UGUIController*                              pMyController;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIQuestionPage.NewOnButtonClick
// Flags: 
struct UGUIQuestionPage_execNewOnButtonClick_Parms
{
	unsigned char                                      bButton;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIQuestionPage.OnButtonClick
// Flags: 
struct UGUIQuestionPage_execOnButtonClick_Parms
{
	unsigned char                                      bButton;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function XInterface.HudBase.GetCurGameTime
// Flags: 
struct AHudBase_execGetCurGameTime_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.clearkilllog
// Flags: [ FUNC_Exec ]
struct AHudBase_execclearkilllog_Parms
{
};

// Function XInterface.HudBase.userzone
// Flags: [ FUNC_Exec ]
struct AHudBase_execuserzone_Parms
{
	struct FString                                     szPath;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szCommand;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bResult:1;                                        		// 0x0018 ( 0x0004 [0x00000001]
};

// Function XInterface.HudBase.usermove
// Flags: [ FUNC_Exec ]
struct AHudBase_execusermove_Parms
{
	struct FString                                     szPath;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szCommand;                                        		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                nCombatNum;                                       		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bResult:1;                                        		// 0x001C ( 0x0004 [0x00000001]
};

// Function XInterface.HudBase.killlog
// Flags: [ FUNC_Exec ]
struct AHudBase_execkilllog_Parms
{
	struct FString                                     szPath;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     szCommand;                                        		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bResult:1;                                        		// 0x0018 ( 0x0004 [0x00000001]
};

// Function XInterface.HudBase.WorldSpaceOverlays
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AHudBase_eventWorldSpaceOverlays_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	struct FVector                                     vCenterPos;                                       		// 0x0004 ( 0x000C
};

// Function XInterface.HudBase.PlayHUDSound
// Flags: 
struct AHudBase_execPlayHUDSound_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      soundType;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	struct FString                                     strSound;                                         		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.HudBase.CalcNametagPos
// Flags: 
struct AHudBase_execCalcNametagPos_Parms
{
	class APawn*                                       curPawn;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     NametagPosition;                                  		// 0x0010 ( 0x000C
};

// Function XInterface.HudBase.CalcNametagPosNative
// Flags: [ FUNC_Native ]
struct AHudBase_execCalcNametagPosNative_Parms
{
	class APawn*                                       curPawn;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.GetNametagColor
// Flags: 
struct AHudBase_execGetNametagColor_Parms
{
	class APlayerReplicationInfo*                      Info;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class FColor                                       C;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.HudBase.RefreshKillerName
// Flags: 
struct AHudBase_execRefreshKillerName_Parms
{
	struct FString                                     mKillerName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.HudBase.DrawNameTag
// Flags: 
struct AHudBase_execDrawNameTag_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwPawn*                                      curPawn;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              X1;                                               		// 0x0008 ( 0x0004
	float                                              Y1;                                               		// 0x000C ( 0x0004
	float                                              X2;                                               		// 0x0010 ( 0x0004
	float                                              Y2;                                               		// 0x0014 ( 0x0004
	float                                              width;                                            		// 0x0018 ( 0x0004
	float                                              Height;                                           		// 0x001C ( 0x0004
	struct FString                                     nametag;                                          		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
	class FColor                                       nametagColor;                                     		// 0x002C ( 0x0004
	float                                              markWidth;                                        		// 0x0030 ( 0x0004
	float                                              markHeight;                                       		// 0x0034 ( 0x0004
	class UMaterial*                                   Mark;                                             		// 0x0038 ( 0x0004
};

// Function XInterface.HudBase.DrawMissionIcon
// Flags: 
struct AHudBase_execDrawMissionIcon_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwPawn*                                      curPawn;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawNametagsScript
// Flags: 
struct AHudBase_execDrawNametagsScript_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSpectateMode:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      drawAlways:1;                                     		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class AwPawn*                                      curPawn;                                          		// 0x000C ( 0x0004
	class AwPawn*                                      wPawnOwner;                                       		// 0x0010 ( 0x0004
	struct FVector                                     camLoc;                                           		// 0x0014 ( 0x000C
	struct FRotator                                    camRot;                                           		// 0x0020 ( 0x000C
	float                                              X1;                                               		// 0x002C ( 0x0004
	float                                              Y1;                                               		// 0x0030 ( 0x0004
	float                                              X2;                                               		// 0x0034 ( 0x0004
	float                                              Y2;                                               		// 0x0038 ( 0x0004
	float                                              width;                                            		// 0x003C ( 0x0004
	float                                              Height;                                           		// 0x0040 ( 0x0004
	unsigned long                                      curPawnSameTeam:1;                                		// 0x0044 ( 0x0004 [0x00000001]
	struct FVector                                     centerScreenPos;                                  		// 0x0048 ( 0x000C
	unsigned long                                      bDraw:1;                                          		// 0x0054 ( 0x0004 [0x00000001]
	struct FVector                                     curPawnCenterPos;                                 		// 0x0058 ( 0x000C
	struct FVector                                     HitLocation;                                      		// 0x0064 ( 0x000C
	struct FVector                                     HitNormal;                                        		// 0x0070 ( 0x000C
	struct FVector                                     TraceEnd;                                         		// 0x007C ( 0x000C
	float                                              markWidth;                                        		// 0x0088 ( 0x0004
	float                                              markHeight;                                       		// 0x008C ( 0x0004
	unsigned long                                      bUpdateNametagVis:1;                              		// 0x0090 ( 0x0004 [0x00000001]
	int                                                lp1;                                              		// 0x0094 ( 0x0004
};

// Function XInterface.HudBase.DrawNametags
// Flags: 
struct AHudBase_execDrawNametags_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSpectateMode:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      drawAlways:1;                                     		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.HudBase.DrawNametagsNative
// Flags: [ FUNC_Native ]
struct AHudBase_execDrawNametagsNative_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSpectateMode:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      drawAlways:1;                                     		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.HudBase.DrawHudSpectating
// Flags: 
struct AHudBase_execDrawHudSpectating_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawGMHudSpectating
// Flags: 
struct AHudBase_execDrawGMHudSpectating_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.FindPRI
// Flags: 
struct AHudBase_execFindPRI_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerReplicationInfo*                      PRI;                                              		// 0x0008 ( 0x0004
//	struct FString                                     PlayerName;                                       		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x0018 ( 0x0004
};

// Function XInterface.HudBase.GetBaseTeamColor
// Flags: 
struct AHudBase_execGetBaseTeamColor_Parms
{
	int                                                viewerTeamIndex;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                targetTeamIndex;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.GetBaseTeamName
// Flags: 
struct AHudBase_execGetBaseTeamName_Parms
{
	int                                                TeamIndex;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.HudBase.DrawWarfareCrosshairExtNative
// Flags: [ FUNC_Native ]
struct AHudBase_execDrawWarfareCrosshairExtNative_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Spread;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.CalculateCoordinateDigitEx
// Flags: [ FUNC_Native ]
struct AHudBase_execCalculateCoordinateDigitEx_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FDigitSet                                   W;                                                		// 0x0004 ( 0x00B4[ CPF_Parm ]
	struct FNumericWidget                              N;                                                		// 0x00B8 ( 0x0030[ CPF_Parm ]
	float                                              fWidth;                                           		// 0x00E8 ( 0x0004[ CPF_Parm ]
	float                                              fHeight;                                          		// 0x00EC ( 0x0004[ CPF_Parm ]
	int                                                Index;                                            		// 0x00F0 ( 0x0004[ CPF_Parm ]
	struct FCalCoordsW                                 coordsW;                                          		// 0x00F4 ( 0x0030[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.HudBase.CalculateCoordinateDigit
// Flags: [ FUNC_Native ]
struct AHudBase_execCalculateCoordinateDigit_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FDigitSet                                   W;                                                		// 0x0004 ( 0x00B4[ CPF_Parm ]
	struct FNumericWidget                              N;                                                		// 0x00B8 ( 0x0030[ CPF_Parm ]
	float                                              fWidth;                                           		// 0x00E8 ( 0x0004[ CPF_Parm ]
	float                                              fHeight;                                          		// 0x00EC ( 0x0004[ CPF_Parm ]
	int                                                Index;                                            		// 0x00F0 ( 0x0004[ CPF_Parm ]
	struct FCalCoordsW                                 coordsW;                                          		// 0x00F4 ( 0x0030[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.HudBase.CalculateCoordinateEx
// Flags: [ FUNC_Native ]
struct AHudBase_execCalculateCoordinateEx_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FSpriteWidget                               W;                                                		// 0x0004 ( 0x0040[ CPF_Parm ]
	float                                              fWidth;                                           		// 0x0044 ( 0x0004[ CPF_Parm ]
	float                                              fHeight;                                          		// 0x0048 ( 0x0004[ CPF_Parm ]
	struct FCalCoordsW                                 coordsW;                                          		// 0x004C ( 0x0030[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.HudBase.CalculateCoordinate
// Flags: [ FUNC_Native ]
struct AHudBase_execCalculateCoordinate_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FSpriteWidget                               W;                                                		// 0x0004 ( 0x0040[ CPF_Parm ]
	float                                              fWidth;                                           		// 0x0044 ( 0x0004[ CPF_Parm ]
	float                                              fHeight;                                          		// 0x0048 ( 0x0004[ CPF_Parm ]
	struct FCalCoordsW                                 coordsW;                                          		// 0x004C ( 0x0030[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.HudBase.DrawTileFromSpriteWidget2
// Flags: [ FUNC_Native ]
struct AHudBase_execDrawTileFromSpriteWidget2_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FSpriteWidget                               SW;                                               		// 0x0004 ( 0x0040[ CPF_Parm ]
	float                                              W;                                                		// 0x0044 ( 0x0004[ CPF_Parm ]
	float                                              H;                                                		// 0x0048 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawTileFromSpriteWidget
// Flags: [ FUNC_Native ]
struct AHudBase_execDrawTileFromSpriteWidget_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FSpriteWidget                               SW;                                               		// 0x0004 ( 0x0040[ CPF_Parm ]
};

// Function XInterface.HudBase.ClipScreenCoords
// Flags: 
struct AHudBase_execClipScreenCoords_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              X;                                                		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              Y;                                                		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              XL;                                               		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              YL;                                               		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.HudBase.IsTargetInFrontOfPlayer2
// Flags: 
struct AHudBase_execIsTargetInFrontOfPlayer2_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     TargetPos;                                        		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ScreenPos;                                        		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     camLoc;                                           		// 0x001C ( 0x000C[ CPF_Parm ]
	struct FRotator                                    camRot;                                           		// 0x0028 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.IsTargetInFrontOfPlayer
// Flags: 
struct AHudBase_execIsTargetInFrontOfPlayer_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Target;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ScreenPos;                                        		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     camLoc;                                           		// 0x0014 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    camRot;                                           		// 0x0020 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.DrawIntroSubtitles
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawIntroSubtitles_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     CurrentSubTitles;                                 		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              XL;                                               		// 0x0010 ( 0x0004
	float                                              YL;                                               		// 0x0014 ( 0x0004
	float                                              YO;                                               		// 0x0018 ( 0x0004
	class TArray< struct FString >                     OutArray;                                         		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0028 ( 0x0004
};

// Function XInterface.HudBase.DrawCinematicHUD
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawCinematicHUD_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawVehicleName
// Flags: 
struct AHudBase_execDrawVehicleName_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawWeaponName
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawWeaponName_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     CurWeaponName;                                    		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              XL;                                               		// 0x0010 ( 0x0004
	float                                              YL;                                               		// 0x0014 ( 0x0004
	float                                              Fade;                                             		// 0x0018 ( 0x0004
};

// Function XInterface.HudBase.LoadInstructionFont
// Flags: [ FUNC_Simulated ]
struct AHudBase_execLoadInstructionFont_Parms
{
	class UFont*                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.SetInstructionKeyText
// Flags: [ FUNC_Simulated ]
struct AHudBase_execSetInstructionKeyText_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.HudBase.SetInstructionText
// Flags: [ FUNC_Simulated ]
struct AHudBase_execSetInstructionText_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.HudBase.DrawInstructionKeyText
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawInstructionKeyText_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              strX;                                             		// 0x0004 ( 0x0004
	float                                              strY;                                             		// 0x0008 ( 0x0004
};

// Function XInterface.HudBase.DrawInstructionText
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawInstructionText_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawInstructionGfx
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawInstructionGfx_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              CropHeight;                                       		// 0x0004 ( 0x0004
};

// Function XInterface.HudBase.SetCropping
// Flags: [ FUNC_Simulated ]
struct AHudBase_execSetCropping_Parms
{
	unsigned long                                      Active:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.HudBase.DrawTargeting
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawTargeting_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                XPos;                                             		// 0x0004 ( 0x0004
	int                                                YPos;                                             		// 0x0008 ( 0x0004
	struct FVector                                     ScreenPos;                                        		// 0x000C ( 0x000C
	struct FVector                                     X;                                                		// 0x0018 ( 0x000C
	struct FVector                                     Y;                                                		// 0x0024 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0030 ( 0x000C
	struct FVector                                     Dir;                                              		// 0x003C ( 0x000C
	float                                              ratioX;                                           		// 0x0048 ( 0x0004
	float                                              ratioY;                                           		// 0x004C ( 0x0004
	float                                              tileX;                                            		// 0x0050 ( 0x0004
	float                                              tileY;                                            		// 0x0054 ( 0x0004
	float                                              dist;                                             		// 0x0058 ( 0x0004
	float                                              SizeX;                                            		// 0x005C ( 0x0004
	float                                              SizeY;                                            		// 0x0060 ( 0x0004
};

// Function XInterface.HudBase.SetTargeting
// Flags: [ FUNC_Simulated ]
struct AHudBase_execSetTargeting_Parms
{
	unsigned long                                      bShow:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FVector                                     TargetLocation;                                   		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	float                                              Size;                                             		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.HudBase.Draw2DLocationDot
// Flags: 
struct AHudBase_execDraw2DLocationDot_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     loc;                                              		// 0x0004 ( 0x000C[ CPF_Parm ]
	float                                              OffsetX;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              OffsetY;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	float                                              ScaleX;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	float                                              ScaleY;                                           		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FRotator                                    Dir;                                              		// 0x0020 ( 0x000C
	float                                              Angle;                                            		// 0x002C ( 0x0004
	float                                              Scaling;                                          		// 0x0030 ( 0x0004
	class AActor*                                      Start;                                            		// 0x0034 ( 0x0004
};

// Function XInterface.HudBase.CreateKeyMenus
// Flags: [ FUNC_Simulated ]
struct AHudBase_execCreateKeyMenus_Parms
{
};

// Function XInterface.HudBase.DisplayLocalMessages
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDisplayLocalMessages_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              PosX;                                             		// 0x0004 ( 0x0004
	float                                              PosY;                                             		// 0x0008 ( 0x0004
	float                                              dy;                                               		// 0x000C ( 0x0004
	float                                              dx;                                               		// 0x0010 ( 0x0004
	int                                                i;                                                		// 0x0014 ( 0x0004
	int                                                j;                                                		// 0x0018 ( 0x0004
	int                                                iCount;                                           		// 0x001C ( 0x0004
	int                                                iCount2;                                          		// 0x0020 ( 0x0004
	float                                              FadeValue;                                        		// 0x0024 ( 0x0004
	struct FPlane                                      OldCM;                                            		// 0x0028 ( 0x0010
	unsigned long                                      bDeleteMessage:1;                                 		// 0x0038 ( 0x0004 [0x00000001]
	float                                              fRemainTime;                                      		// 0x003C ( 0x0004
};

// Function XInterface.HudBase.DrawMessageWithTexture
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawMessageWithTexture_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              PosX;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              PosY;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              dx;                                               		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              dy;                                               		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.HudBase.DrawMessage
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawMessage_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              PosX;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              PosY;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              dx;                                               		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              dy;                                               		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              FadeValue;                                        		// 0x0018 ( 0x0004
	float                                              ScreenX;                                          		// 0x001C ( 0x0004
	float                                              ScreenY;                                          		// 0x0020 ( 0x0004
};

// Function XInterface.HudBase.GetScreenCoords
// Flags: [ FUNC_Simulated ]
struct AHudBase_execGetScreenCoords_Parms
{
	float                                              PosX;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              PosY;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              ScreenX;                                          		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              ScreenY;                                          		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FHudLocalizedMessage                        Message;                                          		// 0x0010 ( 0x004C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class UCanvas*                                     C;                                                		// 0x005C ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.LayoutMessage
// Flags: [ FUNC_Simulated ]
struct AHudBase_execLayoutMessage_Parms
{
	struct FHudLocalizedMessage                        Message;                                          		// 0x0000 ( 0x004C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class UCanvas*                                     C;                                                		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                FontSize;                                         		// 0x0050 ( 0x0004
};

// Function XInterface.HudBase.GetLocalStatsScreen
// Flags: 
struct AHudBase_execGetLocalStatsScreen_Parms
{
};

// Function XInterface.HudBase.GetTeamColor
// Flags: 
struct AHudBase_execGetTeamColor_Parms
{
	unsigned char                                      TeamNum;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.LocalizedMessage2
// Flags: [ FUNC_Simulated ]
struct AHudBase_execLocalizedMessage2_Parms
{
	class UClass*                                      Message;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     CriticalString;                                   		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function XInterface.HudBase.LocalizedMessage
// Flags: [ FUNC_Simulated ]
struct AHudBase_execLocalizedMessage_Parms
{
	class UClass*                                      Message;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     CriticalString;                                   		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0020 ( 0x0004
	int                                                k;                                                		// 0x0024 ( 0x0004
	int                                                iCountMessageScore;                               		// 0x0028 ( 0x0004
	int                                                iIndexMessage;                                    		// 0x002C ( 0x0004
	class APlayerReplicationInfo*                      HUDPRI;                                           		// 0x0030 ( 0x0004
	float                                              fAddTime;                                         		// 0x0034 ( 0x0004
	float                                              fIntervalTime;                                    		// 0x0038 ( 0x0004
	float                                              fNextDrawIntervalTime;                            		// 0x003C ( 0x0004
};

// Function XInterface.HudBase.Message
// Flags: [ FUNC_Simulated ]
struct AHudBase_execMessage_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Msg;                                              		// 0x0004 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
	struct FName                                       MsgType;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	class UClass*                                      LocalMessageClass;                                		// 0x0014 ( 0x0004
};

// Function XInterface.HudBase.ClearMessage
// Flags: [ FUNC_Simulated ]
struct AHudBase_execClearMessage_Parms
{
	struct FHudLocalizedMessage                        M;                                                		// 0x0000 ( 0x004C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.HudBase.AddChildHudPart
// Flags: [ FUNC_Simulated ]
struct AHudBase_execAddChildHudPart_Parms
{
	class AHudBase*                                    Child;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawDigitSet
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawDigitSet_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              X;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              Y;                                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              OffsetX;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              XL;                                               		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                Value;                                            		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FDigitSet                                   dSet;                                             		// 0x001C ( 0x00B4[ CPF_Parm ]
	int                                                totalDigits;                                      		// 0x00D0 ( 0x0004[ CPF_Parm ]
	struct FString                                     paddingChar;                                      		// 0x00D4 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x00E0 ( 0x0004
	struct FString                                     str;                                              		// 0x00E4 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                val;                                              		// 0x00F0 ( 0x0004
	int                                                StrLen;                                           		// 0x00F4 ( 0x0004
};

// Function XInterface.HudBase.DrawCSReviw
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawCSReviw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	struct FVector                                     ScreenPos;                                        		// 0x0008 ( 0x000C
	float                                              width;                                            		// 0x0014 ( 0x0004
	float                                              Height;                                           		// 0x0018 ( 0x0004
	struct FVector                                     camLoc;                                           		// 0x001C ( 0x000C
	struct FRotator                                    camRot;                                           		// 0x0028 ( 0x000C
};

// Function XInterface.HudBase.DrawNumericWidget
// Flags: [ FUNC_Simulated | FUNC_Native ]
struct AHudBase_execDrawNumericWidget_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FNumericWidget                              W;                                                		// 0x0004 ( 0x0030[ CPF_Parm | CPF_OutParm ]
	struct FDigitSet                                   D;                                                		// 0x0034 ( 0x00B4[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.HudBase.DrawSpriteWidget
// Flags: [ FUNC_Simulated | FUNC_Native ]
struct AHudBase_execDrawSpriteWidget_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FSpriteWidget                               W;                                                		// 0x0004 ( 0x0040[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.HudBase.DrawHUD
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawHUD_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.UpdateScreenRatios
// Flags: 
struct AHudBase_execUpdateScreenRatios_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
};

// Function XInterface.HudBase.DrawAttacked
// Flags: 
struct AHudBase_execDrawAttacked_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iAlpha;                                           		// 0x0004 ( 0x0004
	float                                              fTotalDrawTime;                                   		// 0x0008 ( 0x0004
	float                                              fDelayDrawTime;                                   		// 0x000C ( 0x0004
	float                                              fFadeOutDrawTime;                                 		// 0x0010 ( 0x0004
};

// Function XInterface.HudBase.DrawHeadShotSphere
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawHeadShotSphere_Parms
{
	struct FCoords                                     co;                                               		// 0x0000 ( 0x0030
	class APawn*                                       P;                                                		// 0x0030 ( 0x0004
	struct FVector                                     HeadLoc;                                          		// 0x0034 ( 0x000C
};

// Function XInterface.HudBase.Tick
// Flags: [ FUNC_Simulated ]
struct AHudBase_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.HudBase.PlayPainSound
// Flags: 
struct AHudBase_execPlayPainSound_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawDamageIndicators
// Flags: 
struct AHudBase_execDrawDamageIndicators_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                nDamageAccumulate;                                		// 0x0004 ( 0x0004
};

// Function XInterface.HudBase.DisplayHit
// Flags: 
struct AHudBase_execDisplayHit_Parms
{
	struct FVector                                     HitDir;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	int                                                Damage;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0014 ( 0x0004
	struct FVector                                     X;                                                		// 0x0018 ( 0x000C
	struct FVector                                     Y;                                                		// 0x0024 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0030 ( 0x000C
	unsigned char                                      Ignore[ 0x04 ];                                   		// 0x003C ( 0x0004
	struct FRotator                                    LookDir;                                          		// 0x0040 ( 0x000C
	float                                              NewDamageTime;                                    		// 0x004C ( 0x0004
	float                                              Forward;                                          		// 0x0050 ( 0x0004
	float                                              Left;                                             		// 0x0054 ( 0x0004
};

// Function XInterface.HudBase.DrawMiniMap
// Flags: 
struct AHudBase_execDrawMiniMap_Parms
{
	class AwHudPart_MinimapBase*                       Minimap;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UCanvas*                                     C;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.SetCustomHUDColor
// Flags: 
struct AHudBase_execSetCustomHUDColor_Parms
{
};

// Function XInterface.HudBase.CustomHUDColorAllowed
// Flags: 
struct AHudBase_execCustomHUDColorAllowed_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.HudBase.PostBeginPlay
// Flags: 
struct AHudBase_execPostBeginPlay_Parms
{
};

// Function XInterface.HudBase.PrecacheFonts
// Flags: [ FUNC_Simulated ]
struct AHudBase_execPrecacheFonts_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawHudPassD
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawHudPassD_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawHudPassC
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawHudPassC_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawHudPassB
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawHudPassB_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.DrawHudPassA
// Flags: [ FUNC_Simulated ]
struct AHudBase_execDrawHudPassA_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.HudBase.UpdateHUD
// Flags: [ FUNC_Simulated ]
struct AHudBase_execUpdateHUD_Parms
{
};

// Function XInterface.HudBase.DoUpdateTime
// Flags: 
struct AHudBase_execDoUpdateTime_Parms
{
};

// Function XInterface.wHudPart_KillMessage.Draw
// Flags: 
struct AwHudPart_KillMessage_execDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	unsigned long                                      needToCacheAll:1;                                 		// 0x0008 ( 0x0004 [0x00000001]
	unsigned long                                      needCaching:1;                                    		// 0x000C ( 0x0004 [0x00000001]
	float                                              CurrentY;                                         		// 0x0010 ( 0x0004
	float                                              currentY2;                                        		// 0x0014 ( 0x0004
};

// Function XInterface.wHudPart_KillMessage.DrawOnlyImage
// Flags: 
struct AwHudPart_KillMessage_execDrawOnlyImage_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	float                                              CurrentY;                                         		// 0x0008 ( 0x0004
	float                                              currentY2;                                        		// 0x000C ( 0x0004
};

// Function XInterface.wHudPart_KillMessage.DrawOnlyText
// Flags: 
struct AwHudPart_KillMessage_execDrawOnlyText_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	float                                              CurrentY;                                         		// 0x0008 ( 0x0004
	float                                              currentY2;                                        		// 0x000C ( 0x0004
};

// Function XInterface.wHudPart_KillMessage.UpdateCache
// Flags: 
struct AwHudPart_KillMessage_execUpdateCache_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
	unsigned long                                      needToCacheAll:1;                                 		// 0x0008 ( 0x0004 [0x00000001]
	unsigned long                                      needCaching:1;                                    		// 0x000C ( 0x0004 [0x00000001]
};

// Function XInterface.wHudPart_KillMessage.End
// Flags: 
struct AwHudPart_KillMessage_execEnd_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.wHudPart_KillMessage.Begin
// Flags: 
struct AwHudPart_KillMessage_execBegin_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.wHudPart_KillMessage.DrawNative
// Flags: [ FUNC_Native ]
struct AwHudPart_KillMessage_execDrawNative_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.wHudPart_KillMessage.Update
// Flags: 
struct AwHudPart_KillMessage_execUpdate_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function XInterface.wHudPart_KillMessage.AddKillMessageItem
// Flags: 
struct AwHudPart_KillMessage_execAddKillMessageItem_Parms
{
	struct FKillMessageItem                            Item;                                             		// 0x0000 ( 0x00C0[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.wHudPart_KillMessage.AddKillMessage
// Flags: 
struct AwHudPart_KillMessage_execAddKillMessage_Parms
{
	class APlayerReplicationInfo*                      KillerPRI;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      victimPRI;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function XInterface.wHudPart_KillMessage.GetNameColor
// Flags: 
struct AwHudPart_KillMessage_execGetNameColor_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.wHudPart_KillMessage.MakeKillMessageItem
// Flags: 
struct AwHudPart_KillMessage_execMakeKillMessageItem_Parms
{
	class APlayerReplicationInfo*                      KillerPRI;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      victimPRI;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     KillerName;                                       		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     VictimName;                                       		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      DamageType;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned long                                      NoKillerName:1;                                   		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      NoVictimName:1;                                   		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm ]
	class UMaterial*                                   overrideImage;                                    		// 0x0030 ( 0x0004[ CPF_Parm ]
	struct FKillMessageItem                            ReturnValue;                                      		// 0x0034 ( 0x00C0[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FKillMessageItem                            Item;                                             		// 0x00F4 ( 0x00C0[ CPF_NeedCtorLink ]
//	class UClass*                                      resClass;                                         		// 0x01B4 ( 0x0004
//	int                                                msgIsHeadShot;                                    		// 0x01B8 ( 0x0004
//	int                                                msgIsAimShot;                                     		// 0x01BC ( 0x0004
//	int                                                msgKillSuccession;                                		// 0x01C0 ( 0x0004
//	int                                                msgIsPinPointKill;                                		// 0x01C4 ( 0x0004
};

// Function XInterface.wHudPart_KillMessage.Initialize
// Flags: 
struct AwHudPart_KillMessage_execInitialize_Parms
{
	class AHudBase*                                    myOwner;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class ALevelInfo*                                  myLevel;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.wHudPart_KillMessage.Precache
// Flags: 
struct AwHudPart_KillMessage_execPrecache_Parms
{
};

// Function XInterface.GUIListBox.MyClose
// Flags: 
struct UGUIListBox_execMyClose_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBox.MyOpen
// Flags: 
struct UGUIListBox_execMyOpen_Parms
{
	class UGUIContextMenu*                             Menu;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBox.ItemCount
// Flags: 
struct UGUIListBox_execItemCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBox.InternalOnChange
// Flags: 
struct UGUIListBox_execInternalOnChange_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBox.InternalOnDblClick
// Flags: 
struct UGUIListBox_execInternalOnDblClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBox.InternalOnClick
// Flags: 
struct UGUIListBox_execInternalOnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBox.InitComponent
// Flags: 
struct UGUIListBox_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBox.InitBaseList
// Flags: 
struct UGUIListBox_execInitBaseList_Parms
{
	class UGUIListBase*                                LocalList;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollTextBox.AddText
// Flags: 
struct UGUIScrollTextBox_execAddText_Parms
{
	struct FString                                     NewText;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     StrippedText;                                     		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIScrollTextBox.StripColors
// Flags: 
struct UGUIScrollTextBox_execStripColors_Parms
{
	struct FString                                     MyString;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                EscapePos;                                        		// 0x0018 ( 0x0004
//	int                                                RemCount;                                         		// 0x001C ( 0x0004
//	int                                                LenFromEscape;                                    		// 0x0020 ( 0x0004
};

// Function XInterface.GUIScrollTextBox.IsNumber
// Flags: 
struct UGUIScrollTextBox_execIsNumber_Parms
{
	struct FString                                     Num;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollTextBox.InternalOnAdjustTop
// Flags: 
struct UGUIScrollTextBox_execInternalOnAdjustTop_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollTextBox.Stop
// Flags: 
struct UGUIScrollTextBox_execStop_Parms
{
};

// Function XInterface.GUIScrollTextBox.Restart
// Flags: 
struct UGUIScrollTextBox_execRestart_Parms
{
};

// Function XInterface.GUIScrollTextBox.SetContent
// Flags: 
struct UGUIScrollTextBox_execSetContent_Parms
{
	struct FString                                     NewContent;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     sep;                                              		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIScrollTextBox.InitComponent
// Flags: 
struct UGUIScrollTextBox_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollTextBox.InitBaseList
// Flags: 
struct UGUIScrollTextBox_execInitBaseList_Parms
{
	class UGUIListBase*                                LocalList;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollTextBox.InternalOnCreateComponent
// Flags: 
struct UGUIScrollTextBox_execInternalOnCreateComponent_Parms
{
	class UGUIComponent*                               NewComp;                                          		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               Sender;                                           		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollTextBox.Created
// Flags: [ FUNC_Event ]
struct UGUIScrollTextBox_eventCreated_Parms
{
};

// Function XInterface.GUIMultiColumnListBox.SetHeaderStyle
// Flags: 
struct UGUIMultiColumnListBox_execSetHeaderStyle_Parms
{
	unsigned long                                      changeStyle:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FString                                     stylez;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      changeBarStyle:1;                                 		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FString                                     barStylez;                                        		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      X;                                                		// 0x0020 ( 0x0001
};

// Function XInterface.GUIMultiColumnListBox.InternalOnColumnSized
// Flags: 
struct UGUIMultiColumnListBox_execInternalOnColumnSized_Parms
{
	int                                                Column;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIMultiColumnListBox.InternalOnCreateComponent
// Flags: 
struct UGUIMultiColumnListBox_execInternalOnCreateComponent_Parms
{
	class UGUIComponent*                               NewComp;                                          		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               Sender;                                           		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIMultiColumnListBox.InternalOnLoadINI
// Flags: 
struct UGUIMultiColumnListBox_execInternalOnLoadINI_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     S;                                                		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIMultiColumnListBox.InitComponent
// Flags: 
struct UGUIMultiColumnListBox_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIMultiColumnListBox.InitBaseList
// Flags: 
struct UGUIMultiColumnListBox_execInitBaseList_Parms
{
	class UGUIListBase*                                LocalList;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBoxBase.SetFriendlyLabel
// Flags: 
struct UGUIListBoxBase_execSetFriendlyLabel_Parms
{
	class UGUILabel*                                   NewLabel;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBoxBase.SetScrollBarStyle
// Flags: 
struct UGUIListBoxBase_execSetScrollBarStyle_Parms
{
	unsigned long                                      changeScrollZoneStyle:1;                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UGUIStyles*                                  scrollZoneStyle;                                  		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      changeIncreaseButtonStyle:1;                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UGUIStyles*                                  increaseButtonStyle;                              		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      changeIncreaseButtonGraphic:1;                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UMaterial*                                   increaseButtonGraphic;                            		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      changeDecreaseButtonStyle:1;                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UGUIStyles*                                  decreaseButtonStyle;                              		// 0x001C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      changeDecreaseButtonGraphic:1;                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UMaterial*                                   decreaseButtonGraphic;                            		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned long                                      changeGripButtonStyle:1;                          		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UGUIStyles*                                  gripButtonStyle;                                  		// 0x002C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBoxBase.InternalOnCreateComponent
// Flags: 
struct UGUIListBoxBase_execInternalOnCreateComponent_Parms
{
	class UGUIComponent*                               NewComp;                                          		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               Sender;                                           		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBoxBase.SetHint
// Flags: 
struct UGUIListBoxBase_execSetHint_Parms
{
	struct FString                                     NewHint;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIListBoxBase.InitBaseList
// Flags: 
struct UGUIListBoxBase_execInitBaseList_Parms
{
	class UGUIListBase*                                LocalList;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBoxBase.InitComponent
// Flags: 
struct UGUIListBoxBase_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bTemp:1;                                          		// 0x0008 ( 0x0004 [0x00000001]
};

// Function XInterface.GUIScrollText.IsValid
// Flags: 
struct UGUIScrollText_execIsValid_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollText.EndScrolling
// Flags: 
struct UGUIScrollText_execEndScrolling_Parms
{
};

// Function XInterface.GUIScrollText.InternalOnKeyEvent
// Flags: 
struct UGUIScrollText_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      retval:1;                                         		// 0x000C ( 0x0004 [0x00000001]
};

// Function XInterface.GUIScrollText.InternalOnKeyType
// Flags: 
struct UGUIScrollText_execInternalOnKeyType_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	struct FString                                     Unicode;                                          		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollText.InternalOnClick
// Flags: 
struct UGUIScrollText_execInternalOnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned long                                      retval:1;                                         		// 0x0008 ( 0x0004 [0x00000001]
};

// Function XInterface.GUIScrollText.Timer
// Flags: [ FUNC_Event ]
struct UGUIScrollText_eventTimer_Parms
{
};

// Function XInterface.GUIScrollText.SkipChar
// Flags: 
struct UGUIScrollText_execSkipChar_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollText.Restart
// Flags: 
struct UGUIScrollText_execRestart_Parms
{
};

// Function XInterface.GUIScrollText.Stop
// Flags: 
struct UGUIScrollText_execStop_Parms
{
};

// Function XInterface.GUIScrollText.SetContent
// Flags: 
struct UGUIScrollText_execSetContent_Parms
{
	struct FString                                     NewContent;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     sep;                                              		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIScrollText.InitComponent
// Flags: 
struct UGUIScrollText_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollText.Dump
// Flags: 
struct UGUIScrollText_execDump_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIScrollText.OnEndOfLine
// Flags: 
struct UGUIScrollText_execOnEndOfLine_Parms
{
};

// Function XInterface.GUIScrollText.GetWordUnderCursor
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIScrollText_execGetWordUnderCursor_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIMultiColumnListHeader.InitComponent
// Flags: 
struct UGUIMultiColumnListHeader_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned char                                      X;                                                		// 0x0008 ( 0x0001
};

// Function XInterface.GUIList.GetPendingElements
// Flags: 
struct UGUIList_execGetPendingElements_Parms
{
	unsigned long                                      bGuarantee:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class TArray< struct FGUIListElem >                ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIList.ClearPendingElements
// Flags: 
struct UGUIList_execClearPendingElements_Parms
{
};

// Function XInterface.GUIList.InternalOnDragDrop
// Flags: 
struct UGUIList_execInternalOnDragDrop_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FGUIListElem >                NewItem;                                          		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function XInterface.GUIList.InternalOnEndDrag
// Flags: 
struct UGUIList_execInternalOnEndDrag_Parms
{
	class UGUIComponent*                               Accepting;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bAccepted:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIList.FindIndex
// Flags: 
struct UGUIList_execFindIndex_Parms
{
	struct FString                                     Test;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bExact:1;                                         		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExtra:1;                                         		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     TestObject;                                       		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x001C ( 0x0004
};

// Function XInterface.GUIList.FindItemObject
// Flags: 
struct UGUIList_execFindItemObject_Parms
{
	class UObject*                                     obj;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.FindExtra
// Flags: 
struct UGUIList_execFindExtra_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bExact:1;                                         		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.Find
// Flags: 
struct UGUIList_execFind_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bExact:1;                                         		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExtra:1;                                         		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0020 ( 0x0004
};

// Function XInterface.GUIList.RemoveExtra
// Flags: 
struct UGUIList_execRemoveExtra_Parms
{
	struct FString                                     str;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIList.RemoveObject
// Flags: 
struct UGUIList_execRemoveObject_Parms
{
	class UObject*                                     obj;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIList.RemoveItem
// Flags: 
struct UGUIList_execRemoveItem_Parms
{
	struct FString                                     Item;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIList.SetExtraAtIndex
// Flags: 
struct UGUIList_execSetExtraAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewExtra;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.SetObjectAtIndex
// Flags: 
struct UGUIList_execSetObjectAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     NewObject;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIList.SetItemAtIndex
// Flags: 
struct UGUIList_execSetItemAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewItem;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.GetAtIndex
// Flags: 
struct UGUIList_execGetAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ItemStr;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class UObject*                                     ExtraObj;                                         		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     ExtraStr;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.GetExtraAtIndex
// Flags: 
struct UGUIList_execGetExtraAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.GetObjectAtIndex
// Flags: 
struct UGUIList_execGetObjectAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.GetItemAtIndex
// Flags: 
struct UGUIList_execGetItemAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.IsSection
// Flags: 
struct UGUIList_execIsSection_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.GetExtra
// Flags: 
struct UGUIList_execGetExtra_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.GetObject
// Flags: 
struct UGUIList_execGetObject_Parms
{
	class UObject*                                     ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.Get
// Flags: 
struct UGUIList_execGet_Parms
{
	unsigned long                                      bGuarantee:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.SelectedText
// Flags: 
struct UGUIList_execSelectedText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.Clear
// Flags: 
struct UGUIList_execClear_Parms
{
};

// Function XInterface.GUIList.RemoveElement
// Flags: 
struct UGUIList_execRemoveElement_Parms
{
	struct FGUIListElem                                elem;                                             		// 0x0000 ( 0x0020[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Count;                                            		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoSort:1;                                        		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x002C ( 0x0004
};

// Function XInterface.GUIList.RemoveSilent
// Flags: 
struct UGUIList_execRemoveSilent_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.Remove
// Flags: 
struct UGUIList_execRemove_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoSort:1;                                        		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.LoadFrom
// Flags: 
struct UGUIList_execLoadFrom_Parms
{
	class UGUIList*                                    Source;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bClearFirst:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     t1;                                               		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     t2;                                               		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	class UObject*                                     t;                                                		// 0x0020 ( 0x0004
	int                                                i;                                                		// 0x0024 ( 0x0004
};

// Function XInterface.GUIList.Swap
// Flags: [ FUNC_Event ]
struct UGUIList_eventSwap_Parms
{
	int                                                IndexA;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                IndexB;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FGUIListElem                                elem;                                             		// 0x0008 ( 0x0020[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.InsertElement
// Flags: 
struct UGUIList_execInsertElement_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FGUIListElem                                NewElem;                                          		// 0x0004 ( 0x0020[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bNoSort:1;                                        		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIList.Insert
// Flags: 
struct UGUIList_execInsert_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewItem;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UObject*                                     obj;                                              		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     str;                                              		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bNoSort:1;                                        		// 0x0020 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bSection:1;                                       		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIList.Replace
// Flags: 
struct UGUIList_execReplace_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewItem;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UObject*                                     obj;                                              		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     str;                                              		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bNoSort:1;                                        		// 0x0020 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIList.AddElement
// Flags: 
struct UGUIList_execAddElement_Parms
{
	struct FGUIListElem                                NewElem;                                          		// 0x0000 ( 0x0020[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.Add
// Flags: 
struct UGUIList_execAdd_Parms
{
	struct FString                                     NewItem;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UObject*                                     obj;                                              		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     str;                                              		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bSection:1;                                       		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                NewIndex;                                         		// 0x0020 ( 0x0004
	struct FGUIListElem                                E;                                                		// 0x0024 ( 0x0020[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIList.CompareItem
// Flags: 
struct UGUIList_execCompareItem_Parms
{
	struct FGUIListElem                                ElemA;                                            		// 0x0000 ( 0x0020[ CPF_Parm | CPF_NeedCtorLink ]
	struct FGUIListElem                                ElemB;                                            		// 0x0020 ( 0x0020[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x0040 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIList.Sort
// Flags: 
struct UGUIList_execSort_Parms
{
};

// Function XInterface.GUIList.SortList
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIList_execSortList_Parms
{
};

// Function XInterface.GUIVertImageList.InternalOnDragDrop
// Flags: 
struct UGUIVertImageList_execInternalOnDragDrop_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class TArray< struct FImageListElem >              NewItem;                                          		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function XInterface.GUIVertImageList.InternalOnEndDrag
// Flags: 
struct UGUIVertImageList_execInternalOnEndDrag_Parms
{
	class UGUIComponent*                               Accepting;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bAccepted:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIVertImageList.FindItem
// Flags: 
struct UGUIVertImageList_execFindItem_Parms
{
	int                                                Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIVertImageList.FindImage
// Flags: 
struct UGUIVertImageList_execFindImage_Parms
{
	class UMaterial*                                   Image;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIVertImageList.RemoveItem
// Flags: 
struct UGUIVertImageList_execRemoveItem_Parms
{
	int                                                Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIVertImageList.RemoveImage
// Flags: 
struct UGUIVertImageList_execRemoveImage_Parms
{
	class UMaterial*                                   Image;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIVertImageList.SetItemAtIndex
// Flags: 
struct UGUIVertImageList_execSetItemAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                NewItem;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIVertImageList.SetImageAtIndex
// Flags: 
struct UGUIVertImageList_execSetImageAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UMaterial*                                   NewImage;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIVertImageList.GetPendingElements
// Flags: 
struct UGUIVertImageList_execGetPendingElements_Parms
{
	unsigned long                                      bGuarantee:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class TArray< struct FImageListElem >              ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIVertImageList.ClearPendingElements
// Flags: 
struct UGUIVertImageList_execClearPendingElements_Parms
{
};

// Function XInterface.GUIVertImageList.IsLocked
// Flags: 
struct UGUIVertImageList_execIsLocked_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.IndexLocked
// Flags: 
struct UGUIVertImageList_execIndexLocked_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.GetAtIndex
// Flags: 
struct UGUIVertImageList_execGetAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UMaterial*                                   Image;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                Item;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                Locked;                                           		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function XInterface.GUIVertImageList.GetItemIntAtIndex
// Flags: 
struct UGUIVertImageList_execGetItemIntAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.GetItemAtIndex
// Flags: 
struct UGUIVertImageList_execGetItemAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIVertImageList.GetImageAtIndex
// Flags: 
struct UGUIVertImageList_execGetImageAtIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UMaterial*                                   ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.GetItem
// Flags: 
struct UGUIVertImageList_execGetItem_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.Get
// Flags: 
struct UGUIVertImageList_execGet_Parms
{
	unsigned long                                      bGuarantee:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UMaterial*                                   ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.Clear
// Flags: 
struct UGUIVertImageList_execClear_Parms
{
};

// Function XInterface.GUIVertImageList.RemoveElement
// Flags: 
struct UGUIVertImageList_execRemoveElement_Parms
{
	struct FImageListElem                              elem;                                             		// 0x0000 ( 0x000C[ CPF_Parm ]
	int                                                Count;                                            		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function XInterface.GUIVertImageList.RemoveSilent
// Flags: 
struct UGUIVertImageList_execRemoveSilent_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.Remove
// Flags: 
struct UGUIVertImageList_execRemove_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.LoadFrom
// Flags: 
struct UGUIVertImageList_execLoadFrom_Parms
{
	class UGUIVertImageList*                           Source;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bClearFirst:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	int                                                Item;                                             		// 0x000C ( 0x0004
	class UMaterial*                                   mat;                                              		// 0x0010 ( 0x0004
	int                                                L;                                                		// 0x0014 ( 0x0004
};

// Function XInterface.GUIVertImageList.Swap
// Flags: [ FUNC_Event ]
struct UGUIVertImageList_eventSwap_Parms
{
	int                                                IndexA;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                IndexB;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FImageListElem                              elem;                                             		// 0x0008 ( 0x000C
};

// Function XInterface.GUIVertImageList.InsertElement
// Flags: 
struct UGUIVertImageList_execInsertElement_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FImageListElem                              NewElem;                                          		// 0x0004 ( 0x000C[ CPF_Parm ]
	int                                                Locked;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIVertImageList.Insert
// Flags: 
struct UGUIVertImageList_execInsert_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UMaterial*                                   NewImage;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                NewItem;                                          		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                Locked;                                           		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIVertImageList.Replace
// Flags: 
struct UGUIVertImageList_execReplace_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UMaterial*                                   NewImage;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                NewItem;                                          		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                Locked;                                           		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIVertImageList.AddImage
// Flags: 
struct UGUIVertImageList_execAddImage_Parms
{
	struct FImageListElem                              NewElem;                                          		// 0x0000 ( 0x000C[ CPF_Parm ]
	int                                                Locked;                                           		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIVertImageList.Add
// Flags: 
struct UGUIVertImageList_execAdd_Parms
{
	class UMaterial*                                   Image;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Item;                                             		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                Locked;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIVertImageList.SetTopItem
// Flags: 
struct UGUIVertImageList_execSetTopItem_Parms
{
	int                                                Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ModResult;                                        		// 0x0004 ( 0x0004
};

// Function XInterface.GUIVertImageList.MakeVisible
// Flags: 
struct UGUIVertImageList_execMakeVisible_Parms
{
	float                                              perc;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              MaxTop;                                           		// 0x0004 ( 0x0004
	float                                              ModResult;                                        		// 0x0008 ( 0x0004
	int                                                NewTop;                                           		// 0x000C ( 0x0004
	int                                                Change;                                           		// 0x0010 ( 0x0004
};

// Function XInterface.GUIVertImageList.PgDn
// Flags: 
struct UGUIVertImageList_execPgDn_Parms
{
	int                                                NewTop;                                           		// 0x0000 ( 0x0004
};

// Function XInterface.GUIVertImageList.PgUp
// Flags: 
struct UGUIVertImageList_execPgUp_Parms
{
	int                                                NewTop;                                           		// 0x0000 ( 0x0004
};

// Function XInterface.GUIVertImageList.End
// Flags: 
struct UGUIVertImageList_execEnd_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIVertImageList.home
// Flags: 
struct UGUIVertImageList_exechome_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIVertImageList.MoveLeft
// Flags: 
struct UGUIVertImageList_execMoveLeft_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                TargetIndex;                                      		// 0x0004 ( 0x0004
};

// Function XInterface.GUIVertImageList.MoveRight
// Flags: 
struct UGUIVertImageList_execMoveRight_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                TargetIndex;                                      		// 0x0004 ( 0x0004
};

// Function XInterface.GUIVertImageList.Down
// Flags: 
struct UGUIVertImageList_execDown_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                TargetIndex;                                      		// 0x0004 ( 0x0004
};

// Function XInterface.GUIVertImageList.Up
// Flags: 
struct UGUIVertImageList_execUp_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                TargetIndex;                                      		// 0x0004 ( 0x0004
};

// Function XInterface.GUIVertImageList.SetIndex
// Flags: 
struct UGUIVertImageList_execSetIndex_Parms
{
	int                                                NewIndex;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.InternalOnClick
// Flags: 
struct UGUIVertImageList_execInternalOnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                NewIndex;                                         		// 0x0008 ( 0x0004
};

// Function XInterface.GUIVertImageList.OnIsSelectibleIndex
// Flags: 
struct UGUIVertImageList_execOnIsSelectibleIndex_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                Index;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.OnItemDblClick
// Flags: 
struct UGUIVertImageList_execOnItemDblClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertImageList.CalculateIndex
// Flags: [ FUNC_Event ]
struct UGUIVertImageList_eventCalculateIndex_Parms
{
	unsigned long                                      bRequireValidIndex:1;                             		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                HitCol;                                           		// 0x000C ( 0x0004
//	int                                                HitRow;                                           		// 0x0010 ( 0x0004
};

// Function XInterface.GUIListBase.SetOutlineAlpha
// Flags: 
struct UGUIListBase_execSetOutlineAlpha_Parms
{
	int                                                NewAlpha;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIListBase.IsMultiSelect
// Flags: [ FUNC_Event ]
struct UGUIListBase_eventIsMultiSelect_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.InternalOnDragLeave
// Flags: 
struct UGUIListBase_execInternalOnDragLeave_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.InternalOnDragEnter
// Flags: 
struct UGUIListBase_execInternalOnDragEnter_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.InternalOnDragOver
// Flags: 
struct UGUIListBase_execInternalOnDragOver_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                NewIndex;                                         		// 0x0004 ( 0x0004
};

// Function XInterface.GUIListBase.InternalOnDragDrop
// Flags: 
struct UGUIListBase_execInternalOnDragDrop_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.InternalOnEndDrag
// Flags: 
struct UGUIListBase_execInternalOnEndDrag_Parms
{
	class UGUIComponent*                               Accepting;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bAccepted:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIListBase.InternalOnRightClick
// Flags: 
struct UGUIListBase_execInternalOnRightClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.CheckDragSelect
// Flags: 
struct UGUIListBase_execCheckDragSelect_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIListBase.InternalOnBeginDrag
// Flags: 
struct UGUIListBase_execInternalOnBeginDrag_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.InternalOnMouseRelease
// Flags: 
struct UGUIListBase_execInternalOnMouseRelease_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.InternalOnMousePressed
// Flags: 
struct UGUIListBase_execInternalOnMousePressed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      IsRepeat:1;                                       		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	int                                                j;                                                		// 0x000C ( 0x0004
	int                                                k;                                                		// 0x0010 ( 0x0004
	int                                                NewIndex;                                         		// 0x0014 ( 0x0004
	class UGUIMultiColumnList*                         kMultiColumnList;                                 		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.End
// Flags: 
struct UGUIListBase_execEnd_Parms
{
};

// Function XInterface.GUIListBase.home
// Flags: 
struct UGUIListBase_exechome_Parms
{
};

// Function XInterface.GUIListBase.PgDn
// Flags: 
struct UGUIListBase_execPgDn_Parms
{
};

// Function XInterface.GUIListBase.PgUp
// Flags: 
struct UGUIListBase_execPgUp_Parms
{
};

// Function XInterface.GUIListBase.WheelDown
// Flags: 
struct UGUIListBase_execWheelDown_Parms
{
};

// Function XInterface.GUIListBase.WheelUp
// Flags: 
struct UGUIListBase_execWheelUp_Parms
{
};

// Function XInterface.GUIListBase.MoveLeft
// Flags: 
struct UGUIListBase_execMoveLeft_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.MoveRight
// Flags: 
struct UGUIListBase_execMoveRight_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.Down
// Flags: 
struct UGUIListBase_execDown_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.Up
// Flags: 
struct UGUIListBase_execUp_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.InternalOnKeyEvent
// Flags: 
struct UGUIListBase_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      KeyState;                                         		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
//	unsigned char                                      iKey;                                             		// 0x0010 ( 0x0001
};

// Function XInterface.GUIListBase.GetPendingItems
// Flags: 
struct UGUIListBase_execGetPendingItems_Parms
{
	unsigned long                                      bGuarantee:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class TArray< struct FString >                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	class TArray< struct FString >                     items;                                            		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIListBase.GetItemAtIndex
// Flags: 
struct UGUIListBase_execGetItemAtIndex_Parms
{
	int                                                idx;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIListBase.AdditionalDebugString
// Flags: [ FUNC_Event ]
struct UGUIListBase_eventAdditionalDebugString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIListBase.IsValidIndex
// Flags: 
struct UGUIListBase_execIsValidIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.IsValid
// Flags: 
struct UGUIListBase_execIsValid_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.DisableLinkedObjects
// Flags: 
struct UGUIListBase_execDisableLinkedObjects_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIListBase.EnableLinkedObjects
// Flags: 
struct UGUIListBase_execEnableLinkedObjects_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIListBase.InitLinkObjects
// Flags: 
struct UGUIListBase_execInitLinkObjects_Parms
{
	class TArray< class UGUIComponent* >               NewObj;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bNoCheck:1;                                       		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIListBase.AddLinkObject
// Flags: 
struct UGUIListBase_execAddLinkObject_Parms
{
	class UGUIComponent*                               NewObj;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bNoCheck:1;                                       		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIListBase.SetTopItem
// Flags: 
struct UGUIListBase_execSetTopItem_Parms
{
	int                                                Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIListBase.MakeVisible
// Flags: 
struct UGUIListBase_execMakeVisible_Parms
{
	float                                              perc;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIListBase.Clear
// Flags: 
struct UGUIListBase_execClear_Parms
{
};

// Function XInterface.GUIListBase.ClearPendingElements
// Flags: 
struct UGUIListBase_execClearPendingElements_Parms
{
};

// Function XInterface.GUIListBase.IndexChanged
// Flags: 
struct UGUIListBase_execIndexChanged_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.SetIndex
// Flags: 
struct UGUIListBase_execSetIndex_Parms
{
	int                                                NewIndex;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.MultiCalculateIndex
// Flags: [ FUNC_Event ]
struct UGUIListBase_eventMultiCalculateIndex_Parms
{
	unsigned long                                      bRequireValidIndex:1;                             		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.CalculateIndex
// Flags: [ FUNC_Event ]
struct UGUIListBase_eventCalculateIndex_Parms
{
	unsigned long                                      bRequireValidIndex:1;                             		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIListBase.SilentSetIndex
// Flags: 
struct UGUIListBase_execSilentSetIndex_Parms
{
	int                                                NewIndex;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIListBase.Sort
// Flags: 
struct UGUIListBase_execSort_Parms
{
};

// Function XInterface.GUIListBase.UpdateScrollbarForcedPosition
// Flags: [ FUNC_Event ]
struct UGUIListBase_eventUpdateScrollbarForcedPosition_Parms
{
};

// Function XInterface.GUIListBase.InitComponent
// Flags: 
struct UGUIListBase_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.CheckLinkedObjects
// Flags: 
struct UGUIListBase_execCheckLinkedObjects_Parms
{
	class UGUIListBase*                                List;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.OnTrack
// Flags: 
struct UGUIListBase_execOnTrack_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                LastIndex;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIListBase.OnAdjustTop
// Flags: 
struct UGUIListBase_execOnAdjustTop_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIListBase.OnDrawItem
// Flags: 
struct UGUIListBase_execOnDrawItem_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Item;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              X;                                                		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Y;                                                		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              W;                                                		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              HT;                                               		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSelected:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bPending:1;                                       		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIListBase.OnScrollBy
// Flags: 
struct UGUIListBase_execOnScrollBy_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIVertList.PgDn
// Flags: 
struct UGUIVertList_execPgDn_Parms
{
};

// Function XInterface.GUIVertList.PgUp
// Flags: 
struct UGUIVertList_execPgUp_Parms
{
};

// Function XInterface.GUIVertList.End
// Flags: 
struct UGUIVertList_execEnd_Parms
{
};

// Function XInterface.GUIVertList.home
// Flags: 
struct UGUIVertList_exechome_Parms
{
};

// Function XInterface.GUIVertList.Down
// Flags: 
struct UGUIVertList_execDown_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertList.Up
// Flags: 
struct UGUIVertList_execUp_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertList.WheelDown
// Flags: 
struct UGUIVertList_execWheelDown_Parms
{
};

// Function XInterface.GUIVertList.WheelUp
// Flags: 
struct UGUIVertList_execWheelUp_Parms
{
};

// Function XInterface.GUIVertList.InternalOnKeyType
// Flags: 
struct UGUIVertList_execInternalOnKeyType_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	struct FString                                     Unicode;                                          		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIVertList.InternalOnClick
// Flags: 
struct UGUIVertList_execInternalOnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                NewIndex;                                         		// 0x0008 ( 0x0004
};

// Function XInterface.GUIVertList.MultiCalculateIndex
// Flags: [ FUNC_Event ]
struct UGUIVertList_eventMultiCalculateIndex_Parms
{
	unsigned long                                      bRequireValidIndex:1;                             		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                j;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIVertList.CalculateIndex
// Flags: [ FUNC_Event ]
struct UGUIVertList_eventCalculateIndex_Parms
{
	unsigned long                                      bRequireValidIndex:1;                             		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                NewIndex;                                         		// 0x000C ( 0x0004
};

// Function XInterface.GUIVertList.CenterMouse
// Flags: 
struct UGUIVertList_execCenterMouse_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004
	float                                              X;                                                		// 0x0004 ( 0x0004
	float                                              Y;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIVertList.GetItemHeight
// Flags: 
struct UGUIVertList_execGetItemHeight_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIMultiColumnList.SetTopItem
// Flags: 
struct UGUIMultiColumnList_execSetTopItem_Parms
{
	int                                                Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIMultiColumnList.Dump
// Flags: 
struct UGUIMultiColumnList_execDump_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIMultiColumnList.Sort
// Flags: 
struct UGUIMultiColumnList_execSort_Parms
{
};

// Function XInterface.GUIMultiColumnList.GetCellLeftWidth
// Flags: 
struct UGUIMultiColumnList_execGetCellLeftWidth_Parms
{
	int                                                Column;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Left;                                             		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              width;                                            		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIMultiColumnList.InternalOnPreDraw
// Flags: 
struct UGUIMultiColumnList_execInternalOnPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              X;                                                		// 0x0008 ( 0x0004
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIMultiColumnList.InitializeColumns
// Flags: [ FUNC_Event ]
struct UGUIMultiColumnList_eventInitializeColumns_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	float                                              AW;                                               		// 0x0008 ( 0x0004
};

// Function XInterface.GUIMultiColumnList.ResolutionChanged
// Flags: 
struct UGUIMultiColumnList_execResolutionChanged_Parms
{
	int                                                ResX;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ResY;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIMultiColumnList.RemovedCurrent
// Flags: 
struct UGUIMultiColumnList_execRemovedCurrent_Parms
{
};

// Function XInterface.GUIMultiColumnList.Clear
// Flags: 
struct UGUIMultiColumnList_execClear_Parms
{
};

// Function XInterface.GUIMultiColumnList.OnSortChanged
// Flags: [ FUNC_Event ]
struct UGUIMultiColumnList_eventOnSortChanged_Parms
{
};

// Function XInterface.GUIMultiColumnList.CurrentListId
// Flags: 
struct UGUIMultiColumnList_execCurrentListId_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIMultiColumnList.GetSortString
// Flags: 
struct UGUIMultiColumnList_execGetSortString_Parms
{
	int                                                YourArrayIndex;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIMultiColumnList.AddedItem
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIMultiColumnList_execAddedItem_Parms
{
	int                                                YourArrayIndex;                                   		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIMultiColumnList.RemovedItem
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIMultiColumnList_execRemovedItem_Parms
{
	int                                                YourArrayIndex;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIMultiColumnList.UpdatedItem
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIMultiColumnList_execUpdatedItem_Parms
{
	int                                                YourArrayIndex;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIMultiColumnList.SortList
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIMultiColumnList_execSortList_Parms
{
};

// Function XInterface.GUIMultiColumnList.ChangeSortOrder
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIMultiColumnList_execChangeSortOrder_Parms
{
};

// Function XInterface.GUIMultiColumnList.GetListIndex
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIMultiColumnList_execGetListIndex_Parms
{
	int                                                YourArrayIndex;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIMultiColumnList.OnColumnSized
// Flags: 
struct UGUIMultiColumnList_execOnColumnSized_Parms
{
	int                                                Column;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIPage.FadedOut
// Flags: 
struct UGUIPage_execFadedOut_Parms
{
};

// Function XInterface.GUIPage.FadedIn
// Flags: 
struct UGUIPage_execFadedIn_Parms
{
};

// Function XInterface.GUIPage.FadeOut
// Flags: 
struct UGUIPage_execFadeOut_Parms
{
	unsigned long                                      bTranslate:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bChangeAlpha:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIPage.FadeIn
// Flags: 
struct UGUIPage_execFadeIn_Parms
{
	unsigned long                                      bTranslate:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bChangeAlpha:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIPage.AllowOpen
// Flags: 
struct UGUIPage_execAllowOpen_Parms
{
	struct FString                                     MenuClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIPage.IsOpen
// Flags: [ FUNC_Final ]
struct UGUIPage_execIsOpen_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIPage.free
// Flags: [ FUNC_Event ]
struct UGUIPage_eventfree_Parms
{
};

// Function XInterface.GUIPage.NotifyLevelChange
// Flags: 
struct UGUIPage_execNotifyLevelChange_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIPage.SetDataString
// Flags: 
struct UGUIPage_execSetDataString_Parms
{
	struct FString                                     str;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIPage.GetDataString
// Flags: 
struct UGUIPage_execGetDataString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIPage.HandleObject
// Flags: 
struct UGUIPage_execHandleObject_Parms
{
	class UObject*                                     obj;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     OptionalObj_1;                                    		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObj_2;                                    		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIPage.GetRestoreParams
// Flags: 
struct UGUIPage_execGetRestoreParams_Parms
{
	struct FString                                     Param1;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIPage.HandleParameters
// Flags: [ FUNC_Event ]
struct UGUIPage_eventHandleParameters_Parms
{
	struct FString                                     Param1;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIPage.SetFocus
// Flags: [ FUNC_Event ]
struct UGUIPage_eventSetFocus_Parms
{
	class UGUIComponent*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIPage.ChangeHint
// Flags: [ FUNC_Event ]
struct UGUIPage_eventChangeHint_Parms
{
	struct FString                                     NewHint;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIPage.CheckResolution
// Flags: 
struct UGUIPage_execCheckResolution_Parms
{
	unsigned long                                      Closing:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UGUIController*                              InController;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     CurrentRes;                                       		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     Xstr;                                             		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     Ystr;                                             		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                ResX;                                             		// 0x002C ( 0x0004
	int                                                ResY;                                             		// 0x0030 ( 0x0004
};

// Function XInterface.GUIPage.InitComponent
// Flags: 
struct UGUIPage_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIPage.PlayCloseSound
// Flags: 
struct UGUIPage_execPlayCloseSound_Parms
{
};

// Function XInterface.GUIPage.PlayOpenSound
// Flags: 
struct UGUIPage_execPlayOpenSound_Parms
{
};

// Function XInterface.GUIPage.Closed
// Flags: [ FUNC_Event ]
struct UGUIPage_eventClosed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bCancelled:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIPage.OnCanClose
// Flags: 
struct UGUIPage_execOnCanClose_Parms
{
	unsigned long                                      bCancelled:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIPage.OnClose
// Flags: 
struct UGUIPage_execOnClose_Parms
{
	unsigned long                                      bCancelled:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIPage.OnReOpen
// Flags: 
struct UGUIPage_execOnReOpen_Parms
{
};

// Function XInterface.GUIPage.OnOpen
// Flags: 
struct UGUIPage_execOnOpen_Parms
{
};

// Function XInterface.GUIBorder.GetCaption
// Flags: 
struct UGUIBorder_execGetCaption_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIBorder.SetCaption
// Flags: 
struct UGUIBorder_execSetCaption_Parms
{
	struct FString                                     NewCaption;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUITabControl.LevelChanged
// Flags: 
struct UGUITabControl_execLevelChanged_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUITabControl.free
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventfree_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUITabControl.CenterMouse
// Flags: 
struct UGUITabControl_execCenterMouse_Parms
{
};

// Function XInterface.GUITabControl.FocusLast
// Flags: 
struct UGUITabControl_execFocusLast_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabControl.FocusFirst
// Flags: 
struct UGUITabControl_execFocusFirst_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabControl.InternalOnActivate
// Flags: 
struct UGUITabControl_execInternalOnActivate_Parms
{
};

// Function XInterface.GUITabControl.SetVisibility
// Flags: 
struct UGUITabControl_execSetVisibility_Parms
{
	unsigned long                                      bIsVisible:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUITabControl.BorrowPanel
// Flags: 
struct UGUITabControl_execBorrowPanel_Parms
{
	struct FString                                     Caption;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUITabPanel*                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUITabControl.FindPanelClass
// Flags: 
struct UGUITabControl_execFindPanelClass_Parms
{
	class UClass*                                      PanelClass;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUITabPanel*                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUITabControl.TabIndex
// Flags: 
struct UGUITabControl_execTabIndex_Parms
{
	struct FString                                     tabname;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUITabControl.PrevControl
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventPrevControl_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabControl.NextControl
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventNextControl_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabControl.PrevPage
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventPrevPage_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUITabControl.NextPage
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventNextPage_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUITabControl.InternalTabClick
// Flags: 
struct UGUITabControl_execInternalTabClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UGUITabButton*                               But;                                              		// 0x0008 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabControl.ActivateTabByPanel
// Flags: 
struct UGUITabControl_execActivateTabByPanel_Parms
{
	class UGUITabPanel*                                Panel;                                            		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bFocusPanel:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUITabControl.ActivateTabByName
// Flags: 
struct UGUITabControl_execActivateTabByName_Parms
{
	struct FString                                     tabname;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bFocusPanel:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function XInterface.GUITabControl.ActivateTab
// Flags: 
struct UGUITabControl_execActivateTab_Parms
{
	class UGUITabButton*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bFocusPanel:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabControl.MakeTabActive
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventMakeTabActive_Parms
{
	class UGUITabButton*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabControl.LostActiveTab
// Flags: 
struct UGUITabControl_execLostActiveTab_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUITabControl.RemoveTab
// Flags: 
struct UGUITabControl_execRemoveTab_Parms
{
	struct FString                                     Caption;                                          		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class UGUITabButton*                               Who;                                              		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0010 ( 0x0004
	unsigned long                                      bActive:1;                                        		// 0x0014 ( 0x0004 [0x00000001]
	class UGUITabPanel*                                OldPanel;                                         		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabControl.ReplaceTab
// Flags: 
struct UGUITabControl_execReplaceTab_Parms
{
	class UGUITabButton*                               Which;                                            		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Caption;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     PanelClass;                                       		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUITabPanel*                                ExistingPanel;                                    		// 0x001C ( 0x0004[ CPF_ExportObject | CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     InHint;                                           		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bForceActive:1;                                   		// 0x002C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UGUITabPanel*                                ReturnValue;                                      		// 0x0030 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UClass*                                      NewPanelClass;                                    		// 0x0034 ( 0x0004
//	class UGUITabPanel*                                NewTabPanel;                                      		// 0x0038 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	class UGUITabPanel*                                OldTabPanel;                                      		// 0x003C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabControl.InsertTab
// Flags: 
struct UGUITabControl_execInsertTab_Parms
{
	int                                                pos;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Caption;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     PanelClass;                                       		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUITabPanel*                                ExistingPanel;                                    		// 0x001C ( 0x0004[ CPF_ExportObject | CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     InHint;                                           		// 0x0020 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bForceActive:1;                                   		// 0x002C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UGUITabPanel*                                ReturnValue;                                      		// 0x0030 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UClass*                                      NewPanelClass;                                    		// 0x0034 ( 0x0004
//	class UGUITabPanel*                                NewTabPanel;                                      		// 0x0038 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	class UGUITabButton*                               NewTabButton;                                     		// 0x003C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabControl.AddTab
// Flags: 
struct UGUITabControl_execAddTab_Parms
{
	struct FString                                     InCaption;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     PanelClass;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUITabPanel*                                ExistingPanel;                                    		// 0x0018 ( 0x0004[ CPF_ExportObject | CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     InHint;                                           		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bForceActive:1;                                   		// 0x0028 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UGUITabPanel*                                ReturnValue;                                      		// 0x002C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UClass*                                      NewPanelClass;                                    		// 0x0030 ( 0x0004
//	class UGUITabButton*                               NewTabButton;                                     		// 0x0034 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	class UGUITabPanel*                                NewTabPanel;                                      		// 0x0038 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	unsigned char                                      myFontScale;                                      		// 0x003C ( 0x0001
//	int                                                i;                                                		// 0x0040 ( 0x0004
};

// Function XInterface.GUITabControl.AddTabItem
// Flags: 
struct UGUITabControl_execAddTabItem_Parms
{
	struct FGUITabItem                                 Item;                                             		// 0x0000 ( 0x0024[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUITabPanel*                                ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabControl.InternalOnKeyEvent
// Flags: 
struct UGUITabControl_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x000C ( 0x0004
//	int                                                aTabIndex;                                        		// 0x0010 ( 0x0004
//	int                                                StartIndex;                                       		// 0x0014 ( 0x0004
};

// Function XInterface.GUITabControl.Closed
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventClosed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bCancelled:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUITabControl.Opened
// Flags: [ FUNC_Event ]
struct UGUITabControl_eventOpened_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUITabControl.InitComponent
// Flags: 
struct UGUITabControl_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabButton.CanShowPanel
// Flags: 
struct UGUITabButton_execCanShowPanel_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabButton.ChangeActiveState
// Flags: 
struct UGUITabButton_execChangeActiveState_Parms
{
	unsigned long                                      IsActive:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bFocusPanel:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabButton.SetFocus
// Flags: [ FUNC_Event ]
struct UGUITabButton_eventSetFocus_Parms
{
	class UGUIComponent*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUITabPanel.GetTooltipPos
// Flags: 
struct UGUITabPanel_execGetTooltipPos_Parms
{
	int                                                tooltipWidth;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                tooltipHeight;                                    		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                nOffsetX;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                nOffsetY;                                         		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FFloatBox                                   ReturnValue;                                      		// 0x0010 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   TooltipPos;                                       		// 0x0020 ( 0x0010
};

// Function XInterface.GUITabPanel.CanShowPanel
// Flags: 
struct UGUITabPanel_execCanShowPanel_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUITabPanel.ShowPanel
// Flags: 
struct UGUITabPanel_execShowPanel_Parms
{
	unsigned long                                      bShow:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUITabPanel.free
// Flags: [ FUNC_Event ]
struct UGUITabPanel_eventfree_Parms
{
};

// Function XInterface.GUITabPanel.OnDestroyPanel
// Flags: 
struct UGUITabPanel_execOnDestroyPanel_Parms
{
	unsigned long                                      bCancelled:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUITabPanel.InitPanel
// Flags: 
struct UGUITabPanel_execInitPanel_Parms
{
};

// Function XInterface.GUITabPanel.Refresh
// Flags: 
struct UGUITabPanel_execRefresh_Parms
{
};

// Function XInterface.GUIEditBox.IMEInputCancel
// Flags: 
struct UGUIEditBox_execIMEInputCancel_Parms
{
};

// Function XInterface.GUIEditBox.InternalDeactivate
// Flags: 
struct UGUIEditBox_execInternalDeactivate_Parms
{
};

// Function XInterface.GUIEditBox.InternalActivate
// Flags: 
struct UGUIEditBox_execInternalActivate_Parms
{
};

// Function XInterface.GUIEditBox.TextChanged
// Flags: 
struct UGUIEditBox_execTextChanged_Parms
{
};

// Function XInterface.GUIEditBox.GetText
// Flags: 
struct UGUIEditBox_execGetText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIEditBox.ConvertIllegal
// Flags: 
struct UGUIEditBox_execConvertIllegal_Parms
{
	struct FString                                     inputstr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
//	int                                                Max;                                              		// 0x001C ( 0x0004
//	struct FString                                     retval;                                           		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     C;                                                		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIEditBox.InternalOnKeyEvent
// Flags: 
struct UGUIEditBox_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIEditBox.InternalOnKeyType
// Flags: 
struct UGUIEditBox_execInternalOnKeyType_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	struct FString                                     Unicode;                                          		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     temp;                                             		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     st;                                               		// 0x0020 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIEditBox.DeleteChar
// Flags: 
struct UGUIEditBox_execDeleteChar_Parms
{
};

// Function XInterface.GUIEditBox.SetText
// Flags: [ FUNC_Event ]
struct UGUIEditBox_eventSetText_Parms
{
	struct FString                                     NewText;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bChanged:1;                                       		// 0x000C ( 0x0004 [0x00000001]
};

// Function XInterface.GUIEditBox.InitComponent
// Flags: 
struct UGUIEditBox_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIEditBox.OnIME_Notify
// Flags: [ FUNC_Native ]
struct UGUIEditBox_execOnIME_Notify_Parms
{
	int                                                Type;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                LangID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     strText;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                nStartPos;                                        		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                nSize;                                            		// 0x0018 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollBarBase.SetFriendlyLabel
// Flags: 
struct UGUIScrollBarBase_execSetFriendlyLabel_Parms
{
	class UGUILabel*                                   NewLabel;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollBarBase.GripPreDraw
// Flags: 
struct UGUIScrollBarBase_execGripPreDraw_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollBarBase.Refocus
// Flags: 
struct UGUIScrollBarBase_execRefocus_Parms
{
	class UGUIComponent*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIScrollBarBase.AlignThumb
// Flags: 
struct UGUIScrollBarBase_execAlignThumb_Parms
{
	float                                              NewPos;                                           		// 0x0000 ( 0x0004
};

// Function XInterface.GUIScrollBarBase.WheelDown
// Flags: 
struct UGUIScrollBarBase_execWheelDown_Parms
{
};

// Function XInterface.GUIScrollBarBase.WheelUp
// Flags: 
struct UGUIScrollBarBase_execWheelUp_Parms
{
};

// Function XInterface.GUIScrollBarBase.IncreaseClick
// Flags: 
struct UGUIScrollBarBase_execIncreaseClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollBarBase.DecreaseClick
// Flags: 
struct UGUIScrollBarBase_execDecreaseClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollBarBase.MoveGripBy
// Flags: 
struct UGUIScrollBarBase_execMoveGripBy_Parms
{
	int                                                items;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                NewItem;                                          		// 0x0004 ( 0x0004
};

// Function XInterface.GUIScrollBarBase.UpdateGripPosition
// Flags: 
struct UGUIScrollBarBase_execUpdateGripPosition_Parms
{
	float                                              NewPos;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIScrollBarBase.SetList
// Flags: 
struct UGUIScrollBarBase_execSetList_Parms
{
	class UGUIListBase*                                List;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollBarBase.InitComponent
// Flags: 
struct UGUIScrollBarBase_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIScrollBarBase.PositionChanged
// Flags: 
struct UGUIScrollBarBase_execPositionChanged_Parms
{
	int                                                NewPos;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIScrollZoneBase.InternalOnClick
// Flags: 
struct UGUIScrollZoneBase_execInternalOnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIScrollZoneBase.OnScrollZoneClick
// Flags: 
struct UGUIScrollZoneBase_execOnScrollZoneClick_Parms
{
	float                                              Delta;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIGFXButton.InternalOnClick
// Flags: 
struct UGUIGFXButton_execInternalOnClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIGFXButton.SetChecked
// Flags: 
struct UGUIGFXButton_execSetChecked_Parms
{
	unsigned long                                      bNewChecked:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIGFXButton.InitComponent
// Flags: 
struct UGUIGFXButton_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComboBox.FocusLast
// Flags: 
struct UGUIComboBox_execFocusLast_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.FocusFirst
// Flags: 
struct UGUIComboBox_execFocusFirst_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.LoseFocus
// Flags: 
struct UGUIComboBox_execLoseFocus_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComboBox.SetFriendlyLabel
// Flags: 
struct UGUIComboBox_execSetFriendlyLabel_Parms
{
	class UGUILabel*                                   NewLabel;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComboBox.CenterMouse
// Flags: 
struct UGUIComboBox_execCenterMouse_Parms
{
};

// Function XInterface.GUIComboBox.Clear
// Flags: 
struct UGUIComboBox_execClear_Parms
{
};

// Function XInterface.GUIComboBox.InternalOnMousePressed
// Flags: 
struct UGUIComboBox_execInternalOnMousePressed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRepeat:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIComboBox.ReadOnly
// Flags: 
struct UGUIComboBox_execReadOnly_Parms
{
	unsigned long                                      B:1;                                              		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIComboBox.ItemCount
// Flags: 
struct UGUIComboBox_execItemCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.FindIndex
// Flags: 
struct UGUIComboBox_execFindIndex_Parms
{
	struct FString                                     Test;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bExact:1;                                         		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExtra:1;                                         		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     obj;                                              		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.FindExtra
// Flags: 
struct UGUIComboBox_execFindExtra_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bExact:1;                                         		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.Find
// Flags: 
struct UGUIComboBox_execFind_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bExact:1;                                         		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExtra:1;                                         		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.GetItemObject
// Flags: 
struct UGUIComboBox_execGetItemObject_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.GetItem
// Flags: 
struct UGUIComboBox_execGetItem_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.RemoveItem
// Flags: 
struct UGUIComboBox_execRemoveItem_Parms
{
	int                                                Item;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Count;                                            		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIComboBox.AddItem
// Flags: 
struct UGUIComboBox_execAddItem_Parms
{
	struct FString                                     Item;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UObject*                                     Extra;                                            		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     str;                                              		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.GetIndex
// Flags: 
struct UGUIComboBox_execGetIndex_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.SetIndex
// Flags: 
struct UGUIComboBox_execSetIndex_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIComboBox.GetExtra
// Flags: 
struct UGUIComboBox_execGetExtra_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     temp;                                             		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.GetObject
// Flags: 
struct UGUIComboBox_execGetObject_Parms
{
	class UObject*                                     ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     temp;                                             		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.GetText
// Flags: 
struct UGUIComboBox_execGetText_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.Get
// Flags: 
struct UGUIComboBox_execGet_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.SetExtra
// Flags: 
struct UGUIComboBox_execSetExtra_Parms
{
	struct FString                                     NewExtra;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bListItemsOnly:1;                                 		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIComboBox.SetText
// Flags: 
struct UGUIComboBox_execSetText_Parms
{
	struct FString                                     NewText;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bListItemsOnly:1;                                 		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIComboBox.TextChanged
// Flags: 
struct UGUIComboBox_execTextChanged_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComboBox.ItemChanged
// Flags: 
struct UGUIComboBox_execItemChanged_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComboBox.ShowListBox
// Flags: 
struct UGUIComboBox_execShowListBox_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.SetVisibility
// Flags: [ FUNC_Event ]
struct UGUIComboBox_eventSetVisibility_Parms
{
	unsigned long                                      bIsVisible:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bTemp:1;                                          		// 0x0004 ( 0x0004 [0x00000001]
};

// Function XInterface.GUIComboBox.HideListBox
// Flags: 
struct UGUIComboBox_execHideListBox_Parms
{
};

// Function XInterface.GUIComboBox.InternalOnLoadINI
// Flags: 
struct UGUIComboBox_execInternalOnLoadINI_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     S;                                                		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.InternalOnSaveINI
// Flags: 
struct UGUIComboBox_execInternalOnSaveINI_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.InternalListClick
// Flags: 
struct UGUIComboBox_execInternalListClick_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComboBox.InternalEditPressed
// Flags: 
struct UGUIComboBox_execInternalEditPressed_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bRepeat:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIComboBox.InternalOnInvalidate
// Flags: 
struct UGUIComboBox_execInternalOnInvalidate_Parms
{
	class UGUIComponent*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComboBox.InternalListDeActivate
// Flags: 
struct UGUIComboBox_execInternalListDeActivate_Parms
{
};

// Function XInterface.GUIComboBox.InternalOnKeyEvent
// Flags: 
struct UGUIComboBox_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      iKey;                                             		// 0x000C ( 0x0001
};

// Function XInterface.GUIComboBox.SetHint
// Flags: 
struct UGUIComboBox_execSetHint_Parms
{
	struct FString                                     NewHint;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComboBox.InitComponent
// Flags: 
struct UGUIComboBox_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComboBox.OnHideList
// Flags: 
struct UGUIComboBox_execOnHideList_Parms
{
};

// Function XInterface.GUIComboBox.OnShowList
// Flags: 
struct UGUIComboBox_execOnShowList_Parms
{
};

// Function XInterface.GUIMenuOption.SetFriendlyLabel
// Flags: 
struct UGUIMenuOption_execSetFriendlyLabel_Parms
{
	class UGUILabel*                                   NewLabel;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIMenuOption.CenterMouse
// Flags: 
struct UGUIMenuOption_execCenterMouse_Parms
{
};

// Function XInterface.GUIMenuOption.InternalOnCreateComponent
// Flags: 
struct UGUIMenuOption_execInternalOnCreateComponent_Parms
{
	class UGUIComponent*                               NewComp;                                          		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	class UGUIComponent*                               Sender;                                           		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIMenuOption.InternalOnChange
// Flags: 
struct UGUIMenuOption_execInternalOnChange_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIMenuOption.MenuOptionClicked
// Flags: 
struct UGUIMenuOption_execMenuOptionClicked_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIMenuOption.SetCaption
// Flags: 
struct UGUIMenuOption_execSetCaption_Parms
{
	struct FString                                     NewCaption;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIMenuOption.SetHint
// Flags: 
struct UGUIMenuOption_execSetHint_Parms
{
	struct FString                                     NewHint;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIMenuOption.SetReadOnly
// Flags: 
struct UGUIMenuOption_execSetReadOnly_Parms
{
	unsigned long                                      bValue:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIMenuOption.ResetComponent
// Flags: 
struct UGUIMenuOption_execResetComponent_Parms
{
};

// Function XInterface.GUIMenuOption.GetComponentValue
// Flags: 
struct UGUIMenuOption_execGetComponentValue_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIMenuOption.SetComponentValue
// Flags: 
struct UGUIMenuOption_execSetComponentValue_Parms
{
	struct FString                                     NewValue;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
	unsigned long                                      bNoChange:1;                                      		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIMenuOption.InitComponent
// Flags: 
struct UGUIMenuOption_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIPanel.InitComponent
// Flags: 
struct UGUIPanel_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIPanel.OnPostDraw
// Flags: 
struct UGUIPanel_execOnPostDraw_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIImage.AdditionalDebugString
// Flags: [ FUNC_Event ]
struct UGUIImage_eventAdditionalDebugString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUISectionBackground.SetPosition
// Flags: 
struct UGUISectionBackground_execSetPosition_Parms
{
	float                                              NewLeft;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              NewTop;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              NewWidth;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              NewHeight;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRelative:1;                                      		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUISectionBackground.ResolutionChanged
// Flags: [ FUNC_Event ]
struct UGUISectionBackground_eventResolutionChanged_Parms
{
	int                                                ResX;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ResY;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUISectionBackground.InternalPreDraw
// Flags: 
struct UGUISectionBackground_execInternalPreDraw_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              AL;                                               		// 0x0008 ( 0x0004
//	float                                              AT;                                               		// 0x000C ( 0x0004
//	float                                              AW;                                               		// 0x0010 ( 0x0004
//	float                                              AH;                                               		// 0x0014 ( 0x0004
//	float                                              LPad;                                             		// 0x0018 ( 0x0004
//	float                                              RPad;                                             		// 0x001C ( 0x0004
//	float                                              TPad;                                             		// 0x0020 ( 0x0004
//	float                                              BPad;                                             		// 0x0024 ( 0x0004
};

// Function XInterface.GUISectionBackground.Reset
// Flags: 
struct UGUISectionBackground_execReset_Parms
{
};

// Function XInterface.GUISectionBackground.FindComponentIndex
// Flags: 
struct UGUISectionBackground_execFindComponentIndex_Parms
{
	class UGUIComponent*                               Comp;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUISectionBackground.UnmanageComponent
// Flags: 
struct UGUISectionBackground_execUnmanageComponent_Parms
{
	class UGUIComponent*                               Comp;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUISectionBackground.ManageComponent
// Flags: 
struct UGUISectionBackground_execManageComponent_Parms
{
	class UGUIComponent*                               Component;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUISectionBackground.SetVisibility
// Flags: [ FUNC_Event ]
struct UGUISectionBackground_eventSetVisibility_Parms
{
	unsigned long                                      bIsVisible:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUISectionBackground.InitComponent
// Flags: 
struct UGUISectionBackground_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIContextMenu.ReplaceItem
// Flags: 
struct UGUIContextMenu_execReplaceItem_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     NewItem;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIContextMenu.RemoveItemByIndex
// Flags: 
struct UGUIContextMenu_execRemoveItemByIndex_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIContextMenu.RemoveItemByName
// Flags: 
struct UGUIContextMenu_execRemoveItemByName_Parms
{
	struct FString                                     ItemName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Index;                                            		// 0x0010 ( 0x0004
};

// Function XInterface.GUIContextMenu.InsertItem
// Flags: 
struct UGUIContextMenu_execInsertItem_Parms
{
	struct FString                                     NewItem;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Index;                                            		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIContextMenu.AddItem
// Flags: 
struct UGUIContextMenu_execAddItem_Parms
{
	struct FString                                     NewItem;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Index;                                            		// 0x0010 ( 0x0004
};

// Function XInterface.GUIContextMenu.OnContextHitTest
// Flags: 
struct UGUIContextMenu_execOnContextHitTest_Parms
{
	float                                              MouseX;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              MouseY;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIContextMenu.OnSelect
// Flags: 
struct UGUIContextMenu_execOnSelect_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                ClickIndex;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIContextMenu.OnClose
// Flags: 
struct UGUIContextMenu_execOnClose_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIContextMenu.OnOpen
// Flags: 
struct UGUIContextMenu_execOnOpen_Parms
{
	class UGUIContextMenu*                             Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIToolTip.SetTip
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIToolTip_execSetTip_Parms
{
	struct FString                                     NewTip;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIToolTip.GetTopBelowCursor
// Flags: 
struct UGUIToolTip_execGetTopBelowCursor_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              TargetY;                                          		// 0x0008 ( 0x0004
//	float                                              TempY;                                            		// 0x000C ( 0x0004
};

// Function XInterface.GUIToolTip.GetTopAboveCursor
// Flags: 
struct UGUIToolTip_execGetTopAboveCursor_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              TargetY;                                          		// 0x0008 ( 0x0004
//	float                                              TempY;                                            		// 0x000C ( 0x0004
};

// Function XInterface.GUIToolTip.GetHeight
// Flags: 
struct UGUIToolTip_execGetHeight_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              XL;                                               		// 0x0008 ( 0x0004
//	float                                              YL;                                               		// 0x000C ( 0x0004
};

// Function XInterface.GUIToolTip.GetWidth
// Flags: 
struct UGUIToolTip_execGetWidth_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	float                                              MaxLineWidth;                                     		// 0x000C ( 0x0004
//	float                                              XL;                                               		// 0x0010 ( 0x0004
//	float                                              YL;                                               		// 0x0014 ( 0x0004
};

// Function XInterface.GUIToolTip.GetTop
// Flags: 
struct UGUIToolTip_execGetTop_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              TargetTop;                                        		// 0x0008 ( 0x0004
};

// Function XInterface.GUIToolTip.GetLeft
// Flags: 
struct UGUIToolTip_execGetLeft_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              X;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIToolTip.UpdatePosition
// Flags: [ FUNC_Event ]
struct UGUIToolTip_eventUpdatePosition_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIToolTip.HideToolTip
// Flags: 
struct UGUIToolTip_execHideToolTip_Parms
{
};

// Function XInterface.GUIToolTip.ShowToolTip
// Flags: 
struct UGUIToolTip_execShowToolTip_Parms
{
};

// Function XInterface.GUIToolTip.Tick
// Flags: 
struct UGUIToolTip_execTick_Parms
{
	float                                              RealSeconds;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIToolTip.InternalLeaveArea
// Flags: 
struct UGUIToolTip_execInternalLeaveArea_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIToolTip.LeaveArea
// Flags: 
struct UGUIToolTip_execLeaveArea_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIToolTip.InternalEnterArea
// Flags: 
struct UGUIToolTip_execInternalEnterArea_Parms
{
	class UGUIToolTip*                                 ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIToolTip.EnterArea
// Flags: 
struct UGUIToolTip_execEnterArea_Parms
{
	class UGUIToolTip*                                 ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIButton.InternalOnKeyEvent
// Flags: 
struct UGUIButton_execInternalOnKeyEvent_Parms
{
	unsigned char                                      key;                                              		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      State;                                            		// 0x0001 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	float                                              Delta;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIButton.InitComponent
// Flags: 
struct UGUIButton_execInitComponent_Parms
{
	class UGUIController*                              MyController;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIComponent*                               myOwner;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned char                                      X;                                                		// 0x0008 ( 0x0001
};

// Function XInterface.GUIController.ShowQuestionDialog
// Flags: 
struct UGUIController_execShowQuestionDialog_Parms
{
	struct FString                                     Question;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Buttons;                                          		// 0x000C ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	unsigned char                                      defButton;                                        		// 0x000D ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	class UGUIQuestionPage*                            ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UGUIQuestionPage*                            QPage;                                            		// 0x0014 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.KeyPressed
// Flags: [ FUNC_Final ]
struct UGUIController_execKeyPressed_Parms
{
	unsigned char                                      iKey;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.SearchBinds
// Flags: [ FUNC_Final ]
struct UGUIController_execSearchBinds_Parms
{
	struct FString                                     BindAliasMask;                                    		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     BindAliases;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     S;                                                		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetAssignedKeys
// Flags: [ FUNC_Final ]
struct UGUIController_execGetAssignedKeys_Parms
{
	struct FString                                     BindAlias;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     BindKeyNames;                                     		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     LocalizedBindKeyNames;                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0028 ( 0x0004
//	int                                                iKey;                                             		// 0x002C ( 0x0004
//	struct FString                                     S;                                                		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetCurrentBind
// Flags: [ FUNC_Final ]
struct UGUIController_execGetCurrentBind_Parms
{
	struct FString                                     BindKeyName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     BindKeyValue;                                     		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.KeyNameFromIndex
// Flags: [ FUNC_Final ]
struct UGUIController_execKeyNameFromIndex_Parms
{
	unsigned char                                      iKey;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     KeyName;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     LocalizedKeyName;                                 		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.SetKeyBind
// Flags: [ FUNC_Final ]
struct UGUIController_execSetKeyBind_Parms
{
	struct FString                                     BindKeyName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     BindKeyValue;                                     		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.GetQuitPage
// Flags: 
struct UGUIController_execGetQuitPage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetSettingsPage
// Flags: 
struct UGUIController_execGetSettingsPage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetModPage
// Flags: 
struct UGUIController_execGetModPage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetInstantActionPage
// Flags: 
struct UGUIController_execGetInstantActionPage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetMultiplayerPage
// Flags: 
struct UGUIController_execGetMultiplayerPage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetServerBrowserPage
// Flags: 
struct UGUIController_execGetServerBrowserPage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetSinglePlayerPage
// Flags: 
struct UGUIController_execGetSinglePlayerPage_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetMainMenuClass
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execGetMainMenuClass_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.Validate
// Flags: [ FUNC_Event ]
struct UGUIController_eventValidate_Parms
{
};

// Function XInterface.GUIController.ConsolidateMenus
// Flags: 
struct UGUIController_execConsolidateMenus_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                j;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIController.PurgeComponentClasses
// Flags: 
struct UGUIController_execPurgeComponentClasses_Parms
{
};

// Function XInterface.GUIController.PurgeObjectReferences
// Flags: 
struct UGUIController_execPurgeObjectReferences_Parms
{
	class UClass*                                      OriginalStyle;                                    		// 0x0000 ( 0x0004
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIController.VerifyStack
// Flags: 
struct UGUIController_execVerifyStack_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIController.CloseOverlays
// Flags: 
struct UGUIController_execCloseOverlays_Parms
{
};

// Function XInterface.GUIController.NotifyLevelChange
// Flags: [ FUNC_Event ]
struct UGUIController_eventNotifyLevelChange_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIController.SetRequiredGameResolution
// Flags: [ FUNC_Event ]
struct UGUIController_eventSetRequiredGameResolution_Parms
{
	struct FString                                     GameRes;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.NeedsMenuResolution
// Flags: [ FUNC_Event ]
struct UGUIController_eventNeedsMenuResolution_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIController.CanShowHints
// Flags: [ FUNC_Event ]
struct UGUIController_eventCanShowHints_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.HasMouseMoved
// Flags: 
struct UGUIController_execHasMouseMoved_Parms
{
	float                                              ErrorMargin;                                      		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.MoveFocused
// Flags: [ FUNC_Event ]
struct UGUIController_eventMoveFocused_Parms
{
	class UGUIComponent*                               C;                                                		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                bmLeft;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                bmTop;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                bmWidth;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                bmHeight;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              ClipX;                                            		// 0x0014 ( 0x0004[ CPF_Parm ]
	float                                              ClipY;                                            		// 0x0018 ( 0x0004[ CPF_Parm ]
	float                                              val;                                              		// 0x001C ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIController.ResetFocus
// Flags: 
struct UGUIController_execResetFocus_Parms
{
};

// Function XInterface.GUIController.ChangeFocus
// Flags: [ FUNC_Event ]
struct UGUIController_eventChangeFocus_Parms
{
	class UGUIComponent*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.SetControllerStatus
// Flags: 
struct UGUIController_execSetControllerStatus_Parms
{
	unsigned long                                      On:1;                                             		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bWasActive:1;                                     		// 0x0004 ( 0x0004 [0x00000001]
};

// Function XInterface.GUIController.PerformRestore
// Flags: 
struct UGUIController_execPerformRestore_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                idx;                                              		// 0x0004 ( 0x0004
};

// Function XInterface.GUIController.SaveRestorePages
// Flags: 
struct UGUIController_execSaveRestorePages_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	struct FString                                     Param1;                                           		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     MenuClass;                                        		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.Count
// Flags: 
struct UGUIController_execCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.CloseAll
// Flags: [ FUNC_Event ]
struct UGUIController_eventCloseAll_Parms
{
	unsigned long                                      bCancel:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bForced:1;                                        		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIController.ClickCloseWndBtn
// Flags: 
struct UGUIController_execClickCloseWndBtn_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.PressedCloseWndBtn
// Flags: 
struct UGUIController_execPressedCloseWndBtn_Parms
{
};

// Function XInterface.GUIController.CloseMenu
// Flags: [ FUNC_Event ]
struct UGUIController_eventCloseMenu_Parms
{
	unsigned long                                      bCancelled:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.RemoveMenu
// Flags: [ FUNC_Event ]
struct UGUIController_eventRemoveMenu_Parms
{
	class UGUIPage*                                    Menu;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bCancelled:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.RemoveMenuAt
// Flags: 
struct UGUIController_execRemoveMenuAt_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bCancelled:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.PopMenu
// Flags: [ FUNC_Event ]
struct UGUIController_eventPopMenu_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIPage*                                    CurMenu;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bCancelled:1;                                     		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIController.PushMenu
// Flags: [ FUNC_Event ]
struct UGUIController_eventPushMenu_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIPage*                                    NewMenu;                                          		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Param1;                                           		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x0014 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.ReplaceMenu2
// Flags: 
struct UGUIController_execReplaceMenu2_Parms
{
	struct FString                                     NewMenuName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bCancelled:1;                                     		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class UGUIPage*                                    ppage;                                            		// 0x0010 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.ReplaceMenu2_FadedOut
// Flags: 
struct UGUIController_execReplaceMenu2_FadedOut_Parms
{
};

// Function XInterface.GUIController.CloseMenuPage
// Flags: 
struct UGUIController_execCloseMenuPage_Parms
{
	class UGUIPage*                                    SelectPage;                                       		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bCancelled:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIController.ReplaceMenu
// Flags: [ FUNC_Event ]
struct UGUIController_eventReplaceMenu_Parms
{
	struct FString                                     NewMenuName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param1;                                           		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x0018 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bCancelled:1;                                     		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UGUIPage*                                    NewMenu;                                          		// 0x002C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.AutoLoadMenus
// Flags: [ FUNC_Event ]
struct UGUIController_eventAutoLoadMenus_Parms
{
	class UGUIPage*                                    NewMenu;                                          		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIController.OpenMenuByObject
// Flags: 
struct UGUIController_execOpenMenuByObject_Parms
{
	class UGUIPage*                                    NewMenu;                                          		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	struct FString                                     Param1;                                           		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.OpenMenu
// Flags: [ FUNC_Event ]
struct UGUIController_eventOpenMenu_Parms
{
	struct FString                                     NewMenuName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param1;                                           		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x0018 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UGUIPage*                                    NewMenu;                                          		// 0x0028 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.CreateMenu
// Flags: [ FUNC_Event ]
struct UGUIController_eventCreateMenu_Parms
{
	struct FString                                     NewMenuName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUIPage*                                    ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UClass*                                      NewMenuClass;                                     		// 0x0010 ( 0x0004
//	class UGUIPage*                                    NewMenu;                                          		// 0x0014 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x0018 ( 0x0004
};

// Function XInterface.GUIController.GetLastMenu
// Flags: 
struct UGUIController_execGetLastMenu_Parms
{
	class UGUIPage*                                    ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.LogControlInfo
// Flags: 
struct UGUIController_execLogControlInfo_Parms
{
	class UGUIComponent*                               Sender;                                           		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.LogControllerInfo
// Flags: 
struct UGUIController_execLogControllerInfo_Parms
{
};

// Function XInterface.GUIController.LogMenuStack
// Flags: 
struct UGUIController_execLogMenuStack_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	class UGUIPage*                                    Page;                                             		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.GetMenuByIndex
// Flags: 
struct UGUIController_execGetMenuByIndex_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIPage*                                    ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.FindMenuByClass
// Flags: 
struct UGUIController_execFindMenuByClass_Parms
{
	class UClass*                                      PageClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIPage*                                    ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIController.FindPersistentMenuByClass
// Flags: 
struct UGUIController_execFindPersistentMenuByClass_Parms
{
	class UClass*                                      PageClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UGUIPage*                                    ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIController.FindPersistentMenuIndex
// Flags: [ FUNC_Event ]
struct UGUIController_eventFindPersistentMenuIndex_Parms
{
	class UGUIPage*                                    Menu;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIController.FindMenuIndex
// Flags: [ FUNC_Event ]
struct UGUIController_eventFindMenuIndex_Parms
{
	class UGUIPage*                                    Menu;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function XInterface.GUIController.FindMenuIndexByName
// Flags: [ FUNC_Event ]
struct UGUIController_eventFindMenuIndexByName_Parms
{
	struct FString                                     MenuClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIController.FindPersistentMenuByName
// Flags: [ FUNC_Event ]
struct UGUIController_eventFindPersistentMenuByName_Parms
{
	struct FString                                     MenuClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUIPage*                                    ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function XInterface.GUIController.AddComponentClass
// Flags: [ FUNC_Event ]
struct UGUIController_eventAddComponentClass_Parms
{
	struct FString                                     ClassName;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	class UClass*                                      cls;                                              		// 0x0014 ( 0x0004
};

// Function XInterface.GUIController.RegisterStyle
// Flags: 
struct UGUIController_execRegisterStyle_Parms
{
	class UClass*                                      StyleClass;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bTemporary:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UGUIStyles*                                  NewStyle;                                         		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	int                                                Index;                                            		// 0x0014 ( 0x0004
};

// Function XInterface.GUIController.InitializeController
// Flags: [ FUNC_Event ]
struct UGUIController_eventInitializeController_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	class UClass*                                      NewStyleClass;                                    		// 0x0004 ( 0x0004
};

// Function XInterface.GUIController.TopPage
// Flags: 
struct UGUIController_execTopPage_Parms
{
	class UGUIPage*                                    ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.GetTeamSymbolList
// Flags: [ FUNC_Final ]
struct UGUIController_execGetTeamSymbolList_Parms
{
	class TArray< struct FString >                     SymbolNames;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      bNoSinglePlayer:1;                                		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIController.LoadDecoText
// Flags: 
struct UGUIController_execLoadDecoText_Parms
{
	struct FString                                     PackageName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     DecoTextName;                                     		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0024 ( 0x0004
//	class UDecoText*                                   Deco;                                             		// 0x0028 ( 0x0004
//	struct FString                                     DecoText;                                         		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.CheckForECE
// Flags: [ FUNC_Native ]
struct UGUIController_execCheckForECE_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.AuthroizeFirewall
// Flags: [ FUNC_Native ]
struct UGUIController_execAuthroizeFirewall_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.CheckFirewall
// Flags: [ FUNC_Native ]
struct UGUIController_execCheckFirewall_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.LaunchURL
// Flags: [ FUNC_Native ]
struct UGUIController_execLaunchURL_Parms
{
	struct FString                                     URL;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetMapList
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execGetMapList_Parms
{
	struct FString                                     Prefix;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUIList*                                    List;                                             		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bDecoText:1;                                      		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIController.GetWeaponList
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execGetWeaponList_Parms
{
	class TArray< class UClass* >                      WeaponClass;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     WeaponDesc;                                       		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.SaveOwnageList
// Flags: [ FUNC_Native ]
struct UGUIController_execSaveOwnageList_Parms
{
	class TArray< struct FeOwnageMap >                 Maps;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetOwnageList
// Flags: [ FUNC_Native ]
struct UGUIController_execGetOwnageList_Parms
{
	class TArray< int >                                RLevel;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     MNames;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     MDesc;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     mURL;                                             		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetDEMHeader
// Flags: [ FUNC_Native ]
struct UGUIController_execGetDEMHeader_Parms
{
	struct FString                                     DemoName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     MapName;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     GameType;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	int                                                ScoreLimit;                                       		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                TimeLimit;                                        		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                ClientSide;                                       		// 0x002C ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     RecordedBy;                                       		// 0x0030 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     TimeStamp;                                        		// 0x003C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     ReqPackages;                                      		// 0x0048 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0054 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.GetDEMList
// Flags: [ FUNC_Native ]
struct UGUIController_execGetDEMList_Parms
{
	class TArray< struct FString >                     DEMFiles;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.Profile
// Flags: [ FUNC_Native ]
struct UGUIController_execProfile_Parms
{
	struct FString                                     ProfileName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.SetMoveControl
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execSetMoveControl_Parms
{
	class UGUIComponent*                               C;                                                		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.PlayInterfaceSound
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execPlayInterfaceSound_Parms
{
	unsigned char                                      soundType;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function XInterface.GUIController.GetOGGList
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execGetOGGList_Parms
{
	class TArray< struct FString >                     OGGFiles;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.ResetKeyboard
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execResetKeyboard_Parms
{
};

// Function XInterface.GUIController.GetProfileList
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execGetProfileList_Parms
{
	struct FString                                     Prefix;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ProfileList;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.ResetInput
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execResetInput_Parms
{
};

// Function XInterface.GUIController.ResetDesigner
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execResetDesigner_Parms
{
};

// Function XInterface.GUIController.SetRenderDevice
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execSetRenderDevice_Parms
{
	struct FString                                     NewRenderDevice;                                  		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.GetCurrentRes
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIController_execGetCurrentRes_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.GetStyle
// Flags: [ FUNC_Event | FUNC_Native ]
struct UGUIController_eventGetStyle_Parms
{
	struct FString                                     StyleName;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      FontScale;                                        		// 0x000C ( 0x0001[ CPF_Parm | CPF_OutParm ]
	class UGUIStyles*                                  ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.GetMenuFont
// Flags: [ FUNC_Event | FUNC_Native ]
struct UGUIController_eventGetMenuFont_Parms
{
	struct FString                                     FontName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UGUIFont*                                    ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIController.AddBuddy
// Flags: 
struct UGUIController_execAddBuddy_Parms
{
	struct FString                                     NewBuddyName;                                     		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIController.OnNeedRawKeyPress
// Flags: 
struct UGUIController_execOnNeedRawKeyPress_Parms
{
	unsigned char                                      NewKey;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIController.PopPage
// Flags: 
struct UGUIController_execPopPage_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	int                                                j;                                                		// 0x0004 ( 0x0004
};

// Function XInterface.GUIController.PushPage
// Flags: 
struct UGUIController_execPushPage_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIFont.LoadFont
// Flags: 
struct UGUIFont_execLoadFont_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UFont*                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIFont.LoadFontStatic
// Flags: 
struct UGUIFont_execLoadFontStatic_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UFont*                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIFont.GetFont
// Flags: [ FUNC_Event | FUNC_Native ]
struct UGUIFont_eventGetFont_Parms
{
	int                                                XRes;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UFont*                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIStyles.Initialize
// Flags: [ FUNC_Event ]
struct UGUIStyles_eventInitialize_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function XInterface.GUIStyles.btrDrawTextStyles
// Flags: [ FUNC_Native ]
struct UGUIStyles_execbtrDrawTextStyles_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MenuState;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	float                                              Left;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Top;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              width;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              Height;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Align;                                            		// 0x0018 ( 0x0001[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      FontScale;                                        		// 0x0028 ( 0x0001[ CPF_Parm ]
	int                                                FontSize;                                         		// 0x002C ( 0x0004[ CPF_Parm ]
	float                                              R;                                                		// 0x0030 ( 0x0004[ CPF_Parm ]
	float                                              G;                                                		// 0x0034 ( 0x0004[ CPF_Parm ]
	float                                              B;                                                		// 0x0038 ( 0x0004[ CPF_Parm ]
	float                                              A;                                                		// 0x003C ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIStyles.btrTextSizeStyles
// Flags: [ FUNC_Native ]
struct UGUIStyles_execbtrTextSizeStyles_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MenuState;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              XL;                                               		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YL;                                               		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      FontScale;                                        		// 0x001C ( 0x0001[ CPF_Parm ]
	int                                                FontSize;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIStyles.TextSize
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIStyles_execTextSize_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MenuState;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              XL;                                               		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YL;                                               		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      FontScale;                                        		// 0x001C ( 0x0001[ CPF_Parm ]
};

// Function XInterface.GUIStyles.DrawText
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIStyles_execDrawText_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MenuState;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	float                                              Left;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Top;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              width;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              Height;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Align;                                            		// 0x0018 ( 0x0001[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      FontScale;                                        		// 0x0028 ( 0x0001[ CPF_Parm ]
};

// Function XInterface.GUIStyles.Draw
// Flags: [ FUNC_Final | FUNC_Native ]
struct UGUIStyles_execDraw_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MenuState;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	float                                              Left;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Top;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              width;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              Height;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
};

// Function XInterface.GUIStyles.OnDrawText
// Flags: 
struct UGUIStyles_execOnDrawText_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MenuState;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	float                                              Left;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Top;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              width;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              Height;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Align;                                            		// 0x0018 ( 0x0001[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      FontScale;                                        		// 0x0028 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIStyles.OnDraw
// Flags: 
struct UGUIStyles_execOnDraw_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      MenuState;                                        		// 0x0004 ( 0x0001[ CPF_Parm ]
	float                                              Left;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Top;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              width;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              Height;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUI.GetModLogo
// Flags: [ FUNC_Native ]
struct UGUI_execGetModLogo_Parms
{
	struct FString                                     ModDir;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UMaterial*                                   ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUI.GetModValue
// Flags: [ FUNC_Native ]
struct UGUI_execGetModValue_Parms
{
	struct FString                                     ModDir;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ModKey;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUI.GetModList
// Flags: [ FUNC_Native ]
struct UGUI_execGetModList_Parms
{
	class TArray< struct FString >                     ModDirs;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     ModTitles;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function XInterface.GUI.Profile
// Flags: [ FUNC_Native ]
struct UGUI_execProfile_Parms
{
	struct FString                                     ProfileName;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUI.JoinArray
// Flags: [ FUNC_Final ]
struct UGUI_execJoinArray_Parms
{
	class TArray< struct FString >                     StringArray;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Delim;                                            		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bIgnoreBlanks:1;                                  		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x001C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0028 ( 0x0004
//	struct FString                                     S;                                                		// 0x002C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function XInterface.GUI.IsDigit
// Flags: 
struct UGUI_execIsDigit_Parms
{
	struct FString                                     Test;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bAllowDecimal:1;                                  		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComponent.GetCurrentCanvas
// Flags: 
struct UGUIComponent_execGetCurrentCanvas_Parms
{
	class UCanvas*                                     ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function XInterface.GUIComponent.DebugTabOrder
// Flags: 
struct UGUIComponent_execDebugTabOrder_Parms
{
};

// Function XInterface.GUIComponent.LevelChanged
// Flags: 
struct UGUIComponent_execLevelChanged_Parms
{
};

// Function XInterface.GUIComponent.SetEnabled
// Flags: 
struct UGUIComponent_execSetEnabled_Parms
{
	unsigned long                                      Value:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIComponent.DisableMe
// Flags: 
struct UGUIComponent_execDisableMe_Parms
{
};

// Function XInterface.GUIComponent.EnableMe
// Flags: 
struct UGUIComponent_execEnableMe_Parms
{
};

// Function XInterface.GUIComponent.SetFlicker
// Flags: 
struct UGUIComponent_execSetFlicker_Parms
{
	unsigned long                                      Value:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIComponent.DisableComponent
// Flags: [ FUNC_Final ]
struct UGUIComponent_execDisableComponent_Parms
{
	class UGUIComponent*                               Comp;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComponent.EnableComponent
// Flags: [ FUNC_Final ]
struct UGUIComponent_execEnableComponent_Parms
{
	class UGUIComponent*                               Comp;                                             		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComponent.KillAnimation
// Flags: 
struct UGUIComponent_execKillAnimation_Parms
{
};

// Function XInterface.GUIComponent.DAnimate
// Flags: 
struct UGUIComponent_execDAnimate_Parms
{
	float                                              NewLeft;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              NewTop;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              NewWidth;                                         		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              NewHeight;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              PositionTime;                                     		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              DimensionTime;                                    		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function XInterface.GUIComponent.Resize
// Flags: 
struct UGUIComponent_execResize_Parms
{
	float                                              NewWidth;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              NewHeight;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              Time;                                             		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIComponent.Animate
// Flags: 
struct UGUIComponent_execAnimate_Parms
{
	float                                              NewLeft;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              NewTop;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              Time;                                             		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function XInterface.GUIComponent.EndAnimation
// Flags: [ FUNC_Event ]
struct UGUIComponent_eventEndAnimation_Parms
{
	class UGUIComponent*                               Animating;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned char                                      Type;                                             		// 0x0004 ( 0x0001[ CPF_Parm ]
};

// Function XInterface.GUIComponent.BeginAnimation
// Flags: [ FUNC_Event ]
struct UGUIComponent_eventBeginAnimation_Parms
{
	class UGUIComponent*                               Animating;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComponent.OwnerPage
// Flags: [ FUNC_Event ]
struct UGUIComponent_eventOwnerPage_Parms
{
	class UGUIPage*                                    ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink | CPF_EditInline ]
//	class UGUIComponent*                               C;                                                		// 0x0004 ( 0x0004[ CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComponent.DebugFocusPosition
// Flags: [ FUNC_Final ]
struct UGUIComponent_execDebugFocusPosition_Parms
{
	class UGUIComponent*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      Last:1;                                           		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIComponent.DebugFocus
// Flags: [ FUNC_Final ]
struct UGUIComponent_execDebugFocus_Parms
{
	class UGUIComponent*                               Who;                                              		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
	unsigned long                                      bLose:1;                                          		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function XInterface.GUIComponent.SetTooltip
// Flags: 
struct UGUIComponent_execSetTooltip_Parms
{
	class UGUIToolTip*                                 InTooltip;                                        		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComponent.SetToolTipText
// Flags: 
struct UGUIComponent_execSetToolTipText_Parms
{
	struct FString                                     NewToolTipText;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComponent.SetHint
// Flags: 
struct UGUIComponent_execSetHint_Parms
{
	struct FString                                     NewHint;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function XInterface.GUIComponent.SetFriendlyLabel
// Flags: 
struct UGUIComponent_execSetFriendlyLabel_Parms
{
	class UGUILabel*                                   NewLabel;                                         		// 0x0000 ( 0x0004[ CPF_ExportObject | CPF_Parm | CPF_NeedCtorLink | CPF_EditInline ]
};

// Function XInterface.GUIComponent.SetFocusInstead
// Flags: 
struct UGUIComponent_execSetFocusInstead_Parms
{
