#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : Gameplay
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function Gameplay.AnimNotify_EjectShell.Notify
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct UAnimNotify_EjectShell_eventNotify_Parms
{
	class AActor*                                      Owner;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwGun*                                       Gun;                                              		// 0x0004 ( 0x0004
	class AwFPWeaponAttachment*                        FPWeapon;                                         		// 0x0008 ( 0x0004
};

// Function Gameplay.AnimNotify_ReloadWeapon.Notify
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct UAnimNotify_ReloadWeapon_eventNotify_Parms
{
	class AActor*                                      Owner;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwGun*                                       Gun;                                              		// 0x0004 ( 0x0004
};

// Function Gameplay.AnimNotify_EjectShell_3rd.Notify
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct UAnimNotify_EjectShell_3rd_eventNotify_Parms
{
	class AActor*                                      Owner;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.AnimNotify_EjectShell_Recham.Notify
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct UAnimNotify_EjectShell_Recham_eventNotify_Parms
{
	class AActor*                                      Owner;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004
};

// Function Gameplay.ScriptedController.LeaveScripting
// Flags: 
struct AScriptedController_execLeaveScripting_Parms
{
};

// Function Gameplay.ScriptedController.AdjustAim
// Flags: 
struct AScriptedController_execAdjustAim_Parms
{
	struct FFireProperties                             FiredAmmunition;                                  		// 0x0000 ( 0x0014[ CPF_Parm ]
	struct FVector                                     projStart;                                        		// 0x0014 ( 0x000C[ CPF_Parm ]
	int                                                AimError;                                         		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FRotator                                    LookDir;                                          		// 0x0030 ( 0x000C
};

// Function Gameplay.ScriptedController.SetFireYaw
// Flags: 
struct AScriptedController_execSetFireYaw_Parms
{
	int                                                FireYaw;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedController.ClearAnimation
// Flags: 
struct AScriptedController_execClearAnimation_Parms
{
};

// Function Gameplay.ScriptedController.SetNewScript
// Flags: 
struct AScriptedController_execSetNewScript_Parms
{
	class AScriptedSequence*                           NewScript;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.ScriptedController.ClearScript
// Flags: 
struct AScriptedController_execClearScript_Parms
{
};

// Function Gameplay.ScriptedController.CheckIfNearPlayer
// Flags: 
struct AScriptedController_execCheckIfNearPlayer_Parms
{
	float                                              Distance;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       MyPlayer;                                         		// 0x0008 ( 0x0004
};

// Function Gameplay.ScriptedController.GetSoundSource
// Flags: 
struct AScriptedController_execGetSoundSource_Parms
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedController.GetInstigator
// Flags: 
struct AScriptedController_execGetInstigator_Parms
{
	class APawn*                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedController.GetMyPlayer
// Flags: 
struct AScriptedController_execGetMyPlayer_Parms
{
	class APawn*                                       ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedController.DestroyPawn
// Flags: 
struct AScriptedController_execDestroyPawn_Parms
{
};

// Function Gameplay.ScriptedController.SetEnemyReaction
// Flags: 
struct AScriptedController_execSetEnemyReaction_Parms
{
	int                                                AlertnessLevel;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.ScriptedController.TakeControlOf
// Flags: 
struct AScriptedController_execTakeControlOf_Parms
{
	class APawn*                                       aPawn;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.ScriptedController.NotifyJumpApex
// Flags: [ FUNC_Event ]
struct AScriptedController_eventNotifyJumpApex_Parms
{
	class AActor*                                      HitActor;                                         		// 0x0000 ( 0x0004
	struct FVector                                     HitNormal;                                        		// 0x0004 ( 0x000C
	struct FVector                                     HitLocation;                                      		// 0x0010 ( 0x000C
	struct FVector                                     HalfHeight;                                       		// 0x001C ( 0x000C
	struct FVector                                     Start;                                            		// 0x0028 ( 0x000C
};

// Function Gameplay.ScriptedController.SetDoubleJump
// Flags: 
struct AScriptedController_execSetDoubleJump_Parms
{
};

// Function Gameplay.ScriptedController.WeaponFireAgain
// Flags: 
struct AScriptedController_execWeaponFireAgain_Parms
{
	float                                              RefireRate;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bFinishedFire:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedSequence.SetActions
// Flags: 
struct AScriptedSequence_execSetActions_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AScriptedSequence*                           NewScript;                                        		// 0x0004 ( 0x0004
	unsigned long                                      bDone:1;                                          		// 0x0008 ( 0x0004 [0x00000001]
};

// Function Gameplay.ScriptedSequence.ValidAction
// Flags: 
struct AScriptedSequence_execValidAction_Parms
{
	int                                                N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedSequence.TakeOver
// Flags: 
struct AScriptedSequence_execTakeOver_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AScriptedController*                         S;                                                		// 0x0004 ( 0x0004
};

// Function Gameplay.ScriptedSequence.CheckForErrors
// Flags: 
struct AScriptedSequence_execCheckForErrors_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedSequence.SpawnControllerFor
// Flags: 
struct AScriptedSequence_execSpawnControllerFor_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.ScriptedSequence.Reset
// Flags: [ FUNC_Event ]
struct AScriptedSequence_eventReset_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function Gameplay.ScriptedSequence.PostBeginPlay
// Flags: 
struct AScriptedSequence_execPostBeginPlay_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function Gameplay.LatentScriptedAction.GetDistance
// Flags: 
struct ULatentScriptedAction_execGetDistance_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.GetMoveTargetFor
// Flags: 
struct ULatentScriptedAction_execGetMoveTargetFor_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.TurnToGoal
// Flags: 
struct ULatentScriptedAction_execTurnToGoal_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.MoveToGoal
// Flags: 
struct ULatentScriptedAction_execMoveToGoal_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.StillTicking
// Flags: 
struct ULatentScriptedAction_execStillTicking_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              DeltaTime;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.TickedAction
// Flags: 
struct ULatentScriptedAction_execTickedAction_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.WaitForPlayer
// Flags: 
struct ULatentScriptedAction_execWaitForPlayer_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.CompleteWhenTimer
// Flags: 
struct ULatentScriptedAction_execCompleteWhenTimer_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.CompleteOnLIPSincAnim
// Flags: 
struct ULatentScriptedAction_execCompleteOnLIPSincAnim_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.CompleteOnAnim
// Flags: 
struct ULatentScriptedAction_execCompleteOnAnim_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.CompleteWhenTriggered
// Flags: 
struct ULatentScriptedAction_execCompleteWhenTriggered_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.InitActionFor
// Flags: 
struct ULatentScriptedAction_execInitActionFor_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.LatentScriptedAction.DisplayDebug
// Flags: 
struct ULatentScriptedAction_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Gameplay.ScriptedAction.GetActionString
// Flags: 
struct UScriptedAction_execGetActionString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Gameplay.ScriptedAction.ProceedToSectionEnd
// Flags: 
struct UScriptedAction_execProceedToSectionEnd_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Nesting;                                          		// 0x0004 ( 0x0004
	class UScriptedAction*                             A;                                                		// 0x0008 ( 0x0004
};

// Function Gameplay.ScriptedAction.ProceedToNextAction
// Flags: 
struct UScriptedAction_execProceedToNextAction_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.ScriptedAction.GetScript
// Flags: 
struct UScriptedAction_execGetScript_Parms
{
	class AScriptedSequence*                           S;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AScriptedSequence*                           ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedAction.StartsSection
// Flags: 
struct UScriptedAction_execStartsSection_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedAction.EndsSection
// Flags: 
struct UScriptedAction_execEndsSection_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedAction.InitActionFor
// Flags: 
struct UScriptedAction_execInitActionFor_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ScriptedAction.Reset
// Flags: [ FUNC_Event ]
struct UScriptedAction_eventReset_Parms
{
};

// Function Gameplay.ScriptedAction.PostBeginPlay
// Flags: [ FUNC_Event ]
struct UScriptedAction_eventPostBeginPlay_Parms
{
	class AScriptedSequence*                           ss;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.ScriptedAction.ActionCompleted
// Flags: [ FUNC_Event ]
struct UScriptedAction_eventActionCompleted_Parms
{
};

// Function Gameplay.Action_PLAYANIM.GetActionString
// Flags: 
struct UAction_PLAYANIM_execGetActionString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Gameplay.Action_PLAYANIM.PawnPlayBaseAnim
// Flags: 
struct UAction_PLAYANIM_execPawnPlayBaseAnim_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bFirstPlay:1;                                     		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.Action_PLAYANIM.SetCurrentAnimationFor
// Flags: 
struct UAction_PLAYANIM_execSetCurrentAnimationFor_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Gameplay.Action_PLAYANIM.InitActionFor
// Flags: 
struct UAction_PLAYANIM_execInitActionFor_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.Drowned.GetPawnDamageEffect
// Flags: 
struct ADrowned_execGetPawnDamageEffect_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              Damage;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0010 ( 0x000C[ CPF_Parm ]
	class APawn*                                       Victim;                                           		// 0x001C ( 0x0004[ CPF_Parm ]
	unsigned long                                      bLowDetail:1;                                     		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm ]
	class UClass*                                      ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.Action_MOVETOPOINT.GetActionString
// Flags: 
struct UAction_MOVETOPOINT_execGetActionString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Gameplay.Action_MOVETOPOINT.GetMoveTargetFor
// Flags: 
struct UAction_MOVETOPOINT_execGetMoveTargetFor_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.Action_MOVETOPOINT.MoveToGoal
// Flags: 
struct UAction_MOVETOPOINT_execMoveToGoal_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.Action_WAITFORTIMER.GetActionString
// Flags: 
struct UAction_WAITFORTIMER_execGetActionString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Gameplay.Action_WAITFORTIMER.CompleteWhenTimer
// Flags: 
struct UAction_WAITFORTIMER_execCompleteWhenTimer_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.Action_WAITFORTIMER.CompleteWhenTriggered
// Flags: 
struct UAction_WAITFORTIMER_execCompleteWhenTriggered_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.Action_WAITFORTIMER.InitActionFor
// Flags: 
struct UAction_WAITFORTIMER_execInitActionFor_Parms
{
	class AScriptedController*                         C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Gameplay.ActionMessage.GetString
// Flags: 
struct AActionMessage_execGetString_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

#ifdef _MSC_VER
#pragma pack ( pop )
#endif

