#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : Engine
# >    File : Classes.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif


/*
# ======================================================================================== #
# > Constants
# ======================================================================================== #
*/

#define CONST_MINFLOORZ                                          0.7
#define CONST_MAXSTEPHEIGHT                                      35.0
#define CONST_LATENT_MOVETOWARD                                  503
#define CONST_kIISF_All                                          0x7F
#define CONST_kIISF_Sales                                        0x40
#define CONST_kIISF_Reserved                                     0x20
#define CONST_kIISF_Best                                         0x10
#define CONST_kIISF_Hot                                          0x08
#define CONST_kIISF_Limited                                      0x04
#define CONST_kIISF_Event                                        0x02
#define CONST_kIISF_New                                          0x01
#define CONST_kIISF_Enabled                                      0x00

	FC_Linear                                          = 0,
	FC_Sinusoidal                                      = 1,
	FC_Zigzag                                          = 2
};

// Enum Engine.Combiner.EColorOperation
enum EColorOperation
{
	CO_Use_Color_From_Material1                        = 0,
	CO_Use_Color_From_Material2                        = 1,
	CO_Multiply                                        = 2,
	CO_Add                                             = 3,
	CO_Subtract                                        = 4,
	CO_AlphaBlend_With_Mask                            = 5,
	CO_Add_With_Mask_Modulation                        = 6,
	CO_Use_Color_From_Mask                             = 7
};

// Enum Engine.Combiner.EAlphaOperation
enum EAlphaOperation
{
	AO_Use_Mask                                        = 0,
	AO_Multiply                                        = 1,
	AO_Add                                             = 2,
	AO_Use_Alpha_From_Material1                        = 3,
	AO_Use_Alpha_From_Material2                        = 4
};

// Enum Engine.BeamEmitter.EBeamEndPointType
enum EBeamEndPointType
{
	PTEP_Velocity                                      = 0,
	PTEP_Distance                                      = 1,
	PTEP_Offset                                        = 2,
	PTEP_Actor                                         = 3,
	PTEP_TraceOffset                                   = 4,
	PTEP_OffsetAsAbsolute                              = 5,
	PTEP_DynamicDistance                               = 6
};

// Enum Engine.KHinge.EHingeType
enum EHingeType
{
	HT_Normal                                          = 0,
	HT_Springy                                         = 1,
	HT_Motor                                           = 2,
	HT_Controlled                                      = 3
};

// Enum Engine.wWeatherEffect.EWeatherType
enum EWeatherType
{
	WT_Rain                                            = 0,
	WT_Snow                                            = 1,
	WT_Dust                                            = 2
};

// Enum Engine.wProcMesh.EProcMeshType
enum EProcMeshType
{
	MT_Water                                           = 0,
	MT_Deform                                          = 1
};

// Enum Engine.Effect_ShadowController.CrispnessEnum
enum CrispnessEnum
{
	Low01                                              = 0,
	Medium                                             = 1,
	High01                                             = 2,
	Maximum                                            = 3
};

// Enum Engine.PlayerStart_DOM.EApplyFlag
enum EApplyFlag
{
	A_FLAG                                             = 0,
	B_FLAG                                             = 1,
	C_FLAG                                             = 2,
	Neutral                                            = 3
};


/*
# ======================================================================================== #
# > Classes
# ======================================================================================== #
*/

struct DLL_IMPORT FCanvasUtil
{
public:
    FCanvasUtil(struct FCanvasUtil const &);
    FCanvasUtil(struct FRenderTarget *,struct FRenderInterface *);
    ~FCanvasUtil(void);
    struct FCanvasUtil & operator=(struct FCanvasUtil const &);
    void BeginPrimitive(enum EPrimitiveType,class UMaterial *);
    void DrawLine(float,float,float,float,struct FColor);
    void DrawPoint(float,float,float,float,float,struct FColor);
    int DrawString(int,int,unsigned short const *,class UFont *,struct FColor,int);
    void DrawTile(float,float,float,float,float,float,float,float,float,class UMaterial *,struct FColor);
    void DrawTile(struct FVector,struct FVector,struct FVector,struct FVector,float,float,float,float,class UMaterial *,struct FColor);
    void Flush(void);
    virtual unsigned __int64 GetCacheId(void);
    virtual int GetComponents(struct FVertexComponent *);
    virtual void GetRawStreamData(void * *,int);
    virtual int GetRevision(void);
    virtual int GetSize(void);
    virtual void GetStreamData(void *);
    virtual int GetStride(void);
    void getTextWidthSize(unsigned short const *,int,long &,long &);
    void getTextWidthSizeLH(unsigned short const *,int,long &,long &);
    void getTextWidthSizeOLD(unsigned short const *,int,long &,long &);
    void storeDrawText(int,int,int,int,unsigned char,unsigned char,unsigned char,unsigned char,unsigned char,unsigned char,unsigned char,unsigned char,float,float,float,float,int,unsigned short const *,float,float,bool);
};

// Class Engine.wWeaponBaseParams
class DLL_IMPORT UwWeaponBaseParams : public UObject
{
public:
	unsigned char                                      eType;                                            		// 0x002C ( 0x0001 ) [ CPF_Edit | CPF_EditConst ]
	struct FString                                     strName;                                          		// 0x0030 ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink ]
	int                                                iWeaponID;                                        		// 0x003C ( 0x0004 ) [ CPF_Edit | CPF_EditConst ]
	int                                                iInventoryGroup;                                  		// 0x0040 ( 0x0004 ) [ CPF_Edit ]
	int                                                iPriority;                                        		// 0x0044 ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     szClass_Resource;                                 		// 0x0048 ( 0x000C ) [ CPF_Edit | CPF_EditConst | CPF_NeedCtorLink ]
	int                                                iFireMode;                                        		// 0x0054 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bAimAvailable:1;                                  		// 0x0058 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              fRateOfFire;                                      		// 0x005C ( 0x0004 ) [ CPF_Edit ]
	float                                              fFireDelay;                                       		// 0x0060 ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDelay;                                      		// 0x0064 ( 0x0004 ) [ CPF_Edit ]
	int                                                iRoundBurstCount;                                 		// 0x0068 ( 0x0004 ) [ CPF_Edit ]
	float                                              fRoundBurstTime;                                  		// 0x006C ( 0x0004 ) [ CPF_Edit ]
	float                                              fZoomFOV;                                         		// 0x0070 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bOverHeat:1;                                      		// 0x0074 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              fOverHeat_Up;                                     		// 0x0078 ( 0x0004 ) [ CPF_Edit ]
	float                                              fOverHeat_Down;                                   		// 0x007C ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      BulletType;                                       		// 0x0080 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      ProjMoveType;                                     		// 0x0081 ( 0x0001 ) [ CPF_Edit ]
	int                                                iBulletCount;                                     		// 0x0084 ( 0x0004 ) [ CPF_Edit ]
	float                                              fProjSpeed;                                       		// 0x0088 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bExplodeCollide:1;                                		// 0x008C ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bProjTakeDamage:1;                                		// 0x008C ( 0x0004 )  [0x00000002][ CPF_Edit ]
	int                                                iBombWeaponID;                                    		// 0x0090 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFuseTime;                                        		// 0x0094 ( 0x0004 ) [ CPF_Edit ]
	float                                              fActiveTime;                                      		// 0x0098 ( 0x0004 ) [ CPF_Edit ]
	float                                              fProjDecelEachBound;                              		// 0x009C ( 0x0004 ) [ CPF_Edit ]
	float                                              fProjSpin;                                        		// 0x00A0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fProjThrowPitch;                                  		// 0x00A4 ( 0x0004 ) [ CPF_Edit ]
	int                                                i2ndBulletCount;                                  		// 0x00A8 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bBulletLandExplode:1;                             		// 0x00AC ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned char                                      damtype;                                          		// 0x00B0 ( 0x0001 ) [ CPF_Edit ]
	int                                                iDamage;                                          		// 0x00B4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamWallShot;                                     		// 0x00B8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fMomentum;                                        		// 0x00BC ( 0x0004 ) [ CPF_Edit ]
	float                                              fMomentum_Pawn;                                   		// 0x00C0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamRange_Eff;                                    		// 0x00C4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamRange_Max;                                    		// 0x00C8 ( 0x0004 ) [ CPF_Edit ]
	int                                                iDam_OOR;                                         		// 0x00CC ( 0x0004 ) [ CPF_Edit ]
	int                                                iDamMelee;                                        		// 0x00D0 ( 0x0004 ) [ CPF_Edit ]
	int                                                iMeleeRange;                                      		// 0x00D4 ( 0x0004 ) [ CPF_Edit ]
	int                                                iMeleeExtent;                                     		// 0x00D8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDam_Head;                                   		// 0x00DC ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDam_UpperTorso;                             		// 0x00E0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDam_LowerTorso;                             		// 0x00E4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDam_UpperArm;                               		// 0x00E8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDam_LowerArm;                               		// 0x00EC ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDam_UpperLeg;                               		// 0x00F0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fMeleeDam_LowerLeg;                               		// 0x00F4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_Head;                                    		// 0x00F8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_UpperTorso;                              		// 0x00FC ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_LowerTorso;                              		// 0x0100 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_UpperArm;                                		// 0x0104 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_LowerArm;                                		// 0x0108 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_UpperLeg;                                		// 0x010C ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_LowerLeg;                                		// 0x0110 ( 0x0004 ) [ CPF_Edit ]
	float                                              fDamPerc_Heli;                                    		// 0x0114 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bHitEffFriendly:1;                                		// 0x0118 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              fHitGunKick;                                      		// 0x011C ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitStunTime;                                     		// 0x0120 ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitFlashTime;                                    		// 0x0124 ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitFireTime;                                     		// 0x0128 ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitFreezeTime;                                   		// 0x012C ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitEAXEffectTime;                                		// 0x0130 ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     strHitEAXEffectClass;                             		// 0x0134 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	unsigned char                                      ReloadType;                                       		// 0x0140 ( 0x0001 ) [ CPF_Edit ]
	unsigned long                                      bRechamber:1;                                     		// 0x0144 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              fRechamberRate;                                   		// 0x0148 ( 0x0004 ) [ CPF_Edit ]
	float                                              fReloadRate;                                      		// 0x014C ( 0x0004 ) [ CPF_Edit ]
	float                                              fReloadEmptyRate;                                 		// 0x0150 ( 0x0004 ) [ CPF_Edit ]
	float                                              fReloadBeginRate;                                 		// 0x0154 ( 0x0004 ) [ CPF_Edit ]
	float                                              fReloadEndRate;                                   		// 0x0158 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBulletGravity;                                   		// 0x015C ( 0x0004 ) [ CPF_Edit ]
	float                                              fExplRad_Inner;                                   		// 0x0160 ( 0x0004 ) [ CPF_Edit ]
	float                                              fExplRad_Outer;                                   		// 0x0164 ( 0x0004 ) [ CPF_Edit ]
	float                                              fExplDam_Inner;                                   		// 0x0168 ( 0x0004 ) [ CPF_Edit ]
	float                                              fExplDam_Outer;                                   		// 0x016C ( 0x0004 ) [ CPF_Edit ]
	float                                              fExplForce_Effect;                                		// 0x0170 ( 0x0004 ) [ CPF_Edit ]
	float                                              fExplRad_Effect;                                  		// 0x0174 ( 0x0004 ) [ CPF_Edit ]
	int                                                iAmmo_Magazine;                                   		// 0x0178 ( 0x0004 ) [ CPF_Edit ]
	int                                                iAmmo_Reload;                                     		// 0x017C ( 0x0004 ) [ CPF_Edit ]
	int                                                iAmmo_Initial;                                    		// 0x0180 ( 0x0004 ) [ CPF_Edit ]
	int                                                iAmmo_Max;                                        		// 0x0184 ( 0x0004 ) [ CPF_Edit ]
	int                                                iSpread_2nd_StartNum;                             		// 0x0188 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_2nd_Add;                                  		// 0x018C ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_2nd_Max;                                  		// 0x0190 ( 0x0004 ) [ CPF_Edit ]
	int                                                iSpread_Visual_Add;                               		// 0x0194 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Shotgun;                                  		// 0x0198 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Jump;                                     		// 0x019C ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Stand_Min;                                		// 0x01A0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Stand_Max;                                		// 0x01A4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Ducked_Min;                               		// 0x01A8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Ducked_Max;                               		// 0x01AC ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Prone_Min;                                		// 0x01B0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Prone_Max;                                		// 0x01B4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Move_Add;                                 		// 0x01B8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Fire_Add;                                 		// 0x01BC ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Image_Increase;                           		// 0x01C0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Stand_Reduce;                             		// 0x01C4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Ducked_Reduce;                            		// 0x01C8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Prone_Reduce;                             		// 0x01CC ( 0x0004 ) [ CPF_Edit ]
	float                                              fSpread_Aim_move_add;                             		// 0x01D0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_XMin;                                		// 0x01D4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_XMax;                                		// 0x01D8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_YMin;                                		// 0x01DC ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_YMax;                                		// 0x01E0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_Accel;                               		// 0x01E4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_Decel;                               		// 0x01E8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_StayTime;                            		// 0x01EC ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_DecaySpeed;                          		// 0x01F0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickHip_DecayTimeFast;                       		// 0x01F4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_XMin;                                		// 0x01F8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_XMax;                                		// 0x01FC ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_YMin;                                		// 0x0200 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_YMax;                                		// 0x0204 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_Accel;                               		// 0x0208 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_Decel;                               		// 0x020C ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_StayTime;                            		// 0x0210 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_DecaySpeed;                          		// 0x0214 ( 0x0004 ) [ CPF_Edit ]
	float                                              fViewKickAds_DecayTimeFast;                       		// 0x0218 ( 0x0004 ) [ CPF_Edit ]
	float                                              fAnimRate_PutDown;                                		// 0x021C ( 0x0004 ) [ CPF_Edit ]
	float                                              fAnimRate_PutDown_Quick;                          		// 0x0220 ( 0x0004 ) [ CPF_Edit ]
	float                                              fAnimRate_BringUp;                                		// 0x0224 ( 0x0004 ) [ CPF_Edit ]
	float                                              fAnimRate_SprintBringUp;                          		// 0x0228 ( 0x0004 ) [ CPF_Edit ]
	float                                              fAnimRate_AdsOn;                                  		// 0x022C ( 0x0004 ) [ CPF_Edit ]
	float                                              fAnimRate_AdsOff;                                 		// 0x0230 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bApplyQuickDrop:1;                                		// 0x0234 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	float                                              fMaxPitch;                                        		// 0x0238 ( 0x0004 ) [ CPF_Edit ]
	int                                                iCrossHair;                                       		// 0x023C ( 0x0004 ) [ CPF_Edit ]
	float                                              fMovePivot;                                       		// 0x0240 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSprintStaminaRate;                               		// 0x0244 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSprintSpeed;                                     		// 0x0248 ( 0x0004 ) [ CPF_Edit ]
	float                                              fRunSpeed;                                        		// 0x024C ( 0x0004 ) [ CPF_Edit ]
	float                                              fCrouchSpeed;                                     		// 0x0250 ( 0x0004 ) [ CPF_Edit ]
	float                                              fPronedSpeed;                                     		// 0x0254 ( 0x0004 ) [ CPF_Edit ]
	float                                              fAimRunSpeed;                                     		// 0x0258 ( 0x0004 ) [ CPF_Edit ]
	float                                              fAimCrouchSpeed;                                  		// 0x025C ( 0x0004 ) [ CPF_Edit ]
	float                                              fStaminaRecovery;                                 		// 0x0260 ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitMoveSpeed;                                    		// 0x0264 ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitMoveTime;                                     		// 0x0268 ( 0x0004 ) [ CPF_Edit ]
	float                                              fHitMoveDelay;                                    		// 0x026C ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathRadius_Idle;                               		// 0x0270 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathSpeed_Idle;                                		// 0x0274 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathRadius_Aim;                                		// 0x0278 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathSpeed_Aim;                                 		// 0x027C ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathRadius_DuckedAim;                          		// 0x0280 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathSpeed_DuckedAim;                           		// 0x0284 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathRadius_ProneAim;                           		// 0x0288 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBreathSpeed_ProneAim;                            		// 0x028C ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_Move;                                  		// 0x0290 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_Move;                                  		// 0x0294 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_Ads_Move;                              		// 0x0298 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_Ads_Move;                              		// 0x029C ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_Ducked_Move;                           		// 0x02A0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_Ducked_Move;                           		// 0x02A4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_Prone_Move;                            		// 0x02A8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_Sprint_Move;                           		// 0x02AC ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_Sprint_Move;                           		// 0x02B0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_sprint_y;                              		// 0x02B4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_sprint_y;                              		// 0x02B8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_ads_move_y;                            		// 0x02BC ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_ads_move_y;                            		// 0x02C0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_move_y;                                		// 0x02C4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_move_y;                                		// 0x02C8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobWeapon_ducked_move_y;                         		// 0x02CC ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_ducked_move_y;                         		// 0x02D0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fBobScreen_prone_move_y;                          		// 0x02D4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_HipX_Max;                                   		// 0x02D8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_HipX_Incr;                                  		// 0x02DC ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_HipX_Speed;                                 		// 0x02E0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_HipY_Max;                                   		// 0x02E4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_HipY_Incr;                                  		// 0x02E8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_HipY_Speed;                                 		// 0x02EC ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_AdsX_Max;                                   		// 0x02F0 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_AdsX_Incr;                                  		// 0x02F4 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_AdsX_Speed;                                 		// 0x02F8 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_AdsY_Max;                                   		// 0x02FC ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_AdsY_Incr;                                  		// 0x0300 ( 0x0004 ) [ CPF_Edit ]
	float                                              fSway_AdsY_Speed;                                 		// 0x0304 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_HipX_Max;                             		// 0x0308 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_HipX_Incr;                            		// 0x030C ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_HipX_Speed;                           		// 0x0310 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_HipY_Max;                             		// 0x0314 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_HipY_Incr;                            		// 0x0318 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_HipY_Speed;                           		// 0x031C ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_AdsX_Max;                             		// 0x0320 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_AdsX_Incr;                            		// 0x0324 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_AdsX_Speed;                           		// 0x0328 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_AdsY_Max;                             		// 0x032C ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_AdsY_Incr;                            		// 0x0330 ( 0x0004 ) [ CPF_Edit ]
	float                                              fFiringSway_AdsY_Speed;                           		// 0x0334 ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      CrosshairType;                                    		// 0x0338 ( 0x0001 ) [ CPF_Edit ]
	struct FString                                     CrosshairImage;                                   		// 0x033C ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	float                                              fNPCSpreadRate;                                   		// 0x0348 ( 0x0004 ) 
	float                                              fNPCRateOfFire;                                   		// 0x034C ( 0x0004 ) 
	int                                                iNPCFire;                                         		// 0x0350 ( 0x0004 ) 
	float                                              wt_BoundingMax;                                   		// 0x0354 ( 0x0004 ) 
	float                                              wt_RandomMul;                                     		// 0x0358 ( 0x0004 ) 
	class TArray< float >                              wt_x;                                             		// 0x035C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              wt_y;                                             		// 0x0368 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              wt_RandomWeight;                                  		// 0x0374 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              wtAim_BoundingMax;                                		// 0x0380 ( 0x0004 ) 
	float                                              wtAim_RandomMul;                                  		// 0x0384 ( 0x0004 ) 
	class TArray< float >                              wtAim_x;                                          		// 0x0388 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              wtAim_y;                                          		// 0x0394 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              wtAim_RandomWeight;                               		// 0x03A0 ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 unsigned char             GetCrosshairType ( struct FString szValue );      		//  Engine.wWeaponBaseParams.GetCrosshairType
	 unsigned char             GetReloadType ( struct FString szValue );         		//  Engine.wWeaponBaseParams.GetReloadType
	 unsigned char             GetProjMoveType ( struct FString szValue );       		//  Engine.wWeaponBaseParams.GetProjMoveType
	 unsigned char             GetBulletType ( struct FString szValue );         		//  Engine.wWeaponBaseParams.GetBulletType

	// Public Imports
	UwWeaponBaseParams(class UwWeaponBaseParams const &);
	UwWeaponBaseParams(void);
	class UwWeaponBaseParams &  operator=(class UwWeaponBaseParams const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0380

// Class Engine.wWeaponManager
class DLL_IMPORT UwWeaponManager : public UObject
{
public:
	class TArray< class UwWeaponBaseParams* >          WeaponParams;                                     		// 0x002C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     arr_szResClass;                                   		// 0x0038 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UClass* >                      arr_classRes;                                     		// 0x0044 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              BaseSpeed_Sprint;                                 		// 0x0050 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              BaseSpeed_Run;                                    		// 0x005C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              BaseSpeed_Aim;                                    		// 0x0068 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              BaseSpeed_Run_Cr;                                 		// 0x0074 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              BaseSpeed_Aim_Cr;                                 		// 0x0080 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              BaseSpeed_Prone;                                  		// 0x008C ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      PrecacheSound (  );                               		//  Engine.wWeaponManager.PrecacheSound
	 void                      PrecacheMaterials ( class ALevelInfo* Level );    		//  Engine.wWeaponManager.PrecacheMaterials
	 void                      PrecacheClasses (  );                             		//  Engine.wWeaponManager.PrecacheClasses
	 class UwWeaponBaseParams* eventGetBaseParam ( int id );                     		// [ FUNC_Event ] Engine.wWeaponManager.GetBaseParam
	 void                      LoadWeaponExParams (  );                          		//  Engine.wWeaponManager.LoadWeaponExParams
	 void                      AddParams ( class UBTNetGameData* GameData );     		//  Engine.wWeaponManager.AddParams
	 void                      LoadWeaponParams (  );                            		//  Engine.wWeaponManager.LoadWeaponParams
	 void                      AddWeaponRecoilParams ( class UBTNetGameData* GameData );		//  Engine.wWeaponManager.AddWeaponRecoilParams
	 void                      LoadWeaponRecoilParams (  );                      		//  Engine.wWeaponManager.LoadWeaponRecoilParams
	 class UClass*             GetRes ( struct FString szRes );                  		//  Engine.wWeaponManager.GetRes
	 void                      eventInitWeaponPrecacheClasses (  );              		// [ FUNC_Event ] Engine.wWeaponManager.InitWeaponPrecacheClasses
	 void                      eventLoadWeaponRes (  );                          		// [ FUNC_Event ] Engine.wWeaponManager.LoadWeaponRes
	 void                      eventDestroyScript (  );                          		// [ FUNC_Event ] Engine.wWeaponManager.DestroyScript
	 void                      eventInitScript (  );                             		// [ FUNC_Event ] Engine.wWeaponManager.InitScript

	// Public Imports
	UwWeaponManager(class UwWeaponManager const &);
	UwWeaponManager(void);
	class UwWeaponManager &  operator=(class UwWeaponManager const &);
	void  DestroyNative(void);
	void  Init(void);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x006C

// Class Engine.ObjectPool
class DLL_IMPORT UObjectPool : public UObject
{
public:
	class TArray< class UObject* >                     Objects;                                          		// 0x002C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                NewCount;                                         		// 0x0038 ( 0x0004 ) 

	// UScript Functions
	 void                      Shrink (  );                                      		// [ FUNC_Simulated ] Engine.ObjectPool.Shrink
	 class UObject*            FreeObjectDupCheck ( class UObject* obj );        		// [ FUNC_Simulated | FUNC_Native ] Engine.ObjectPool.FreeObjectDupCheck
	 class UObject*            FreeObject ( class UObject* obj );                		// [ FUNC_Simulated ] Engine.ObjectPool.FreeObject
	 class UObject*            AllocateObject ( class UClass* ObjectClass );     		// [ FUNC_Simulated ] Engine.ObjectPool.AllocateObject
	 class UObject*            PopObject ( class UClass* ObjectClass );          		// [ FUNC_Simulated | FUNC_Native ] Engine.ObjectPool.PopObject

	// Public Imports
	UObjectPool(class UObjectPool const &);
	class UObjectPool &  operator=(class UObjectPool const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class Engine.Actor
class DLL_IMPORT AActor : public UObject
{
public:
	unsigned char                                      LightType;                                        		// 0x002C ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      LightEffect;                                      		// 0x002D ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      LightHue;                                         		// 0x002E ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      LightSaturation;                                  		// 0x002F ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	float                                              LightBrightness;                                  		// 0x0030 ( 0x0004 ) [ CPF_Edit | CPF_Net ]
	float                                              LightRadius;                                      		// 0x0034 ( 0x0004 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      LightPeriod;                                      		// 0x0038 ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      LightPhase;                                       		// 0x0039 ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      LightCone;                                        		// 0x003A ( 0x0001 ) [ CPF_Edit ]
	float                                              LightBrightnessScale;                             		// 0x003C ( 0x0004 ) [ CPF_Edit ]
	float                                              PawnLightBrightnessScale;                         		// 0x0040 ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      DrawType;                                         		// 0x0044 ( 0x0001 ) [ CPF_Edit | CPF_Const | CPF_Net ]
	unsigned char                                      StaticFilterState;                                		// 0x0045 ( 0x0001 ) [ CPF_Const | CPF_Native ]
	class UStaticMesh*                                 StaticMesh;                                       		// 0x0048 ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_Net ]
	class AActor*                                      Owner;                                            		// 0x004C ( 0x0004 ) [ CPF_Const | CPF_Net ]
	class AActor*                                      Base;                                             		// 0x0050 ( 0x0004 ) [ CPF_Const | CPF_Net ]
	class UMaterial*                                   BaseMaterial;                                     		// 0x0054 ( 0x0004 ) [ CPF_Const ]
	struct FActorRenderDataPtr                         ActorRenderData;                                  		// 0x0058 ( 0x0004 ) [ CPF_Const | CPF_Native ]
	struct FLightRenderDataPtr                         LightRenderData;                                  		// 0x005C ( 0x0004 ) [ CPF_Const | CPF_Native ]
	int                                                RenderRevision;                                   		// 0x0060 ( 0x0004 ) [ CPF_Const | CPF_Native ]
	int                                                FunctionReplicateCount;                           		// 0x0064 ( 0x0004 ) 
	int                                                VariableReplicateCount;                           		// 0x0068 ( 0x0004 ) 
	class TArray< struct FBatchReference >             StaticSectionBatches;                             		// 0x006C ( 0x000C ) [ CPF_Const | CPF_Native ]
	struct FName                                       ForcedVisibilityZoneTag;                          		// 0x0078 ( 0x0004 ) [ CPF_Edit | CPF_Const ]
	float                                              CullDistance;                                     		// 0x007C ( 0x0004 ) [ CPF_Edit ]
	float                                              fLightScale;                                      		// 0x0080 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bSpecialLit:1;                                    		// 0x0084 ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_Net ]
	unsigned long                                      bActorShadows:1;                                  		// 0x0084 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bCorona:1;                                        		// 0x0084 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bDirectionalCorona:1;                             		// 0x0084 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bAttenByLife:1;                                   		// 0x0084 ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned long                                      bLightingVisibility:1;                            		// 0x0084 ( 0x0004 )  [0x00000020][ CPF_Edit ]
	unsigned long                                      bUseDynamicLights:1;                              		// 0x0084 ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned long                                      bLightChanged:1;                                  		// 0x0084 ( 0x0004 )  [0x00000080]
	unsigned long                                      bDramaticLighting:1;                              		// 0x0084 ( 0x0004 )  [0x00000100]
	unsigned long                                      bStatic:1;                                        		// 0x0084 ( 0x0004 )  [0x00000200][ CPF_Edit | CPF_Const ]
	unsigned long                                      bHidden:1;                                        		// 0x0084 ( 0x0004 )  [0x00000400][ CPF_Edit | CPF_Net ]
	unsigned long                                      bNoDelete:1;                                      		// 0x0084 ( 0x0004 )  [0x00000800][ CPF_Edit | CPF_Const ]
	unsigned long                                      bDeleteMe:1;                                      		// 0x0084 ( 0x0004 )  [0x00001000][ CPF_Const ]
	unsigned long                                      bTicked:1;                                        		// 0x0084 ( 0x0004 )  [0x00002000][ CPF_Const | CPF_Transient ]
	unsigned long                                      bDynamicLight:1;                                  		// 0x0084 ( 0x0004 )  [0x00004000][ CPF_Edit ]
	unsigned long                                      bEnvironmentLight:1;                              		// 0x0084 ( 0x0004 )  [0x00008000][ CPF_Edit ]
	unsigned long                                      bTimerLoop:1;                                     		// 0x0084 ( 0x0004 )  [0x00010000]
	unsigned long                                      bOnlyOwnerSee:1;                                  		// 0x0084 ( 0x0004 )  [0x00020000][ CPF_Net ]
	unsigned long                                      bHighDetail:1;                                    		// 0x0084 ( 0x0004 )  [0x00040000][ CPF_Edit ]
	unsigned long                                      bSuperHighDetail:1;                               		// 0x0084 ( 0x0004 )  [0x00080000][ CPF_Edit ]
	unsigned long                                      bOnlyDrawIfAttached:1;                            		// 0x0084 ( 0x0004 )  [0x00100000][ CPF_Net ]
	unsigned long                                      bStasis:1;                                        		// 0x0084 ( 0x0004 )  [0x00200000][ CPF_Edit ]
	unsigned long                                      bTrailerAllowRotation:1;                          		// 0x0084 ( 0x0004 )  [0x00400000]
	unsigned long                                      bTrailerSameRotation:1;                           		// 0x0084 ( 0x0004 )  [0x00800000]
	unsigned long                                      bTrailerPrePivot:1;                               		// 0x0084 ( 0x0004 )  [0x01000000]
	unsigned long                                      bWorldGeometry:1;                                 		// 0x0084 ( 0x0004 )  [0x02000000]
	unsigned long                                      bAcceptsProjectors:1;                             		// 0x0084 ( 0x0004 )  [0x04000000][ CPF_Edit ]
	unsigned long                                      bOrientOnSlope:1;                                 		// 0x0084 ( 0x0004 )  [0x08000000]
	unsigned long                                      bOnlyAffectPawns:1;                               		// 0x0084 ( 0x0004 )  [0x10000000][ CPF_Const ]
	unsigned long                                      bDisableSorting:1;                                		// 0x0084 ( 0x0004 )  [0x20000000][ CPF_Edit ]
	unsigned long                                      bIgnoreEncroachers:1;                             		// 0x0084 ( 0x0004 )  [0x40000000][ CPF_Edit | CPF_Net ]
	unsigned long                                      bShowOctreeNodes:1;                               		// 0x0084 ( 0x0004 )  [0x80000000]
	unsigned long                                      bWasSNFiltered:1;                                 		// 0x0088 ( 0x0004 )  [0x00000001]
	unsigned long                                      bShouldStopKarma:1;                               		// 0x0088 ( 0x0004 )  [0x00000002][ CPF_Const | CPF_Transient ]
	unsigned long                                      bDetailAttachment:1;                              		// 0x0088 ( 0x0004 )  [0x00000004][ CPF_Const ]
	unsigned long                                      bNetTemporary:1;                                  		// 0x0088 ( 0x0004 )  [0x00000008][ CPF_Const ]
	unsigned long                                      bOnlyRelevantToOwner:1;                           		// 0x0088 ( 0x0004 )  [0x00000010]
	unsigned long                                      bNetDirty:1;                                      		// 0x0088 ( 0x0004 )  [0x00000020][ CPF_Const | CPF_Transient ]
	unsigned long                                      bAlwaysRelevant:1;                                		// 0x0088 ( 0x0004 )  [0x00000040]
	unsigned long                                      bReplicateInstigator:1;                           		// 0x0088 ( 0x0004 )  [0x00000080]
	unsigned long                                      bReplicateMovement:1;                             		// 0x0088 ( 0x0004 )  [0x00000100]
	unsigned long                                      bSkipActorPropertyReplication:1;                  		// 0x0088 ( 0x0004 )  [0x00000200]
	unsigned long                                      bUpdateSimulatedPosition:1;                       		// 0x0088 ( 0x0004 )  [0x00000400]
	unsigned long                                      bTearOff:1;                                       		// 0x0088 ( 0x0004 )  [0x00000800][ CPF_Net ]
	unsigned long                                      bOnlyDirtyReplication:1;                          		// 0x0088 ( 0x0004 )  [0x00001000]
	unsigned long                                      bReplicateAnimations:1;                           		// 0x0088 ( 0x0004 )  [0x00002000]
	unsigned long                                      bNetInitialRotation:1;                            		// 0x0088 ( 0x0004 )  [0x00004000][ CPF_Const ]
	unsigned long                                      bCompressedPosition:1;                            		// 0x0088 ( 0x0004 )  [0x00008000]
	unsigned long                                      bAlwaysZeroBoneOffset:1;                          		// 0x0088 ( 0x0004 )  [0x00010000]
	unsigned long                                      bIgnoreVehicles:1;                                		// 0x0088 ( 0x0004 )  [0x00020000]
	unsigned long                                      bDeferRendering:1;                                		// 0x0088 ( 0x0004 )  [0x00040000][ CPF_Edit ]
	unsigned long                                      bBadStateCode:1;                                  		// 0x0088 ( 0x0004 )  [0x00080000]
	unsigned long                                      bSkipTimerInChangedHost:1;                        		// 0x0088 ( 0x0004 )  [0x00100000]
	unsigned long                                      bSkipLifeSpanInChangedHost:1;                     		// 0x0088 ( 0x0004 )  [0x00200000]
	int                                                nOldActor;                                        		// 0x008C ( 0x0004 ) 
	class TArray< class UObject* >                     DestroyListeners;                                 		// 0x0090 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      Physics;                                          		// 0x009C ( 0x0001 ) [ CPF_Edit | CPF_Const | CPF_Net ]
	unsigned char                                      RemoteRole;                                       		// 0x009D ( 0x0001 ) [ CPF_Net ]
	unsigned char                                      Role;                                             		// 0x009E ( 0x0001 ) [ CPF_Net ]
	int                                                NetTag;                                           		// 0x00A0 ( 0x0004 ) [ CPF_Const | CPF_Transient ]
	float                                              NetUpdateTime;                                    		// 0x00A4 ( 0x0004 ) 
	float                                              NetUpdateFrequency;                               		// 0x00A8 ( 0x0004 ) [ CPF_Localized ]
	float                                              NetPriority;                                      		// 0x00AC ( 0x0004 ) 
	class APawn*                                       Instigator;                                       		// 0x00B0 ( 0x0004 ) [ CPF_Net ]
	class USound*                                      AmbientSound;                                     		// 0x00B4 ( 0x0004 ) [ CPF_Edit | CPF_Net ]
	struct FName                                       AttachmentBone;                                   		// 0x00B8 ( 0x0004 ) [ CPF_Const | CPF_Net ]
	class ALevelInfo*                                  Level;                                            		// 0x00BC ( 0x0004 ) [ CPF_Const ]
	class ULevel*                                      XLevel;                                           		// 0x00C0 ( 0x0004 ) [ CPF_Const | CPF_Transient ]
	float                                              LifeSpan;                                         		// 0x00C4 ( 0x0004 ) [ CPF_Edit ]
	float                                              LifeSpanReplicated;                               		// 0x00C8 ( 0x0004 ) [ CPF_Net ]
	float                                              LifeSpanReplicatedClient;                         		// 0x00CC ( 0x0004 ) 
	struct FPointRegion                                Region;                                           		// 0x00D0 ( 0x000C ) [ CPF_Const ]
	float                                              TimerRate;                                        		// 0x00DC ( 0x0004 ) 
	class UMaterial*                                   OverlayMaterial;                                  		// 0x00E0 ( 0x0004 ) [ CPF_Edit | CPF_Net ]
	class UMesh*                                       Mesh;                                             		// 0x00E4 ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_Net ]
	float                                              LastRenderTime;                                   		// 0x00E8 ( 0x0004 ) [ CPF_Transient ]
	struct FName                                       Tag;                                              		// 0x00EC ( 0x0004 ) [ CPF_Edit ]
	class TArray< int >                                Leaves;                                           		// 0x00F0 ( 0x000C ) [ CPF_Transient | CPF_NeedCtorLink ]
	struct FName                                       Event;                                            		// 0x00FC ( 0x0004 ) [ CPF_Edit ]
	class AInventory*                                  Inventory;                                        		// 0x0100 ( 0x0004 ) [ CPF_Net ]
	float                                              TimerCounter;                                     		// 0x0104 ( 0x0004 ) [ CPF_Const ]
	class UMeshInstance*                               MeshInstance;                                     		// 0x0108 ( 0x0004 ) [ CPF_Transient ]
	float                                              LODBias;                                          		// 0x010C ( 0x0004 ) [ CPF_Edit ]
	struct FName                                       InitialState;                                     		// 0x0110 ( 0x0004 ) [ CPF_Edit ]
	struct FName                                       Group;                                            		// 0x0114 ( 0x0004 ) [ CPF_Edit ]
	class TArray< class AActor* >                      Touching;                                         		// 0x0118 ( 0x000C ) [ CPF_Const | CPF_NeedCtorLink ]
	class TArray< void* >                              OctreeNodes;                                      		// 0x0124 ( 0x000C ) [ CPF_Const | CPF_Transient | CPF_NeedCtorLink ]
	struct FBox                                        OctreeBox;                                        		// 0x0130 ( 0x001C ) [ CPF_Const | CPF_Transient ]
	struct FVector                                     OctreeBoxCenter;                                  		// 0x014C ( 0x000C ) [ CPF_Const | CPF_Transient ]
	struct FVector                                     OctreeBoxRadii;                                   		// 0x0158 ( 0x000C ) [ CPF_Const | CPF_Transient ]
	class AActor*                                      Deleted;                                          		// 0x0164 ( 0x0004 ) [ CPF_Const ]
	float                                              LatentFloat;                                      		// 0x0168 ( 0x0004 ) [ CPF_Const ]
	int                                                CollisionTag;                                     		// 0x016C ( 0x0004 ) [ CPF_Const | CPF_Native ]
	int                                                JoinedTag;                                        		// 0x0170 ( 0x0004 ) [ CPF_Const | CPF_Transient ]
	class APhysicsVolume*                              PhysicsVolume;                                    		// 0x0174 ( 0x0004 ) [ CPF_Const ]
	struct FVector                                     Location;                                         		// 0x0178 ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_Net ]
	struct FRotator                                    Rotation;                                         		// 0x0184 ( 0x000C ) [ CPF_Edit | CPF_Const | CPF_Net ]
	struct FVector                                     Velocity;                                         		// 0x0190 ( 0x000C ) [ CPF_Edit | CPF_Net ]
	struct FVector                                     Acceleration;                                     		// 0x019C ( 0x000C ) 
	float                                              fLeanAcc;                                         		// 0x01A8 ( 0x0004 ) 
	struct FVector                                     vLeanVel;                                         		// 0x01AC ( 0x000C ) 
	struct FVector                                     vLeanAcc;                                         		// 0x01B8 ( 0x000C ) 
	struct FVector                                     CachedLocation;                                   		// 0x01C4 ( 0x000C ) [ CPF_Const ]
	struct FRotator                                    CachedRotation;                                   		// 0x01D0 ( 0x000C ) [ CPF_Const ]
	struct FMatrix                                     CachedLocalToWorld;                               		// 0x01DC ( 0x0040 ) 
	struct FName                                       AttachTag;                                        		// 0x021C ( 0x0004 ) [ CPF_Edit ]
	class TArray< class AActor* >                      Attached;                                         		// 0x0220 ( 0x000C ) [ CPF_Const | CPF_NeedCtorLink ]
	struct FVector                                     RelativeLocation;                                 		// 0x022C ( 0x000C ) [ CPF_Const | CPF_Net ]
	struct FRotator                                    RelativeRotation;                                 		// 0x0238 ( 0x000C ) [ CPF_Const | CPF_Net ]
	struct FMatrix                                     HardRelMatrix;                                    		// 0x0244 ( 0x0040 ) [ CPF_Const ]
	class TArray< struct FProjectorRenderInfoPtr >     Projectors;                                       		// 0x0284 ( 0x000C ) [ CPF_Const | CPF_Native ]
	class TArray< struct FStaticMeshProjectorRenderInfoPtr > StaticMeshProjectors;                             		// 0x0290 ( 0x000C ) [ CPF_Const | CPF_Native ]
	class UMaterial*                                   Texture;                                          		// 0x029C ( 0x0004 ) [ CPF_Edit | CPF_Net ]
	class UStaticMeshInstance*                         StaticMeshInstance;                               		// 0x02A0 ( 0x0004 ) 
	class UModel*                                      Brush;                                            		// 0x02A4 ( 0x0004 ) [ CPF_Const | CPF_ExportObject ]
	float                                              DrawScale;                                        		// 0x02A8 ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_Net ]
	struct FVector                                     DrawScale3D;                                      		// 0x02AC ( 0x000C ) [ CPF_Edit | CPF_Const ]
	struct FVector                                     PrePivot;                                         		// 0x02B8 ( 0x000C ) [ CPF_Edit | CPF_Net ]
	unsigned long                                      bSyncCollsionSizeHK:1;                            		// 0x02C4 ( 0x0004 )  [0x00000001]
	class TArray< class UMaterial* >                   Skins;                                            		// 0x02C8 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	class UMaterial*                                   RepSkin;                                          		// 0x02D4 ( 0x0004 ) [ CPF_Net ]
	unsigned char                                      AmbientGlow;                                      		// 0x02D8 ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      MaxLights;                                        		// 0x02D9 ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      UV2Mode;                                          		// 0x02DA ( 0x0001 ) [ CPF_Edit ]
	class UConvexVolume*                               AntiPortal;                                       		// 0x02DC ( 0x0004 ) [ CPF_Edit | CPF_ExportObject ]
	class UMaterial*                                   UV2Texture;                                       		// 0x02E0 ( 0x0004 ) [ CPF_Edit ]
	int                                                UV2TextureSize;                                   		// 0x02E4 ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   UV2DirectionalLightmaps;                          		// 0x02E8 ( 0x0004 ) [ CPF_Edit ]
	float                                              ScaleGlow;                                        		// 0x02EC ( 0x0004 ) [ CPF_Edit ]
	class UMaterial*                                   EnvironmentMap;                                   		// 0x02F0 ( 0x0004 ) [ CPF_Edit ]
	int                                                CurrentLODLevel;                                  		// 0x02F4 ( 0x0004 ) 
	unsigned long                                      bShadowMap:1;                                     		// 0x02F8 ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bSelfShadowCast:1;                                		// 0x02F8 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bExcludeVisibilityTest:1;                         		// 0x02F8 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bIsFar:1;                                         		// 0x02F8 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bDontBatch:1;                                     		// 0x02F8 ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned char                                      SurfaceType;                                      		// 0x02FC ( 0x0001 ) [ CPF_Edit ]
	unsigned char                                      Style;                                            		// 0x02FD ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned long                                      bUnlit:1;                                         		// 0x0300 ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_Net ]
	unsigned long                                      bShadowCast:1;                                    		// 0x0300 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bStaticLighting:1;                                		// 0x0300 ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bUseLightingFromBase:1;                           		// 0x0300 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bHurtEntry:1;                                     		// 0x0300 ( 0x0004 )  [0x00000010]
	unsigned long                                      bGameRelevant:1;                                  		// 0x0300 ( 0x0004 )  [0x00000020][ CPF_Edit ]
	unsigned long                                      bCollideWhenPlacing:1;                            		// 0x0300 ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned long                                      bTravel:1;                                        		// 0x0300 ( 0x0004 )  [0x00000080]
	unsigned long                                      bMovable:1;                                       		// 0x0300 ( 0x0004 )  [0x00000100][ CPF_Edit ]
	unsigned long                                      bDestroyInPainVolume:1;                           		// 0x0300 ( 0x0004 )  [0x00000200]
	unsigned long                                      bCanBeDamaged:1;                                  		// 0x0300 ( 0x0004 )  [0x00000400]
	unsigned long                                      bShouldBaseAtStartup:1;                           		// 0x0300 ( 0x0004 )  [0x00000800][ CPF_Edit ]
	unsigned long                                      bPendingDelete:1;                                 		// 0x0300 ( 0x0004 )  [0x00001000]
	unsigned long                                      bAnimByOwner:1;                                   		// 0x0300 ( 0x0004 )  [0x00002000]
	unsigned long                                      bOwnerNoSee:1;                                    		// 0x0300 ( 0x0004 )  [0x00004000]
	unsigned long                                      bCanTeleport:1;                                   		// 0x0300 ( 0x0004 )  [0x00008000][ CPF_Edit ]
	unsigned long                                      bClientAnim:1;                                    		// 0x0300 ( 0x0004 )  [0x00010000]
	unsigned long                                      bDisturbFluidSurface:1;                           		// 0x0300 ( 0x0004 )  [0x00020000]
	float                                              FluidSurfaceShootStrengthMod;                     		// 0x0304 ( 0x0004 ) 
	unsigned long                                      bAlwaysTick:1;                                    		// 0x0308 ( 0x0004 )  [0x00000001][ CPF_Const ]
	unsigned long                                      bFullVolume:1;                                    		// 0x0308 ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bNotifyLocalPlayerTeamReceived:1;                 		// 0x0308 ( 0x0004 )  [0x00000004]
	unsigned long                                      bHardAttach:1;                                    		// 0x0308 ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bForceSkelUpdate:1;                               		// 0x0308 ( 0x0004 )  [0x00000010]
	unsigned long                                      bClientAuthoritative:1;                           		// 0x0308 ( 0x0004 )  [0x00000020][ CPF_Const ]
	unsigned long                                      bNotDrawSelf:1;                                   		// 0x0308 ( 0x0004 )  [0x00000040][ CPF_Net ]
	unsigned char                                      SoundVolume;                                      		// 0x030C ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      SoundPitch;                                       		// 0x030D ( 0x0001 ) [ CPF_Edit | CPF_Net ]
	unsigned char                                      SoundOcclusion;                                   		// 0x030E ( 0x0001 ) [ CPF_Edit ]
	float                                              SoundRadius;                                      		// 0x0310 ( 0x0004 ) [ CPF_Edit | CPF_Net ]
	float                                              TransientSoundVolume;                             		// 0x0314 ( 0x0004 ) [ CPF_Edit ]
	float                                              TransientSoundRadius;                             		// 0x0318 ( 0x0004 ) [ CPF_Edit ]
	float                                              CollisionRadius;                                  		// 0x031C ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_Net ]
	float                                              CollisionHeight;                                  		// 0x0320 ( 0x0004 ) [ CPF_Edit | CPF_Const | CPF_Net ]
	unsigned long                                      bCollideActors:1;                                 		// 0x0324 ( 0x0004 )  [0x00000001][ CPF_Edit | CPF_Const | CPF_Net ]
	unsigned long                                      bCollideWorld:1;                                  		// 0x0324 ( 0x0004 )  [0x00000002][ CPF_Net ]
	unsigned long                                      bBlockActors:1;                                   		// 0x0324 ( 0x0004 )  [0x00000004][ CPF_Edit | CPF_Net ]
	unsigned long                                      bBlockPlayers:1;                                  		// 0x0324 ( 0x0004 )  [0x00000008]
	unsigned long                                      bBlockProjectiles:1;                              		// 0x0324 ( 0x0004 )  [0x00000010]
	unsigned long                                      bProjTarget:1;                                    		// 0x0324 ( 0x0004 )  [0x00000020][ CPF_Edit | CPF_Net ]
	unsigned long                                      bBlockZeroExtentTraces:1;                         		// 0x0324 ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned long                                      bBlockNonZeroExtentTraces:1;                      		// 0x0324 ( 0x0004 )  [0x00000080][ CPF_Edit ]
	unsigned long                                      bAutoAlignToTerrain:1;                            		// 0x0324 ( 0x0004 )  [0x00000100][ CPF_Edit ]
	unsigned long                                      bUseCylinderCollision:1;                          		// 0x0324 ( 0x0004 )  [0x00000200][ CPF_Edit ]
	unsigned long                                      bBlockKarma:1;                                    		// 0x0324 ( 0x0004 )  [0x00000400][ CPF_Edit | CPF_Const ]
	unsigned long                                      bBlocksTeleport:1;                                		// 0x0324 ( 0x0004 )  [0x00000800]
	unsigned long                                      bAlwaysFaceCamera:1;                              		// 0x0324 ( 0x0004 )  [0x00001000][ CPF_Edit ]
	unsigned long                                      bNetNotify:1;                                     		// 0x0324 ( 0x0004 )  [0x00002000]
	unsigned long                                      bClientTrigger:1;                                 		// 0x0324 ( 0x0004 )  [0x00004000][ CPF_Net ]
	unsigned long                                      bUseCollisionStaticMesh:1;                        		// 0x0324 ( 0x0004 )  [0x00008000]
	unsigned long                                      bSmoothKarmaStateUpdates:1;                       		// 0x0324 ( 0x0004 )  [0x00010000]
	unsigned long                                      bIgnoreOutOfWorld:1;                              		// 0x0324 ( 0x0004 )  [0x00020000]
	unsigned long                                      bBounce:1;                                        		// 0x0324 ( 0x0004 )  [0x00040000][ CPF_Edit ]
	unsigned long                                      bFixedRotationDir:1;                              		// 0x0324 ( 0x0004 )  [0x00080000][ CPF_Edit | CPF_Net ]
	unsigned long                                      bRotateToDesired:1;                               		// 0x0324 ( 0x0004 )  [0x00100000][ CPF_Edit | CPF_Net ]
	unsigned long                                      bIgnoreTerminalVelocity:1;                        		// 0x0324 ( 0x0004 )  [0x00200000][ CPF_Edit ]
	unsigned long                                      bOrientToVelocity:1;                              		// 0x0324 ( 0x0004 )  [0x00400000][ CPF_Edit ]
	unsigned long                                      bInterpolating:1;                                 		// 0x0324 ( 0x0004 )  [0x00800000]
	unsigned long                                      bJustTeleported:1;                                		// 0x0324 ( 0x0004 )  [0x01000000][ CPF_Const ]
	float                                              Mass;                                             		// 0x0328 ( 0x0004 ) [ CPF_Edit ]
	float                                              Buoyancy;                                         		// 0x032C ( 0x0004 ) [ CPF_Edit ]
	struct FRotator                                    RotationRate;                                     		// 0x0330 ( 0x000C ) [ CPF_Edit | CPF_Net ]
	struct FRotator                                    DesiredRotation;                                  		// 0x033C ( 0x000C ) [ CPF_Edit | CPF_Net ]
	unsigned long                                      DesiredRotationCheck_Yaw:1;                       		// 0x0348 ( 0x0004 )  [0x00000001]
	unsigned long                                      DesiredRotationCheck_Pitch:1;                     		// 0x0348 ( 0x0004 )  [0x00000002]
	unsigned long                                      DesiredRotationCheck_Roll:1;                      		// 0x0348 ( 0x0004 )  [0x00000004]
	float                                              DesiredRotationThreshold_Yaw;                     		// 0x034C ( 0x0004 ) 
	float                                              DesiredRotationThreshold_Pitch;                   		// 0x0350 ( 0x0004 ) 
	float                                              DesiredRotationThreshold_Roll;                    		// 0x0354 ( 0x0004 ) 
	class AActor*                                      PendingTouch;                                     		// 0x0358 ( 0x0004 ) 
	struct FVector                                     ColLocation;                                      		// 0x035C ( 0x000C ) [ CPF_Const ]
	struct FName                                       ExcludeTag[ 0x08 ];                               		// 0x0368 ( 0x0020 ) [ CPF_Edit ]
	class UKarmaParamsCollision*                       KParams;                                          		// 0x0388 ( 0x0004 ) [ CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline ]
	int                                                KStepTag;                                         		// 0x038C ( 0x0004 ) [ CPF_Const | CPF_Native ]
	float                                              AccumKarmaAngleError;                             		// 0x0390 ( 0x0004 ) 
	struct FAnimRep                                    SimAnim;                                          		// 0x0394 ( 0x000C ) [ CPF_Net ]
	unsigned char                                      ForceType;                                        		// 0x03A0 ( 0x0001 ) [ CPF_Edit ]
	float                                              ForceRadius;                                      		// 0x03A4 ( 0x0004 ) [ CPF_Edit ]
	float                                              ForceScale;                                       		// 0x03A8 ( 0x0004 ) [ CPF_Edit ]
	float                                              ForceNoise;                                       		// 0x03AC ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bNetInitial:1;                                    		// 0x03B0 ( 0x0004 )  [0x00000001][ CPF_Const ]
	unsigned long                                      bNetOwner:1;                                      		// 0x03B0 ( 0x0004 )  [0x00000002][ CPF_Const | CPF_Net ]
	unsigned long                                      bNetRelevant:1;                                   		// 0x03B0 ( 0x0004 )  [0x00000004][ CPF_Const ]
	unsigned long                                      bDemoRecording:1;                                 		// 0x03B0 ( 0x0004 )  [0x00000008][ CPF_Const ]
	unsigned long                                      bClientDemoRecording:1;                           		// 0x03B0 ( 0x0004 )  [0x00000010][ CPF_Const ]
	unsigned long                                      bRepClientDemo:1;                                 		// 0x03B0 ( 0x0004 )  [0x00000020][ CPF_Const ]
	unsigned long                                      bClientDemoNetFunc:1;                             		// 0x03B0 ( 0x0004 )  [0x00000040][ CPF_Const ]
	unsigned long                                      bDemoOwner:1;                                     		// 0x03B0 ( 0x0004 )  [0x00000080][ CPF_Const ]
	unsigned long                                      bNoRepMesh:1;                                     		// 0x03B0 ( 0x0004 )  [0x00000100]
	unsigned long                                      bNotOnDedServer:1;                                		// 0x03B0 ( 0x0004 )  [0x00000200]
	unsigned long                                      bAlreadyPrecachedMaterials:1;                     		// 0x03B0 ( 0x0004 )  [0x00000400]
	unsigned long                                      bAlreadyPrecachedMeshes:1;                        		// 0x03B0 ( 0x0004 )  [0x00000800]
	unsigned long                                      bAlreadyPrecachedSkeletalMeshes:1;                		// 0x03B0 ( 0x0004 )  [0x00001000]
	unsigned long                                      bHiddenEd:1;                                      		// 0x03B0 ( 0x0004 )  [0x00002000][ CPF_Edit ]
	unsigned long                                      bHiddenEdGroup:1;                                 		// 0x03B0 ( 0x0004 )  [0x00004000][ CPF_Edit ]
	unsigned long                                      bDirectional:1;                                   		// 0x03B0 ( 0x0004 )  [0x00008000][ CPF_Edit ]
	unsigned long                                      bSelected:1;                                      		// 0x03B0 ( 0x0004 )  [0x00010000][ CPF_Const ]
	unsigned long                                      bEdShouldSnap:1;                                  		// 0x03B0 ( 0x0004 )  [0x00020000][ CPF_Edit ]
	unsigned long                                      bEdSnap:1;                                        		// 0x03B0 ( 0x0004 )  [0x00040000][ CPF_Transient ]
	unsigned long                                      bTempEditor:1;                                    		// 0x03B0 ( 0x0004 )  [0x00080000][ CPF_Const | CPF_Transient ]
	unsigned long                                      bObsolete:1;                                      		// 0x03B0 ( 0x0004 )  [0x00100000]
	unsigned long                                      bPathColliding:1;                                 		// 0x03B0 ( 0x0004 )  [0x00200000][ CPF_Edit ]
	unsigned long                                      bPathTemp:1;                                      		// 0x03B0 ( 0x0004 )  [0x00400000][ CPF_Transient ]
	unsigned long                                      bScriptInitialized:1;                             		// 0x03B0 ( 0x0004 )  [0x00800000]
	unsigned long                                      bLockLocation:1;                                  		// 0x03B0 ( 0x0004 )  [0x01000000][ CPF_Edit ]
	unsigned long                                      bTraceWater:1;                                    		// 0x03B0 ( 0x0004 )  [0x02000000]
	unsigned long                                      bNoProne:1;                                       		// 0x03B0 ( 0x0004 )  [0x04000000][ CPF_Edit ]
	class UClass*                                      MessageClass;                                     		// 0x03B4 ( 0x0004 ) 
	float                                              OverlayTimer;                                     		// 0x03B8 ( 0x0004 ) [ CPF_Edit | CPF_Net ]
	float                                              ClientOverlayTimer;                               		// 0x03BC ( 0x0004 ) [ CPF_Edit | CPF_Transient ]
	float                                              ClientOverlayCounter;                             		// 0x03C0 ( 0x0004 ) [ CPF_Edit | CPF_Transient ]
	class UMaterial*                                   HighDetailOverlay;                                		// 0x03C4 ( 0x0004 ) 

	// UScript Functions
	 void                      OnEndRound (  );                                  		//  Engine.Actor.OnEndRound
	 void                      OnBeginRound (  );                                		//  Engine.Actor.OnBeginRound
	 void                      eventSunLightDirectionUpdate ( struct FVector direction );		// [ FUNC_Event ] Engine.Actor.SunLightDirectionUpdate
	 bool                      BlocksShotAt ( class AActor* Other );             		//  Engine.Actor.BlocksShotAt
	 void                      PawnBaseDied (  );                                		//  Engine.Actor.PawnBaseDied
	 void                      RecoverFromHostChange (  );                       		//  Engine.Actor.RecoverFromHostChange
	 float                     GetAngleH ( struct FVector V );                   		//  Engine.Actor.GetAngleH
	 float                     GetDotH ( struct FVector V );                     		//  Engine.Actor.GetDotH
	 bool                      IsStationary (  );                                		//  Engine.Actor.IsStationary
	 void                      InitBot ( int Grade );                            		//  Engine.Actor.InitBot
	 void                      eventrpclog ( struct FString rpc );               		// [ FUNC_Event ] Engine.Actor.rpclog
	 void                      eventdblog ( struct FString Msg );                		// [ FUNC_Event ] Engine.Actor.dblog
	 void                      crlog ( struct FString Msg );                     		//  Engine.Actor.crlog
	 void                      eventclog ( struct FString Msg );                 		// [ FUNC_Simulated | FUNC_Event ] Engine.Actor.clog
	 void                      eventctlog ( struct FString Msg );                		// [ FUNC_Event ] Engine.Actor.ctlog
	 void                      eventalllog ( struct FString Msg );               		// [ FUNC_Event ] Engine.Actor.alllog
	 void                      NotifyLocalPlayerTeamReceived (  );               		//  Engine.Actor.NotifyLocalPlayerTeamReceived
	 void                      NotifyLocalPlayerDead ( class APlayerController* PC );		//  Engine.Actor.NotifyLocalPlayerDead
	 void                      SetDelayedDamageInstigatorController ( class AController* C );		//  Engine.Actor.SetDelayedDamageInstigatorController
	 bool                      TeamLink ( int TeamNum );                         		//  Engine.Actor.TeamLink
	 bool                      SelfTriggered (  );                               		//  Engine.Actor.SelfTriggered
	 bool                      EffectIsRelevant ( struct FVector SpawnLocation, bool bForceDedicated );		// [ FUNC_Simulated ] Engine.Actor.EffectIsRelevant
	 bool                      CheckMaxEffectDistance ( class APlayerController* P, struct FVector SpawnLocation );		// [ FUNC_Simulated ] Engine.Actor.CheckMaxEffectDistance
	 void                      SetOverlayMaterial ( class UMaterial* mat, float Time, bool bOverride );		// [ FUNC_Simulated ] Engine.Actor.SetOverlayMaterial
	 void                      Crash (  );                                       		//  Engine.Actor.Crash
	 struct FVector            GetCollisionExtent (  );                          		//  Engine.Actor.GetCollisionExtent
	 bool                      CanSplash (  );                                   		// [ FUNC_Simulated ] Engine.Actor.CanSplash
	 void                      PlayTeleportEffect ( bool bOut, bool bSound );    		//  Engine.Actor.PlayTeleportEffect
	 bool                      IsInPain (  );                                    		//  Engine.Actor.IsInPain
	 bool                      IsInVolume ( class AVolume* aVolume );            		//  Engine.Actor.IsInVolume
	 void                      UntriggerEvent ( struct FName EventName, class AActor* Other, class APawn* EventInstigator );		//  Engine.Actor.UntriggerEvent
	 void                      eventTriggerEvent ( struct FName EventName, class AActor* Other, class APawn* EventInstigator );		// [ FUNC_Simulated | FUNC_Event ] Engine.Actor.TriggerEvent
	 void                      Reset (  );                                       		//  Engine.Actor.Reset
	 void                      StartInterpolation (  );                          		// [ FUNC_Simulated ] Engine.Actor.StartInterpolation
	 bool                      TouchingActor ( class AActor* A );                		// [ FUNC_Final | FUNC_Simulated ] Engine.Actor.TouchingActor
	 bool                      NearSpot ( struct FVector Spot );                 		// [ FUNC_Final | FUNC_Simulated ] Engine.Actor.NearSpot
	 void                      DisplayDebug ( class UCanvas* Canvas, float* YL, float* YPos );		// [ FUNC_Simulated ] Engine.Actor.DisplayDebug
	 struct FString            GetDebugName (  );                                		//  Engine.Actor.GetDebugName
	 void                      SetGRI ( class AGameReplicationInfo* GRI );       		//  Engine.Actor.SetGRI
	 void                      MatchStarting (  );                               		//  Engine.Actor.MatchStarting
	 struct FString            GetLocalString ( int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2 );		//  Engine.Actor.GetLocalString
	 void                      SetDefaultDisplayProperties (  );                 		//  Engine.Actor.SetDefaultDisplayProperties
	 void                      SetDisplayProperties ( unsigned char NewStyle, class UMaterial* NewTexture, bool bLighting );		//  Engine.Actor.SetDisplayProperties
	 struct FString            GetHumanReadableName (  );                        		// [ FUNC_Simulated ] Engine.Actor.GetHumanReadableName
	 void                      POVChanged ( class APlayerController* PC, bool bBehindViewChanged );		//  Engine.Actor.POVChanged
	 void                      BecomeViewTarget (  );                            		//  Engine.Actor.BecomeViewTarget
	 void                      eventTravelPostAccept (  );                       		// [ FUNC_Event ] Engine.Actor.TravelPostAccept
	 void                      eventTravelPreAccept (  );                        		// [ FUNC_Event ] Engine.Actor.TravelPreAccept
	 bool                      CheckForErrors (  );                              		//  Engine.Actor.CheckForErrors
	 void                      HurtRadius ( float DamageAmount, float DamageRadius, class UClass* DamageType, float Momentum, struct FVector HitLocation );		// [ FUNC_Simulated ] Engine.Actor.HurtRadius
	 void                      PrecacheAnnouncer ( class AAnnouncerVoice* V, bool bRewardSounds );		// [ FUNC_Simulated ] Engine.Actor.PrecacheAnnouncer
	 void                      UpdateAnnouncements (  );                         		// [ FUNC_Simulated ] Engine.Actor.UpdateAnnouncements
	 void                      UpdatePrecacheSkeletalMeshes (  );                		// [ FUNC_Simulated ] Engine.Actor.UpdatePrecacheSkeletalMeshes
	 void                      UpdatePrecacheStaticMeshes (  );                  		// [ FUNC_Simulated ] Engine.Actor.UpdatePrecacheStaticMeshes
	 void                      UpdatePrecacheMaterials (  );                     		// [ FUNC_Simulated ] Engine.Actor.UpdatePrecacheMaterials
	 void                      eventPostNetBeginPlay (  );                       		// [ FUNC_Event ] Engine.Actor.PostNetBeginPlay
	 void                      eventSetGRIInitialState (  );                     		// [ FUNC_Simulated | FUNC_Event ] Engine.Actor.SetGRIInitialState
	 void                      eventSetInitialState (  );                        		// [ FUNC_Simulated | FUNC_Event ] Engine.Actor.SetInitialState
	 void                      eventPostBeginPlay (  );                          		// [ FUNC_Event ] Engine.Actor.PostBeginPlay
	 void                      eventBroadcastLocalizedMessage ( class UClass* MessageClass, int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject );		// [ FUNC_Event ] Engine.Actor.BroadcastLocalizedMessage
	 void                      ForceBegin (  );                                  		//  Engine.Actor.ForceBegin
	 void                      eventPreBeginPlay (  );                           		// [ FUNC_Event ] Engine.Actor.PreBeginPlay
	 void                      eventRenderTexture ( class UScriptedTexture* Tex );		// [ FUNC_Event ] Engine.Actor.RenderTexture
	 void                      RenderOverlays ( class UCanvas* Canvas );         		//  Engine.Actor.RenderOverlays
	 void                      eventRecoverFromBadStateCode (  );                		// [ FUNC_Event ] Engine.Actor.RecoverFromBadStateCode
	 class FColor              Multiply_ColorFloat ( class FColor A, float B );  		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0228 ] Engine.Actor.Multiply_ColorFloat
	 class FColor              Add_ColorColor ( class FColor A, class FColor B );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0227 ] Engine.Actor.Add_ColorColor
	 class FColor              Multiply_FloatColor ( float A, class FColor B );  		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0226 ] Engine.Actor.Multiply_FloatColor
	 class FColor              Subtract_ColorColor ( class FColor A, class FColor B );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0225 ] Engine.Actor.Subtract_ColorColor
	 void                      IterateObjectArray ( class TArray< class UObject* > ObjectArray, class UClass* baseClass, class UObject** Object );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.IterateObjectArray
	 void                      IterateActorArray ( class TArray< class AActor* > ActorArray, class UClass* baseClass, struct FName MatchTag, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.IterateActorArray
	 void                      CollidingActors ( class UClass* baseClass, float Radius, struct FVector loc, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0141 ] Engine.Actor.CollidingActors
	 void                      VisibleCollidingActors ( class UClass* baseClass, float Radius, struct FVector loc, bool bIgnoreHidden, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0138 ] Engine.Actor.VisibleCollidingActors
	 void                      VisibleActors ( class UClass* baseClass, float Radius, struct FVector loc, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0137 ] Engine.Actor.VisibleActors
	 void                      RadiusActors ( class UClass* baseClass, float Radius, struct FVector loc, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0136 ] Engine.Actor.RadiusActors
	 void                      TraceActors ( class UClass* baseClass, struct FVector End, struct FVector Start, struct FVector Extent, class AActor** Actor, struct FVector* HitLoc, struct FVector* HitNorm );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0135 ] Engine.Actor.TraceActors
	 void                      TouchingActors ( class UClass* baseClass, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0133 ] Engine.Actor.TouchingActors
	 void                      BasedActors ( class UClass* baseClass, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0132 ] Engine.Actor.BasedActors
	 void                      ChildActors ( class UClass* baseClass, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0131 ] Engine.Actor.ChildActors
	 void                      DynamicActors ( class UClass* baseClass, struct FName MatchTag, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0139 ] Engine.Actor.DynamicActors
	 void                      AllActors ( class UClass* baseClass, struct FName MatchTag, class AActor** Actor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0130 ] Engine.Actor.AllActors
	 bool                      MoveCacheEntry ( struct FString Guid, struct FString NewFilename );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.MoveCacheEntry
	 bool                      GetCacheEntry ( int Num, struct FString* Guid, struct FString* fileName );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetCacheEntry
	 void                      GetAllIntDesc ( struct FString MetaClass, class TArray< struct FString >* Entry, class TArray< struct FString >* Description );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetAllIntDesc
	 void                      GetAllInt ( struct FString MetaClass, class TArray< struct FString > Entries );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetAllInt
	 void                      GetNextIntDesc ( struct FString ClassName, int Num, struct FString* Entry, struct FString* Description );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetNextIntDesc
	 struct FString            GetNextInt ( struct FString ClassName, int Num ); 		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetNextInt
	 struct FString            GetURLMap ( bool bIncludeOptions );               		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0223 ] Engine.Actor.GetURLMap
	 void                      GetNextSkin ( struct FString Prefix, struct FString CurrentSkin, int Dir, struct FString* SkinName, struct FString* SkinDesc );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0221 ] Engine.Actor.GetNextSkin
	 struct FString            GetMapName ( struct FString NameEnding, struct FString MapName, int Dir );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x021B ] Engine.Actor.GetMapName
	 void                      AddToPackageMap ( struct FString PackageName );   		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AddToPackageMap
	 void                      ResetStaticFilterState (  );                      		// [ FUNC_Final | FUNC_Native ] Engine.Actor.ResetStaticFilterState
	 void                      eventBeginPlay (  );                              		// [ FUNC_Event ] Engine.Actor.BeginPlay
	 void                      eventPostTeleport ( class ATeleporter* OutTeleporter );		// [ FUNC_Event ] Engine.Actor.PostTeleport
	 bool                      eventPreTeleport ( class ATeleporter* InTeleporter );		// [ FUNC_Event ] Engine.Actor.PreTeleport
	 struct FVector            SuggestFallVelocity ( struct FVector Destination, struct FVector Start, float MaxZ, float MaxXYSpeed );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SuggestFallVelocity
	 bool                      PlayerCanSeeMe (  );                              		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0214 ] Engine.Actor.PlayerCanSeeMe
	 void                      MakeNoise ( float Loudness );                     		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0200 ] Engine.Actor.MakeNoise
	 bool                      ForceFeedbackSupported ( bool Enable );           		// [ FUNC_Final | FUNC_Native ] Engine.Actor.ForceFeedbackSupported
	 void                      ChangeBaseParamsFeedbackEffect ( struct FString EffectName, float DirectionX, float DirectionY, float Gain );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0239 ] Engine.Actor.ChangeBaseParamsFeedbackEffect
	 void                      ChangeSpringFeedbackEffect ( struct FString EffectName, float CenterX, float CenterY );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0238 ] Engine.Actor.ChangeSpringFeedbackEffect
	 void                      StopFeedbackEffect ( struct FString EffectName ); 		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0237 ] Engine.Actor.StopFeedbackEffect
	 void                      PlayFeedbackEffect ( struct FString EffectName ); 		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0236 ] Engine.Actor.PlayFeedbackEffect
	 float                     GetSoundDuration ( class USound* Sound );         		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetSoundDuration
	 bool                      IsSoundPlayingHK ( int SourceID );                		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.IsSoundPlayingHK
	 bool                      StopSoundHK ( int SourceID );                     		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.StopSoundHK
	 void                      StopLoopSoundByActor (  );                        		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.StopLoopSoundByActor
	 void                      StopAllSoundByActor (  );                         		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.StopAllSoundByActor
	 void                      StopAllSound (  );                                		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.StopAllSound
	 void                      StopSound ( unsigned char Slot, bool bNoOverride );		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.StopSound
	 void                      eventDemoPlaySound ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate );		// [ FUNC_Simulated | FUNC_Event | FUNC_Native ] Engine.Actor.DemoPlaySound
	 int                       PlayOwnedSound ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner );		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.PlayOwnedSound
	 int                       PlaySound ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0108 ] Engine.Actor.PlaySound
	 int                       SpecPlaySoundHK2 ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner, struct FVector SoundLocation );		// [ FUNC_Native ] Engine.Actor.SpecPlaySoundHK2
	 int                       PlaySoundHK2 ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner, struct FVector SoundLocation );		// [ FUNC_Native ] Engine.Actor.PlaySoundHK2
	 int                       ServerSpecPlaySoundHK ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner );		//  Engine.Actor.ServerSpecPlaySoundHK
	 int                       SpecPlaySoundHK ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner );		// [ FUNC_Native ] Engine.Actor.SpecPlaySoundHK
	 int                       PlaySoundHK ( class USound* Sound, unsigned char Slot, float Volume, bool bNoOverride, float Radius, float Pitch, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner );		// [ FUNC_Native ] Engine.Actor.PlaySoundHK
	 int                       fPlaySound ( struct FString fileName, unsigned char Slot, bool bNoOverride, bool Attenuate, bool Loop, int SellectTeam, bool bExceptOwner );		// [ FUNC_Native ] Engine.Actor.fPlaySound
	 void                      eventPostLoadSavedGame (  );                      		// [ FUNC_Event ] Engine.Actor.PostLoadSavedGame
	 void                      eventPreSaveGame (  );                            		// [ FUNC_Event ] Engine.Actor.PreSaveGame
	 void                      SetTimer ( float NewTimerRate, bool bLoop );      		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0118 ] Engine.Actor.SetTimer
	 void                      eventTornOff (  );                                		// [ FUNC_Event ] Engine.Actor.TornOff
	// bool                      Destroy (  );                                     		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0117 ] Engine.Actor.Destroy
	 class AActor*             Spawn ( class UClass* SpawnClass, class AActor* SpawnOwner, struct FName SpawnTag, struct FVector SpawnLocation, struct FRotator SpawnRotation, bool bNoCollisionFail );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0116 ] Engine.Actor.Spawn
	 bool                      TraceThisActorHitPart ( struct FVector TraceEnd, struct FVector TraceStart, struct FVector Extent, struct FVector* HitLocation, struct FVector* HitNormal, unsigned char* HitCollisionPart );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.TraceThisActorHitPart
	 bool                      TraceThisActor ( struct FVector TraceEnd, struct FVector TraceStart, struct FVector Extent, struct FVector* HitLocation, struct FVector* HitNormal );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.TraceThisActor
	 bool                      FastTrace ( struct FVector TraceEnd, struct FVector TraceStart );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0224 ] Engine.Actor.FastTrace
	 void                      MultiTrace ( struct FVector TraceEnd, struct FVector TraceStart, bool bTraceActors, bool bTraceMaterial, struct FVector Extent, class UBtrTraceResult** BtrResult );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.MultiTrace
	 class AActor*             Trace ( struct FVector TraceEnd, struct FVector TraceStart, bool bTraceActors, struct FVector Extent, struct FVector* HitLocation, struct FVector* HitNormal, class UMaterial** Material, unsigned char* CollPart );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0115 ] Engine.Actor.Trace
	 bool                      GetNameFromStr ( struct FString strName, struct FName* retName );		// [ FUNC_Native ] Engine.Actor.GetNameFromStr
	 void                      eventTakeHeadRoundBullet ( struct FVector HitLocation, int WeaponType );		// [ FUNC_Event ] Engine.Actor.TakeHeadRoundBullet
	 bool                      HealDamage ( int Amount, class AController* Healer, class UClass* DamageType );		//  Engine.Actor.HealDamage
	 void                      eventTakeDamage ( int Damage, class APawn* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, int CollisionPart, int WeaponType, bool bWallShot );		// [ FUNC_Event ] Engine.Actor.TakeDamage
	 void                      eventKilledBy ( class APawn* EventInstigator );   		// [ FUNC_Event ] Engine.Actor.KilledBy
	 void                      eventFellOutOfWorld ( unsigned char KillType );   		// [ FUNC_Simulated | FUNC_Event ] Engine.Actor.FellOutOfWorld
	 void                      eventUsedBy ( class APawn* User );                		// [ FUNC_Event ] Engine.Actor.UsedBy
	 void                      eventEndedRotation (  );                          		// [ FUNC_Event ] Engine.Actor.EndedRotation
	 void                      eventFinishedInterpolation (  );                  		// [ FUNC_Event ] Engine.Actor.FinishedInterpolation
	 void                      eventRanInto ( class AActor* Other );             		// [ FUNC_Event ] Engine.Actor.RanInto
	 void                      eventEncroachedBy ( class AActor* Other );        		// [ FUNC_Event ] Engine.Actor.EncroachedBy
	 bool                      eventEncroachingOn ( class AActor* Other );       		// [ FUNC_Event ] Engine.Actor.EncroachingOn
	 class AActor*             eventSpecialHandling ( class APawn* Other );      		// [ FUNC_Event ] Engine.Actor.SpecialHandling
	 void                      eventDetach ( class AActor* Other );              		// [ FUNC_Event ] Engine.Actor.Detach
	 void                      eventAttach ( class AActor* Other );              		// [ FUNC_Event ] Engine.Actor.Attach
	 void                      eventBaseChange (  );                             		// [ FUNC_Event ] Engine.Actor.BaseChange
	 void                      eventBump ( class AActor* Other );                		// [ FUNC_Event ] Engine.Actor.Bump
	 void                      eventUnTouch ( class AActor* Other );             		// [ FUNC_Event ] Engine.Actor.UnTouch
	 void                      eventPostTouch ( class AActor* Other );           		// [ FUNC_Event ] Engine.Actor.PostTouch
	 void                      eventTouch ( class AActor* Other );               		// [ FUNC_Event ] Engine.Actor.Touch
	 void                      eventPhysicsVolumeChange ( class APhysicsVolume* NewVolume );		// [ FUNC_Event ] Engine.Actor.PhysicsVolumeChange
	 void                      eventZoneChange ( class AZoneInfo* NewZone );     		// [ FUNC_Event ] Engine.Actor.ZoneChange
	 void                      eventLanded ( struct FVector HitNormal );         		// [ FUNC_Event ] Engine.Actor.Landed
	 void                      eventFalling (  );                                		// [ FUNC_Event ] Engine.Actor.Falling
	 void                      eventHitWall ( struct FVector HitNormal, class AActor* HitWall, class UMaterial* HitMaterial );		// [ FUNC_Event ] Engine.Actor.HitWall
	 void                      eventTimer (  );                                  		// [ FUNC_Event ] Engine.Actor.Timer
	 void                      TimerPop ( class AVolumeTimer* t );               		// [ FUNC_Simulated ] Engine.Actor.TimerPop
	 void                      eventEndEvent (  );                               		// [ FUNC_Event ] Engine.Actor.EndEvent
	 void                      eventBeginEvent (  );                             		// [ FUNC_Event ] Engine.Actor.BeginEvent
	 void                      eventUnTrigger ( class AActor* Other, class APawn* EventInstigator );		// [ FUNC_Event ] Engine.Actor.UnTrigger
	 void                      eventTrigger ( class AActor* Other, class APawn* EventInstigator );		// [ FUNC_Event ] Engine.Actor.Trigger
	 void                      eventClientTrigger (  );                          		// [ FUNC_Event ] Engine.Actor.ClientTrigger
	 void                      eventPostNetReceive (  );                         		// [ FUNC_Event ] Engine.Actor.PostNetReceive
	 void                      eventTick ( float DeltaTime );                    		// [ FUNC_Event ] Engine.Actor.Tick
	 void                      eventLostChild ( class AActor* Other );           		// [ FUNC_Event ] Engine.Actor.LostChild
	 void                      eventGainedChild ( class AActor* Other );         		// [ FUNC_Event ] Engine.Actor.GainedChild
	 void                      CheckLifeSpanReplicated (  );                     		// [ FUNC_Simulated ] Engine.Actor.CheckLifeSpanReplicated
	 void                      RegisterDestroyListener ( class UObject* o );     		//  Engine.Actor.RegisterDestroyListener
	 void                      eventDestroyed (  );                              		// [ FUNC_Event ] Engine.Actor.Destroyed
	 bool                      IsPenetrate (  );                                 		// [ FUNC_Final | FUNC_Native ] Engine.Actor.IsPenetrate
	 float                     GetMusicDuration ( int SongHandle );              		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetMusicDuration
	 void                      StopAllMusicAndClearQueue ( float FadeOutTime );  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.StopAllMusicAndClearQueue
	 void                      StopAllMusic ( float FadeOutTime );               		// [ FUNC_Final | FUNC_Native ] Engine.Actor.StopAllMusic
	 void                      StopMusic ( int SongHandle, float FadeOutTime );  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.StopMusic
	 bool                      IsPlayingMusic ( int SongHandle );                		// [ FUNC_Final | FUNC_Native ] Engine.Actor.IsPlayingMusic
	 int                       PlayMusic ( struct FString Song, float FadeInTime, float InitialSeekTime );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.PlayMusic
	 bool                      PauseStream ( int Handle );                       		// [ FUNC_Final | FUNC_Native ] Engine.Actor.PauseStream
	 bool                      AdjustVolume ( int Handle, float NewVolume );     		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AdjustVolume
	 int                       SeekStream ( int Handle, float Seconds );         		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SeekStream
	 void                      StopStream ( int Handle, float FadeOutTime );     		// [ FUNC_Final | FUNC_Native ] Engine.Actor.StopStream
	 int                       PlayStream ( struct FString Song, bool UseMusicVolume, float Volume, float FadeInTime, float SeekTime );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.PlayStream
	 void                      AllowMusicPlayback ( bool Allow );                		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AllowMusicPlayback
	 void                      UnClock ( float* Time );                          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.UnClock
	 void                      Clock ( float* Time );                            		// [ FUNC_Final | FUNC_Native ] Engine.Actor.Clock
	 bool                      eventKUpdateState ( struct FKRigidBodyState* NewState );		// [ FUNC_Event ] Engine.Actor.KUpdateState
	 void                      eventKApplyForce ( struct FVector* Force, struct FVector* Torque );		// [ FUNC_Event ] Engine.Actor.KApplyForce
	 void                      eventKSkelConvulse (  );                          		// [ FUNC_Event ] Engine.Actor.KSkelConvulse
	 void                      eventKVelDropBelow (  );                          		// [ FUNC_Event ] Engine.Actor.KVelDropBelow
	 void                      eventKImpact ( class AActor* Other, struct FVector pos, struct FVector impactVel, struct FVector impactNorm );		// [ FUNC_Event ] Engine.Actor.KImpact
	 bool                      KIsRagdollAvailable (  );                         		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KIsRagdollAvailable
	 void                      KMakeRagdollAvailable (  );                       		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KMakeRagdollAvailable
	 void                      KRemoveAllBoneLifters (  );                       		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KRemoveAllBoneLifters
	 void                      KRemoveLifterFromBone ( struct FName BoneName );  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KRemoveLifterFromBone
	 void                      KAddBoneLifter ( struct FName BoneName, struct FInterpCurve LiftVel, float LateralFriction, struct FInterpCurve Softness );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KAddBoneLifter
	 void                      KScaleJointLimits ( float Scale, float stiffness );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KScaleJointLimits
//	 void                      KFreezeRagdoll (  );                              		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KFreezeRagdoll
	 float                     KGetSkelMass (  );                                		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetSkelMass
	 void                      KSetSkelVel ( struct FVector Velocity, struct FVector AngVelocity, bool AddToCurrent );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetSkelVel
	 void                      KEnableCollision ( class AActor* Other );         		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KEnableCollision
	 void                      KDisableCollision ( class AActor* Other );        		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KDisableCollision
	 float                     KGetActorGravScale (  );                          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetActorGravScale
	 void                      KSetActorGravScale ( float ActorGravScale );      		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetActorGravScale
	 void                      KSetBlockKarma ( bool newBlock );                 		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetBlockKarma
	 void                      KSetStayUprightParams ( float stiffness, float damping );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetStayUprightParams
	 void                      KSetStayUpright ( bool stayUpright, bool allowRotate );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetStayUpright
//	 void                      KAddAngularImpulse ( struct FVector AngImpulse ); 		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KAddAngularImpulse
//	 void                      KAddImpulse ( struct FVector Impulse, struct FVector Position, struct FName BoneName );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KAddImpulse
//	 bool                      KIsAwake (  );                                    		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KIsAwake
//	 void                      KWake (  );                                       		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KWake
	 float                     KGetImpactThreshold (  );                         		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetImpactThreshold
	 void                      KSetImpactThreshold ( float thresh );             		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetImpactThreshold
	 void                      KGetCOMPosition ( struct FVector* pos );          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetCOMPosition
	 void                      KGetCOMOffset ( struct FVector* offset );         		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetCOMOffset
	 void                      KSetCOMOffset ( struct FVector offset );          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetCOMOffset
	 float                     KGetRestitution (  );                             		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetRestitution
	 void                      KSetRestitution ( float rest );                   		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetRestitution
	 float                     KGetFriction (  );                                		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetFriction
	 void                      KSetFriction ( float friction );                  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetFriction
	 void                      KGetDampingProps ( float* lindamp, float* angdamp );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetDampingProps
	 void                      KSetDampingProps ( float lindamp, float angdamp );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetDampingProps
	 void                      KGetInertiaTensor ( struct FVector* it1, struct FVector* it2 );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetInertiaTensor
	 void                      KSetInertiaTensor ( struct FVector it1, struct FVector it2 );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetInertiaTensor
	 float                     KGetMass (  );                                    		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetMass
	 void                      KSetMass ( float Mass );                          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetMass
	 struct FKRBVec            KRBVecFromVector ( struct FVector V );            		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KRBVecFromVector
	 struct FVector            KRBVecToVector ( struct FKRBVec RBvec );          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KRBVecToVector
	 void                      KDrawRigidBodyState ( struct FKRigidBodyState RBstate, bool AltColour );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KDrawRigidBodyState
	 void                      KGetRigidBodyState ( struct FKRigidBodyState* RBstate );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetRigidBodyState
	 struct FQuat              KGetRBQuaternion (  );                            		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetRBQuaternion
	 void                      KSetSimParams ( struct FKSimParams SimParams );   		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KSetSimParams
	 void                      KGetSimParams ( struct FKSimParams* SimParams );  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.KGetSimParams
	 void                      OnlyAffectPawns ( bool B );                       		// [ FUNC_Final | FUNC_Native ] Engine.Actor.OnlyAffectPawns
	 void                      SetPhysics ( unsigned char newPhysics );          		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0F82 ] Engine.Actor.SetPhysics
	 void                      FinishInterpolation (  );                         		// [ FUNC_Final | FUNC_Latent | FUNC_Native ] [ iNative : 0x012D ] Engine.Actor.FinishInterpolation
	 void                      DebugUnclock (  );                                		// [ FUNC_Final | FUNC_Native ] Engine.Actor.DebugUnclock
	 void                      DebugClock (  );                                  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.DebugClock
	 void                      ClearStayingDebugLines (  );                      		// [ FUNC_Final | FUNC_Native ] Engine.Actor.ClearStayingDebugLines
	 void                      DrawDebugSphere ( struct FVector Base, float Radius, int NumDivisions, unsigned char R, unsigned char G, unsigned char B );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.DrawDebugSphere
	 void                      DrawDebugCircle ( struct FVector Base, struct FVector X, struct FVector Y, float Radius, int NumSides, unsigned char R, unsigned char G, unsigned char B );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.DrawDebugCircle
	 void                      DrawStayingDebugLine ( struct FVector LineStart, struct FVector LineEnd, unsigned char R, unsigned char G, unsigned char B );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.DrawStayingDebugLine
	 void                      DrawDebugLine ( struct FVector LineStart, struct FVector LineEnd, unsigned char R, unsigned char G, unsigned char B );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.DrawDebugLine
	 struct FPlane             GetRenderBoundingSphere (  );                     		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetRenderBoundingSphere
	 struct FString            GetUrlOption ( struct FString Option );           		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetUrlOption
	 void                      UpdateURL ( struct FString NewOption, struct FString NewValue, bool bSaveDefault );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.UpdateURL
	 struct FName              GetClosestBone ( struct FVector loc, struct FVector ray, struct FName BiasBone, float BiasDistance, float* boneDist );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetClosestBone
	 bool                      AnimIsInGroup ( int Channel, struct FName GroupName );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AnimIsInGroup
	 void                      GetAnimParams ( int Channel, struct FName* OutSeqName, float* OutAnimFrame, float* OutAnimRate );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetAnimParams
	 void                      SetBoneRotation ( struct FName BoneName, struct FRotator BoneTurn, int Space, float Alpha );		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.SetBoneRotation
	 void                      SetBoneLocation ( struct FName BoneName, struct FVector BoneTrans, float Alpha );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetBoneLocation
	 void                      SetBoneDirection ( struct FName BoneName, struct FRotator BoneTurn, struct FVector BoneTrans, float Alpha, int Space );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetBoneDirection
	 void                      SetBoneScale ( int Slot, float BoneScale, struct FName BoneName );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetBoneScale
	 void                      LockRootMotion ( int Lock );                      		// [ FUNC_Final | FUNC_Native ] Engine.Actor.LockRootMotion
//	 bool                      DetachFromBone ( class AActor* Attachment );      		// [ FUNC_Final | FUNC_Native ] Engine.Actor.DetachFromBone
//	 bool                      AttachToBone ( class AActor* Attachment, struct FName BoneName );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AttachToBone
	 struct FRotator           GetRootRotationDelta (  );                        		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetRootRotationDelta
	 struct FVector            GetRootLocationDelta (  );                        		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetRootLocationDelta
	 struct FRotator           GetRootRotation (  );                             		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetRootRotation
	 struct FVector            GetRootLocation (  );                             		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetRootLocation
	 struct FRotator           GetBoneRotation ( struct FName BoneName, int Space );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetBoneRotation
	 struct FCoords            GetBoneCoords ( struct FName BoneName );          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetBoneCoords
	 void                      AnimBlendToAlpha ( int Stage, float TargetAlpha, float TimeInterval );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AnimBlendToAlpha
	 void                      AnimBlendParams ( int Stage, float BlendAlpha, float InTime, float OutTime, struct FName BoneName, bool bGlobalPose );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AnimBlendParams
	 void                      BoneRefresh (  );                                 		// [ FUNC_Final | FUNC_Native ] Engine.Actor.BoneRefresh
	 void                      LinkMesh ( class UMesh* NewMesh, bool bKeepAnim );		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.LinkMesh
	 void                      LinkSkelAnim ( class UMeshAnimation* Anim, class UMesh* NewMesh );		// [ FUNC_Final | FUNC_Simulated | FUNC_Native ] Engine.Actor.LinkSkelAnim
	 int                       GetNotifyChannel (  );                            		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetNotifyChannel
	 void                      EnableChannelNotify ( int Channel, int Switch );  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.EnableChannelNotify
	 void                      eventAnimEnd ( int Channel );                     		// [ FUNC_Event ] Engine.Actor.AnimEnd
	 void                      eventLIPSincAnimEnd (  );                         		// [ FUNC_Event ] Engine.Actor.LIPSincAnimEnd
	 struct FString            CurrentLIPSincAnim (  );                          		// [ FUNC_Final | FUNC_Native ] Engine.Actor.CurrentLIPSincAnim
	 bool                      IsPlayingLIPSincAnim (  );                        		// [ FUNC_Final | FUNC_Native ] Engine.Actor.IsPlayingLIPSincAnim
	 bool                      HasLIPSincAnim ( struct FName LIPSincAnimName );  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.HasLIPSincAnim
	 void                      StopLIPSincAnim (  );                             		// [ FUNC_Final | FUNC_Native ] Engine.Actor.StopLIPSincAnim
	 void                      PlayLIPSincAnim ( struct FName LIPSincAnimName, float Volume, float Radius, float Pitch );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.PlayLIPSincAnim
	 void                      AnimStopLooping ( int Channel );                  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.AnimStopLooping
	 bool                      IsTweening ( int Channel );                       		// [ FUNC_Final | FUNC_Native ] Engine.Actor.IsTweening
	 void                      SetAnimFrame ( float Time, int Channel, int UnitFlag );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetAnimFrame
	 void                      FreezeAnimAt ( float Time, int Channel );         		// [ FUNC_Final | FUNC_Native ] Engine.Actor.FreezeAnimAt
	 void                      StopAnimating ( bool ClearAllButBase );           		// [ FUNC_Final | FUNC_Native ] Engine.Actor.StopAnimating
	 bool                      HasAnim ( struct FName Sequence );                		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0107 ] Engine.Actor.HasAnim
	 void                      FinishAnim ( int Channel );                       		// [ FUNC_Final | FUNC_Latent | FUNC_Native ] [ iNative : 0x0105 ] Engine.Actor.FinishAnim
	 bool                      IsAnimating ( int Channel );                      		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x011A ] Engine.Actor.IsAnimating
	 bool                      TweenAnim ( struct FName Sequence, float Time, int Channel );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0126 ] Engine.Actor.TweenAnim
	 bool                      LoopAnim ( struct FName Sequence, float Rate, float TweenTime, int Channel );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0104 ] Engine.Actor.LoopAnim
	 bool                      PlayAnim ( struct FName Sequence, float Rate, float TweenTime, int Channel );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0103 ] Engine.Actor.PlayAnim
	 struct FString            GetMeshName (  );                                 		// [ FUNC_Final | FUNC_Native ] Engine.Actor.GetMeshName
	 bool                      IsJoinedTo ( class AActor* Other );               		// [ FUNC_Final | FUNC_Native ] Engine.Actor.IsJoinedTo
//	 void                      SetOwner ( class AActor* NewOwner );              		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0110 ] Engine.Actor.SetOwner
	 void                      SetBase ( class AActor* NewBase, struct FVector NewFloor );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x012A ] Engine.Actor.SetBase
	 void                      SetBaseMaterial ( class UMaterial* NewBaseMaterial );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetBaseMaterial
	 void                      AutonomousPhysics ( float DeltaSeconds );         		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0F83 ] Engine.Actor.AutonomousPhysics
	 bool                      MoveSmooth ( struct FVector Delta, bool TestCollide );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0F81 ] Engine.Actor.MoveSmooth
	 bool                      SetRelativeLocation ( struct FVector NewLocation );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetRelativeLocation
	 bool                      SetRelativeRotation ( struct FRotator NewRotation );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetRelativeRotation
	 bool                      SetRotation ( struct FRotator NewRotation );      		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x012B ] Engine.Actor.SetRotation
	 bool                      SetLocation ( struct FVector NewLocation );       		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x010B ] Engine.Actor.SetLocation
	 bool                      Move ( struct FVector Delta );                    		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x010A ] Engine.Actor.Move
	 void                      SetDrawType ( unsigned char NewDrawType );        		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetDrawType
//	 void                      SetStaticMesh ( class UStaticMesh* NewStaticMesh );		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetStaticMesh
//	 void                      SetDrawScale3D ( struct FVector NewScale3D );     		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetDrawScale3D
//	 void                      SetDrawScale ( float NewScale );                  		// [ FUNC_Final | FUNC_Native ] Engine.Actor.SetDrawScale
//	 bool                      SetCollisionSize ( float NewRadius, float NewHeight );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x011B ] Engine.Actor.SetCollisionSize
	 void                      SetCollision ( bool NewColActors, bool NewBlockActors, bool NewBlockPlayers );		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x0106 ] Engine.Actor.SetCollision
	 void                      Sleep ( float Seconds );                          		// [ FUNC_Final | FUNC_Latent | FUNC_Native ] [ iNative : 0x0100 ] Engine.Actor.Sleep
	 bool                      ShouldBeHidden (  );                              		// [ FUNC_Final | FUNC_Native ] Engine.Actor.ShouldBeHidden
	 void                      Error ( struct FString S );                       		// [ FUNC_Final | FUNC_Native ] [ iNative : 0x00E9 ] Engine.Actor.Error
	 void                      TextToSpeech ( struct FString Text, float Volume );		// [ FUNC_Native ] Engine.Actor.TextToSpeech
	 void                      CopyObjectToClipboard ( class UObject* obj );     		// [ FUNC_Native ] Engine.Actor.CopyObjectToClipboard
	 struct FString            ConsoleCommand ( struct FString Command, bool bWriteToLog );		// [ FUNC_Native ] Engine.Actor.ConsoleCommand

	// Public Imports
	AActor(class AActor const &);
	AActor(void);
	class AActor &  operator=(class AActor const &);
	void  AddAntiportals(void);
	void  AttachProjector(class AProjector *);
	int  AttachToBone(class AActor *,class FName);
	void  BeginTouch(class AActor *);
	void  CheckNoiseHearing(float);
	void  ClearOctreeData(void);
	void  ClearRenderData(void);
	int  DetachFromBone(class AActor *);
	void  DetachProjector(class AProjector *);
	void  EndTouch(class AActor *,int);
	unsigned long  FastTraceImp(class FVector const &,class FVector const &);
	void  FindBase(void);
	class FDynamicActor *  GetActorRenderData(void);
	class AActor *  GetAmbientLightingActor(void);
	class FVector  GetCylinderExtent(void)const ;
	class AActor *  GetHitActor(void);
	class ULevel *  GetLevel(void)const ;
	class FDynamicLight *  GetLightRenderData(void);
	void  GetNetBuoyancy(float &,float &);
	class APawn *  GetPlayerPawn(void)const ;
	class AActor *  GetTopOwner(void);
	class FRotator  GetViewRotation(void);
	static void  InternalConstructor(void *);
	int  IsAnimating(int)const ;
	int  IsBasedOn(class AActor const *)const ;
	int  IsBlockedBy(class AActor const *)const ;
	int  IsBrush(void)const ;
	int  IsEncroacher(void)const ;
	int  IsHiddenEd(void);
	int  IsInOctree(void);
	int  IsInZone(class AZoneInfo const *)const ;
	int  IsMovingBrush(void)const ;
	int  IsOverlapping(class AActor *,struct FCheckResult *);
	int  IsOwnedBy(class AActor const *)const ;
	int  IsPlayer(void)const ;
	int  IsStaticBrush(void)const ;
	int  IsVolumeBrush(void)const ;
	void  KAddAngularImpulse(class FVector);
	void  KAddForces(class FVector,class FVector);
	void  KAddImpulse(class FVector,class FVector,class FName);
	void  KDrawRigidBodyState(struct _FKRigidBodyState *,int);
	void  KFreezeRagdoll(void);
	void  KGetRigidBodyState(struct _FKRigidBodyState *);
	int  KIsAwake(void);
	void  KWake(void);
	float  LifeFraction(void);
	void  MultiTrace(class UBtrTraceResult *,class FVector const &,class FVector const &,int,int,class FVector const &);
	void  PlayReplicatedAnim(void);
	void  ProcessDemoRecFunction(class UFunction *,void *,struct FFrame *);
	void  ReplicateAnim(int,class FName,float,float,float,float,int);
	void  SetCollision(int,int);
	void  SetCollisionSize(float,float);
	void  SetDrawScale3D(class FVector);
	void  SetDrawScale(float);
	void  SetDrawType(enum EDrawType);
	void  SetOwner(class AActor *);
	bool  SetRotationImp2(class FRotator const &);
	void  SetRotationImp(class FRotator const &,void *);
	void  SetStaticMesh(class UStaticMesh *);
	static class UClass *  StaticClass(void);
	class FVector  SuggestFallVelocity(class FVector,class FVector,float,float,float,float);
	int  TestCanSeeMe(class APlayerController *);
	void  TextToSpeech(class FString const &,float);
	void  TraceImp(class FVector *,class FVector *,class FVector const &,class FVector const &,unsigned long,class FVector,class UMaterial * *,int *,void *);
	unsigned long  TraceThisActorImp2(class FVector *,class FVector *,class FVector const &,class FVector const &,class FVector const &);
	void  TraceThisActorImp(class FVector *,class FVector *,class FVector const &,class FVector const &,class FVector const &,unsigned long *);
	void  TwoWallAdjust(class FVector &,class FVector &,class FVector &,class FVector &,float);
	void  UpdateOverlay(float);
	void  UpdateRelativeRotation(void);
	void  UpdateRenderData(void);
	void  UpdateTimers(float);
	int  fixedTurn(int,int,int);
	int  moveSmooth(class FVector);
	void  physKarmaRagDoll(float);
	void  physKarmaRagDoll_internal(float);
	void  physKarma_internal(float);
	void  physProjectile(float,int);
	void  physRootMotion(float);
	void  physTrailer(float);
	void  physicsRotation(float);
	void  postKarmaStep_skeletal(void);
	void  preKarmaStep_skeletal(float);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x039C

// Class Engine.wAILevelBase
class DLL_IMPORT AwAILevelBase : public AActor
{
public:

	// UScript Functions
	 void                      ClearReferences (  );                             		//  Engine.wAILevelBase.ClearReferences
	 void                      KillBotsTeam ( int Num, int inTeam );             		//  Engine.wAILevelBase.KillBotsTeam
	 void                      KillBots ( int Num );                             		//  Engine.wAILevelBase.KillBots
	 void                      KillBot ( class AAIController* Bot );             		//  Engine.wAILevelBase.KillBot
	 void                      Initialize (  );                                  		//  Engine.wAILevelBase.Initialize

	// Public Imports
	AwAILevelBase(class AwAILevelBase const &);
	class AwAILevelBase &  operator=(class AwAILevelBase const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0000

// Class Engine.wMatchMaker
class DLL_IMPORT UwMatchMaker : public UObject
{
public:
	struct FTencentLoginInfo                           LoginInfo;                                        		// 0x002C ( 0x0098 ) [ CPF_NeedCtorLink ]
	unsigned char                                      GamePageState;                                    		// 0x00C4 ( 0x0001 ) 
	unsigned char                                      GameEndType;                                      		// 0x00C5 ( 0x0001 ) 
	class TArray< struct FPingTime >                   arrPingTime;                                      		// 0x00C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UInteraction*                                Console;                                          		// 0x00D4 ( 0x0004 ) [ CPF_Transient ]
	unsigned long                                      bForceGameOut:1;                                  		// 0x00D8 ( 0x0004 )  [0x00000001]
	unsigned long                                      bKickOut:1;                                       		// 0x00D8 ( 0x0004 )  [0x00000002]
	unsigned long                                      bUsing:1;                                         		// 0x00D8 ( 0x0004 )  [0x00000004]
	unsigned long                                      bIsOwner:1;                                       		// 0x00D8 ( 0x0004 )  [0x00000008]
	unsigned long                                      bListen:1;                                        		// 0x00D8 ( 0x0004 )  [0x00000010]
	unsigned long                                      bServerConnected:1;                               		// 0x00D8 ( 0x0004 )  [0x00000020]
	unsigned long                                      IsRelayServerOff:1;                               		// 0x00D8 ( 0x0004 )  [0x00000040]
	unsigned long                                      bSDRespawn:1;                                     		// 0x00D8 ( 0x0004 )  [0x00000080]
	unsigned long                                      bForceSDRespawn:1;                                		// 0x00D8 ( 0x0004 )  [0x00000100]
	unsigned long                                      bAutoStart:1;                                     		// 0x00D8 ( 0x0004 )  [0x00000200]
	struct FString                                     strLoadingErrorMsg;                               		// 0x00DC ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szGameClass;                                      		// 0x00E8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szSeverName;                                      		// 0x00F4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szChannelGroup;                                   		// 0x0100 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szChannelName;                                    		// 0x010C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szMapName;                                        		// 0x0118 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szRoomName;                                       		// 0x0124 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     szRoomPassword;                                   		// 0x0130 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                iNumTeam;                                         		// 0x013C ( 0x0004 ) 
	int                                                iGoalRound;                                       		// 0x0140 ( 0x0004 ) 
	int                                                iTimeLimit;                                       		// 0x0144 ( 0x0004 ) 
	unsigned long                                      bFriendlyFire:1;                                  		// 0x0148 ( 0x0004 )  [0x00000001]
	unsigned long                                      bAllowSpectate:1;                                 		// 0x0148 ( 0x0004 )  [0x00000002]
	unsigned long                                      bAutobalance:1;                                   		// 0x0148 ( 0x0004 )  [0x00000004]
	unsigned long                                      bAllowJoin:1;                                     		// 0x0148 ( 0x0004 )  [0x00000008]
	unsigned long                                      bAllow3rdPersonView:1;                            		// 0x0148 ( 0x0004 )  [0x00000010]
	unsigned long                                      bChatVictimOnly:1;                                		// 0x0148 ( 0x0004 )  [0x00000020]
	unsigned long                                      bHasChannelTCP:1;                                 		// 0x0148 ( 0x0004 )  [0x00000040]
	int                                                LoadingSleepTime;                                 		// 0x014C ( 0x0004 ) 
	int                                                LoadingSleepTimePrecache;                         		// 0x0150 ( 0x0004 ) 
	unsigned char                                      eWeaponLimit;                                     		// 0x0154 ( 0x0001 ) 
	int                                                iMinutesKickAFK;                                  		// 0x0158 ( 0x0004 ) 
	int                                                iMinPlayers;                                      		// 0x015C ( 0x0004 ) 
	int                                                iMaxPlayers;                                      		// 0x0160 ( 0x0004 ) 
	unsigned long                                      InGamePlaying:1;                                  		// 0x0164 ( 0x0004 )  [0x00000001]
	int                                                InGameOver;                                       		// 0x0168 ( 0x0004 ) 
	unsigned long                                      bIsLoading:1;                                     		// 0x016C ( 0x0004 )  [0x00000001]
	unsigned long                                      TR_bNewRespawn:1;                                 		// 0x016C ( 0x0004 )  [0x00000002]
	unsigned long                                      bFreeView:1;                                      		// 0x016C ( 0x0004 )  [0x00000004]
	struct FString                                     OldHostName;                                      		// 0x0170 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bHardCore:1;                                      		// 0x017C ( 0x0004 )  [0x00000001]
	unsigned long                                      bAdminSpectator:1;                                		// 0x017C ( 0x0004 )  [0x00000002]
	unsigned long                                      bMultiBomb:1;                                     		// 0x017C ( 0x0004 )  [0x00000004]
	int                                                SD_ChangeRound;                                   		// 0x0180 ( 0x0004 ) 
	unsigned long                                      SD_ChangeAttackTeam:1;                            		// 0x0184 ( 0x0004 )  [0x00000001]
	unsigned long                                      IsUsingTenProtect:1;                              		// 0x0184 ( 0x0004 )  [0x00000002]
	class TArray< struct FString >                     BlockUserListForOption;                           		// 0x0188 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kFriendListCount;                                 		// 0x0194 ( 0x0004 ) 
	class TArray< struct FFriendStruct >               kFriendList;                                      		// 0x0198 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kClanListCount;                                   		// 0x01A4 ( 0x0004 ) 
	class TArray< struct FClanStruct >                 kClanList;                                        		// 0x01A8 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kPCBangListCount;                                 		// 0x01B4 ( 0x0004 ) 
	class TArray< struct FPCBangStruct >               kPCBangList;                                      		// 0x01B8 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kBlockListCount;                                  		// 0x01C4 ( 0x0004 ) 
	class TArray< struct FBlockStruct >                kBlockList;                                       		// 0x01C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      kConnectAlpha;                                    		// 0x01D4 ( 0x0001 ) 
	unsigned char                                      kChannelingType;                                  		// 0x01D5 ( 0x0001 ) 
	int                                                kServerType;                                      		// 0x01D8 ( 0x0004 ) 
	unsigned long                                      kIsDSHost:1;                                      		// 0x01DC ( 0x0004 )  [0x00000001]
	unsigned long                                      kIsInDSChannel:1;                                 		// 0x01DC ( 0x0004 )  [0x00000002]
	unsigned long                                      kDS_SavedOwnerInfo:1;                             		// 0x01DC ( 0x0004 )  [0x00000004]
	unsigned long                                      kClanMatch_InChannel:1;                           		// 0x01DC ( 0x0004 )  [0x00000008]
	unsigned long                                      kClanMatch_InReadyRoom:1;                         		// 0x01DC ( 0x0004 )  [0x00000010]
	unsigned long                                      kClanMatch_Leader:1;                              		// 0x01DC ( 0x0004 )  [0x00000020]
	int                                                kClanMatch_ReadyRoomID;                           		// 0x01E0 ( 0x0004 ) 
	unsigned long                                      kClanMatch_InMatchRoom:1;                         		// 0x01E4 ( 0x0004 )  [0x00000001]
	int                                                kClanMatch_ChannelID;                             		// 0x01E8 ( 0x0004 ) 
	int                                                kClanMatch_RoomID;                                		// 0x01EC ( 0x0004 ) 
	unsigned long                                      kClanMatch_OpenState:1;                           		// 0x01F0 ( 0x0004 )  [0x00000001]
	int                                                kClanMatch_VersusMode;                            		// 0x01F4 ( 0x0004 ) 
	class TArray< int >                                kClanMatch_Map;                                   		// 0x01F8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     kClanMatch_RoomName;                              		// 0x0204 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bNewDailyQuestAvailable:1;                        		// 0x0210 ( 0x0004 )  [0x00000001]
	unsigned long                                      bNoUpdateQuestInfo:1;                             		// 0x0210 ( 0x0004 )  [0x00000002]
	unsigned long                                      bRecvProtocolUpdateQuest:1;                       		// 0x0210 ( 0x0004 )  [0x00000004]
	unsigned long                                      bSortQuestList:1;                                 		// 0x0210 ( 0x0004 )  [0x00000008]
	class UObject*                                     kMainMenu;                                        		// 0x0214 ( 0x0004 ) 
	class UBTTcpLink_Channel*                          kTcpChannel;                                      		// 0x0218 ( 0x0004 ) 
	class UBTTcpLink_Process2Agent*                    kTcpDStoDP;                                       		// 0x021C ( 0x0004 ) 
	int                                                kDediServerID;                                    		// 0x0220 ( 0x0004 ) 
	int                                                kDediChannelNum;                                  		// 0x0224 ( 0x0004 ) 
	int                                                kDediRoomNum;                                     		// 0x0228 ( 0x0004 ) 
	int                                                kPID;                                             		// 0x022C ( 0x0004 ) 
	unsigned long                                      kDediIsConnectedWithServer:1;                     		// 0x0230 ( 0x0004 )  [0x00000001]
	unsigned long                                      kCharacterCreation:1;                             		// 0x0230 ( 0x0004 )  [0x00000002]
	unsigned char                                      kInterfaceGuideStep;                              		// 0x0234 ( 0x0001 ) 
	unsigned long                                      kFirstTutorial:1;                                 		// 0x0238 ( 0x0004 )  [0x00000001]
	unsigned long                                      kFirstIntoInventory:1;                            		// 0x0238 ( 0x0004 )  [0x00000002]
	unsigned long                                      kFirstIntoStore:1;                                		// 0x0238 ( 0x0004 )  [0x00000004]
	unsigned long                                      kNeedUpdateItemList:1;                            		// 0x0238 ( 0x0004 )  [0x00000008]
	unsigned long                                      kNeedUpdateSkillList:1;                           		// 0x0238 ( 0x0004 )  [0x00000010]
	unsigned long                                      kNeedUpdatePoint:1;                               		// 0x0238 ( 0x0004 )  [0x00000020]
	unsigned long                                      kNeedUpdateCash:1;                                		// 0x0238 ( 0x0004 )  [0x00000040]
	unsigned long                                      kRecvPaidPCBangInfo:1;                            		// 0x0238 ( 0x0004 )  [0x00000080]
	int                                                kIsPaidPCBang;                                    		// 0x023C ( 0x0004 ) 
	int                                                kIsRegisteredPCBang;                              		// 0x0240 ( 0x0004 ) 
	int                                                kIsMainPCBang;                                    		// 0x0244 ( 0x0004 ) 
	struct FString                                     kPCBangName;                                      		// 0x0248 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kPCBangType;                                      		// 0x0254 ( 0x0004 ) 
	unsigned long                                      kClanLookingFor:1;                                		// 0x0258 ( 0x0004 )  [0x00000001]
	struct FString                                     kPrevClanName;                                    		// 0x025C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     kClanName;                                        		// 0x0268 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kClanPattern;                                     		// 0x0274 ( 0x0004 ) 
	int                                                kClanBG;                                          		// 0x0278 ( 0x0004 ) 
	int                                                kClanBL;                                          		// 0x027C ( 0x0004 ) 
	int                                                kInClanGrade;                                     		// 0x0280 ( 0x0004 ) 
	unsigned long                                      bInverseWeapon:1;                                 		// 0x0284 ( 0x0004 )  [0x00000001]
	int                                                kClanLevel;                                       		// 0x0288 ( 0x0004 ) 
	int                                                kClanExp;                                         		// 0x028C ( 0x0004 ) 
	struct FString                                     kClanMasterName;                                  		// 0x0290 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kClanWin;                                         		// 0x029C ( 0x0004 ) 
	int                                                kClanLose;                                        		// 0x02A0 ( 0x0004 ) 
	int                                                kClanDraw;                                        		// 0x02A4 ( 0x0004 ) 
	int                                                kClanKill;                                        		// 0x02A8 ( 0x0004 ) 
	int                                                kClanDeath;                                       		// 0x02AC ( 0x0004 ) 
	int                                                kClanAssist;                                      		// 0x02B0 ( 0x0004 ) 
	int                                                kClanPrevRanking;                                 		// 0x02B4 ( 0x0004 ) 
	int                                                kClanRanking;                                     		// 0x02B8 ( 0x0004 ) 
	int                                                kClanMonthlyPrevRanking;                          		// 0x02BC ( 0x0004 ) 
	int                                                kClanMonthlyRanking;                              		// 0x02C0 ( 0x0004 ) 
	unsigned char                                      kClanRegion;                                      		// 0x02C4 ( 0x0001 ) 
	int                                                kClanMemberCount;                                 		// 0x02C8 ( 0x0004 ) 
	int                                                kClanMemberMaximum;                               		// 0x02CC ( 0x0004 ) 
	unsigned char                                      kClanIsRecruit;                                   		// 0x02D0 ( 0x0001 ) 
	struct FString                                     kClanHowOld;                                      		// 0x02D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     kClanKeyword;                                     		// 0x02E0 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     kClanIntro;                                       		// 0x02EC ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     kClanNotice;                                      		// 0x02F8 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kClanActivity;                                    		// 0x0304 ( 0x0004 ) 
	int                                                kClanActivityRank;                                		// 0x0308 ( 0x0004 ) 
	int                                                kClanActivityRankPrev;                            		// 0x030C ( 0x0004 ) 
	int                                                kClanActivityMRank;                               		// 0x0310 ( 0x0004 ) 
	int                                                kClanActivityMRankPrev;                           		// 0x0314 ( 0x0004 ) 
	struct FString                                     kUserName;                                        		// 0x0318 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kLevel;                                           		// 0x0324 ( 0x0004 ) 
	int                                                kUID;                                             		// 0x0328 ( 0x0004 ) 
	int                                                kExp;                                             		// 0x032C ( 0x0004 ) 
	int                                                kStartExp;                                        		// 0x0330 ( 0x0004 ) 
	int                                                kEndExp;                                          		// 0x0334 ( 0x0004 ) 
	int                                                kLevelMarkID;                                     		// 0x0338 ( 0x0004 ) 
	int                                                kTitleMarkID;                                     		// 0x033C ( 0x0004 ) 
	int                                                kReserved1;                                       		// 0x0340 ( 0x0004 ) 
	int                                                kReserved2;                                       		// 0x0344 ( 0x0004 ) 
	int                                                kReserved3;                                       		// 0x0348 ( 0x0004 ) 
	unsigned long                                      kTest:1;                                          		// 0x034C ( 0x0004 )  [0x00000001]
	unsigned long                                      bExistUseAdvCamShake:1;                           		// 0x034C ( 0x0004 )  [0x00000002]
	unsigned char                                      GMLevelFlag;                                      		// 0x0350 ( 0x0001 ) 
	unsigned long                                      isGMRoom:1;                                       		// 0x0354 ( 0x0004 )  [0x00000001]
	class TArray< int >                                kGMListInGameRoom;                                		// 0x0358 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kPrevRanking;                                     		// 0x0364 ( 0x0004 ) 
	int                                                kRanking;                                         		// 0x0368 ( 0x0004 ) 
	int                                                kPrevHeadShotRanking;                             		// 0x036C ( 0x0004 ) 
	int                                                kHeadShotRanking;                                 		// 0x0370 ( 0x0004 ) 
	int                                                kPrevWomanRanking;                                		// 0x0374 ( 0x0004 ) 
	int                                                kWomanRanking;                                    		// 0x0378 ( 0x0004 ) 
	int                                                kMonthlyPrevRanking;                              		// 0x037C ( 0x0004 ) 
	int                                                kMonthlyRanking;                                  		// 0x0380 ( 0x0004 ) 
	int                                                kMonthlyPrevHeadShotRanking;                      		// 0x0384 ( 0x0004 ) 
	int                                                kMonthlyHeadShotRanking;                          		// 0x0388 ( 0x0004 ) 
	int                                                kMonthlyPrevWomanRanking;                         		// 0x038C ( 0x0004 ) 
	int                                                kMonthlyWomanRanking;                             		// 0x0390 ( 0x0004 ) 
	int                                                kKill;                                            		// 0x0394 ( 0x0004 ) 
	int                                                kDeath;                                           		// 0x0398 ( 0x0004 ) 
	int                                                kWin;                                             		// 0x039C ( 0x0004 ) 
	int                                                kLose;                                            		// 0x03A0 ( 0x0004 ) 
	int                                                kAssist;                                          		// 0x03A4 ( 0x0004 ) 
	int                                                kHeadShot;                                        		// 0x03A8 ( 0x0004 ) 
	int                                                kDisConnectCount;                                 		// 0x03AC ( 0x0004 ) 
	int                                                kTotalPlayTime;                                   		// 0x03B0 ( 0x0004 ) 
	int                                                kUser_ClanContribue;                              		// 0x03B4 ( 0x0004 ) 
	int                                                kUser_ClanWin;                                    		// 0x03B8 ( 0x0004 ) 
	int                                                kUser_ClanLose;                                   		// 0x03BC ( 0x0004 ) 
	int                                                kUser_ClanKill;                                   		// 0x03C0 ( 0x0004 ) 
	int                                                kUser_ClanDeath;                                  		// 0x03C4 ( 0x0004 ) 
	int                                                kUser_ClanAssist;                                 		// 0x03C8 ( 0x0004 ) 
	int                                                kUser_ClanHeadshot;                               		// 0x03CC ( 0x0004 ) 
	int                                                kUser_ClanDiscon;                                 		// 0x03D0 ( 0x0004 ) 
	int                                                kFaceID;                                          		// 0x03D4 ( 0x0004 ) 
	int                                                kHelmetID;                                        		// 0x03D8 ( 0x0004 ) 
	int                                                kFaceAccessoryID;                                 		// 0x03DC ( 0x0004 ) 
	int                                                kAFSpecialID;                                     		// 0x03E0 ( 0x0004 ) 
	int                                                kRSASpecialID;                                    		// 0x03E4 ( 0x0004 ) 
	int                                                kPrimaryID;                                       		// 0x03E8 ( 0x0004 ) 
	int                                                kSecondaryID;                                     		// 0x03EC ( 0x0004 ) 
	int                                                kThrow1ID;                                        		// 0x03F0 ( 0x0004 ) 
	int                                                kThrow2ID;                                        		// 0x03F4 ( 0x0004 ) 
	int                                                kSkill1ID;                                        		// 0x03F8 ( 0x0004 ) 
	int                                                kSkill2ID;                                        		// 0x03FC ( 0x0004 ) 
	int                                                kSkill3ID;                                        		// 0x0400 ( 0x0004 ) 
	int                                                kSkill4ID;                                        		// 0x0404 ( 0x0004 ) 
	int                                                kPoint;                                           		// 0x0408 ( 0x0004 ) 
	int                                                kCash;                                            		// 0x040C ( 0x0004 ) 
	int                                                kCCoinCash;                                       		// 0x0410 ( 0x0004 ) 
	int                                                kCurPos;                                          		// 0x0414 ( 0x0004 ) 
	int                                                kCurSubPos;                                       		// 0x0418 ( 0x0004 ) 
	int                                                kChatStatus;                                      		// 0x041C ( 0x0004 ) 
	int                                                kServerGroupID;                                   		// 0x0420 ( 0x0004 ) 
	struct FString                                     kServerGroupName;                                 		// 0x0424 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kServerID;                                        		// 0x0430 ( 0x0004 ) 
	struct FString                                     kServerName;                                      		// 0x0434 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     kServerShortName;                                 		// 0x0440 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kChannelID;                                       		// 0x044C ( 0x0004 ) 
	struct FString                                     kChannelName;                                     		// 0x0450 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kRoomID;                                          		// 0x045C ( 0x0004 ) 
	int                                                kTeamID;                                          		// 0x0460 ( 0x0004 ) 
	int                                                kServerPing;                                      		// 0x0464 ( 0x0004 ) 
	struct FString                                     kGame_RoomName;                                   		// 0x0468 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      kGame_bOwner:1;                                   		// 0x0474 ( 0x0004 )  [0x00000001]
	struct FString                                     kGame_Password;                                   		// 0x0478 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     kGame_MapName;                                    		// 0x0484 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kGame_MapNum;                                     		// 0x0490 ( 0x0004 ) 
	int                                                kGame_GameMode;                                   		// 0x0494 ( 0x0004 ) 
	int                                                kGame_UserCount;                                  		// 0x0498 ( 0x0004 ) 
	int                                                kGame_GameTime;                                   		// 0x049C ( 0x0004 ) 
	int                                                kGame_GameRound;                                  		// 0x04A0 ( 0x0004 ) 
	int                                                kGame_WeaponLimit;                                		// 0x04A4 ( 0x0004 ) 
	unsigned long                                      kGame_TeamBalance:1;                              		// 0x04A8 ( 0x0004 )  [0x00000001]
	unsigned long                                      kGame_bHardCore:1;                                		// 0x04A8 ( 0x0004 )  [0x00000002]
	class TArray< struct FDisplayMode >                SupportModes;                                     		// 0x04AC ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                DefaultSupportModeIdx;                            		// 0x04B8 ( 0x0004 ) 
	float                                              Quest_LastUpdateTime;                             		// 0x04BC ( 0x0004 ) 
	class TArray< struct FQuestItem >                  QuestList;                                        		// 0x04C0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                CompletedQuestList;                               		// 0x04CC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                NewQuestList;                                     		// 0x04D8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FMissionItem >                MissionList;                                      		// 0x04E4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FMissionItem >                TMissionList;                                     		// 0x04F0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                My_iUID;                                          		// 0x04FC ( 0x0004 ) 
	int                                                My_iRoom;                                         		// 0x0500 ( 0x0004 ) 
	int                                                My_iTeam;                                         		// 0x0504 ( 0x0004 ) 
	int                                                My_Level;                                         		// 0x0508 ( 0x0004 ) 
	struct FString                                     My_szName;                                        		// 0x050C ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      My_AASLevel;                                      		// 0x0518 ( 0x0001 ) 
	class UGameEngine*                                 gEngine;                                          		// 0x051C ( 0x0004 ) 
	class ALevelInfo*                                  playingLevelInfo;                                 		// 0x0520 ( 0x0004 ) 
	unsigned long                                      bShowFont:1;                                      		// 0x0524 ( 0x0004 )  [0x00000001]
	unsigned long                                      bChangingHost:1;                                  		// 0x0524 ( 0x0004 )  [0x00000002]
	unsigned long                                      IsChangeHost_InLoading:1;                         		// 0x0524 ( 0x0004 )  [0x00000004]
	unsigned long                                      IsChangeNewGuest_InLoading:1;                     		// 0x0524 ( 0x0004 )  [0x00000008]
	unsigned long                                      DrawChangeHost_Host:1;                            		// 0x0524 ( 0x0004 )  [0x00000010]
	unsigned long                                      DrawChangeHost_Guest:1;                           		// 0x0524 ( 0x0004 )  [0x00000020]
	struct FString                                     newHostAddr;                                      		// 0x0528 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bForceGameOver:1;                                 		// 0x0534 ( 0x0004 )  [0x00000001]
	unsigned long                                      bPendingStarted:1;                                		// 0x0534 ( 0x0004 )  [0x00000002]
	unsigned long                                      bSendedLoadingFailed:1;                           		// 0x0534 ( 0x0004 )  [0x00000004]
	int                                                ConnectClientNum;                                 		// 0x0538 ( 0x0004 ) 
	int                                                ConnectedCount;                                   		// 0x053C ( 0x0004 ) 
	int                                                DisConnectedUserID;                               		// 0x0540 ( 0x0004 ) 
	unsigned long                                      IsDisconnected:1;                                 		// 0x0544 ( 0x0004 )  [0x00000001]
	int                                                ReconnectClientNum;                               		// 0x0548 ( 0x0004 ) 
	unsigned long                                      bIntervention:1;                                  		// 0x054C ( 0x0004 )  [0x00000001]
	class UwMapSettings*                               MapSettings;                                      		// 0x0550 ( 0x0004 ) 
	unsigned long                                      bShowWarningHostPoint:1;                          		// 0x0554 ( 0x0004 )  [0x00000001]
	int                                                iHardwarePoint;                                   		// 0x0558 ( 0x0004 ) 
	int                                                iAvgFrameRate;                                    		// 0x055C ( 0x0004 ) 
	int                                                iAvgPing;                                         		// 0x0560 ( 0x0004 ) 
	int                                                iHostPoint;                                       		// 0x0564 ( 0x0004 ) 
	unsigned long                                      bShowMessageHostUnsuitableness:1;                 		// 0x0568 ( 0x0004 )  [0x00000001]
	class TArray< class UwMatchUserInfo* >             UserInfos;                                        		// 0x056C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                GmUserNum;                                        		// 0x0578 ( 0x0004 ) 
	class TArray< struct FResultInfo >                 ResultInfos;                                      		// 0x057C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                ResultTeamScores;                                 		// 0x0588 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                ResultBonusOwnerID;                               		// 0x0594 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                ResultBonusID;                                    		// 0x05A0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                ResultMainWeaponIDs;                              		// 0x05AC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ResultMainWeaponRanks;                            		// 0x05B8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< unsigned char >                      ResultMainWeaponExps;                             		// 0x05C4 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      PlayWithBots:1;                                   		// 0x05D0 ( 0x0004 )  [0x00000001]
	int                                                BotUserTeam;                                      		// 0x05D4 ( 0x0004 ) 
	int                                                BotNum0;                                          		// 0x05D8 ( 0x0004 ) 
	int                                                BotNum1;                                          		// 0x05DC ( 0x0004 ) 
	int                                                BotDifficulty;                                    		// 0x05E0 ( 0x0004 ) 
	unsigned long                                      bBotModeTeamBalance:1;                            		// 0x05E4 ( 0x0004 )  [0x00000001]
	unsigned long                                      BotTutorial:1;                                    		// 0x05E4 ( 0x0004 )  [0x00000002]
	unsigned long                                      bCompletedBotTutorial:1;                          		// 0x05E4 ( 0x0004 )  [0x00000004]
	unsigned long                                      BeginnerMode:1;                                   		// 0x05E4 ( 0x0004 )  [0x00000008]
	unsigned char                                      ResultIsGiveType;                                 		// 0x05E8 ( 0x0001 ) 
	unsigned long                                      ResultIsBootyGet:1;                               		// 0x05EC ( 0x0004 )  [0x00000001]
	unsigned long                                      ResultIsOverlapWeapon:1;                          		// 0x05EC ( 0x0004 )  [0x00000002]
	class TArray< struct FBootyInfo >                  ResultBootyInfo;                                  		// 0x05F0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UBTNetGameData*                              NetGameData;                                      		// 0x05FC ( 0x0004 ) 
	unsigned long                                      IsTestMode:1;                                     		// 0x0600 ( 0x0004 )  [0x00000001]
	class UBTPingCheckerLinker*                        PingChecker;                                      		// 0x0604 ( 0x0004 ) 
	struct FString                                     szChannelIP;                                      		// 0x0608 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                nChannelPort;                                     		// 0x0614 ( 0x0004 ) 
	struct FString                                     szRelayIP;                                        		// 0x0618 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                nRelayPort;                                       		// 0x0624 ( 0x0004 ) 
	int                                                nNatType;                                         		// 0x0628 ( 0x0004 ) 
	unsigned long                                      m_bHostBlocking:1;                                		// 0x062C ( 0x0004 )  [0x00000001]
	unsigned long                                      IsFixedAssistPoint:1;                             		// 0x062C ( 0x0004 )  [0x00000002]
	float                                              FixedAssistTime;                                  		// 0x0630 ( 0x0004 ) 
	struct FString                                     lastBuyItemName;                                  		// 0x0634 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                lastBuyItemType;                                  		// 0x0640 ( 0x0004 ) 
	int                                                lastBuyItemGrade;                                 		// 0x0644 ( 0x0004 ) 
	struct FString                                     ERServerIP;                                       		// 0x0648 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                ERServerPort;                                     		// 0x0654 ( 0x0004 ) 
	int                                                MinimapMode;                                      		// 0x0658 ( 0x0004 ) 
	class TArray< int >                                ChannelRestrictionMaps;                           		// 0x065C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                ChannelRestrictionModes;                          		// 0x0668 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __CMDHK__Delegate;                                		// 0x0674 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdatePCBangInfo__Delegate;                     		// 0x067C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateGameRoomInfo__Delegate;                   		// 0x0684 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateCharInfo__Delegate;                       		// 0x068C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateRankingInfo__Delegate;                    		// 0x0694 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateEquipItemInfo__Delegate;                  		// 0x069C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateMoneyInfo__Delegate;                      		// 0x06A4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateClanInfo__Delegate;                       		// 0x06AC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdatePositionInfo__Delegate;                   		// 0x06B4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateRecv_CharInfo__Delegate;                  		// 0x06BC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateQuestList__Delegate;                      		// 0x06C4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __AccomplishMission25Percent__Delegate;           		// 0x06CC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __AccomplishMission50Percent__Delegate;           		// 0x06D4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __AccomplishMission75Percent__Delegate;           		// 0x06DC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __AccomplishMission100Percent__Delegate;          		// 0x06E4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __QuestLog__Delegate;                             		// 0x06EC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnReqSuccessStartGame__Delegate;                		// 0x06F4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __OnRecivedPing__Delegate;                        		// 0x06FC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateFriendList__Delegate;                     		// 0x0704 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateClanList__Delegate;                       		// 0x070C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdatePCBangList__Delegate;                     		// 0x0714 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateBlockList__Delegate;                      		// 0x071C ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      SendUpdateUserPerformenceInfo ( int UserID, int MinFps, int MaxFps, int AvgFps, int MinPing, int MaxPing, int AvgPing );		//  Engine.wMatchMaker.SendUpdateUserPerformenceInfo
	 void                      SetLastBuyItemInfo ( struct FString ItemName, int ItemType, int ItemGrade );		//  Engine.wMatchMaker.SetLastBuyItemInfo
	 bool                      IsPCBangItem ( class UwItemBoxHK* ItemInfo );     		//  Engine.wMatchMaker.IsPCBangItem
	 bool                      CheckUsingItem ( class UwItemBoxHK* ItemInfo );   		//  Engine.wMatchMaker.CheckUsingItem
	 bool                      IsPlayingPCBangPlus (  );                         		//  Engine.wMatchMaker.IsPlayingPCBangPlus
	 bool                      IsPlayingPCBang (  );                             		//  Engine.wMatchMaker.IsPlayingPCBang
	 void                      SetAASLevel ( unsigned char _level );             		//  Engine.wMatchMaker.SetAASLevel
	 unsigned char             GetIsAASLevel (  );                               		//  Engine.wMatchMaker.GetIsAASLevel
	 bool                      IsSDRespawn (  );                                 		//  Engine.wMatchMaker.IsSDRespawn
	 bool                      IsFriendlyUser ( struct FString CharName, struct FString ClanName );		//  Engine.wMatchMaker.IsFriendlyUser
	 bool                      IsBlockUser ( struct FString UserName );          		//  Engine.wMatchMaker.IsBlockUser
	 void                      UpdateBlockList ( class UwMatchMaker* MM );       		//  Engine.wMatchMaker.UpdateBlockList
	 void                      UpdatePCBangList ( class UwMatchMaker* MM );      		//  Engine.wMatchMaker.UpdatePCBangList
	 void                      UpdateClanList ( class UwMatchMaker* MM );        		//  Engine.wMatchMaker.UpdateClanList
	 void                      UpdateFriendList ( class UwMatchMaker* MM );      		//  Engine.wMatchMaker.UpdateFriendList
	 void                      ReplaceBlockNickName ( struct FString old_name, struct FString new_name );		//  Engine.wMatchMaker.ReplaceBlockNickName
	 void                      AddBlockList ( struct FString UserName );         		//  Engine.wMatchMaker.AddBlockList
	 void                      SetBlockListCount ( int cnt );                    		//  Engine.wMatchMaker.SetBlockListCount
	 void                      ClearBlockList (  );                              		//  Engine.wMatchMaker.ClearBlockList
	 void                      AddClanList ( struct FString UserName, unsigned char IsLogOn, int Level, int ClanGrade, int ClanWin, int ClanLose, int LevelMarkID, int TitleMarkID );		//  Engine.wMatchMaker.AddClanList
	 void                      SetClanListCount ( int cnt );                     		//  Engine.wMatchMaker.SetClanListCount
	 void                      ClearClanList (  );                               		//  Engine.wMatchMaker.ClearClanList
	 void                      AddPCBangList2 ( struct FString UserName, unsigned char IsLogOn, int ClanMark, int ClanBG, int ClanBL, struct FString ClanName, int Level, int ClanGrade, int ClanWin, int ClanLose, int IsLookForClan, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  Engine.wMatchMaker.AddPCBangList2
	 void                      AddPCBangList ( struct FString UserName, int ClanMark, int ClanBG, int ClanBL, struct FString ClanName, int Level, struct FString ServerName, struct FString ServerShortName, struct FString ServerIP, int serverPort, int CurPos, int ChannelNum, struct FString ChannelNickName, int RoomNum, int ClanGrade, int ClanWin, int ClanLose, int IsLookForClan, int ClanLevel, int LevelMarkID, int TitleMarkID, int Reserved1, int Reserved2, int Reserved3 );		//  Engine.wMatchMaker.AddPCBangList
	 void                      RemovePCBangList ( struct FString UserName );     		//  Engine.wMatchMaker.RemovePCBangList
	 void                      SetPCBangListCount ( int cnt );                   		//  Engine.wMatchMaker.SetPCBangListCount
	 void                      ClearPCBangList (  );                             		//  Engine.wMatchMaker.ClearPCBangList
	 void                      AddFriendList ( struct FString UserName, unsigned char IsLogOn, int ClanMark, int ClanBG, int ClanBL, struct FString ClanName, int Level, unsigned char IsLookForClan, int ClanLevel, int LevelMarkID );		//  Engine.wMatchMaker.AddFriendList
	 void                      SetFriendListCount ( int cnt );                   		//  Engine.wMatchMaker.SetFriendListCount
	 void                      ClearFriendList (  );                             		//  Engine.wMatchMaker.ClearFriendList
	 bool                      IsDisconnectedUser (  );                          		//  Engine.wMatchMaker.IsDisconnectedUser
	 void                      SetDisconnectedUser ( bool bSet, int UserID );    		//  Engine.wMatchMaker.SetDisconnectedUser
	 int                       GetHostPoint (  );                                		//  Engine.wMatchMaker.GetHostPoint
	 int                       CalculateHostPoint ( bool bInGame );              		//  Engine.wMatchMaker.CalculateHostPoint
	 int                       ReceivedPing ( struct FString fromAddr, int msec );		//  Engine.wMatchMaker.ReceivedPing
	 void                      OnRecivedPing ( class UwMatchMaker* MM, struct FString fromAddr, int msec );		//  Engine.wMatchMaker.OnRecivedPing
	 void                      ReceivedPingHK ( struct FString fromAddr, int msec );		//  Engine.wMatchMaker.ReceivedPingHK
	 void                      ClearReceivedPingHK (  );                         		//  Engine.wMatchMaker.ClearReceivedPingHK
	 int                       GetLastestPingValue ( struct FString fromAddr );  		//  Engine.wMatchMaker.GetLastestPingValue
	 void                      SendPingHK ( struct FString fromAddr );           		//  Engine.wMatchMaker.SendPingHK
	 void                      SendPingToClient (  );                            		//  Engine.wMatchMaker.SendPingToClient
	 void                      eventDrawOtherLoadingState ( int UserID, unsigned char bLoadingState );		// [ FUNC_Event ] Engine.wMatchMaker.DrawOtherLoadingState
	 void                      OnReqSuccessStartGame ( int Step );               		//  Engine.wMatchMaker.OnReqSuccessStartGame
	 void                      eventReqSuccessStartGame ( int Step );            		// [ FUNC_Event ] Engine.wMatchMaker.ReqSuccessStartGame
	 void                      GetItemDurabilityInfo ( class TArray< int >* OwnerID, class TArray< int >* PlayedNumber, class TArray< int >* PlayedRound, class TArray< struct FBtrDouble >* UniqueItemID, class TArray< int >* UsingTime, class TArray< int >* PlayedCount );		//  Engine.wMatchMaker.GetItemDurabilityInfo
	 bool                      eventForceGameOver ( class APlayerReplicationInfo* Winner );		// [ FUNC_Event ] Engine.wMatchMaker.ForceGameOver
	 void                      ProcessPendingChangeNewHostOrChangeNewGuest (  ); 		//  Engine.wMatchMaker.ProcessPendingChangeNewHostOrChangeNewGuest
	 void                      PendingChangeNewGuest ( struct FString hostAddress );		//  Engine.wMatchMaker.PendingChangeNewGuest
	 void                      PendingChangeHost ( int ClientNum );              		//  Engine.wMatchMaker.PendingChangeHost
	 void                      SetChangeHostMessageFlag (  );                    		//  Engine.wMatchMaker.SetChangeHostMessageFlag
	 bool                      ChangeNewGuest ( struct FString HostIP );         		//  Engine.wMatchMaker.ChangeNewGuest
	 bool                      ChangeHost ( int ClientNum );                     		//  Engine.wMatchMaker.ChangeHost
	 void                      eventSetChangingHostFlag ( bool flag );           		// [ FUNC_Event ] Engine.wMatchMaker.SetChangingHostFlag
	 bool                      ResetChangingHostGuest (  );                      		//  Engine.wMatchMaker.ResetChangingHostGuest
	 bool                      eventIsLoading (  );                              		// [ FUNC_Event ] Engine.wMatchMaker.IsLoading
	 void                      eventEndLoading (  );                             		// [ FUNC_Event ] Engine.wMatchMaker.EndLoading
	 void                      eventStartLoading (  );                           		// [ FUNC_Event ] Engine.wMatchMaker.StartLoading
	 class UMaterial*          eventGetMiniMapInfoImage (  );                    		// [ FUNC_Event ] Engine.wMatchMaker.GetMiniMapInfoImage
	 class UMaterial*          eventGetLoadingImage (  );                        		// [ FUNC_Event ] Engine.wMatchMaker.GetLoadingImage
	 void                      eventInitializeMapSettings_DS_Server (  );        		// [ FUNC_Event ] Engine.wMatchMaker.InitializeMapSettings_DS_Server
	 void                      InitializeMapSettings (  );                       		//  Engine.wMatchMaker.InitializeMapSettings
	 void                      ClearConsole (  );                                		//  Engine.wMatchMaker.ClearConsole
	 void                      eventEndMatch ( bool bForceEndMatch );            		// [ FUNC_Event ] Engine.wMatchMaker.EndMatch
	 void                      ResetGameFlag (  );                               		//  Engine.wMatchMaker.ResetGameFlag
	 int                       GetTeamCount (  );                                		//  Engine.wMatchMaker.GetTeamCount
	 unsigned char             GetGameModeNum ( struct FString szGameClassName );		//  Engine.wMatchMaker.GetGameModeNum
	 void                      SetCurMatchState ( struct FMatchState kState );   		//  Engine.wMatchMaker.SetCurMatchState
	 bool                      IsHost ( struct FString UserName );               		//  Engine.wMatchMaker.IsHost
	 void                      SetNewHost ( struct FString UserName );           		//  Engine.wMatchMaker.SetNewHost
	 struct FString            GetUserClanNameByUserName ( struct FString UserName );		//  Engine.wMatchMaker.GetUserClanNameByUserName
	 int                       GetUserLevelMarkIDByUserName ( struct FString UserName );		//  Engine.wMatchMaker.GetUserLevelMarkIDByUserName
	 bool                      ReplaceUserName ( struct FString OldName, struct FString NewName );		//  Engine.wMatchMaker.ReplaceUserName
	 int                       GetUserGradeByUserName ( struct FString UserName );		//  Engine.wMatchMaker.GetUserGradeByUserName
	 int                       GetUIDByUserName ( struct FString UserName );     		//  Engine.wMatchMaker.GetUIDByUserName
	 class UwMatchUserInfo*    GetUserInfoByUserName ( struct FString UserName );		//  Engine.wMatchMaker.GetUserInfoByUserName
	 class UwMatchUserInfo*    GetUserInfoByUID ( int UserID );                  		//  Engine.wMatchMaker.GetUserInfoByUID
	 void                      SetMyTeam ( int iTeam );                          		//  Engine.wMatchMaker.SetMyTeam
	 struct FString            GetMyNetworkCheckFailedMsg ( int LoadingStep );   		//  Engine.wMatchMaker.GetMyNetworkCheckFailedMsg
	 struct FString            GetHostNetworkCheckFailedMsg ( int LoadingStep ); 		//  Engine.wMatchMaker.GetHostNetworkCheckFailedMsg
	 bool                      FailedNetworkChecking (  );                       		//  Engine.wMatchMaker.FailedNetworkChecking
	 bool                      StartNetworkChecking ( int ClientsCount, bool bConnectGame );		//  Engine.wMatchMaker.StartNetworkChecking
	 bool                      eventSendPingToChannelServer (  );                		// [ FUNC_Event ] Engine.wMatchMaker.SendPingToChannelServer
	 bool                      eventSendPingToOtherUser ( struct FString toAddr );		// [ FUNC_Event ] Engine.wMatchMaker.SendPingToOtherUser
	 bool                      eventSendText ( struct FString d_ip, int d_port, struct FString dText );		// [ FUNC_Event ] Engine.wMatchMaker.SendText
	 void                      SendErrorReportC ( int Code, int windowtype, struct FString ct );		//  Engine.wMatchMaker.SendErrorReportC
	 void                      SendErrorReportS ( int Code, struct FString ct ); 		//  Engine.wMatchMaker.SendErrorReportS
	 class UBTPingCheckerLinker* eventCreatePingChecker (  );                      		// [ FUNC_Event ] Engine.wMatchMaker.CreatePingChecker
	 bool                      eventGetHostBlocking (  );                        		// [ FUNC_Event ] Engine.wMatchMaker.GetHostBlocking
	 void                      eventSetHostBlocking ( bool Blocking );           		// [ FUNC_Event ] Engine.wMatchMaker.SetHostBlocking
	 void                      MakeHSResponseData ( class TArray< unsigned char > Data, class TArray< unsigned char >* Result );		// [ FUNC_Native ] Engine.wMatchMaker.MakeHSResponseData
	 bool                      TenProtectRelease (  );                           		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectRelease
	 bool                      TenProtectCreate ( int QQUserID );                		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectCreate
	 bool                      TenProtectDProtoEncrypt (  );                     		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectDProtoEncrypt
	 bool                      TenProtectDProtoDecrypt (  );                     		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectDProtoDecrypt
	 bool                      TenProtectUpdate_AntiBot (  );                    		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectUpdate_AntiBot
	 bool                      TenProtectStopLocalCheck (  );                    		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectStopLocalCheck
	 bool                      TenProtectStartLocalOnceCheck (  );               		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectStartLocalOnceCheck
	 bool                      TenProtectSendInitData (  );                      		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectSendInitData
	 bool                      TenProtectSetInitData (  );                       		// [ FUNC_Native ] Engine.wMatchMaker.TenProtectSetInitData
	 int                       GetClientVersion (  );                            		// [ FUNC_Native ] Engine.wMatchMaker.GetClientVersion
	 bool                      ConsoleCmd_DS ( struct FString strCmd );          		// [ FUNC_Native ] Engine.wMatchMaker.ConsoleCmd_DS
	 bool                      ForceSetLoadingStep ( int LoadingStep );          		// [ FUNC_Native ] Engine.wMatchMaker.ForceSetLoadingStep
	 bool                      StartHolePunchingClient ( int GameType, int ReqStartUserID );		// [ FUNC_Native ] Engine.wMatchMaker.StartHolePunchingClient
	 bool                      StartHolePunchingHost ( int GameType, int ReqStartUserID );		// [ FUNC_Native ] Engine.wMatchMaker.StartHolePunchingHost
	 bool                      SetTcpTimeOutInTempReset (  );                    		// [ FUNC_Native ] Engine.wMatchMaker.SetTcpTimeOutInTempReset
	 bool                      SetTcpTimeOutInGame (  );                         		// [ FUNC_Native ] Engine.wMatchMaker.SetTcpTimeOutInGame
	 bool                      SetTcpTimeOutInUI (  );                           		// [ FUNC_Native ] Engine.wMatchMaker.SetTcpTimeOutInUI
	 bool                      ForceDisconnectGameWithErrMessage ( struct FString strErrMsg );		// [ FUNC_Native ] Engine.wMatchMaker.ForceDisconnectGameWithErrMessage
	 bool                      SetUDPConnectionTimeLimit ( float fLimitSec );    		// [ FUNC_Native ] Engine.wMatchMaker.SetUDPConnectionTimeLimit
	 bool                      IsCompletedLoading (  );                          		// [ FUNC_Native ] Engine.wMatchMaker.IsCompletedLoading
	 bool                      CheckHolePunchingResult ( int Result, unsigned char Phrase, int InterventionUserID, unsigned char Intervention, class TArray< int > FailedUserIDs );		// [ FUNC_Native ] Engine.wMatchMaker.CheckHolePunchingResult
	 struct FString            GetStrLoadingState ( unsigned char bState );      		// [ FUNC_Native ] Engine.wMatchMaker.GetStrLoadingState
	 bool                      PrintLoadingMsg ( struct FLoadingMessageItem Item );		// [ FUNC_Native ] Engine.wMatchMaker.PrintLoadingMsg
	 struct FString            MakeMD5 ( struct FString strsrc );                		// [ FUNC_Native ] Engine.wMatchMaker.MakeMD5
	 bool                      DestoryLoadingStater (  );                        		// [ FUNC_Native ] Engine.wMatchMaker.DestoryLoadingStater
	 bool                      CreateLoadingStater ( struct FString LoginName ); 		// [ FUNC_Native ] Engine.wMatchMaker.CreateLoadingStater
	 bool                      LowRelayServerOff (  );                           		// [ FUNC_Native ] Engine.wMatchMaker.LowRelayServerOff
	 bool                      LowRelayServerOn ( struct FString RelayServerIP, int RelayServerPortNum );		// [ FUNC_Native ] Engine.wMatchMaker.LowRelayServerOn
	 bool                      LowChangeClient ( struct FString HostAddr );      		// [ FUNC_Native ] Engine.wMatchMaker.LowChangeClient
	 bool                      LowChangeServer (  );                             		// [ FUNC_Native ] Engine.wMatchMaker.LowChangeServer
	 bool                      ForceDisconnectUDPConnectionClientSide (  );      		// [ FUNC_Native ] Engine.wMatchMaker.ForceDisconnectUDPConnectionClientSide
	 bool                      ForceDisconnectUDPConnectionHostSide ( int UserID );		// [ FUNC_Native ] Engine.wMatchMaker.ForceDisconnectUDPConnectionHostSide
	 bool                      StartTickCheck (  );                              		// [ FUNC_Native ] Engine.wMatchMaker.StartTickCheck
	 bool                      SetNatTypeToEngine ( int NatType );               		// [ FUNC_Native ] Engine.wMatchMaker.SetNatTypeToEngine
	 bool                      ClientInitNatChecker ( int HostUserID, struct FString HostIP, int hostPortNum, unsigned char NatType, unsigned char Intervention, struct FString HostInnerIP, int HostInnerPort );		// [ FUNC_Native ] Engine.wMatchMaker.ClientInitNatChecker
	 bool                      HostInitNatChecker ( int ClientUserID, struct FString ClientIP, int clientPortNum, unsigned char NatType, unsigned char Intervention_Own );		// [ FUNC_Native ] Engine.wMatchMaker.HostInitNatChecker
	 bool                      NatServerAddrStoreToEngine ( struct FString natServerIP1, int natServerPortNum1, struct FString natServerIP2, int natServerPortNum2 );		// [ FUNC_Native ] Engine.wMatchMaker.NatServerAddrStoreToEngine
	 bool                      StartMatch ( int GameRoomNum, bool bHost, struct FString szHostAddr, int hostPortNum );		// [ FUNC_Native ] Engine.wMatchMaker.StartMatch
	 void                      UpdateQuest_WinnerInBotMode ( int Level, int RecodeType );		//  Engine.wMatchMaker.UpdateQuest_WinnerInBotMode
	 void                      UpdateQuest_RoundCompletedInBotMode ( int Level, int CompletedRound );		//  Engine.wMatchMaker.UpdateQuest_RoundCompletedInBotMode
	 void                      UpdateQuest_MatchCompletedInBotMode ( int Level );		//  Engine.wMatchMaker.UpdateQuest_MatchCompletedInBotMode
	 void                      UpdateQuest_SprintTime ( int sec );               		//  Engine.wMatchMaker.UpdateQuest_SprintTime
	 void                      UpdateQuest_AcquireTrophy ( int ItemID );         		//  Engine.wMatchMaker.UpdateQuest_AcquireTrophy
	 void                      UpdateQuest_MatchEndInBotMode ( int difficult, int Map );		//  Engine.wMatchMaker.UpdateQuest_MatchEndInBotMode
	 void                      UpdateQuest_KillInBotMode ( int difficult, int Map );		//  Engine.wMatchMaker.UpdateQuest_KillInBotMode
	 void                      UpdateQuest_MatchEnd ( int Mode, int Map );       		//  Engine.wMatchMaker.UpdateQuest_MatchEnd
	 void                      UpdateQuest_CombatTime ( int Mode, int Map, int Min );		//  Engine.wMatchMaker.UpdateQuest_CombatTime
	 void                      UpdateQuest_ExecTime ( int Mode, int Map, int Min );		//  Engine.wMatchMaker.UpdateQuest_ExecTime
	 void                      UpdateQuest_Death ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_Death
	 void                      UpdateQuest_Assist ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_Assist
	 void                      UpdateQuest_15Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_15Kill
	 void                      UpdateQuest_10Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_10Kill
	 void                      UpdateQuest_9Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_9Kill
	 void                      UpdateQuest_8Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_8Kill
	 void                      UpdateQuest_7Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_7Kill
	 void                      UpdateQuest_6Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_6Kill
	 void                      UpdateQuest_5Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_5Kill
	 void                      UpdateQuest_4Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_4Kill
	 void                      UpdateQuest_3Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_3Kill
	 void                      UpdateQuest_2Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_2Kill
	 void                      UpdateQuest_MeeleAttackKill (  );                 		//  Engine.wMatchMaker.UpdateQuest_MeeleAttackKill
	 void                      UpdateQuest_HeadshotKill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_HeadshotKill
	 void                      UpdateQuest_AimedKill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_AimedKill
	 void                      UpdateQuest_Kill ( int WeaponType, int weaponID );		//  Engine.wMatchMaker.UpdateQuest_Kill
	 void                      QuestLog ( struct FString Msg );                  		//  Engine.wMatchMaker.QuestLog
	 int                       GetNextQuestID (  );                              		//  Engine.wMatchMaker.GetNextQuestID
	 void                      UpdateTutorial ( int QuestID, int AddCount );     		//  Engine.wMatchMaker.UpdateTutorial
	 void                      UpdateQuest ( int MissionType, int MissionOption1, int MissionOption2, int AddCount );		//  Engine.wMatchMaker.UpdateQuest
	 void                      CheckMissionProgress ( int i, int AddCount );     		//  Engine.wMatchMaker.CheckMissionProgress
	 void                      AccomplishMission100Percent ( struct FString MissionDesc, int cur, int Max );		//  Engine.wMatchMaker.AccomplishMission100Percent
	 void                      AccomplishMission75Percent ( struct FString MissionDesc, int cur, int Max );		//  Engine.wMatchMaker.AccomplishMission75Percent
	 void                      AccomplishMission50Percent ( struct FString MissionDesc, int cur, int Max );		//  Engine.wMatchMaker.AccomplishMission50Percent
	 void                      AccomplishMission25Percent ( struct FString MissionDesc, int cur, int Max );		//  Engine.wMatchMaker.AccomplishMission25Percent
	 void                      GenerateMissionList ( class UwGameManager* GameMgr );		//  Engine.wMatchMaker.GenerateMissionList
	 void                      SortQuestList ( class UwGameManager* GameMgr );   		//  Engine.wMatchMaker.SortQuestList
	 int                       FindQuest ( int nQuestID );                       		//  Engine.wMatchMaker.FindQuest
	 void                      RemoveDailyQuestArray ( class TArray< int > QuestID );		//  Engine.wMatchMaker.RemoveDailyQuestArray
	 void                      AddDailyQuestArray ( class TArray< int > QuestID );		//  Engine.wMatchMaker.AddDailyQuestArray
	 void                      RemoveDailyQuest ( int QuestID );                 		//  Engine.wMatchMaker.RemoveDailyQuest
	 void                      AddDailyQuest ( int QuestID );                    		//  Engine.wMatchMaker.AddDailyQuest
	 void                      RemoveQuestArray ( class TArray< int > QuestID ); 		//  Engine.wMatchMaker.RemoveQuestArray
	 void                      AddQuestArray ( class TArray< int > QuestID );    		//  Engine.wMatchMaker.AddQuestArray
	 void                      RemoveQuest ( int QuestID );                      		//  Engine.wMatchMaker.RemoveQuest
	 void                      AddQuest ( int QuestID );                         		//  Engine.wMatchMaker.AddQuest
	 bool                      IsEnableAltTab (  );                              		//  Engine.wMatchMaker.IsEnableAltTab
	 void                      SetCurSubPos ( int CurSubPos );                   		//  Engine.wMatchMaker.SetCurSubPos
	 void                      SetCurpos ( int CurPos, int CurSubPos );          		//  Engine.wMatchMaker.SetCurpos
	 bool                      IsClanGrade ( int Grade );                        		//  Engine.wMatchMaker.IsClanGrade
	 bool                      IsClanMember (  );                                		//  Engine.wMatchMaker.IsClanMember
	 void                      RI_Clear (  );                                    		//  Engine.wMatchMaker.RI_Clear
	 void                      PI_LeavelRoom (  );                               		//  Engine.wMatchMaker.PI_LeavelRoom
	 void                      RemoveGMList ( int GMUID );                       		//  Engine.wMatchMaker.RemoveGMList
	 void                      AddGMList ( int GMUID );                          		//  Engine.wMatchMaker.AddGMList
	 void                      ClearGMList (  );                                 		//  Engine.wMatchMaker.ClearGMList
	 void                      PI_EnterRoom ( int RoomID, int TeamID );          		//  Engine.wMatchMaker.PI_EnterRoom
	 void                      PI_LeaveChannel (  );                             		//  Engine.wMatchMaker.PI_LeaveChannel
	 void                      PI_EnterChannel ( int ServerGroupID, struct FString ServerGroupName, int ServerID, struct FString ServerName, int ChannelID, struct FString ChannelName, bool bClanWarChannel, int ChannelTypeValue, bool IsDedicatedServer );		//  Engine.wMatchMaker.PI_EnterChannel
	 void                      UpdateCharInfoAndReqClanUserList (  );            		//  Engine.wMatchMaker.UpdateCharInfoAndReqClanUserList
	 void                      UpdateQuestList ( class UwMatchMaker* MM );       		//  Engine.wMatchMaker.UpdateQuestList
	 void                      UpdateRecv_CharInfo ( class UwMatchMaker* MM );   		//  Engine.wMatchMaker.UpdateRecv_CharInfo
	 void                      UpdatePositionInfo ( class UwMatchMaker* MM );    		//  Engine.wMatchMaker.UpdatePositionInfo
	 void                      UpdateClanInfo ( class UwMatchMaker* MM );        		//  Engine.wMatchMaker.UpdateClanInfo
	 void                      UpdateMoneyInfo ( class UwMatchMaker* MM );       		//  Engine.wMatchMaker.UpdateMoneyInfo
	 void                      UpdateEquipItemInfo ( class UwMatchMaker* MM );   		//  Engine.wMatchMaker.UpdateEquipItemInfo
	 void                      UpdateRankingInfo ( class UwMatchMaker* MM );     		//  Engine.wMatchMaker.UpdateRankingInfo
	 void                      UpdateCharInfo ( class UwMatchMaker* MM );        		//  Engine.wMatchMaker.UpdateCharInfo
	 void                      UpdateGameRoomInfo ( class UwMatchMaker* MM );    		//  Engine.wMatchMaker.UpdateGameRoomInfo
	 void                      UpdatePCBangInfo ( class UwMatchMaker* MM );      		//  Engine.wMatchMaker.UpdatePCBangInfo
	 void                      CMDHK ( int Index, struct FString Param1, struct FString Param2, struct FString param3 );		//  Engine.wMatchMaker.CMDHK
	 bool                      IsChannelRestrictionMaps ( int MapNum );          		//  Engine.wMatchMaker.IsChannelRestrictionMaps
	 bool                      IsChannelRestrictionModes ( int ModeNum );        		//  Engine.wMatchMaker.IsChannelRestrictionModes

	// Public Imports
	UwMatchMaker(class UwMatchMaker const &);
	UwMatchMaker(void);
	class UwMatchMaker &  operator=(class UwMatchMaker const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);
	void  delegateAccomplishMission100Percent(class FString const &,int,int);
	void  delegateAccomplishMission25Percent(class FString const &,int,int);
	void  delegateAccomplishMission50Percent(class FString const &,int,int);
	void  delegateAccomplishMission75Percent(class FString const &,int,int);
	void  delegateCMDHK(int,class FString const &,class FString const &,class FString const &);
	void  delegateOnRecivedPing(class UwMatchMaker *,class FString const &,int);
	void  delegateOnReqSuccessStartGame(int);
	void  delegateQuestLog(class FString const &);
	void  delegateUpdateBlockList(class UwMatchMaker *);
	void  delegateUpdateCharInfo(class UwMatchMaker *);
	void  delegateUpdateClanInfo(class UwMatchMaker *);
	void  delegateUpdateClanList(class UwMatchMaker *);
	void  delegateUpdateEquipItemInfo(class UwMatchMaker *);
	void  delegateUpdateFriendList(class UwMatchMaker *);
	void  delegateUpdateGameRoomInfo(class UwMatchMaker *);
	void  delegateUpdateMoneyInfo(class UwMatchMaker *);
	void  delegateUpdatePCBangInfo(class UwMatchMaker *);
	void  delegateUpdatePCBangList(class UwMatchMaker *);
	void  delegateUpdatePositionInfo(class UwMatchMaker *);
	void  delegateUpdateQuestList(class UwMatchMaker *);
	void  delegateUpdateRankingInfo(class UwMatchMaker *);
	void  delegateUpdateRecv_CharInfo(class UwMatchMaker *);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x06F8

// Class Engine.wWeaponFire
class DLL_IMPORT UwWeaponFire : public UObject
{
public:
	unsigned long                                      bSplashDamage:1;                                  		// 0x002C ( 0x0004 )  [0x00000001][ CPF_Edit ]
	unsigned long                                      bSplashJump:1;                                    		// 0x002C ( 0x0004 )  [0x00000002][ CPF_Edit ]
	unsigned long                                      bRecommendSplashDamage:1;                         		// 0x002C ( 0x0004 )  [0x00000004][ CPF_Edit ]
	unsigned long                                      bTossed:1;                                        		// 0x002C ( 0x0004 )  [0x00000008][ CPF_Edit ]
	unsigned long                                      bLeadTarget:1;                                    		// 0x002C ( 0x0004 )  [0x00000010][ CPF_Edit ]
	unsigned long                                      bInstantHit:1;                                    		// 0x002C ( 0x0004 )  [0x00000020][ CPF_Edit ]
	unsigned long                                      bPawnRapidFireAnim:1;                             		// 0x002C ( 0x0004 )  [0x00000040][ CPF_Edit ]
	unsigned long                                      bReflective:1;                                    		// 0x002C ( 0x0004 )  [0x00000080][ CPF_Edit ]
	unsigned long                                      bTimerLoop:1;                                     		// 0x002C ( 0x0004 )  [0x00000100]
	unsigned long                                      bFireOnRelease:1;                                 		// 0x002C ( 0x0004 )  [0x00000200][ CPF_Edit ]
	unsigned long                                      bWaitForRelease:1;                                		// 0x002C ( 0x0004 )  [0x00000400][ CPF_Edit ]
	unsigned long                                      bModeExclusive:1;                                 		// 0x002C ( 0x0004 )  [0x00000800][ CPF_Edit ]
	unsigned long                                      bInputFire:1;                                     		// 0x002C ( 0x0004 )  [0x00001000]
	unsigned long                                      bIsFiring:1;                                      		// 0x002C ( 0x0004 )  [0x00002000]
	unsigned long                                      bNowWaiting:1;                                    		// 0x002C ( 0x0004 )  [0x00004000]
	unsigned long                                      bServerDelayStopFire:1;                           		// 0x002C ( 0x0004 )  [0x00008000]
	unsigned long                                      bServerDelayStartFire:1;                          		// 0x002C ( 0x0004 )  [0x00010000]
	unsigned long                                      bInstantStop:1;                                   		// 0x002C ( 0x0004 )  [0x00020000]
	unsigned long                                      bAttachSmokeEmitter:1;                            		// 0x002C ( 0x0004 )  [0x00040000][ CPF_Edit ]
	unsigned long                                      bAttachFlashEmitter:1;                            		// 0x002C ( 0x0004 )  [0x00080000][ CPF_Edit ]
	float                                              TimerInterval;                                    		// 0x0030 ( 0x0004 ) 
	float                                              NextTimerPop;                                     		// 0x0034 ( 0x0004 ) 
	class AwWeapon*                                    Weapon;                                           		// 0x0038 ( 0x0004 ) [ CPF_Edit ]
	class APawn*                                       Instigator;                                       		// 0x003C ( 0x0004 ) 
	class ALevelInfo*                                  Level;                                            		// 0x0040 ( 0x0004 ) 
	class AActor*                                      Owner;                                            		// 0x0044 ( 0x0004 ) 
	float                                              NextFireTime;                                     		// 0x0048 ( 0x0004 ) 
	float                                              PreFireTime;                                      		// 0x004C ( 0x0004 ) [ CPF_Edit ]
	float                                              MaxHoldTime;                                      		// 0x0050 ( 0x0004 ) [ CPF_Edit ]
	float                                              HoldTime;                                         		// 0x0054 ( 0x0004 ) [ CPF_Edit ]
	int                                                ThisModeNum;                                      		// 0x0058 ( 0x0004 ) [ CPF_Edit ]
	float                                              TransientSoundVolume;                             		// 0x005C ( 0x0004 ) 
	float                                              TransientSoundRadius;                             		// 0x0060 ( 0x0004 ) 
	struct FName                                       PreFireAnim;                                      		// 0x0064 ( 0x0004 ) [ CPF_Edit ]
	struct FName                                       FireAnim;                                         		// 0x0068 ( 0x0004 ) [ CPF_Edit ]
	struct FName                                       FireLoopAnim;                                     		// 0x006C ( 0x0004 ) [ CPF_Edit ]
	struct FName                                       FireEndAnim;                                      		// 0x0070 ( 0x0004 ) [ CPF_Edit ]
	struct FName                                       ReloadAnim;                                       		// 0x0074 ( 0x0004 ) [ CPF_Edit ]
	float                                              PreFireAnimRate;                                  		// 0x0078 ( 0x0004 ) [ CPF_Edit ]
	float                                              FireAnimRate;                                     		// 0x007C ( 0x0004 ) [ CPF_Edit ]
	float                                              FireLoopAnimRate;                                 		// 0x0080 ( 0x0004 ) [ CPF_Edit ]
	float                                              FireEndAnimRate;                                  		// 0x0084 ( 0x0004 ) [ CPF_Edit ]
	float                                              ReloadAnimRate;                                   		// 0x0088 ( 0x0004 ) [ CPF_Edit ]
	float                                              TweenTime;                                        		// 0x008C ( 0x0004 ) [ CPF_Edit ]
	class USound*                                      FireSound_Stereo;                                 		// 0x0090 ( 0x0004 ) [ CPF_Edit ]
	class USound*                                      FireSound;                                        		// 0x0094 ( 0x0004 ) [ CPF_Edit ]
	class USound*                                      ReloadSound;                                      		// 0x0098 ( 0x0004 ) [ CPF_Edit ]
	class USound*                                      NoAmmoSound;                                      		// 0x009C ( 0x0004 ) [ CPF_Edit ]
	struct FString                                     FireForce;                                        		// 0x00A0 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     ReloadForce;                                      		// 0x00AC ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	struct FString                                     NoAmmoForce;                                      		// 0x00B8 ( 0x000C ) [ CPF_Edit | CPF_NeedCtorLink ]
	float                                              FireRate;                                         		// 0x00C4 ( 0x0004 ) [ CPF_Edit ]
	float                                              ServerStartFireTime;                              		// 0x00C8 ( 0x0004 ) 
	unsigned long                                      bEnableBustMode:1;                                		// 0x00CC ( 0x0004 )  [0x00000001]
	unsigned long                                      IsFiringBustMode:1;                               		// 0x00CC ( 0x0004 )  [0x00000002]
	int                                                iFireRBC;                                         		// 0x00D0 ( 0x0004 ) 
	int                                                iFireCount;                                       		// 0x00D4 ( 0x0004 ) 
	float                                              fFireRBT;                                         		// 0x00D8 ( 0x0004 ) 
	class UClass*                                      AmmoClass;                                        		// 0x00DC ( 0x0004 ) [ CPF_Edit ]
	int                                                AmmoPerFire;                                      		// 0x00E0 ( 0x0004 ) [ CPF_Edit ]
	int                                                AmmoClipSize;                                     		// 0x00E4 ( 0x0004 ) [ CPF_Edit ]
	float                                              Load;                                             		// 0x00E8 ( 0x0004 ) [ CPF_Edit ]
	struct FVector                                     ShakeRotMag;                                      		// 0x00EC ( 0x000C ) [ CPF_Edit ]
	struct FVector                                     ShakeRotRate;                                     		// 0x00F8 ( 0x000C ) [ CPF_Edit ]
	float                                              ShakeRotTime;                                     		// 0x0104 ( 0x0004 ) [ CPF_Edit ]
	struct FVector                                     ShakeOffsetMag;                                   		// 0x0108 ( 0x000C ) [ CPF_Edit ]
	struct FVector                                     ShakeOffsetRate;                                  		// 0x0114 ( 0x000C ) [ CPF_Edit ]
	float                                              ShakeOffsetTime;                                  		// 0x0120 ( 0x0004 ) [ CPF_Edit ]
	class UClass*                                      ProjectileClass;                                  		// 0x0124 ( 0x0004 ) [ CPF_Edit ]
	float                                              BotRefireRate;                                    		// 0x0128 ( 0x0004 ) [ CPF_Edit ]
	float                                              WarnTargetPct;                                    		// 0x012C ( 0x0004 ) [ CPF_Edit ]
	class UClass*                                      FlashEmitterClass;                                		// 0x0130 ( 0x0004 ) [ CPF_Edit ]
	class AwEmitter*                                   FlashEmitter;                                     		// 0x0134 ( 0x0004 ) [ CPF_Edit ]
	class UClass*                                      FlashFirstPersonEmitterClass;                     		// 0x0138 ( 0x0004 ) [ CPF_Edit ]
	class UClass*                                      SmokeEmitterClass;                                		// 0x013C ( 0x0004 ) [ CPF_Edit ]
	class AwEmitter*                                   SmokeEmitter;                                     		// 0x0140 ( 0x0004 ) [ CPF_Edit ]
	class UClass*                                      SmokeFirstPersonEmitterClass;                     		// 0x0144 ( 0x0004 ) [ CPF_Edit ]
	float                                              AimError;                                         		// 0x0148 ( 0x0004 ) [ CPF_Edit ]
	float                                              Spread;                                           		// 0x014C ( 0x0004 ) [ CPF_Edit ]
	unsigned char                                      SpreadStyle;                                      		// 0x0150 ( 0x0001 ) [ CPF_Edit ]
	int                                                FireCount;                                        		// 0x0154 ( 0x0004 ) 
	int                                                iPartsDamage;                                     		// 0x0158 ( 0x0004 ) 
	int                                                iPartsDamage_Outer;                               		// 0x015C ( 0x0004 ) 
	struct FFireProperties                             SavedFireProperties;                              		// 0x0160 ( 0x0014 ) 
	class UwWeaponBaseParams*                          BaseParams;                                       		// 0x0174 ( 0x0004 ) 
	class UClass*                                      ResParams;                                        		// 0x0178 ( 0x0004 ) 
	unsigned long                                      bMakeRadarNoise:1;                                		// 0x017C ( 0x0004 )  [0x00000001]
	unsigned char                                      SpreadStance;                                     		// 0x0180 ( 0x0001 ) 
	int                                                nBulletPerfire;                                   		// 0x0184 ( 0x0004 ) 
	int                                                AutoAimCount;                                     		// 0x0188 ( 0x0004 ) 

	// UScript Functions
	 void                      eventDamageLog ( class APawn* Victim, float fDam, float fDist, unsigned char CParts );		// [ FUNC_Event ] Engine.wWeaponFire.DamageLog
	 void                      MakeFireNoise (  );                               		//  Engine.wWeaponFire.MakeFireNoise
	 void                      SetSpreadStance ( unsigned char ss );             		//  Engine.wWeaponFire.SetSpreadStance
	 void                      wLoadOut (  );                                    		// [ FUNC_Simulated ] Engine.wWeaponFire.wLoadOut
	 class AActor*             Trace ( struct FVector TraceEnd, struct FVector TraceStart, bool bTraceActors, struct FVector Extent, struct FVector* HitLocation, struct FVector* HitNormal, class UMaterial** Material );		//  Engine.wWeaponFire.Trace
	 class AActor*             Spawn ( class UClass* SpawnClass, class AActor* SpawnOwner, struct FName SpawnTag, struct FVector SpawnLocation, struct FRotator SpawnRotation );		//  Engine.wWeaponFire.Spawn
	 float                     MaxRange (  );                                    		//  Engine.wWeaponFire.MaxRange
	 void                      DisplayDebug ( class UCanvas* Canvas, float* YL, float* YPos );		// [ FUNC_Simulated ] Engine.wWeaponFire.DisplayDebug
	 struct FVector            GetFireStart ( struct FVector X, struct FVector Y, struct FVector Z );		// [ FUNC_Simulated ] Engine.wWeaponFire.GetFireStart
	 struct FRotator           AdjustAim ( struct FVector Start, float InAimError );		//  Engine.wWeaponFire.AdjustAim
	 void                      PlayFireEnd (  );                                 		//  Engine.wWeaponFire.PlayFireEnd
	 void                      PlayFiring (  );                                  		//  Engine.wWeaponFire.PlayFiring
	 void                      PlayStartHold (  );                               		//  Engine.wWeaponFire.PlayStartHold
	 void                      PlayPreFire (  );                                 		//  Engine.wWeaponFire.PlayPreFire
	 void                      PlaySoundTeam (  );                               		//  Engine.wWeaponFire.PlaySoundTeam
	 void                      ServerPlayFiring (  );                            		//  Engine.wWeaponFire.ServerPlayFiring
	 bool                      AllowFire (  );                                   		// [ FUNC_Simulated ] Engine.wWeaponFire.AllowFire
	 void                      eventModeHoldFire (  );                           		// [ FUNC_Event ] Engine.wWeaponFire.ModeHoldFire
	 void                      eventModeDoFire (  );                             		// [ FUNC_Event ] Engine.wWeaponFire.ModeDoFire
	 void                      SyncRandSeed (  );                                		// [ FUNC_Simulated ] Engine.wWeaponFire.SyncRandSeed
	 void                      eventModeTick ( float dt );                       		// [ FUNC_Event ] Engine.wWeaponFire.ModeTick
	 bool                      IsFiring (  );                                    		//  Engine.wWeaponFire.IsFiring
	 void                      StopFiring (  );                                  		//  Engine.wWeaponFire.StopFiring
	 void                      StartFiring (  );                                 		//  Engine.wWeaponFire.StartFiring
	 void                      Update ( float dt );                              		//  Engine.wWeaponFire.Update
	 void                      StopForceFeedback ( struct FString EffectName );  		//  Engine.wWeaponFire.StopForceFeedback
	 void                      ClientPlayForceFeedback ( struct FString EffectName );		//  Engine.wWeaponFire.ClientPlayForceFeedback
	 void                      ShakeView (  );                                   		//  Engine.wWeaponFire.ShakeView
	 void                      StartMuzzleSmoke (  );                            		//  Engine.wWeaponFire.StartMuzzleSmoke
	 void                      FlashMuzzleFlash (  );                            		//  Engine.wWeaponFire.FlashMuzzleFlash
	 void                      DrawMuzzleFlash ( class UCanvas* Canvas );        		//  Engine.wWeaponFire.DrawMuzzleFlash
	 void                      DoFireEffectForClient (  );                       		//  Engine.wWeaponFire.DoFireEffectForClient
	 void                      DoFireEffect (  );                                		//  Engine.wWeaponFire.DoFireEffect
	 void                      InitEffects (  );                                 		// [ FUNC_Simulated ] Engine.wWeaponFire.InitEffects
	 void                      DestroyEffects (  );                              		// [ FUNC_Simulated ] Engine.wWeaponFire.DestroyEffects
	 void                      PostBeginPlay (  );                               		// [ FUNC_Simulated ] Engine.wWeaponFire.PostBeginPlay
	 void                      eventSetInitialState (  );                        		// [ FUNC_Simulated | FUNC_Event ] Engine.wWeaponFire.SetInitialState
	 void                      PostNetBeginPlay (  );                            		// [ FUNC_Simulated ] Engine.wWeaponFire.PostNetBeginPlay
	 void                      BeginPlay (  );                                   		// [ FUNC_Simulated ] Engine.wWeaponFire.BeginPlay
	 void                      PreBeginPlay (  );                                		// [ FUNC_Simulated ] Engine.wWeaponFire.PreBeginPlay
	 void                      eventTimer (  );                                  		// [ FUNC_Event ] Engine.wWeaponFire.Timer
	 void                      SetTimer ( float NewTimerRate, bool bLoop );      		// [ FUNC_Simulated ] Engine.wWeaponFire.SetTimer

	// Public Imports
	UwWeaponFire(class UwWeaponFire const &);
	UwWeaponFire(void);
	class UwWeaponFire &  operator=(class UwWeaponFire const &);
	static void  InternalConstructor(void *);
	void  ModeTick(float);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0160

// Class Engine.wInstantFire
class DLL_IMPORT UwInstantFire : public UwWeaponFire
{
public:
	class UClass*                                      DamageType;                                       		// 0x018C ( 0x0004 ) 
	float                                              TraceRange;                                       		// 0x0190 ( 0x0004 ) 
	float                                              Momentum;                                         		// 0x0194 ( 0x0004 ) 
	float                                              Momentum_Pawn;                                    		// 0x0198 ( 0x0004 ) 
	float                                              HeadShotExtent;                                   		// 0x019C ( 0x0004 ) 
	struct FName                                       Aim_FireAnim;                                     		// 0x01A0 ( 0x0004 ) [ CPF_Edit ]
	struct FName                                       Aim_FireLoopAnim;                                 		// 0x01A4 ( 0x0004 ) [ CPF_Edit ]
	float                                              Aim_FireAnimRate;                                 		// 0x01A8 ( 0x0004 ) [ CPF_Edit ]
	float                                              Aim_FireLoopAnimRate;                             		// 0x01AC ( 0x0004 ) [ CPF_Edit ]
	class UClass*                                      SilencerSmokeEmitterClass;                        		// 0x01B0 ( 0x0004 ) [ CPF_Edit ]
	class AwEmitter*                                   SilencerSmokeEmitter;                             		// 0x01B4 ( 0x0004 ) [ CPF_Edit ]
	unsigned long                                      bToggleSlot:1;                                    		// 0x01B8 ( 0x0004 )  [0x00000001]
	float                                              fSpread_Weapon;                                   		// 0x01BC ( 0x0004 ) 
	float                                              fSpread_Char;                                     		// 0x01C0 ( 0x0004 ) 
	float                                              fSpread_Min;                                      		// 0x01C4 ( 0x0004 ) 
	float                                              fSpread_Max;                                      		// 0x01C8 ( 0x0004 ) 
	float                                              fSpreadReduce;                                    		// 0x01CC ( 0x0004 ) 
	float                                              fSpreadReduce_Normal;                             		// 0x01D0 ( 0x0004 ) 
	float                                              fLastRecoilReduceTime;                            		// 0x01D4 ( 0x0004 ) 
	class USound*                                      sound_Fire_Silencer;                              		// 0x01D8 ( 0x0004 ) 
	float                                              fSpread_2nd_Max_Curr;                             		// 0x01DC ( 0x0004 ) 

	// UScript Functions
	 void                      MakeFireNoise (  );                               		//  Engine.wInstantFire.MakeFireNoise
	 void                      DisplayDebug ( class UCanvas* Canvas, float* YL, float* YPos );		// [ FUNC_Simulated ] Engine.wInstantFire.DisplayDebug
	 void                      CalcSpread (  );                                  		//  Engine.wInstantFire.CalcSpread
	 void                      SetSpreadStance ( unsigned char ss );             		//  Engine.wInstantFire.SetSpreadStance
	 void                      StartMuzzleSmoke (  );                            		//  Engine.wInstantFire.StartMuzzleSmoke
	 void                      DrawMuzzleFlash ( class UCanvas* Canvas );        		//  Engine.wInstantFire.DrawMuzzleFlash
	 void                      DestroyEffects (  );                              		// [ FUNC_Simulated ] Engine.wInstantFire.DestroyEffects
	 void                      InitEffects (  );                                 		// [ FUNC_Simulated ] Engine.wInstantFire.InitEffects
	 void                      wLoadOut (  );                                    		// [ FUNC_Simulated ] Engine.wInstantFire.wLoadOut
	 void                      FlashMuzzleFlash (  );                            		//  Engine.wInstantFire.FlashMuzzleFlash
	 void                      DoTrace ( struct FVector Start, struct FRotator Dir );		//  Engine.wInstantFire.DoTrace
	 void                      DoTraceForClient ( struct FVector Start, struct FRotator Dir );		//  Engine.wInstantFire.DoTraceForClient
	 void                      DoFireEffectForClient (  );                       		//  Engine.wInstantFire.DoFireEffectForClient
	 void                      DoTraceNative ( struct FVector Start, struct FRotator Dir );		// [ FUNC_Native ] Engine.wInstantFire.DoTraceNative
	 void                      DoFireEffect (  );                                		//  Engine.wInstantFire.DoFireEffect
	 void                      eventModeTick ( float dt );                       		// [ FUNC_Event ] Engine.wInstantFire.ModeTick
	 float                     MaxRange (  );                                    		//  Engine.wInstantFire.MaxRange
	 void                      ServerPlayFiring (  );                            		//  Engine.wInstantFire.ServerPlayFiring
	 void                      PlayFiring (  );                                  		//  Engine.wInstantFire.PlayFiring
	 bool                      AllowFire (  );                                   		// [ FUNC_Simulated ] Engine.wInstantFire.AllowFire
	 void                      eventModeDoFire (  );                             		// [ FUNC_Event ] Engine.wInstantFire.ModeDoFire

	// Public Imports
	UwInstantFire(class UwInstantFire const &);
	class UwInstantFire &  operator=(class UwInstantFire const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0054

// Class Engine.wWeaponCustomPartsParam
class DLL_IMPORT UwWeaponCustomPartsParam : public UObject
{
public:
	int                                                iItemID;                                          		// 0x002C ( 0x0004 ) 
	unsigned char                                      eType;                                            		// 0x0030 ( 0x0001 ) 
	int                                                iPartID;                                          		// 0x0034 ( 0x0004 ) 
	struct FString                                     strDisplayName;                                   		// 0x0038 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strAddPartGroupID;                                		// 0x0044 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strPartImageName;                                 		// 0x0050 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              fDurability_Weight;                               		// 0x005C ( 0x0004 ) 
	unsigned long                                      bUsableAR:1;                                      		// 0x0060 ( 0x0004 )  [0x00000001]
	unsigned long                                      bUsableSMG:1;                                     		// 0x0060 ( 0x0004 )  [0x00000002]
	unsigned long                                      bUsableSR:1;                                      		// 0x0060 ( 0x0004 )  [0x00000004]
	unsigned long                                      bUsablePS:1;                                      		// 0x0060 ( 0x0004 )  [0x00000008]
	unsigned long                                      bUsableSG:1;                                      		// 0x0060 ( 0x0004 )  [0x00000010]
	unsigned long                                      bUsableETC:1;                                     		// 0x0060 ( 0x0004 )  [0x00000020]
	struct FVector                                     vAddAimDiff;                                      		// 0x0064 ( 0x000C ) 
	int                                                ui_damage_range;                                  		// 0x0070 ( 0x0004 ) 
	int                                                ui_firesound;                                     		// 0x0074 ( 0x0004 ) 
	struct FString                                     ui_zoom_1;                                        		// 0x0078 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ui_zoom_2;                                        		// 0x0084 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                UI_Durability;                                    		// 0x0090 ( 0x0004 ) 
	int                                                ui_damage;                                        		// 0x0094 ( 0x0004 ) 
	int                                                ui_spread;                                        		// 0x0098 ( 0x0004 ) 
	int                                                ui_view_kick;                                     		// 0x009C ( 0x0004 ) 
	int                                                ui_rate_of_fire;                                  		// 0x00A0 ( 0x0004 ) 
	int                                                ui_move;                                          		// 0x00A4 ( 0x0004 ) 
	int                                                ui_range;                                         		// 0x00A8 ( 0x0004 ) 
	int                                                iSkillID;                                         		// 0x00AC ( 0x0004 ) 

	// Public Imports
	UwWeaponCustomPartsParam(class UwWeaponCustomPartsParam const &);
	UwWeaponCustomPartsParam(void);
	class UwWeaponCustomPartsParam &  operator=(class UwWeaponCustomPartsParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0084

// Class Engine.wWeaponCustomInfoParam
class DLL_IMPORT UwWeaponCustomInfoParam : public UObject
{
public:
	int                                                iItemID;                                          		// 0x002C ( 0x0004 ) 
	struct FString                                     strDisplayName;                                   		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strAddPartSightGroupID;                           		// 0x003C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strAddPartBarrelGroupID;                          		// 0x0048 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strAddPartSilencerGroupID;                        		// 0x0054 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strAddPartGunstockGroupID;                        		// 0x0060 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned long                                      bCustomSight:1;                                   		// 0x006C ( 0x0004 )  [0x00000001]
	unsigned long                                      bCustomSilencer:1;                                		// 0x006C ( 0x0004 )  [0x00000002]
	unsigned long                                      bCustomBarrel:1;                                  		// 0x006C ( 0x0004 )  [0x00000004]
	unsigned long                                      bCustomGunstock:1;                                		// 0x006C ( 0x0004 )  [0x00000008]
	unsigned long                                      bCustomPainting:1;                                		// 0x006C ( 0x0004 )  [0x00000010]
	int                                                iDefaultSightUniID;                               		// 0x0070 ( 0x0004 ) 
	int                                                iDefaultSilencerUniID;                            		// 0x0074 ( 0x0004 ) 
	int                                                iDefaultBarrelUniID;                              		// 0x0078 ( 0x0004 ) 
	int                                                iDefaultGunstockUniID;                            		// 0x007C ( 0x0004 ) 
	int                                                iDefaultPaintingID;                               		// 0x0080 ( 0x0004 ) 
	int                                                iSightOnAddItemID;                                		// 0x0084 ( 0x0004 ) 
	int                                                iSightOffAddItemID;                               		// 0x0088 ( 0x0004 ) 
	struct FVector                                     vAimDiff;                                         		// 0x008C ( 0x000C ) 
	struct FVector                                     vDisplay_3d;                                      		// 0x0098 ( 0x000C ) 
	float                                              fDisplay_3d_rot_y;                                		// 0x00A4 ( 0x0004 ) 
	struct FVector                                     vBootyitem_3d;                                    		// 0x00A8 ( 0x000C ) 
	float                                              fBootyitem_3d_rot_y;                              		// 0x00B4 ( 0x0004 ) 

	// Public Imports
	UwWeaponCustomInfoParam(class UwWeaponCustomInfoParam const &);
	UwWeaponCustomInfoParam(void);
	class UwWeaponCustomInfoParam &  operator=(class UwWeaponCustomInfoParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x008C

// Class Engine.wModeDOAParam
class DLL_IMPORT UwModeDOAParam : public UObject
{
public:
	int                                                GroupID;                                          		// 0x002C ( 0x0004 ) 
	int                                                WeaponID0;                                        		// 0x0030 ( 0x0004 ) 
	int                                                WeaponID1;                                        		// 0x0034 ( 0x0004 ) 
	int                                                WeaponID2;                                        		// 0x0038 ( 0x0004 ) 
	int                                                WeaponID3;                                        		// 0x003C ( 0x0004 ) 
	int                                                WeaponID4;                                        		// 0x0040 ( 0x0004 ) 

	// Public Imports
	UwModeDOAParam(class UwModeDOAParam const &);
	UwModeDOAParam(void);
	class UwModeDOAParam &  operator=(class UwModeDOAParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0018

// Class Engine.wDefenceGameParam
class DLL_IMPORT UwDefenceGameParam : public UObject
{
public:
	int                                                nMapID;                                           		// 0x002C ( 0x0004 ) 
	int                                                nDelayTime;                                       		// 0x0030 ( 0x0004 ) 
	int                                                nGrade;                                           		// 0x0034 ( 0x0004 ) 
	unsigned char                                      nRound;                                           		// 0x0038 ( 0x0001 ) 
	unsigned char                                      nRegenLoc;                                        		// 0x0039 ( 0x0001 ) 
	unsigned char                                      nUnit;                                            		// 0x003A ( 0x0001 ) 
	unsigned char                                      nLevel;                                           		// 0x003B ( 0x0001 ) 

	// Public Imports
	UwDefenceGameParam(class UwDefenceGameParam const &);
	UwDefenceGameParam(void);
	class UwDefenceGameParam &  operator=(class UwDefenceGameParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class Engine.wNPCActionGroupParam
class DLL_IMPORT UwNPCActionGroupParam : public UObject
{
public:
	int                                                ActionGroupID;                                    		// 0x002C ( 0x0004 ) 
	struct FString                                     ActionID;                                         		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]

	// Public Imports
	UwNPCActionGroupParam(class UwNPCActionGroupParam const &);
	UwNPCActionGroupParam(void);
	class UwNPCActionGroupParam &  operator=(class UwNPCActionGroupParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class Engine.wNPCItemGroupParam
class DLL_IMPORT UwNPCItemGroupParam : public UObject
{
public:
	int                                                GroupID;                                          		// 0x002C ( 0x0004 ) 
	int                                                ItemID;                                           		// 0x0030 ( 0x0004 ) 
	int                                                PartsID;                                          		// 0x0034 ( 0x0004 ) 

	// Public Imports
	UwNPCItemGroupParam(class UwNPCItemGroupParam const &);
	UwNPCItemGroupParam(void);
	class UwNPCItemGroupParam &  operator=(class UwNPCItemGroupParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x000C

// Class Engine.wNPCNameGroupParam
class DLL_IMPORT UwNPCNameGroupParam : public UObject
{
public:
	int                                                GroupID;                                          		// 0x002C ( 0x0004 ) 
	struct FString                                     NickName;                                         		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]

	// Public Imports
	UwNPCNameGroupParam(class UwNPCNameGroupParam const &);
	UwNPCNameGroupParam(void);
	class UwNPCNameGroupParam &  operator=(class UwNPCNameGroupParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0010

// Class Engine.wNPCParam
class DLL_IMPORT UwNPCParam : public UObject
{
public:
	int                                                NPCID;                                            		// 0x002C ( 0x0004 ) 
	int                                                NameGroupID;                                      		// 0x0030 ( 0x0004 ) 
	int                                                Lv;                                               		// 0x0034 ( 0x0004 ) 
	struct FString                                     Type;                                             		// 0x0038 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                MainWeaponGroupID;                                		// 0x0044 ( 0x0004 ) 
	int                                                PistolGroupID;                                    		// 0x0048 ( 0x0004 ) 
	int                                                Grenade1GroupID;                                  		// 0x004C ( 0x0004 ) 
	int                                                Grenade2GroupID;                                  		// 0x0050 ( 0x0004 ) 
	int                                                SkillActiveGroupID;                               		// 0x0054 ( 0x0004 ) 
	int                                                SkillPassive1GroupID;                             		// 0x0058 ( 0x0004 ) 
	int                                                SkillPassive2GroupID;                             		// 0x005C ( 0x0004 ) 
	int                                                SkillPassive3GroupID;                             		// 0x0060 ( 0x0004 ) 
	int                                                SpCharGroupID_AF;                                 		// 0x0064 ( 0x0004 ) 
	int                                                SpCharGroupID_RSA;                                		// 0x0068 ( 0x0004 ) 
	int                                                HeadGroupID;                                      		// 0x006C ( 0x0004 ) 
	int                                                FaceGroupID;                                      		// 0x0070 ( 0x0004 ) 
	int                                                AccessoryGroupID;                                 		// 0x0074 ( 0x0004 ) 
	int                                                HP;                                               		// 0x0078 ( 0x0004 ) 
	int                                                SprintRate;                                       		// 0x007C ( 0x0004 ) 
	int                                                DefaultRunSpeed;                                  		// 0x0080 ( 0x0004 ) 
	int                                                ActionGroupID;                                    		// 0x0084 ( 0x0004 ) 
	float                                              DamageRate;                                       		// 0x0088 ( 0x0004 ) 
	float                                              ExplosionDmageRate;                               		// 0x008C ( 0x0004 ) 
	float                                              MeleeDamageRate;                                  		// 0x0090 ( 0x0004 ) 
	float                                              ReactionTime;                                     		// 0x0094 ( 0x0004 ) 
	float                                              DetourRate;                                       		// 0x0098 ( 0x0004 ) 
	float                                              DetourWeightMin;                                  		// 0x009C ( 0x0004 ) 
	float                                              DetourWeightMax;                                  		// 0x00A0 ( 0x0004 ) 
	float                                              SafeWeightMin;                                    		// 0x00A4 ( 0x0004 ) 
	float                                              SafeWeightMax;                                    		// 0x00A8 ( 0x0004 ) 
	float                                              HeadshotChance;                                   		// 0x00AC ( 0x0004 ) 
	float                                              HeadshotChanceMG;                                 		// 0x00B0 ( 0x0004 ) 
	float                                              HeadshotSpreadRate;                               		// 0x00B4 ( 0x0004 ) 
	float                                              RotationgSpeed;                                   		// 0x00B8 ( 0x0004 ) 
	float                                              MeleeActionRange;                                 		// 0x00BC ( 0x0004 ) 
	float                                              MeleeRange;                                       		// 0x00C0 ( 0x0004 ) 
	float                                              EffectiveRange;                                   		// 0x00C4 ( 0x0004 ) 
	float                                              CloseRange;                                       		// 0x00C8 ( 0x0004 ) 
	float                                              OuterRangeSpreadMin;                              		// 0x00CC ( 0x0004 ) 
	float                                              OuterRangeSpreadMax;                              		// 0x00D0 ( 0x0004 ) 
	float                                              EffectiveRangeSpreadMin;                          		// 0x00D4 ( 0x0004 ) 
	float                                              EffectiveRangeSpreadMax;                          		// 0x00D8 ( 0x0004 ) 
	float                                              CloseRangeSpreadMin;                              		// 0x00DC ( 0x0004 ) 
	float                                              CloseRangeSpreadMax;                              		// 0x00E0 ( 0x0004 ) 
	float                                              ZeroRangeSpreadMin;                               		// 0x00E4 ( 0x0004 ) 
	float                                              ZeroRangeSpreadMax;                               		// 0x00E8 ( 0x0004 ) 

	// Public Imports
	UwNPCParam(class UwNPCParam const &);
	UwNPCParam(void);
	class UwNPCParam &  operator=(class UwNPCParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x00C0

// Class Engine.wNPCSpawnParam
class DLL_IMPORT UwNPCSpawnParam : public UObject
{
public:
	int                                                Grade;                                            		// 0x002C ( 0x0004 ) 
	struct FString                                     Type;                                             		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                NPCID;                                            		// 0x003C ( 0x0004 ) 

	// Public Imports
	UwNPCSpawnParam(class UwNPCSpawnParam const &);
	UwNPCSpawnParam(void);
	class UwNPCSpawnParam &  operator=(class UwNPCSpawnParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0014

// Class Engine.wMapInfo
class DLL_IMPORT UwMapInfo : public UObject
{
public:
	int                                                MapID;                                            		// 0x002C ( 0x0004 ) 
	struct FString                                     File;                                             		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     FriendlyName;                                     		// 0x003C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                MapDifficulty;                                    		// 0x0048 ( 0x0004 ) 
	struct FString                                     MapDifficultyDisplay;                             		// 0x004C ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              SupplyHealth;                                     		// 0x0058 ( 0x0004 ) 
	float                                              SupplyHelicopter;                                 		// 0x005C ( 0x0004 ) 
	float                                              SupplyBombing;                                    		// 0x0060 ( 0x0004 ) 
	float                                              SupplyUAV;                                        		// 0x0064 ( 0x0004 ) 
	struct FString                                     ResourceLoadingImage;                             		// 0x0068 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ResourceMapImage;                                 		// 0x0074 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ResourceSupplyImages[ 0x03 ];                     		// 0x0080 ( 0x0024 ) [ CPF_NeedCtorLink ]
	struct FString                                     ResourceMiniMapInfoImage[ 0x04 ];                 		// 0x00A4 ( 0x0030 ) [ CPF_NeedCtorLink ]
	struct FString                                     BGM1;                                             		// 0x00D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                BGM1_Times[ 0x04 ];                               		// 0x00E0 ( 0x0010 ) 
	struct FString                                     BGM2;                                             		// 0x00F0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                BGM2_Times[ 0x04 ];                               		// 0x00FC ( 0x0010 ) 
	unsigned char                                      ModeFFA;                                          		// 0x010C ( 0x0001 ) 
	unsigned char                                      ModeTDM;                                          		// 0x010D ( 0x0001 ) 
	unsigned char                                      ModeSD;                                           		// 0x010E ( 0x0001 ) 
	unsigned char                                      ModeDOA;                                          		// 0x010F ( 0x0001 ) 
	unsigned char                                      ModeDomination;                                   		// 0x0110 ( 0x0001 ) 
	unsigned char                                      ModeSabotage;                                     		// 0x0111 ( 0x0001 ) 
	unsigned char                                      ModeBotFFA;                                       		// 0x0112 ( 0x0001 ) 
	unsigned char                                      ModeBotTDM;                                       		// 0x0113 ( 0x0001 ) 
	unsigned char                                      ModeBotDomination;                                		// 0x0114 ( 0x0001 ) 
	unsigned char                                      ModeBotBeginner;                                  		// 0x0115 ( 0x0001 ) 
	unsigned char                                      ModeDefence;                                      		// 0x0116 ( 0x0001 ) 
	unsigned char                                      ModeInfection;                                    		// 0x0117 ( 0x0001 ) 
	int                                                ModeFFA_Max;                                      		// 0x0118 ( 0x0004 ) 
	int                                                ModeTDM_Max;                                      		// 0x011C ( 0x0004 ) 
	int                                                ModeSD_Max;                                       		// 0x0120 ( 0x0004 ) 
	int                                                ModeDOA_Max;                                      		// 0x0124 ( 0x0004 ) 
	int                                                ModeDomination_Max;                               		// 0x0128 ( 0x0004 ) 
	int                                                ModeSabotage_Max;                                 		// 0x012C ( 0x0004 ) 
	int                                                ModeBotFFA_Max;                                   		// 0x0130 ( 0x0004 ) 
	int                                                ModeBotTDM_Max;                                   		// 0x0134 ( 0x0004 ) 
	int                                                ModeBotDomination_Max;                            		// 0x0138 ( 0x0004 ) 
	int                                                ModeBotBeginner_Max;                              		// 0x013C ( 0x0004 ) 
	int                                                ModeDefence_Max;                                  		// 0x0140 ( 0x0004 ) 
	int                                                ModeInfection_Max;                                		// 0x0144 ( 0x0004 ) 
	unsigned char                                      SubMode_All;                                      		// 0x0148 ( 0x0001 ) 
	unsigned char                                      SubMode_Knife;                                    		// 0x0149 ( 0x0001 ) 
	unsigned char                                      SubMode_Pistol;                                   		// 0x014A ( 0x0001 ) 
	unsigned char                                      SubMode_Grenade;                                  		// 0x014B ( 0x0001 ) 
	unsigned char                                      SubMode_Rocket;                                   		// 0x014C ( 0x0001 ) 
	unsigned char                                      SubMode_Sniper;                                   		// 0x014D ( 0x0001 ) 
	unsigned char                                      SubMode_SniperX;                                  		// 0x014E ( 0x0001 ) 
	unsigned char                                      SubMode_FlameThower;                              		// 0x014F ( 0x0001 ) 
	unsigned char                                      SubMode_ShotGun;                                  		// 0x0150 ( 0x0001 ) 
	unsigned char                                      SubMode_MG;                                       		// 0x0151 ( 0x0001 ) 
	unsigned char                                      ModeTDM_RandomRespawn;                            		// 0x0152 ( 0x0001 ) 
	unsigned char                                      ModeDOMI_RandomRespawn;                           		// 0x0153 ( 0x0001 ) 
	unsigned char                                      GameLevel;                                        		// 0x0154 ( 0x0001 ) 
	int                                                MapDisplaySort;                                   		// 0x0158 ( 0x0004 ) 
	struct FString                                     NewMapIcon;                                       		// 0x015C ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 void                      CopyTo ( class UwMapInfo* Dest );                 		//  Engine.wMapInfo.CopyTo

	// Public Imports
	UwMapInfo(class UwMapInfo const &);
	UwMapInfo(void);
	class UwMapInfo &  operator=(class UwMapInfo const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x013C

// Class Engine.wClanLevelInfoParam
class DLL_IMPORT UwClanLevelInfoParam : public UObject
{
public:
	int                                                nLevel;                                           		// 0x002C ( 0x0004 ) 
	struct FString                                     sLevelName;                                       		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                nAccumExp;                                        		// 0x003C ( 0x0004 ) 

	// Public Imports
	UwClanLevelInfoParam(class UwClanLevelInfoParam const &);
	UwClanLevelInfoParam(void);
	class UwClanLevelInfoParam &  operator=(class UwClanLevelInfoParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0014

// Class Engine.wLevelInfoParam
class DLL_IMPORT UwLevelInfoParam : public UObject
{
public:
	int                                                nLevel;                                           		// 0x002C ( 0x0004 ) 
	struct FString                                     sLevelName;                                       		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                nAccumExp;                                        		// 0x003C ( 0x0004 ) 

	// Public Imports
	UwLevelInfoParam(class UwLevelInfoParam const &);
	UwLevelInfoParam(void);
	class UwLevelInfoParam &  operator=(class UwLevelInfoParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0014

// Class Engine.wItemBoxParam
class DLL_IMPORT UwItemBoxParam : public UObject
{
public:
	int                                                nItemBoxID;                                       		// 0x002C ( 0x0004 ) 
	int                                                nItemCount;                                       		// 0x0030 ( 0x0004 ) 
	int                                                nItemID[ 0x14 ];                                  		// 0x0034 ( 0x0050 ) 
	int                                                nPartID[ 0x14 ];                                  		// 0x0084 ( 0x0050 ) 

	// Public Imports
	UwItemBoxParam(class UwItemBoxParam const &);
	UwItemBoxParam(void);
	class UwItemBoxParam &  operator=(class UwItemBoxParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x00A8

// Class Engine.wClanMarkParam
class DLL_IMPORT UwClanMarkParam : public UObject
{
public:
	int                                                nClanMark_ID;                                     		// 0x002C ( 0x0004 ) 
	int                                                nClanMark_Type_1;                                 		// 0x0030 ( 0x0004 ) 
	int                                                nClanMark_Type_2;                                 		// 0x0034 ( 0x0004 ) 
	int                                                nSell_Type;                                       		// 0x0038 ( 0x0004 ) 
	int                                                nDisplay_Order;                                   		// 0x003C ( 0x0004 ) 
	struct FString                                     sClanMark_Resource_32;                            		// 0x0040 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     sClanMark_Resource_128;                           		// 0x004C ( 0x000C ) [ CPF_NeedCtorLink ]

	// Public Imports
	UwClanMarkParam(class UwClanMarkParam const &);
	UwClanMarkParam(void);
	class UwClanMarkParam &  operator=(class UwClanMarkParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x002C

// Class Engine.wRandBoxParam
class DLL_IMPORT UwRandBoxParam : public UObject
{
public:
	int                                                ItemID;                                           		// 0x002C ( 0x0004 ) 
	int                                                RandNum;                                          		// 0x0030 ( 0x0004 ) 
	int                                                RandItemID[ 0x32 ];                               		// 0x0034 ( 0x00C8 ) 
	int                                                RandPartID[ 0x32 ];                               		// 0x00FC ( 0x00C8 ) 

	// Public Imports
	UwRandBoxParam(class UwRandBoxParam const &);
	UwRandBoxParam(void);
	class UwRandBoxParam &  operator=(class UwRandBoxParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0198

// Class Engine.wDailyQuestParam
class DLL_IMPORT UwDailyQuestParam : public UObject
{
public:
	int                                                DailyQuestType;                                   		// 0x002C ( 0x0004 ) 
	int                                                Step;                                             		// 0x0030 ( 0x0004 ) 
	int                                                QuestID;                                          		// 0x0034 ( 0x0004 ) 

	// Public Imports
	UwDailyQuestParam(class UwDailyQuestParam const &);
	UwDailyQuestParam(void);
	class UwDailyQuestParam &  operator=(class UwDailyQuestParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x000C

// Class Engine.wQuestParam
class DLL_IMPORT UwQuestParam : public UObject
{
public:
	int                                                QuestType;                                        		// 0x002C ( 0x0004 ) 
	int                                                QuestID;                                          		// 0x0030 ( 0x0004 ) 
	int                                                LinkQuestID;                                      		// 0x0034 ( 0x0004 ) 
	int                                                LinkQuestStep;                                    		// 0x0038 ( 0x0004 ) 
	int                                                LimitArea;                                        		// 0x003C ( 0x0004 ) 
	struct FBtrDouble                                  EventStartTime;                                   		// 0x0040 ( 0x0008 ) 
	struct FBtrDouble                                  EventEndTime;                                     		// 0x0048 ( 0x0008 ) 
	int                                                QuestCreateLv;                                    		// 0x0050 ( 0x0004 ) 
	int                                                DisplayOrder;                                     		// 0x0054 ( 0x0004 ) 
	struct FString                                     LinkQuestName;                                    		// 0x0058 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     QuestMissionDesc;                                 		// 0x0064 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     QuestExtDesc;                                     		// 0x0070 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                MissionType;                                      		// 0x007C ( 0x0004 ) 
	int                                                MissionOption[ 0x02 ];                            		// 0x0080 ( 0x0008 ) 
	int                                                MissionBotMode;                                   		// 0x0088 ( 0x0004 ) 
	int                                                MissionCount;                                     		// 0x008C ( 0x0004 ) 
	int                                                RewardExp;                                        		// 0x0090 ( 0x0004 ) 
	int                                                RewardPoint;                                      		// 0x0094 ( 0x0004 ) 
	int                                                RewardItemID[ 0x02 ];                             		// 0x0098 ( 0x0008 ) 
	int                                                RewardItemPartID[ 0x02 ];                         		// 0x00A0 ( 0x0008 ) 
	int                                                RewardQuestID[ 0x05 ];                            		// 0x00A8 ( 0x0014 ) 
	struct FString                                     HelpResource;                                     		// 0x00BC ( 0x000C ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      IsEnabledEventQuest ( struct FBtrDouble CurrentTime );		//  Engine.wQuestParam.IsEnabledEventQuest
	 bool                      IsEventQuest (  );                                		//  Engine.wQuestParam.IsEventQuest

	// Public Imports
	UwQuestParam(class UwQuestParam const &);
	UwQuestParam(void);
	class UwQuestParam &  operator=(class UwQuestParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x009C

// Class Engine.wPromotionParam
class DLL_IMPORT UwPromotionParam : public UObject
{
public:
	int                                                nLevel;                                           		// 0x002C ( 0x0004 ) 
	struct FString                                     sAcquireItem;                                     		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                nPartID;                                          		// 0x003C ( 0x0004 ) 

	// Public Imports
	UwPromotionParam(class UwPromotionParam const &);
	UwPromotionParam(void);
	class UwPromotionParam &  operator=(class UwPromotionParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0014

// Class Engine.wPaintGroupParam
class DLL_IMPORT UwPaintGroupParam : public UObject
{
public:
	int                                                PaintingID;                                       		// 0x002C ( 0x0004 ) 
	struct FString                                     PaintingGroupID;                                  		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                PaintingNum;                                      		// 0x003C ( 0x0004 ) 
	int                                                PaintingItemID;                                   		// 0x0040 ( 0x0004 ) 
	float                                              RepairCost;                                       		// 0x0044 ( 0x0004 ) 
	int                                                UI_Durability;                                    		// 0x0048 ( 0x0004 ) 
	struct FString                                     strUI_Icon;                                       		// 0x004C ( 0x000C ) [ CPF_NeedCtorLink ]

	// Public Imports
	UwPaintGroupParam(class UwPaintGroupParam const &);
	UwPaintGroupParam(void);
	class UwPaintGroupParam &  operator=(class UwPaintGroupParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x002C

// Class Engine.wPartsGroupParam
class DLL_IMPORT UwPartsGroupParam : public UObject
{
public:
	int                                                iAddPartID;                                       		// 0x002C ( 0x0004 ) 
	struct FString                                     strPartsGroupID;                                  		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	unsigned char                                      byAddpartNum;                                     		// 0x003C ( 0x0001 ) 
	struct FString                                     strName;                                          		// 0x0040 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                iPointPrice;                                      		// 0x004C ( 0x0004 ) 
	int                                                iCashPrice;                                       		// 0x0050 ( 0x0004 ) 
	int                                                iSightID;                                         		// 0x0054 ( 0x0004 ) 
	int                                                iSightID_Sub;                                     		// 0x0058 ( 0x0004 ) 
	int                                                iSilencerID;                                      		// 0x005C ( 0x0004 ) 
	int                                                iCamoID;                                          		// 0x0060 ( 0x0004 ) 
	int                                                iPaintingID;                                      		// 0x0064 ( 0x0004 ) 
	int                                                iChar_HeadID;                                     		// 0x0068 ( 0x0004 ) 
	int                                                iChar_FaceID;                                     		// 0x006C ( 0x0004 ) 
	int                                                iChar_AccessoryID;                                		// 0x0070 ( 0x0004 ) 
	int                                                iSkillID;                                         		// 0x0074 ( 0x0004 ) 
	int                                                iAddOption[ 0x02 ];                               		// 0x0078 ( 0x0008 ) 
	int                                                iOptionValue[ 0x02 ];                             		// 0x0080 ( 0x0008 ) 
	struct FString                                     strDescription;                                   		// 0x0088 ( 0x000C ) [ CPF_NeedCtorLink ]
	float                                              fAimDiffX;                                        		// 0x0094 ( 0x0004 ) 
	float                                              fAimDiffY;                                        		// 0x0098 ( 0x0004 ) 
	float                                              fAimDiffZ;                                        		// 0x009C ( 0x0004 ) 
	struct FString                                     strResource_UI_Icon;                              		// 0x00A0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                ui_damage_range;                                  		// 0x00AC ( 0x0004 ) 
	int                                                ui_firesound;                                     		// 0x00B0 ( 0x0004 ) 
	struct FString                                     ui_zoom_1;                                        		// 0x00B4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     ui_zoom_2;                                        		// 0x00C0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                UI_Durability;                                    		// 0x00CC ( 0x0004 ) 
	float                                              display_3d_x;                                     		// 0x00D0 ( 0x0004 ) 
	float                                              display_3d_y;                                     		// 0x00D4 ( 0x0004 ) 
	float                                              display_3d_z;                                     		// 0x00D8 ( 0x0004 ) 
	float                                              display_3d_rot_y;                                 		// 0x00DC ( 0x0004 ) 
	float                                              Bootyitem_3d_x;                                   		// 0x00E0 ( 0x0004 ) 
	float                                              Bootyitem_3d_y;                                   		// 0x00E4 ( 0x0004 ) 
	float                                              Bootyitem_3d_z;                                   		// 0x00E8 ( 0x0004 ) 
	float                                              Bootyitem_3d_rot_y;                               		// 0x00EC ( 0x0004 ) 
	class UMaterial*                                   matWeapon_1st;                                    		// 0x00F0 ( 0x0004 ) 
	class UMaterial*                                   matWeapon_3rd;                                    		// 0x00F4 ( 0x0004 ) 
	class UMaterial*                                   matWeapon_1st_Painting;                           		// 0x00F8 ( 0x0004 ) 
	class UMaterial*                                   matWeapon_3rd_Painting;                           		// 0x00FC ( 0x0004 ) 

	// Public Imports
	UwPartsGroupParam(class UwPartsGroupParam const &);
	UwPartsGroupParam(void);
	class UwPartsGroupParam &  operator=(class UwPartsGroupParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x00D4

// Class Engine.wSkillBaseParam
class DLL_IMPORT UwSkillBaseParam : public UObject
{
public:
	int                                                iSkillID;                                         		// 0x002C ( 0x0004 ) 
	struct FString                                     strName;                                          		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strClassName;                                     		// 0x003C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                iRequirementSkillid;                              		// 0x0048 ( 0x0004 ) 
	int                                                iAttachWeaponID;                                  		// 0x004C ( 0x0004 ) 
	unsigned char                                      ESkillType;                                       		// 0x0050 ( 0x0001 ) 
	unsigned char                                      eActiveType;                                      		// 0x0051 ( 0x0001 ) 
	int                                                iUseKey;                                          		// 0x0054 ( 0x0004 ) 
	struct FString                                     strDescription;                                   		// 0x0058 ( 0x000C ) [ CPF_NeedCtorLink ]

	// Public Imports
	UwSkillBaseParam(class UwSkillBaseParam const &);
	UwSkillBaseParam(void);
	class UwSkillBaseParam &  operator=(class UwSkillBaseParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0038

// Class Engine.wItemResourceParam
class DLL_IMPORT UwItemResourceParam : public UObject
{
public:
	int                                                iItemResourceID;                                  		// 0x002C ( 0x0004 ) 
	struct FString                                     strResName;                                       		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_1st;                                       		// 0x003C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd;                                       		// 0x0048 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_Icon;                                      		// 0x0054 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strHaveDotName;                                   		// 0x0060 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd_AF_Backpack;                           		// 0x006C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd_AF_Gore;                               		// 0x0078 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd_AF_Gore_Static;                        		// 0x0084 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_1st_RSA;                                   		// 0x0090 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd_RSA;                                   		// 0x009C ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd_RSA_Backpack;                          		// 0x00A8 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd_RSA_Gore;                              		// 0x00B4 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strRes_3rd_RSA_Gore_Static;                       		// 0x00C0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class UMesh*                                       mesh_Base_1st;                                    		// 0x00CC ( 0x0004 ) 
	class UMesh*                                       mesh_Base_3rd;                                    		// 0x00D0 ( 0x0004 ) 
	class UMesh*                                       mesh_Base_1st_RSA;                                		// 0x00D4 ( 0x0004 ) 
	class UMesh*                                       mesh_Base_3rd_RSA;                                		// 0x00D8 ( 0x0004 ) 
	class UMesh*                                       mesh_AF_Backpack;                                 		// 0x00DC ( 0x0004 ) 
	class UMesh*                                       mesh_RSA_Backpack;                                		// 0x00E0 ( 0x0004 ) 
	class UStaticMesh*                                 stmesh_Base_1st;                                  		// 0x00E4 ( 0x0004 ) 
	class UStaticMesh*                                 stmesh_Base_3rd;                                  		// 0x00E8 ( 0x0004 ) 
	class UStaticMesh*                                 stmesh_Base_1st_RSA;                              		// 0x00EC ( 0x0004 ) 
	class UStaticMesh*                                 stmesh_Base_3rd_RSA;                              		// 0x00F0 ( 0x0004 ) 
	struct FString                                     Resource_UI_Weapon_Ani;                           		// 0x00F4 ( 0x000C ) [ CPF_NeedCtorLink ]

	// Public Imports
	UwItemResourceParam(class UwItemResourceParam const &);
	UwItemResourceParam(void);
	class UwItemResourceParam &  operator=(class UwItemResourceParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x00D4

// Class Engine.wItemBaseParam
class DLL_IMPORT UwItemBaseParam : public UObject
{
public:
	unsigned char                                      eType;                                            		// 0x002C ( 0x0001 ) 
	unsigned char                                      eGrade;                                           		// 0x002D ( 0x0001 ) 
	struct FString                                     strGradeDisplay;                                  		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                iItemID;                                          		// 0x003C ( 0x0004 ) 
	struct FString                                     strDisplayName;                                   		// 0x0040 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                iResourceID;                                      		// 0x004C ( 0x0004 ) 
	int                                                iShopDisplayOrder;                                		// 0x0050 ( 0x0004 ) 
	int                                                iInvenDisplayOrder;                               		// 0x0054 ( 0x0004 ) 
	int                                                iEquipLevel;                                      		// 0x0058 ( 0x0004 ) 
	int                                                iEquipTeam;                                       		// 0x005C ( 0x0004 ) 
	unsigned char                                      EEquipSlot;                                       		// 0x0060 ( 0x0001 ) 
	unsigned long                                      bOverlap:1;                                       		// 0x0064 ( 0x0004 )  [0x00000001]
	struct FString                                     strAddPartGroupID;                                		// 0x0068 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strPaintingGroupID;                               		// 0x0074 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FString                                     strAddOption[ 0x02 ];                             		// 0x0080 ( 0x0018 ) [ CPF_NeedCtorLink ]
	struct FString                                     strOptionValue[ 0x02 ];                           		// 0x0098 ( 0x0018 ) [ CPF_NeedCtorLink ]
	unsigned char                                      ECastType;                                        		// 0x00B0 ( 0x0001 ) 
	int                                                iRepairCost;                                      		// 0x00B4 ( 0x0004 ) 
	unsigned char                                      byDurabilityWeight;                               		// 0x00B8 ( 0x0001 ) 
	int                                                iAdType;                                          		// 0x00BC ( 0x0004 ) 
	unsigned long                                      bSell:1;                                          		// 0x00C0 ( 0x0004 )  [0x00000001]
	int                                                iSellingPrice;                                    		// 0x00C4 ( 0x0004 ) 
	int                                                iPeriodNum[ 0x05 ];                               		// 0x00C8 ( 0x0014 ) 
	int                                                iCashPrice[ 0x05 ];                               		// 0x00DC ( 0x0014 ) 
	int                                                iPointPrice[ 0x05 ];                              		// 0x00F0 ( 0x0014 ) 
	int                                                iDBRemainTime;                                    		// 0x0104 ( 0x0004 ) 
	int                                                iDBAddPartID;                                     		// 0x0108 ( 0x0004 ) 
	int                                                iDBDurability;                                    		// 0x010C ( 0x0004 ) 
	int                                                iDBImpair;                                        		// 0x0110 ( 0x0004 ) 
	int                                                iDBEquipUpgrade;                                  		// 0x0114 ( 0x0004 ) 
	unsigned long                                      bAuction:1;                                       		// 0x0118 ( 0x0004 )  [0x00000001]
	int                                                iAuctionMaxPrice;                                 		// 0x011C ( 0x0004 ) 
	int                                                iAuctionMinPrice;                                 		// 0x0120 ( 0x0004 ) 
	struct FString                                     strDescription;                                   		// 0x0124 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                start_ammo;                                       		// 0x0130 ( 0x0004 ) 
	int                                                clip_size;                                        		// 0x0134 ( 0x0004 ) 
	unsigned char                                      ui_damage;                                        		// 0x0138 ( 0x0001 ) 
	unsigned char                                      ui_spread;                                        		// 0x0139 ( 0x0001 ) 
	unsigned char                                      ui_view_kick;                                     		// 0x013A ( 0x0001 ) 
	unsigned char                                      ui_rate_of_fire;                                  		// 0x013B ( 0x0001 ) 
	unsigned char                                      ui_move;                                          		// 0x013C ( 0x0001 ) 
	unsigned char                                      ui_range;                                         		// 0x013D ( 0x0001 ) 
	int                                                StartSellDate_Year;                               		// 0x0140 ( 0x0004 ) 
	unsigned char                                      StartSellDate_Month;                              		// 0x0144 ( 0x0001 ) 
	unsigned char                                      StartSellDate_Day;                                		// 0x0145 ( 0x0001 ) 
	unsigned char                                      StartSellDate_Hour;                               		// 0x0146 ( 0x0001 ) 
	unsigned char                                      StartSellDate_Min;                                		// 0x0147 ( 0x0001 ) 
	unsigned char                                      StartSellDate_Sec;                                		// 0x0148 ( 0x0001 ) 
	int                                                EndSellDate_Year;                                 		// 0x014C ( 0x0004 ) 
	unsigned char                                      EndSellDate_Month;                                		// 0x0150 ( 0x0001 ) 
	unsigned char                                      EndSellDate_Day;                                  		// 0x0151 ( 0x0001 ) 
	unsigned char                                      EndSellDate_Hour;                                 		// 0x0152 ( 0x0001 ) 
	unsigned char                                      EndSellDate_Min;                                  		// 0x0153 ( 0x0001 ) 
	unsigned char                                      EndSellDate_Sec;                                  		// 0x0154 ( 0x0001 ) 
	int                                                iResourceArrayIndex;                              		// 0x0158 ( 0x0004 ) 

	// Public Imports
	UwItemBaseParam(class UwItemBaseParam const &);
	UwItemBaseParam(void);
	class UwItemBaseParam &  operator=(class UwItemBaseParam const &);
	static void  InternalConstructor(void *);
	static class UClass *  StaticClass(void);

	// Private Imports
private:
	static class UClass PrivateStaticClass;
}; // Size: 0x0130

// Class Engine.wGameManager
class DLL_IMPORT UwGameManager : public UObject
{
public:
	class UGameEngine*                                 gEngine;                                          		// 0x002C ( 0x0004 ) 
	class TArray< class UwItemBaseParam* >             ItemParams;                                       		// 0x0030 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwItemResourceParam* >         ItemResParams;                                    		// 0x003C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwSkillBaseParam* >            SkillParams;                                      		// 0x0048 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwPartsGroupParam* >           AddPartsGroupParams;                              		// 0x0054 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwPaintGroupParam* >           PaintGroupParams;                                 		// 0x0060 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwPromotionParam* >            PromotionParams;                                  		// 0x006C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwQuestParam* >                QuestParams;                                      		// 0x0078 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwDailyQuestParam* >           DailyQuestParams;                                 		// 0x0084 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwRandBoxParam* >              RandBoxParams;                                    		// 0x0090 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwClanMarkParam* >             ClanMarkParams;                                   		// 0x009C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwItemBoxParam* >              ItemBoxParams;                                    		// 0x00A8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwMapInfo* >                   MapInfos;                                         		// 0x00B4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwModeDOAParam* >              ModeDOAParams;                                    		// 0x00C0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwLevelInfoParam* >            LevelInfoParams;                                  		// 0x00CC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwClanLevelInfoParam* >        ClanLevelInfoParams;                              		// 0x00D8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwWeaponCustomInfoParam* >     WeaponCustomInfoParams;                           		// 0x00E4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwWeaponCustomPartsParam* >    WeaponCustomPartsParams;                          		// 0x00F0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< int >                                LevelExps;                                        		// 0x00FC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     LevelImages;                                      		// 0x0108 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UMaterial* >                   LevelTextures;                                    		// 0x0114 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     ClanLevelImages;                                  		// 0x0120 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UMaterial* >                   ClanLevelTextures;                                		// 0x012C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwSkillBoxHK* >                SkillBoxList;                                     		// 0x0138 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwQuickSlotBoxHK* >            QuickSlotBoxList;                                 		// 0x0144 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwItemBoxHK* >                 UIShowItemLists;                                  		// 0x0150 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwItemBoxHK* >                 CandidateLists;                                   		// 0x015C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwItemBoxInstanceHK* >         InstanceItemLists;                                		// 0x0168 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     TotalLevelImages;                                 		// 0x0174 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FIntBox >                     TotalLevelImageCoordinates;                       		// 0x0180 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     BadWords;                                         		// 0x018C ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FString >                     BadNicks;                                         		// 0x0198 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< float >                              SupplyRandomArray;                                		// 0x01A4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwNPCSpawnParam* >             NPCSpawnParams;                                   		// 0x01B0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwNPCParam* >                  NPCParams;                                        		// 0x01BC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwNPCNameGroupParam* >         NPCNameGroupParams;                               		// 0x01C8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwNPCItemGroupParam* >         NPCItemGroupParams;                               		// 0x01D4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwNPCActionGroupParam* >       NPCActionGroupParams;                             		// 0x01E0 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwDefenceGameParam* >          DefenceGameParamsEasy;                            		// 0x01EC ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwDefenceGameParam* >          DefenceGameParamsNormal;                          		// 0x01F8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwDefenceGameParam* >          DefenceGameParamsHard;                            		// 0x0204 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< class UwDefenceGameParam* >          DefenceGameParamsVeryHard;                        		// 0x0210 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FSEAXEffect >                 EAXEffectList;                                    		// 0x021C ( 0x000C ) [ CPF_NeedCtorLink ]
	class UwGameManagerScriptPart*                     SP;                                               		// 0x0228 ( 0x0004 ) 
	struct FString                                     VoicePackageName;                                 		// 0x022C ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                LanguageType;                                     		// 0x0238 ( 0x0004 ) 
	int                                                TeamIndex;                                        		// 0x023C ( 0x0004 ) 
	unsigned long                                      bUseRagdoll:1;                                    		// 0x0240 ( 0x0004 )  [0x00000001]
	unsigned long                                      bUseGore:1;                                       		// 0x0240 ( 0x0004 )  [0x00000002]
	unsigned long                                      bUseMouseRevision:1;                              		// 0x0240 ( 0x0004 )  [0x00000004]
	unsigned long                                      bUseStanceToggle:1;                               		// 0x0240 ( 0x0004 )  [0x00000008]
	unsigned long                                      bUseAdvCamShake:1;                                		// 0x0240 ( 0x0004 )  [0x00000010]
	int                                                ShopItemListCount;                                		// 0x0244 ( 0x0004 ) 
	class TArray< int >                                ShopItemList;                                     		// 0x0248 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                FlagModify;                                       		// 0x0254 ( 0x0004 ) 
	int                                                FlagDurability;                                   		// 0x0258 ( 0x0004 ) 
	int                                                FlagRenew;                                        		// 0x025C ( 0x0004 ) 
	int                                                FlagCash;                                         		// 0x0260 ( 0x0004 ) 
	int                                                FlagPCBang;                                       		// 0x0264 ( 0x0004 ) 
	int                                                FlagSellShop;                                     		// 0x0268 ( 0x0004 ) 
	int                                                FlagBuyShop;                                      		// 0x026C ( 0x0004 ) 
	class UClanMarkManager*                            cmm;                                              		// 0x0270 ( 0x0004 ) 
	class TArray< struct FBtrDouble >                  kBlockedItemIdx;                                  		// 0x0274 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FBtrDouble                                  kServerTime;                                      		// 0x0280 ( 0x0008 ) 
	int                                                kClientMSec;                                      		// 0x0288 ( 0x0004 ) 
	struct FBtrDouble                                  kClientTime;                                      		// 0x028C ( 0x0008 ) 
	struct FBtrDouble                                  kDiffTime;                                        		// 0x0294 ( 0x0008 ) 
	unsigned long                                      bForceUpdateEventTimer:1;                         		// 0x029C ( 0x0004 )  [0x00000001]
	class TArray< struct FEventTimerStruct >           kEventTimerList;                                  		// 0x02A0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                kWebzenShopVer_Year;                              		// 0x02AC ( 0x0004 ) 
	int                                                kWebzenShopVer_YearID;                            		// 0x02B0 ( 0x0004 ) 
	int                                                kWebzenShopVer_SalesZoneCode;                     		// 0x02B4 ( 0x0004 ) 
	class TArray< struct FWebzenInven >                kWZInvenList;                                     		// 0x02B8 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FWebzenShopCategory >         kWZCategoryList;                                  		// 0x02C4 ( 0x000C ) [ CPF_NeedCtorLink ]
	class TArray< struct FWebzenShopPackage >          kWZPackageList;                                   		// 0x02D0 ( 0x000C ) [ CPF_NeedCtorLink ]
	int                                                GP20ShopVersion;                                  		// 0x02DC ( 0x0004 ) 
	class TArray< struct FGP20Product >                kGP20ProductList;                                 		// 0x02E0 ( 0x000C ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateServerTime__Delegate;                     		// 0x02EC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateWebzenShopVerInfo__Delegate;              		// 0x02F4 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateWebzenShopItemList__Delegate;             		// 0x02FC ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateItemList__Delegate;                       		// 0x0304 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateWebzenItemList__Delegate;                 		// 0x030C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateSkillBoxList__Delegate;                   		// 0x0314 ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __UpdateQuickSlotBoxList__Delegate;               		// 0x031C ( 0x0008 ) [ CPF_NeedCtorLink ]
	struct FScriptDelegate                             __dele_UpdateEventTimer__Delegate;                		// 0x0324 ( 0x0008 ) [ CPF_NeedCtorLink ]

	// UScript Functions
	 bool                      CheckSpCharItem ( int iItemType );                		//  Engine.wGameManager.CheckSpCharItem
	 bool                      CheckAccessoryItem ( int iItemType );             		//  Engine.wGameManager.CheckAccessoryItem
	 bool                      CheckFaceItem ( int iItemType );                  		//  Engine.wGameManager.CheckFaceItem
	 bool                      CheckHeadItem ( int iItemType );                  		//  Engine.wGameManager.CheckHeadItem
	 bool                      CheckThrowingWeapon ( int iItemType );            		//  Engine.wGameManager.CheckThrowingWeapon
