#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : Engine
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function Engine.wWeaponBaseParams.GetCrosshairType
// Flags: 
struct UwWeaponBaseParams_execGetCrosshairType_Parms
{
	struct FString                                     szValue;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ReturnValue;                                      		// 0x000C ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponBaseParams.GetReloadType
// Flags: 
struct UwWeaponBaseParams_execGetReloadType_Parms
{
	struct FString                                     szValue;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ReturnValue;                                      		// 0x000C ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponBaseParams.GetProjMoveType
// Flags: 
struct UwWeaponBaseParams_execGetProjMoveType_Parms
{
	struct FString                                     szValue;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ReturnValue;                                      		// 0x000C ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponBaseParams.GetBulletType
// Flags: 
struct UwWeaponBaseParams_execGetBulletType_Parms
{
	struct FString                                     szValue;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ReturnValue;                                      		// 0x000C ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponManager.PrecacheSound
// Flags: 
struct UwWeaponManager_execPrecacheSound_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function Engine.wWeaponManager.PrecacheMaterials
// Flags: 
struct UwWeaponManager_execPrecacheMaterials_Parms
{
	class ALevelInfo*                                  Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                lp1;                                              		// 0x0004 ( 0x0004
};

// Function Engine.wWeaponManager.PrecacheClasses
// Flags: 
struct UwWeaponManager_execPrecacheClasses_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function Engine.wWeaponManager.GetBaseParam
// Flags: [ FUNC_Event ]
struct UwWeaponManager_eventGetBaseParam_Parms
{
	int                                                id;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwWeaponBaseParams*                          ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                iLength;                                          		// 0x0008 ( 0x0004
//	int                                                iTemp;                                            		// 0x000C ( 0x0004
};

// Function Engine.wWeaponManager.LoadWeaponExParams
// Flags: 
struct UwWeaponManager_execLoadWeaponExParams_Parms
{
	class UBTNetExcelData*                             excel;                                            		// 0x0000 ( 0x0004
	int                                                iIndex;                                           		// 0x0004 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0008 ( 0x0004 [0x00000001]
	struct FString                                     strData;                                          		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wWeaponManager.AddParams
// Flags: 
struct UwWeaponManager_execAddParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwWeaponBaseParams*                          wParam;                                           		// 0x0004 ( 0x0004
	int                                                iIndex;                                           		// 0x0008 ( 0x0004
	int                                                iLength;                                          		// 0x000C ( 0x0004
	struct FString                                     strTemp;                                          		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wWeaponManager.LoadWeaponParams
// Flags: 
struct UwWeaponManager_execLoadWeaponParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function Engine.wWeaponManager.AddWeaponRecoilParams
// Flags: 
struct UwWeaponManager_execAddWeaponRecoilParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iIndex;                                           		// 0x0004 ( 0x0004
	struct FString                                     strTemp;                                          		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0014 ( 0x0004
	int                                                j;                                                		// 0x0018 ( 0x0004
	int                                                bounding_max;                                     		// 0x001C ( 0x0004
	int                                                ItemID;                                           		// 0x0020 ( 0x0004
	struct FString                                     strAim;                                           		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< struct FString >                     strForTrim;                                       		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wWeaponManager.LoadWeaponRecoilParams
// Flags: 
struct UwWeaponManager_execLoadWeaponRecoilParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function Engine.wWeaponManager.GetRes
// Flags: 
struct UwWeaponManager_execGetRes_Parms
{
	struct FString                                     szRes;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function Engine.wWeaponManager.InitWeaponPrecacheClasses
// Flags: [ FUNC_Event ]
struct UwWeaponManager_eventInitWeaponPrecacheClasses_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function Engine.wWeaponManager.LoadWeaponRes
// Flags: [ FUNC_Event ]
struct UwWeaponManager_eventLoadWeaponRes_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function Engine.wWeaponManager.DestroyScript
// Flags: [ FUNC_Event ]
struct UwWeaponManager_eventDestroyScript_Parms
{
};

// Function Engine.wWeaponManager.InitScript
// Flags: [ FUNC_Event ]
struct UwWeaponManager_eventInitScript_Parms
{
};

// Function Engine.ObjectPool.Shrink
// Flags: [ FUNC_Simulated ]
struct UObjectPool_execShrink_Parms
{
};

// Function Engine.ObjectPool.FreeObjectDupCheck
// Flags: [ FUNC_Simulated | FUNC_Native ]
struct UObjectPool_execFreeObjectDupCheck_Parms
{
	class UObject*                                     obj;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.ObjectPool.FreeObject
// Flags: [ FUNC_Simulated ]
struct UObjectPool_execFreeObject_Parms
{
	class UObject*                                     obj;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.ObjectPool.AllocateObject
// Flags: [ FUNC_Simulated ]
struct UObjectPool_execAllocateObject_Parms
{
	class UClass*                                      ObjectClass;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UObject*                                     Result;                                           		// 0x0008 ( 0x0004
};

// Function Engine.ObjectPool.PopObject
// Flags: [ FUNC_Simulated | FUNC_Native ]
struct UObjectPool_execPopObject_Parms
{
	class UClass*                                      ObjectClass;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UObject*                                     ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wAILevelBase.ClearReferences
// Flags: 
struct AwAILevelBase_execClearReferences_Parms
{
};

// Function Engine.wAILevelBase.KillBotsTeam
// Flags: 
struct AwAILevelBase_execKillBotsTeam_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                inTeam;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wAILevelBase.KillBots
// Flags: 
struct AwAILevelBase_execKillBots_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wAILevelBase.KillBot
// Flags: 
struct AwAILevelBase_execKillBot_Parms
{
	class AAIController*                               Bot;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wAILevelBase.Initialize
// Flags: 
struct AwAILevelBase_execInitialize_Parms
{
};

// Function Engine.Actor.OnEndRound
// Flags: 
struct AActor_execOnEndRound_Parms
{
};

// Function Engine.Actor.OnBeginRound
// Flags: 
struct AActor_execOnBeginRound_Parms
{
};

// Function Engine.Actor.SunLightDirectionUpdate
// Flags: [ FUNC_Event ]
struct AActor_eventSunLightDirectionUpdate_Parms
{
	struct FVector                                     direction;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function Engine.Actor.BlocksShotAt
// Flags: 
struct AActor_execBlocksShotAt_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PawnBaseDied
// Flags: 
struct AActor_execPawnBaseDied_Parms
{
};

// Function Engine.Actor.RecoverFromHostChange
// Flags: 
struct AActor_execRecoverFromHostChange_Parms
{
};

// Function Engine.Actor.GetAngleH
// Flags: 
struct AActor_execGetAngleH_Parms
{
	struct FVector                                     V;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetDotH
// Flags: 
struct AActor_execGetDotH_Parms
{
	struct FVector                                     V;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Dot;                                              		// 0x0010 ( 0x0004
//	struct FVector                                     X;                                                		// 0x0014 ( 0x000C
//	struct FVector                                     Y;                                                		// 0x0020 ( 0x000C
//	struct FVector                                     Z;                                                		// 0x002C ( 0x000C
//	struct FVector                                     Dir;                                              		// 0x0038 ( 0x000C
};

// Function Engine.Actor.IsStationary
// Flags: 
struct AActor_execIsStationary_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.InitBot
// Flags: 
struct AActor_execInitBot_Parms
{
	int                                                Grade;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.rpclog
// Flags: [ FUNC_Event ]
struct AActor_eventrpclog_Parms
{
	struct FString                                     rpc;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.dblog
// Flags: [ FUNC_Event ]
struct AActor_eventdblog_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.crlog
// Flags: 
struct AActor_execcrlog_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.clog
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AActor_eventclog_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.ctlog
// Flags: [ FUNC_Event ]
struct AActor_eventctlog_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.alllog
// Flags: [ FUNC_Event ]
struct AActor_eventalllog_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.NotifyLocalPlayerTeamReceived
// Flags: 
struct AActor_execNotifyLocalPlayerTeamReceived_Parms
{
};

// Function Engine.Actor.NotifyLocalPlayerDead
// Flags: 
struct AActor_execNotifyLocalPlayerDead_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.SetDelayedDamageInstigatorController
// Flags: 
struct AActor_execSetDelayedDamageInstigatorController_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.TeamLink
// Flags: 
struct AActor_execTeamLink_Parms
{
	int                                                TeamNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SelfTriggered
// Flags: 
struct AActor_execSelfTriggered_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.EffectIsRelevant
// Flags: [ FUNC_Simulated ]
struct AActor_execEffectIsRelevant_Parms
{
	struct FVector                                     SpawnLocation;                                    		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bForceDedicated:1;                                		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           P;                                                		// 0x0014 ( 0x0004
//	unsigned long                                      bResult:1;                                        		// 0x0018 ( 0x0004 [0x00000001]
};

// Function Engine.Actor.CheckMaxEffectDistance
// Flags: [ FUNC_Simulated ]
struct AActor_execCheckMaxEffectDistance_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     SpawnLocation;                                    		// 0x0004 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetOverlayMaterial
// Flags: [ FUNC_Simulated ]
struct AActor_execSetOverlayMaterial_Parms
{
	class UMaterial*                                   mat;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Time;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bOverride:1;                                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.Crash
// Flags: 
struct AActor_execCrash_Parms
{
};

// Function Engine.Actor.GetCollisionExtent
// Flags: 
struct AActor_execGetCollisionExtent_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     Extent;                                           		// 0x000C ( 0x000C
};

// Function Engine.Actor.CanSplash
// Flags: [ FUNC_Simulated ]
struct AActor_execCanSplash_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PlayTeleportEffect
// Flags: 
struct AActor_execPlayTeleportEffect_Parms
{
	unsigned long                                      bOut:1;                                           		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bSound:1;                                         		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.IsInPain
// Flags: 
struct AActor_execIsInPain_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APhysicsVolume*                              V;                                                		// 0x0004 ( 0x0004
};

// Function Engine.Actor.IsInVolume
// Flags: 
struct AActor_execIsInVolume_Parms
{
	class AVolume*                                     aVolume;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVolume*                                     V;                                                		// 0x0008 ( 0x0004
};

// Function Engine.Actor.UntriggerEvent
// Flags: 
struct AActor_execUntriggerEvent_Parms
{
	struct FName                                       EventName;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Other;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0008 ( 0x0004[ CPF_Parm ]
	class AActor*                                      A;                                                		// 0x000C ( 0x0004
	class ANavigationPoint*                            N;                                                		// 0x0010 ( 0x0004
};

// Function Engine.Actor.TriggerEvent
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AActor_eventTriggerEvent_Parms
{
	struct FName                                       EventName;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Other;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0008 ( 0x0004[ CPF_Parm ]
	class AActor*                                      A;                                                		// 0x000C ( 0x0004
	class ANavigationPoint*                            N;                                                		// 0x0010 ( 0x0004
};

// Function Engine.Actor.Reset
// Flags: 
struct AActor_execReset_Parms
{
};

// Function Engine.Actor.StartInterpolation
// Flags: [ FUNC_Simulated ]
struct AActor_execStartInterpolation_Parms
{
};

// Function Engine.Actor.TouchingActor
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct AActor_execTouchingActor_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     Dir;                                              		// 0x0008 ( 0x000C
};

// Function Engine.Actor.NearSpot
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct AActor_execNearSpot_Parms
{
	struct FVector                                     Spot;                                             		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     Dir;                                              		// 0x0010 ( 0x000C
};

// Function Engine.Actor.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct AActor_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FString                                     t;                                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	float                                              XL;                                               		// 0x0018 ( 0x0004
	int                                                i;                                                		// 0x001C ( 0x0004
	class AActor*                                      A;                                                		// 0x0020 ( 0x0004
	struct FName                                       Anim;                                             		// 0x0024 ( 0x0004
	float                                              frame;                                            		// 0x0028 ( 0x0004
	float                                              Rate;                                             		// 0x002C ( 0x0004
};

// Function Engine.Actor.GetDebugName
// Flags: 
struct AActor_execGetDebugName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.SetGRI
// Flags: 
struct AActor_execSetGRI_Parms
{
	class AGameReplicationInfo*                        GRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.MatchStarting
// Flags: 
struct AActor_execMatchStarting_Parms
{
};

// Function Engine.Actor.GetLocalString
// Flags: 
struct AActor_execGetLocalString_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.SetDefaultDisplayProperties
// Flags: 
struct AActor_execSetDefaultDisplayProperties_Parms
{
};

// Function Engine.Actor.SetDisplayProperties
// Flags: 
struct AActor_execSetDisplayProperties_Parms
{
	unsigned char                                      NewStyle;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	class UMaterial*                                   NewTexture;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bLighting:1;                                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.GetHumanReadableName
// Flags: [ FUNC_Simulated ]
struct AActor_execGetHumanReadableName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.POVChanged
// Flags: 
struct AActor_execPOVChanged_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bBehindViewChanged:1;                             		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.BecomeViewTarget
// Flags: 
struct AActor_execBecomeViewTarget_Parms
{
};

// Function Engine.Actor.TravelPostAccept
// Flags: [ FUNC_Event ]
struct AActor_eventTravelPostAccept_Parms
{
};

// Function Engine.Actor.TravelPreAccept
// Flags: [ FUNC_Event ]
struct AActor_eventTravelPreAccept_Parms
{
};

// Function Engine.Actor.CheckForErrors
// Flags: 
struct AActor_execCheckForErrors_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.HurtRadius
// Flags: [ FUNC_Simulated ]
struct AActor_execHurtRadius_Parms
{
	float                                              DamageAmount;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              DamageRadius;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              Momentum;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0010 ( 0x000C[ CPF_Parm ]
	class AActor*                                      Victims;                                          		// 0x001C ( 0x0004
	float                                              damageScale;                                      		// 0x0020 ( 0x0004
	float                                              dist;                                             		// 0x0024 ( 0x0004
	struct FVector                                     Dir;                                              		// 0x0028 ( 0x000C
};

// Function Engine.Actor.PrecacheAnnouncer
// Flags: [ FUNC_Simulated ]
struct AActor_execPrecacheAnnouncer_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.UpdateAnnouncements
// Flags: [ FUNC_Simulated ]
struct AActor_execUpdateAnnouncements_Parms
{
};

// Function Engine.Actor.UpdatePrecacheSkeletalMeshes
// Flags: [ FUNC_Simulated ]
struct AActor_execUpdatePrecacheSkeletalMeshes_Parms
{
};

// Function Engine.Actor.UpdatePrecacheStaticMeshes
// Flags: [ FUNC_Simulated ]
struct AActor_execUpdatePrecacheStaticMeshes_Parms
{
};

// Function Engine.Actor.UpdatePrecacheMaterials
// Flags: [ FUNC_Simulated ]
struct AActor_execUpdatePrecacheMaterials_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function Engine.Actor.PostNetBeginPlay
// Flags: [ FUNC_Event ]
struct AActor_eventPostNetBeginPlay_Parms
{
};

// Function Engine.Actor.SetGRIInitialState
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AActor_eventSetGRIInitialState_Parms
{
};

// Function Engine.Actor.SetInitialState
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AActor_eventSetInitialState_Parms
{
};

// Function Engine.Actor.PostBeginPlay
// Flags: [ FUNC_Event ]
struct AActor_eventPostBeginPlay_Parms
{
};

// Function Engine.Actor.BroadcastLocalizedMessage
// Flags: [ FUNC_Event ]
struct AActor_eventBroadcastLocalizedMessage_Parms
{
	class UClass*                                      MessageClass;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.ForceBegin
// Flags: 
struct AActor_execForceBegin_Parms
{
};

// Function Engine.Actor.PreBeginPlay
// Flags: [ FUNC_Event ]
struct AActor_eventPreBeginPlay_Parms
{
};

// Function Engine.Actor.RenderTexture
// Flags: [ FUNC_Event ]
struct AActor_eventRenderTexture_Parms
{
	class UScriptedTexture*                            Tex;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.RenderOverlays
// Flags: 
struct AActor_execRenderOverlays_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.RecoverFromBadStateCode
// Flags: [ FUNC_Event ]
struct AActor_eventRecoverFromBadStateCode_Parms
{
};

// Function Engine.Actor.Multiply_ColorFloat
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000228 ( 552 )
struct AActor_execMultiply_ColorFloat_Parms
{
	class FColor                                       A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              B;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.Add_ColorColor
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000227 ( 551 )
struct AActor_execAdd_ColorColor_Parms
{
	class FColor                                       A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class FColor                                       B;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.Multiply_FloatColor
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000226 ( 550 )
struct AActor_execMultiply_FloatColor_Parms
{
	float                                              A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class FColor                                       B;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.Subtract_ColorColor
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000225 ( 549 )
struct AActor_execSubtract_ColorColor_Parms
{
	class FColor                                       A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class FColor                                       B;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.IterateObjectArray
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execIterateObjectArray_Parms
{
	class TArray< class UObject* >                     ObjectArray;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      baseClass;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	class UObject*                                     Object;                                           		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.IterateActorArray
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execIterateActorArray_Parms
{
	class TArray< class AActor* >                      ActorArray;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UClass*                                      baseClass;                                        		// 0x000C ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FName                                       MatchTag;                                         		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.CollidingActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000141 ( 321 )
struct AActor_execCollidingActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              Radius;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     loc;                                              		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.VisibleCollidingActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000138 ( 312 )
struct AActor_execVisibleCollidingActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              Radius;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     loc;                                              		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bIgnoreHidden:1;                                  		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.VisibleActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000137 ( 311 )
struct AActor_execVisibleActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              Radius;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     loc;                                              		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.RadiusActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000136 ( 310 )
struct AActor_execRadiusActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              Radius;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     loc;                                              		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.TraceActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000135 ( 309 )
struct AActor_execTraceActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     HitLoc;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     HitNorm;                                          		// 0x0014 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     End;                                              		// 0x0020 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Start;                                            		// 0x002C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     Extent;                                           		// 0x0038 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.TouchingActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000133 ( 307 )
struct AActor_execTouchingActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.BasedActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000132 ( 306 )
struct AActor_execBasedActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.ChildActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000131 ( 305 )
struct AActor_execChildActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.DynamicActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000139 ( 313 )
struct AActor_execDynamicActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FName                                       MatchTag;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.AllActors
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000130 ( 304 )
struct AActor_execAllActors_Parms
{
	class UClass*                                      baseClass;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Actor;                                            		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FName                                       MatchTag;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.MoveCacheEntry
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execMoveCacheEntry_Parms
{
	struct FString                                     Guid;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     NewFilename;                                      		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetCacheEntry
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetCacheEntry_Parms
{
	int                                                Num;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Guid;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     fileName;                                         		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetAllIntDesc
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetAllIntDesc_Parms
{
	struct FString                                     MetaClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Entry;                                            		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Description;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.GetAllInt
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetAllInt_Parms
{
	struct FString                                     MetaClass;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< struct FString >                     Entries;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.GetNextIntDesc
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetNextIntDesc_Parms
{
	struct FString                                     ClassName;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Num;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     Entry;                                            		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     Description;                                      		// 0x001C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.GetNextInt
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetNextInt_Parms
{
	struct FString                                     ClassName;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Num;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.GetURLMap
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000223 ( 547 )
struct AActor_execGetURLMap_Parms
{
	unsigned long                                      bIncludeOptions:1;                                		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.GetNextSkin
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000221 ( 545 )
struct AActor_execGetNextSkin_Parms
{
	struct FString                                     Prefix;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     CurrentSkin;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Dir;                                              		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     SkinName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	struct FString                                     SkinDesc;                                         		// 0x0028 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.GetMapName
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x0000021B ( 539 )
struct AActor_execGetMapName_Parms
{
	struct FString                                     NameEnding;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     MapName;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Dir;                                              		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x001C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.AddToPackageMap
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAddToPackageMap_Parms
{
	struct FString                                     PackageName;                                      		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.ResetStaticFilterState
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execResetStaticFilterState_Parms
{
};

// Function Engine.Actor.BeginPlay
// Flags: [ FUNC_Event ]
struct AActor_eventBeginPlay_Parms
{
};

// Function Engine.Actor.PostTeleport
// Flags: [ FUNC_Event ]
struct AActor_eventPostTeleport_Parms
{
	class ATeleporter*                                 OutTeleporter;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.PreTeleport
// Flags: [ FUNC_Event ]
struct AActor_eventPreTeleport_Parms
{
	class ATeleporter*                                 InTeleporter;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SuggestFallVelocity
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSuggestFallVelocity_Parms
{
	struct FVector                                     Destination;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Start;                                            		// 0x000C ( 0x000C[ CPF_Parm ]
	float                                              MaxZ;                                             		// 0x0018 ( 0x0004[ CPF_Parm ]
	float                                              MaxXYSpeed;                                       		// 0x001C ( 0x0004[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0020 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PlayerCanSeeMe
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000214 ( 532 )
struct AActor_execPlayerCanSeeMe_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.MakeNoise
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000200 ( 512 )
struct AActor_execMakeNoise_Parms
{
	float                                              Loudness;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.ForceFeedbackSupported
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execForceFeedbackSupported_Parms
{
	unsigned long                                      Enable:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.ChangeBaseParamsFeedbackEffect
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000239 ( 569 )
struct AActor_execChangeBaseParamsFeedbackEffect_Parms
{
	struct FString                                     EffectName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              DirectionX;                                       		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              DirectionY;                                       		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Gain;                                             		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.ChangeSpringFeedbackEffect
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000238 ( 568 )
struct AActor_execChangeSpringFeedbackEffect_Parms
{
	struct FString                                     EffectName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              CenterX;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              CenterY;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.StopFeedbackEffect
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000237 ( 567 )
struct AActor_execStopFeedbackEffect_Parms
{
	struct FString                                     EffectName;                                       		// 0x0000 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.PlayFeedbackEffect
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000236 ( 566 )
struct AActor_execPlayFeedbackEffect_Parms
{
	struct FString                                     EffectName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.GetSoundDuration
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetSoundDuration_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.IsSoundPlayingHK
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execIsSoundPlayingHK_Parms
{
	int                                                SourceID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.StopSoundHK
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execStopSoundHK_Parms
{
	int                                                SourceID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.StopLoopSoundByActor
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execStopLoopSoundByActor_Parms
{
};

// Function Engine.Actor.StopAllSoundByActor
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execStopAllSoundByActor_Parms
{
};

// Function Engine.Actor.StopAllSound
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execStopAllSound_Parms
{
};

// Function Engine.Actor.StopSound
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execStopSound_Parms
{
	unsigned char                                      Slot;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.DemoPlaySound
// Flags: [ FUNC_Simulated | FUNC_Event | FUNC_Native ]
struct AActor_eventDemoPlaySound_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.PlayOwnedSound
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execPlayOwnedSound_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PlaySound
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000108 ( 264 )
struct AActor_execPlaySound_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SpecPlaySoundHK2
// Flags: [ FUNC_Native ]
struct AActor_execSpecPlaySoundHK2_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     SoundLocation;                                    		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0034 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PlaySoundHK2
// Flags: [ FUNC_Native ]
struct AActor_execPlaySoundHK2_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     SoundLocation;                                    		// 0x0028 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0034 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.ServerSpecPlaySoundHK
// Flags: 
struct AActor_execServerSpecPlaySoundHK_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SpecPlaySoundHK
// Flags: [ FUNC_Native ]
struct AActor_execSpecPlaySoundHK_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PlaySoundHK
// Flags: [ FUNC_Native ]
struct AActor_execPlaySoundHK_Parms
{
	class USound*                                      Sound;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Slot;                                             		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.fPlaySound
// Flags: [ FUNC_Native ]
struct AActor_execfPlaySound_Parms
{
	struct FString                                     fileName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Slot;                                             		// 0x000C ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoOverride:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Attenuate:1;                                      		// 0x0014 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      Loop:1;                                           		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                SellectTeam;                                      		// 0x001C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bExceptOwner:1;                                   		// 0x0020 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PostLoadSavedGame
// Flags: [ FUNC_Event ]
struct AActor_eventPostLoadSavedGame_Parms
{
};

// Function Engine.Actor.PreSaveGame
// Flags: [ FUNC_Event ]
struct AActor_eventPreSaveGame_Parms
{
};

// Function Engine.Actor.SetTimer
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000118 ( 280 )
struct AActor_execSetTimer_Parms
{
	float                                              NewTimerRate;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bLoop:1;                                          		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.TornOff
// Flags: [ FUNC_Event ]
struct AActor_eventTornOff_Parms
{
};

// Function Engine.Actor.Destroy
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000117 ( 279 )
struct AActor_execDestroy_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.Spawn
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000116 ( 278 )
struct AActor_execSpawn_Parms
{
	class UClass*                                      SpawnClass;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      SpawnOwner;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FName                                       SpawnTag;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     SpawnLocation;                                    		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	struct FRotator                                    SpawnRotation;                                    		// 0x0018 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bNoCollisionFail:1;                               		// 0x0024 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0028 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.TraceThisActorHitPart
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execTraceThisActorHitPart_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      HitCollisionPart;                                 		// 0x0018 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     TraceEnd;                                         		// 0x001C ( 0x000C[ CPF_Parm ]
	struct FVector                                     TraceStart;                                       		// 0x0028 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Extent;                                           		// 0x0034 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0040 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.TraceThisActor
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execTraceThisActor_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     TraceEnd;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	struct FVector                                     TraceStart;                                       		// 0x0024 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Extent;                                           		// 0x0030 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x003C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.FastTrace
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000224 ( 548 )
struct AActor_execFastTrace_Parms
{
	struct FVector                                     TraceEnd;                                         		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     TraceStart;                                       		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.MultiTrace
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execMultiTrace_Parms
{
	class UBtrTraceResult*                             BtrResult;                                        		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     TraceEnd;                                         		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     TraceStart;                                       		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bTraceActors:1;                                   		// 0x001C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bTraceMaterial:1;                                 		// 0x0020 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     Extent;                                           		// 0x0024 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.Trace
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000115 ( 277 )
struct AActor_execTrace_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     TraceEnd;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	struct FVector                                     TraceStart;                                       		// 0x0024 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bTraceActors:1;                                   		// 0x0030 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     Extent;                                           		// 0x0034 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	class UMaterial*                                   Material;                                         		// 0x0040 ( 0x0004[ CPF_OptionalParm | CPF_Parm | CPF_OutParm ]
	unsigned char                                      CollPart;                                         		// 0x0044 ( 0x0001[ CPF_OptionalParm | CPF_Parm | CPF_OutParm ]
	class AActor*                                      ReturnValue;                                      		// 0x0048 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetNameFromStr
// Flags: [ FUNC_Native ]
struct AActor_execGetNameFromStr_Parms
{
	struct FString                                     strName;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FName                                       retName;                                          		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.TakeHeadRoundBullet
// Flags: [ FUNC_Event ]
struct AActor_eventTakeHeadRoundBullet_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	int                                                WeaponType;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.HealDamage
// Flags: 
struct AActor_execHealDamage_Parms
{
	int                                                Amount;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Healer;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.TakeDamage
// Flags: [ FUNC_Event ]
struct AActor_eventTakeDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x0008 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0014 ( 0x000C[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0024 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                WeaponType;                                       		// 0x0028 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bWallShot:1;                                      		// 0x002C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.KilledBy
// Flags: [ FUNC_Event ]
struct AActor_eventKilledBy_Parms
{
	class APawn*                                       EventInstigator;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.FellOutOfWorld
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AActor_eventFellOutOfWorld_Parms
{
	unsigned char                                      KillType;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function Engine.Actor.UsedBy
// Flags: [ FUNC_Event ]
struct AActor_eventUsedBy_Parms
{
	class APawn*                                       User;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.EndedRotation
// Flags: [ FUNC_Event ]
struct AActor_eventEndedRotation_Parms
{
};

// Function Engine.Actor.FinishedInterpolation
// Flags: [ FUNC_Event ]
struct AActor_eventFinishedInterpolation_Parms
{
};

// Function Engine.Actor.RanInto
// Flags: [ FUNC_Event ]
struct AActor_eventRanInto_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.EncroachedBy
// Flags: [ FUNC_Event ]
struct AActor_eventEncroachedBy_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.EncroachingOn
// Flags: [ FUNC_Event ]
struct AActor_eventEncroachingOn_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SpecialHandling
// Flags: [ FUNC_Event ]
struct AActor_eventSpecialHandling_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.Detach
// Flags: [ FUNC_Event ]
struct AActor_eventDetach_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.Attach
// Flags: [ FUNC_Event ]
struct AActor_eventAttach_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.BaseChange
// Flags: [ FUNC_Event ]
struct AActor_eventBaseChange_Parms
{
};

// Function Engine.Actor.Bump
// Flags: [ FUNC_Event ]
struct AActor_eventBump_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.UnTouch
// Flags: [ FUNC_Event ]
struct AActor_eventUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.PostTouch
// Flags: [ FUNC_Event ]
struct AActor_eventPostTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.Touch
// Flags: [ FUNC_Event ]
struct AActor_eventTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.PhysicsVolumeChange
// Flags: [ FUNC_Event ]
struct AActor_eventPhysicsVolumeChange_Parms
{
	class APhysicsVolume*                              NewVolume;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.ZoneChange
// Flags: [ FUNC_Event ]
struct AActor_eventZoneChange_Parms
{
	class AZoneInfo*                                   NewZone;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.Landed
// Flags: [ FUNC_Event ]
struct AActor_eventLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function Engine.Actor.Falling
// Flags: [ FUNC_Event ]
struct AActor_eventFalling_Parms
{
};

// Function Engine.Actor.HitWall
// Flags: [ FUNC_Event ]
struct AActor_eventHitWall_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	class AActor*                                      HitWall;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	class UMaterial*                                   HitMaterial;                                      		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.Timer
// Flags: [ FUNC_Event ]
struct AActor_eventTimer_Parms
{
};

// Function Engine.Actor.TimerPop
// Flags: [ FUNC_Simulated ]
struct AActor_execTimerPop_Parms
{
	class AVolumeTimer*                                t;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.EndEvent
// Flags: [ FUNC_Event ]
struct AActor_eventEndEvent_Parms
{
};

// Function Engine.Actor.BeginEvent
// Flags: [ FUNC_Event ]
struct AActor_eventBeginEvent_Parms
{
};

// Function Engine.Actor.UnTrigger
// Flags: [ FUNC_Event ]
struct AActor_eventUnTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.Trigger
// Flags: [ FUNC_Event ]
struct AActor_eventTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.ClientTrigger
// Flags: [ FUNC_Event ]
struct AActor_eventClientTrigger_Parms
{
};

// Function Engine.Actor.PostNetReceive
// Flags: [ FUNC_Event ]
struct AActor_eventPostNetReceive_Parms
{
};

// Function Engine.Actor.Tick
// Flags: [ FUNC_Event ]
struct AActor_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.LostChild
// Flags: [ FUNC_Event ]
struct AActor_eventLostChild_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.GainedChild
// Flags: [ FUNC_Event ]
struct AActor_eventGainedChild_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.CheckLifeSpanReplicated
// Flags: [ FUNC_Simulated ]
struct AActor_execCheckLifeSpanReplicated_Parms
{
};

// Function Engine.Actor.RegisterDestroyListener
// Flags: 
struct AActor_execRegisterDestroyListener_Parms
{
	class UObject*                                     o;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.Destroyed
// Flags: [ FUNC_Event ]
struct AActor_eventDestroyed_Parms
{
	int                                                lp1;                                              		// 0x0000 ( 0x0004
};

// Function Engine.Actor.IsPenetrate
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execIsPenetrate_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetMusicDuration
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetMusicDuration_Parms
{
	int                                                SongHandle;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.StopAllMusicAndClearQueue
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execStopAllMusicAndClearQueue_Parms
{
	float                                              FadeOutTime;                                      		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.StopAllMusic
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execStopAllMusic_Parms
{
	float                                              FadeOutTime;                                      		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.StopMusic
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execStopMusic_Parms
{
	int                                                SongHandle;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              FadeOutTime;                                      		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.IsPlayingMusic
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execIsPlayingMusic_Parms
{
	int                                                SongHandle;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PlayMusic
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execPlayMusic_Parms
{
	struct FString                                     Song;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              FadeInTime;                                       		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              InitialSeekTime;                                  		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PauseStream
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execPauseStream_Parms
{
	int                                                Handle;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.AdjustVolume
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAdjustVolume_Parms
{
	int                                                Handle;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              NewVolume;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SeekStream
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSeekStream_Parms
{
	int                                                Handle;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Seconds;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.StopStream
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execStopStream_Parms
{
	int                                                Handle;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              FadeOutTime;                                      		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.PlayStream
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execPlayStream_Parms
{
	struct FString                                     Song;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      UseMusicVolume:1;                                 		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	float                                              Volume;                                           		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              FadeInTime;                                       		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              SeekTime;                                         		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x001C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.AllowMusicPlayback
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAllowMusicPlayback_Parms
{
	unsigned long                                      Allow:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.UnClock
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execUnClock_Parms
{
	float                                              Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.Clock
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execClock_Parms
{
	float                                              Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.KUpdateState
// Flags: [ FUNC_Event ]
struct AActor_eventKUpdateState_Parms
{
	struct FKRigidBodyState                            NewState;                                         		// 0x0000 ( 0x0034[ CPF_Parm | CPF_OutParm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KApplyForce
// Flags: [ FUNC_Event ]
struct AActor_eventKApplyForce_Parms
{
	struct FVector                                     Force;                                            		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     Torque;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.KSkelConvulse
// Flags: [ FUNC_Event ]
struct AActor_eventKSkelConvulse_Parms
{
};

// Function Engine.Actor.KVelDropBelow
// Flags: [ FUNC_Event ]
struct AActor_eventKVelDropBelow_Parms
{
};

// Function Engine.Actor.KImpact
// Flags: [ FUNC_Event ]
struct AActor_eventKImpact_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     pos;                                              		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     impactVel;                                        		// 0x0010 ( 0x000C[ CPF_Parm ]
	struct FVector                                     impactNorm;                                       		// 0x001C ( 0x000C[ CPF_Parm ]
};

// Function Engine.Actor.KIsRagdollAvailable
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKIsRagdollAvailable_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KMakeRagdollAvailable
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKMakeRagdollAvailable_Parms
{
};

// Function Engine.Actor.KRemoveAllBoneLifters
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKRemoveAllBoneLifters_Parms
{
};

// Function Engine.Actor.KRemoveLifterFromBone
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKRemoveLifterFromBone_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KAddBoneLifter
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKAddBoneLifter_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FInterpCurve                                LiftVel;                                          		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              LateralFriction;                                  		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FInterpCurve                                Softness;                                         		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.KScaleJointLimits
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKScaleJointLimits_Parms
{
	float                                              Scale;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              stiffness;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KFreezeRagdoll
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKFreezeRagdoll_Parms
{
};

// Function Engine.Actor.KGetSkelMass
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetSkelMass_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KSetSkelVel
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetSkelVel_Parms
{
	struct FVector                                     Velocity;                                         		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     AngVelocity;                                      		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      AddToCurrent:1;                                   		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.KEnableCollision
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKEnableCollision_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KDisableCollision
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKDisableCollision_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KGetActorGravScale
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetActorGravScale_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KSetActorGravScale
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetActorGravScale_Parms
{
	float                                              ActorGravScale;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KSetBlockKarma
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetBlockKarma_Parms
{
	unsigned long                                      newBlock:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.KSetStayUprightParams
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetStayUprightParams_Parms
{
	float                                              stiffness;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              damping;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KSetStayUpright
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetStayUpright_Parms
{
	unsigned long                                      stayUpright:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      allowRotate:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.KAddAngularImpulse
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKAddAngularImpulse_Parms
{
	struct FVector                                     AngImpulse;                                       		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function Engine.Actor.KAddImpulse
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKAddImpulse_Parms
{
	struct FVector                                     Impulse;                                          		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Position;                                         		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0018 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.KIsAwake
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKIsAwake_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KWake
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKWake_Parms
{
};

// Function Engine.Actor.KGetImpactThreshold
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetImpactThreshold_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KSetImpactThreshold
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetImpactThreshold_Parms
{
	float                                              thresh;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KGetCOMPosition
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetCOMPosition_Parms
{
	struct FVector                                     pos;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.KGetCOMOffset
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetCOMOffset_Parms
{
	struct FVector                                     offset;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.KSetCOMOffset
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetCOMOffset_Parms
{
	struct FVector                                     offset;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function Engine.Actor.KGetRestitution
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetRestitution_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KSetRestitution
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetRestitution_Parms
{
	float                                              rest;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KGetFriction
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetFriction_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KSetFriction
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetFriction_Parms
{
	float                                              friction;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KGetDampingProps
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetDampingProps_Parms
{
	float                                              lindamp;                                          		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              angdamp;                                          		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.KSetDampingProps
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetDampingProps_Parms
{
	float                                              lindamp;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              angdamp;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KGetInertiaTensor
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetInertiaTensor_Parms
{
	struct FVector                                     it1;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     it2;                                              		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.KSetInertiaTensor
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetInertiaTensor_Parms
{
	struct FVector                                     it1;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     it2;                                              		// 0x000C ( 0x000C[ CPF_Parm ]
};

// Function Engine.Actor.KGetMass
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetMass_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KSetMass
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetMass_Parms
{
	float                                              Mass;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.KRBVecFromVector
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKRBVecFromVector_Parms
{
	struct FVector                                     V;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FKRBVec                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KRBVecToVector
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKRBVecToVector_Parms
{
	struct FKRBVec                                     RBvec;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KDrawRigidBodyState
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKDrawRigidBodyState_Parms
{
	struct FKRigidBodyState                            RBstate;                                          		// 0x0000 ( 0x0034[ CPF_Parm ]
	unsigned long                                      AltColour:1;                                      		// 0x0034 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.KGetRigidBodyState
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetRigidBodyState_Parms
{
	struct FKRigidBodyState                            RBstate;                                          		// 0x0000 ( 0x0034[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.KGetRBQuaternion
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetRBQuaternion_Parms
{
	struct FQuat                                       ReturnValue;                                      		// 0x0000 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.KSetSimParams
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKSetSimParams_Parms
{
	struct FKSimParams                                 SimParams;                                        		// 0x0000 ( 0x001C[ CPF_Parm ]
};

// Function Engine.Actor.KGetSimParams
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execKGetSimParams_Parms
{
	struct FKSimParams                                 SimParams;                                        		// 0x0000 ( 0x001C[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.OnlyAffectPawns
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execOnlyAffectPawns_Parms
{
	unsigned long                                      B:1;                                              		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.SetPhysics
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000F82 ( 3970 )
struct AActor_execSetPhysics_Parms
{
	unsigned char                                      newPhysics;                                       		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function Engine.Actor.FinishInterpolation
// Flags: [ FUNC_Final | FUNC_Latent | FUNC_Native ]
// iNative: 0x0000012D ( 301 )
struct AActor_execFinishInterpolation_Parms
{
};

// Function Engine.Actor.DebugUnclock
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execDebugUnclock_Parms
{
};

// Function Engine.Actor.DebugClock
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execDebugClock_Parms
{
};

// Function Engine.Actor.ClearStayingDebugLines
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execClearStayingDebugLines_Parms
{
};

// Function Engine.Actor.DrawDebugSphere
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execDrawDebugSphere_Parms
{
	struct FVector                                     Base;                                             		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              Radius;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                NumDivisions;                                     		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned char                                      R;                                                		// 0x0014 ( 0x0001[ CPF_Parm ]
	unsigned char                                      G;                                                		// 0x0015 ( 0x0001[ CPF_Parm ]
	unsigned char                                      B;                                                		// 0x0016 ( 0x0001[ CPF_Parm ]
};

// Function Engine.Actor.DrawDebugCircle
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execDrawDebugCircle_Parms
{
	struct FVector                                     Base;                                             		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     X;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Y;                                                		// 0x0018 ( 0x000C[ CPF_Parm ]
	float                                              Radius;                                           		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                NumSides;                                         		// 0x0028 ( 0x0004[ CPF_Parm ]
	unsigned char                                      R;                                                		// 0x002C ( 0x0001[ CPF_Parm ]
	unsigned char                                      G;                                                		// 0x002D ( 0x0001[ CPF_Parm ]
	unsigned char                                      B;                                                		// 0x002E ( 0x0001[ CPF_Parm ]
};

// Function Engine.Actor.DrawStayingDebugLine
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execDrawStayingDebugLine_Parms
{
	struct FVector                                     LineStart;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     LineEnd;                                          		// 0x000C ( 0x000C[ CPF_Parm ]
	unsigned char                                      R;                                                		// 0x0018 ( 0x0001[ CPF_Parm ]
	unsigned char                                      G;                                                		// 0x0019 ( 0x0001[ CPF_Parm ]
	unsigned char                                      B;                                                		// 0x001A ( 0x0001[ CPF_Parm ]
};

// Function Engine.Actor.DrawDebugLine
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execDrawDebugLine_Parms
{
	struct FVector                                     LineStart;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     LineEnd;                                          		// 0x000C ( 0x000C[ CPF_Parm ]
	unsigned char                                      R;                                                		// 0x0018 ( 0x0001[ CPF_Parm ]
	unsigned char                                      G;                                                		// 0x0019 ( 0x0001[ CPF_Parm ]
	unsigned char                                      B;                                                		// 0x001A ( 0x0001[ CPF_Parm ]
};

// Function Engine.Actor.GetRenderBoundingSphere
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetRenderBoundingSphere_Parms
{
	struct FPlane                                      ReturnValue;                                      		// 0x0000 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetUrlOption
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetUrlOption_Parms
{
	struct FString                                     Option;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.UpdateURL
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execUpdateURL_Parms
{
	struct FString                                     NewOption;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     NewValue;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bSaveDefault:1;                                   		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.Actor.GetClosestBone
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetClosestBone_Parms
{
	struct FVector                                     loc;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ray;                                              		// 0x000C ( 0x000C[ CPF_Parm ]
	float                                              boneDist;                                         		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	struct FName                                       BiasBone;                                         		// 0x001C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              BiasDistance;                                     		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FName                                       ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.AnimIsInGroup
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAnimIsInGroup_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       GroupName;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetAnimParams
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetAnimParams_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       OutSeqName;                                       		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              OutAnimFrame;                                     		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              OutAnimRate;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.Actor.SetBoneRotation
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execSetBoneRotation_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    BoneTurn;                                         		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	int                                                Space;                                            		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Alpha;                                            		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.SetBoneLocation
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetBoneLocation_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     BoneTrans;                                        		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	float                                              Alpha;                                            		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.SetBoneDirection
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetBoneDirection_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    BoneTurn;                                         		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     BoneTrans;                                        		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	float                                              Alpha;                                            		// 0x001C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                Space;                                            		// 0x0020 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.SetBoneScale
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetBoneScale_Parms
{
	int                                                Slot;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              BoneScale;                                        		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.LockRootMotion
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execLockRootMotion_Parms
{
	int                                                Lock;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.DetachFromBone
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execDetachFromBone_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.AttachToBone
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAttachToBone_Parms
{
	class AActor*                                      Attachment;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetRootRotationDelta
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetRootRotationDelta_Parms
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetRootLocationDelta
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetRootLocationDelta_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetRootRotation
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetRootRotation_Parms
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetRootLocation
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetRootLocation_Parms
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetBoneRotation
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetBoneRotation_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Space;                                            		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FRotator                                    ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetBoneCoords
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetBoneCoords_Parms
{
	struct FName                                       BoneName;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FCoords                                     ReturnValue;                                      		// 0x0004 ( 0x0030[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.AnimBlendToAlpha
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAnimBlendToAlpha_Parms
{
	int                                                Stage;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              TargetAlpha;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              TimeInterval;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.AnimBlendParams
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAnimBlendParams_Parms
{
	int                                                Stage;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              BlendAlpha;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              InTime;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              OutTime;                                          		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FName                                       BoneName;                                         		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bGlobalPose:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.BoneRefresh
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execBoneRefresh_Parms
{
};

// Function Engine.Actor.LinkMesh
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execLinkMesh_Parms
{
	class UMesh*                                       NewMesh;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bKeepAnim:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.LinkSkelAnim
// Flags: [ FUNC_Final | FUNC_Simulated | FUNC_Native ]
struct AActor_execLinkSkelAnim_Parms
{
	class UMeshAnimation*                              Anim;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UMesh*                                       NewMesh;                                          		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.GetNotifyChannel
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetNotifyChannel_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.EnableChannelNotify
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execEnableChannelNotify_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.AnimEnd
// Flags: [ FUNC_Event ]
struct AActor_eventAnimEnd_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.LIPSincAnimEnd
// Flags: [ FUNC_Event ]
struct AActor_eventLIPSincAnimEnd_Parms
{
};

// Function Engine.Actor.CurrentLIPSincAnim
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execCurrentLIPSincAnim_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.IsPlayingLIPSincAnim
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execIsPlayingLIPSincAnim_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.HasLIPSincAnim
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execHasLIPSincAnim_Parms
{
	struct FName                                       LIPSincAnimName;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.StopLIPSincAnim
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execStopLIPSincAnim_Parms
{
};

// Function Engine.Actor.PlayLIPSincAnim
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execPlayLIPSincAnim_Parms
{
	struct FName                                       LIPSincAnimName;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Volume;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Radius;                                           		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              Pitch;                                            		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.AnimStopLooping
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execAnimStopLooping_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.IsTweening
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execIsTweening_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetAnimFrame
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetAnimFrame_Parms
{
	float                                              Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Channel;                                          		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                UnitFlag;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.FreezeAnimAt
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execFreezeAnimAt_Parms
{
	float                                              Time;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Channel;                                          		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.StopAnimating
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execStopAnimating_Parms
{
	unsigned long                                      ClearAllButBase:1;                                		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.HasAnim
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000107 ( 263 )
struct AActor_execHasAnim_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.FinishAnim
// Flags: [ FUNC_Final | FUNC_Latent | FUNC_Native ]
// iNative: 0x00000105 ( 261 )
struct AActor_execFinishAnim_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.IsAnimating
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x0000011A ( 282 )
struct AActor_execIsAnimating_Parms
{
	int                                                Channel;                                          		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.TweenAnim
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000126 ( 294 )
struct AActor_execTweenAnim_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Time;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Channel;                                          		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.LoopAnim
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000104 ( 260 )
struct AActor_execLoopAnim_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Rate;                                             		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              TweenTime;                                        		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                Channel;                                          		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.PlayAnim
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000103 ( 259 )
struct AActor_execPlayAnim_Parms
{
	struct FName                                       Sequence;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Rate;                                             		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	float                                              TweenTime;                                        		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                Channel;                                          		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.GetMeshName
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execGetMeshName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.IsJoinedTo
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execIsJoinedTo_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetOwner
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000110 ( 272 )
struct AActor_execSetOwner_Parms
{
	class AActor*                                      NewOwner;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.SetBase
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x0000012A ( 298 )
struct AActor_execSetBase_Parms
{
	class AActor*                                      NewBase;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     NewFloor;                                         		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.SetBaseMaterial
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetBaseMaterial_Parms
{
	class UMaterial*                                   NewBaseMaterial;                                  		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.AutonomousPhysics
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000F83 ( 3971 )
struct AActor_execAutonomousPhysics_Parms
{
	float                                              DeltaSeconds;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.MoveSmooth
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000F81 ( 3969 )
struct AActor_execMoveSmooth_Parms
{
	struct FVector                                     Delta;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      TestCollide:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetRelativeLocation
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetRelativeLocation_Parms
{
	struct FVector                                     NewLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetRelativeRotation
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetRelativeRotation_Parms
{
	struct FRotator                                    NewRotation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetRotation
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x0000012B ( 299 )
struct AActor_execSetRotation_Parms
{
	struct FRotator                                    NewRotation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetLocation
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x0000010B ( 267 )
struct AActor_execSetLocation_Parms
{
	struct FVector                                     NewLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.Move
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x0000010A ( 266 )
struct AActor_execMove_Parms
{
	struct FVector                                     Delta;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetDrawType
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetDrawType_Parms
{
	unsigned char                                      NewDrawType;                                      		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function Engine.Actor.SetStaticMesh
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetStaticMesh_Parms
{
	class UStaticMesh*                                 NewStaticMesh;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.SetDrawScale3D
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetDrawScale3D_Parms
{
	struct FVector                                     NewScale3D;                                       		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function Engine.Actor.SetDrawScale
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execSetDrawScale_Parms
{
	float                                              NewScale;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.SetCollisionSize
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x0000011B ( 283 )
struct AActor_execSetCollisionSize_Parms
{
	float                                              NewRadius;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              NewHeight;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.SetCollision
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x00000106 ( 262 )
struct AActor_execSetCollision_Parms
{
	unsigned long                                      NewColActors:1;                                   		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      NewBlockActors:1;                                 		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      NewBlockPlayers:1;                                		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.Actor.Sleep
// Flags: [ FUNC_Final | FUNC_Latent | FUNC_Native ]
// iNative: 0x00000100 ( 256 )
struct AActor_execSleep_Parms
{
	float                                              Seconds;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.ShouldBeHidden
// Flags: [ FUNC_Final | FUNC_Native ]
struct AActor_execShouldBeHidden_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.Actor.Error
// Flags: [ FUNC_Final | FUNC_Native ]
// iNative: 0x000000E9 ( 233 )
struct AActor_execError_Parms
{
	struct FString                                     S;                                                		// 0x0000 ( 0x000C[ CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink ]
};

// Function Engine.Actor.TextToSpeech
// Flags: [ FUNC_Native ]
struct AActor_execTextToSpeech_Parms
{
	struct FString                                     Text;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              Volume;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.CopyObjectToClipboard
// Flags: [ FUNC_Native ]
struct AActor_execCopyObjectToClipboard_Parms
{
	class UObject*                                     obj;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.Actor.ConsoleCommand
// Flags: [ FUNC_Native ]
struct AActor_execConsoleCommand_Parms
{
	struct FString                                     Command;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bWriteToLog:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.SendUpdateUserPerformenceInfo
// Flags: 
struct UwMatchMaker_execSendUpdateUserPerformenceInfo_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MinFps;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MaxFps;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                AvgFps;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                MinPing;                                          		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                MaxPing;                                          		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                AvgPing;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.SetLastBuyItemInfo
// Flags: 
struct UwMatchMaker_execSetLastBuyItemInfo_Parms
{
	struct FString                                     ItemName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ItemType;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ItemGrade;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.IsPCBangItem
// Flags: 
struct UwMatchMaker_execIsPCBangItem_Parms
{
	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.CheckUsingItem
// Flags: 
struct UwMatchMaker_execCheckUsingItem_Parms
{
	class UwItemBoxHK*                                 ItemInfo;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.IsPlayingPCBangPlus
// Flags: 
struct UwMatchMaker_execIsPlayingPCBangPlus_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.IsPlayingPCBang
// Flags: 
struct UwMatchMaker_execIsPlayingPCBang_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetAASLevel
// Flags: 
struct UwMatchMaker_execSetAASLevel_Parms
{
	unsigned char                                      _level;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function Engine.wMatchMaker.GetIsAASLevel
// Flags: 
struct UwMatchMaker_execGetIsAASLevel_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.IsSDRespawn
// Flags: 
struct UwMatchMaker_execIsSDRespawn_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwMapInfo*                                   mapInfo;                                          		// 0x0004 ( 0x0004
};

// Function Engine.wMatchMaker.IsFriendlyUser
// Flags: 
struct UwMatchMaker_execIsFriendlyUser_Parms
{
	struct FString                                     CharName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ClanName;                                         		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x001C ( 0x0004
};

// Function Engine.wMatchMaker.IsBlockUser
// Flags: 
struct UwMatchMaker_execIsBlockUser_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.UpdateBlockList
// Flags: 
struct UwMatchMaker_execUpdateBlockList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdatePCBangList
// Flags: 
struct UwMatchMaker_execUpdatePCBangList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateClanList
// Flags: 
struct UwMatchMaker_execUpdateClanList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateFriendList
// Flags: 
struct UwMatchMaker_execUpdateFriendList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ReplaceBlockNickName
// Flags: 
struct UwMatchMaker_execReplaceBlockNickName_Parms
{
	struct FString                                     old_name;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     new_name;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x0018 ( 0x0004
};

// Function Engine.wMatchMaker.AddBlockList
// Flags: 
struct UwMatchMaker_execAddBlockList_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Last;                                             		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.SetBlockListCount
// Flags: 
struct UwMatchMaker_execSetBlockListCount_Parms
{
	int                                                cnt;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ClearBlockList
// Flags: 
struct UwMatchMaker_execClearBlockList_Parms
{
};

// Function Engine.wMatchMaker.AddClanList
// Flags: 
struct UwMatchMaker_execAddClanList_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsLogOn;                                          		// 0x000C ( 0x0001[ CPF_Parm ]
	int                                                Level;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ClanWin;                                          		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                ClanLose;                                         		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0020 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                Last;                                             		// 0x0028 ( 0x0004
};

// Function Engine.wMatchMaker.SetClanListCount
// Flags: 
struct UwMatchMaker_execSetClanListCount_Parms
{
	int                                                cnt;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ClearClanList
// Flags: 
struct UwMatchMaker_execClearClanList_Parms
{
};

// Function Engine.wMatchMaker.AddPCBangList2
// Flags: 
struct UwMatchMaker_execAddPCBangList2_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsLogOn;                                          		// 0x000C ( 0x0001[ CPF_Parm ]
	int                                                ClanMark;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0028 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x002C ( 0x0004[ CPF_Parm ]
	int                                                ClanWin;                                          		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                ClanLose;                                         		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                IsLookForClan;                                    		// 0x0038 ( 0x0004[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x003C ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0040 ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0044 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x0048 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                Last;                                             		// 0x0054 ( 0x0004
};

// Function Engine.wMatchMaker.AddPCBangList
// Flags: 
struct UwMatchMaker_execAddPCBangList_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ClanMark;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0024 ( 0x0004[ CPF_Parm ]
	struct FString                                     ServerName;                                       		// 0x0028 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ServerShortName;                                  		// 0x0034 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ServerIP;                                         		// 0x0040 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                serverPort;                                       		// 0x004C ( 0x0004[ CPF_Parm ]
	int                                                CurPos;                                           		// 0x0050 ( 0x0004[ CPF_Parm ]
	int                                                ChannelNum;                                       		// 0x0054 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelNickName;                                  		// 0x0058 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                RoomNum;                                          		// 0x0064 ( 0x0004[ CPF_Parm ]
	int                                                ClanGrade;                                        		// 0x0068 ( 0x0004[ CPF_Parm ]
	int                                                ClanWin;                                          		// 0x006C ( 0x0004[ CPF_Parm ]
	int                                                ClanLose;                                         		// 0x0070 ( 0x0004[ CPF_Parm ]
	int                                                IsLookForClan;                                    		// 0x0074 ( 0x0004[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0078 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x007C ( 0x0004[ CPF_Parm ]
	int                                                TitleMarkID;                                      		// 0x0080 ( 0x0004[ CPF_Parm ]
	int                                                Reserved1;                                        		// 0x0084 ( 0x0004[ CPF_Parm ]
	int                                                Reserved2;                                        		// 0x0088 ( 0x0004[ CPF_Parm ]
	int                                                Reserved3;                                        		// 0x008C ( 0x0004[ CPF_Parm ]
	int                                                Last;                                             		// 0x0090 ( 0x0004
};

// Function Engine.wMatchMaker.RemovePCBangList
// Flags: 
struct UwMatchMaker_execRemovePCBangList_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.SetPCBangListCount
// Flags: 
struct UwMatchMaker_execSetPCBangListCount_Parms
{
	int                                                cnt;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ClearPCBangList
// Flags: 
struct UwMatchMaker_execClearPCBangList_Parms
{
};

// Function Engine.wMatchMaker.AddFriendList
// Flags: 
struct UwMatchMaker_execAddFriendList_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      IsLogOn;                                          		// 0x000C ( 0x0001[ CPF_Parm ]
	int                                                ClanMark;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                ClanBG;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                ClanBL;                                           		// 0x0018 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClanName;                                         		// 0x001C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                Level;                                            		// 0x0028 ( 0x0004[ CPF_Parm ]
	unsigned char                                      IsLookForClan;                                    		// 0x002C ( 0x0001[ CPF_Parm ]
	int                                                ClanLevel;                                        		// 0x0030 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0034 ( 0x0004[ CPF_Parm ]
	int                                                Last;                                             		// 0x0038 ( 0x0004
};

// Function Engine.wMatchMaker.SetFriendListCount
// Flags: 
struct UwMatchMaker_execSetFriendListCount_Parms
{
	int                                                cnt;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ClearFriendList
// Flags: 
struct UwMatchMaker_execClearFriendList_Parms
{
};

// Function Engine.wMatchMaker.IsDisconnectedUser
// Flags: 
struct UwMatchMaker_execIsDisconnectedUser_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetDisconnectedUser
// Flags: 
struct UwMatchMaker_execSetDisconnectedUser_Parms
{
	unsigned long                                      bSet:1;                                           		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                UserID;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.wMatchMaker.GetHostPoint
// Flags: 
struct UwMatchMaker_execGetHostPoint_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.CalculateHostPoint
// Flags: 
struct UwMatchMaker_execCalculateHostPoint_Parms
{
	unsigned long                                      bInGame:1;                                        		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                iPingPoint;                                       		// 0x0008 ( 0x0004
//	int                                                iFPSPoint;                                        		// 0x000C ( 0x0004
//	float                                              fPingPerSec;                                      		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.ReceivedPing
// Flags: 
struct UwMatchMaker_execReceivedPing_Parms
{
	struct FString                                     fromAddr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                msec;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0014 ( 0x0004
//	int                                                iUserCount;                                       		// 0x0018 ( 0x0004
//	int                                                iSumPing;                                         		// 0x001C ( 0x0004
//	int                                                nResult;                                          		// 0x0020 ( 0x0004
//	class UwMatchUserInfo*                             kUserInfo;                                        		// 0x0024 ( 0x0004
};

// Function Engine.wMatchMaker.OnRecivedPing
// Flags: 
struct UwMatchMaker_execOnRecivedPing_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     fromAddr;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                msec;                                             		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ReceivedPingHK
// Flags: 
struct UwMatchMaker_execReceivedPingHK_Parms
{
	struct FString                                     fromAddr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                msec;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.ClearReceivedPingHK
// Flags: 
struct UwMatchMaker_execClearReceivedPingHK_Parms
{
};

// Function Engine.wMatchMaker.GetLastestPingValue
// Flags: 
struct UwMatchMaker_execGetLastestPingValue_Parms
{
	struct FString                                     fromAddr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.SendPingHK
// Flags: 
struct UwMatchMaker_execSendPingHK_Parms
{
	struct FString                                     fromAddr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.SendPingToClient
// Flags: 
struct UwMatchMaker_execSendPingToClient_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
	class UwMatchUserInfo*                             kUserInfo;                                        		// 0x0004 ( 0x0004
};

// Function Engine.wMatchMaker.DrawOtherLoadingState
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventDrawOtherLoadingState_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      bLoadingState;                                    		// 0x0004 ( 0x0001[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
	struct FString                                     OtherUserName;                                    		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	struct FLoadingMessageItem                         Item;                                             		// 0x0018 ( 0x001C[ CPF_NeedCtorLink ]
	unsigned long                                      bHost:1;                                          		// 0x0034 ( 0x0004 [0x00000001]
};

// Function Engine.wMatchMaker.OnReqSuccessStartGame
// Flags: 
struct UwMatchMaker_execOnReqSuccessStartGame_Parms
{
	int                                                Step;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ReqSuccessStartGame
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventReqSuccessStartGame_Parms
{
	int                                                Step;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.GetItemDurabilityInfo
// Flags: 
struct UwMatchMaker_execGetItemDurabilityInfo_Parms
{
	class TArray< int >                                OwnerID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< int >                                PlayedNumber;                                     		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< int >                                PlayedRound;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< struct FBtrDouble >                  UniqueItemID;                                     		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< int >                                UsingTime;                                        		// 0x0030 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< int >                                PlayedCount;                                      		// 0x003C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0048 ( 0x0004
	int                                                j;                                                		// 0x004C ( 0x0004
	int                                                k;                                                		// 0x0050 ( 0x0004
	int                                                iTemp;                                            		// 0x0054 ( 0x0004
	class UwMatchUserInfo*                             kUser;                                            		// 0x0058 ( 0x0004
	unsigned long                                      bFind:1;                                          		// 0x005C ( 0x0004 [0x00000001]
};

// Function Engine.wMatchMaker.ForceGameOver
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventForceGameOver_Parms
{
	class APlayerReplicationInfo*                      Winner;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ProcessPendingChangeNewHostOrChangeNewGuest
// Flags: 
struct UwMatchMaker_execProcessPendingChangeNewHostOrChangeNewGuest_Parms
{
};

// Function Engine.wMatchMaker.PendingChangeNewGuest
// Flags: 
struct UwMatchMaker_execPendingChangeNewGuest_Parms
{
	struct FString                                     hostAddress;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.PendingChangeHost
// Flags: 
struct UwMatchMaker_execPendingChangeHost_Parms
{
	int                                                ClientNum;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.SetChangeHostMessageFlag
// Flags: 
struct UwMatchMaker_execSetChangeHostMessageFlag_Parms
{
};

// Function Engine.wMatchMaker.ChangeNewGuest
// Flags: 
struct UwMatchMaker_execChangeNewGuest_Parms
{
	struct FString                                     HostIP;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ChangeHost
// Flags: 
struct UwMatchMaker_execChangeHost_Parms
{
	int                                                ClientNum;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetChangingHostFlag
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventSetChangingHostFlag_Parms
{
	unsigned long                                      flag:1;                                           		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.wMatchMaker.ResetChangingHostGuest
// Flags: 
struct UwMatchMaker_execResetChangingHostGuest_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.IsLoading
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventIsLoading_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.EndLoading
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventEndLoading_Parms
{
};

// Function Engine.wMatchMaker.StartLoading
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventStartLoading_Parms
{
};

// Function Engine.wMatchMaker.GetMiniMapInfoImage
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventGetMiniMapInfoImage_Parms
{
	class UMaterial*                                   ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                ImageIndex;                                       		// 0x0004 ( 0x0004
};

// Function Engine.wMatchMaker.GetLoadingImage
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventGetLoadingImage_Parms
{
	class UMaterial*                                   ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     resourceName;                                     		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.InitializeMapSettings_DS_Server
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventInitializeMapSettings_DS_Server_Parms
{
};

// Function Engine.wMatchMaker.InitializeMapSettings
// Flags: 
struct UwMatchMaker_execInitializeMapSettings_Parms
{
};

// Function Engine.wMatchMaker.ClearConsole
// Flags: 
struct UwMatchMaker_execClearConsole_Parms
{
};

// Function Engine.wMatchMaker.EndMatch
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventEndMatch_Parms
{
	unsigned long                                      bForceEndMatch:1;                                 		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.wMatchMaker.ResetGameFlag
// Flags: 
struct UwMatchMaker_execResetGameFlag_Parms
{
};

// Function Engine.wMatchMaker.GetTeamCount
// Flags: 
struct UwMatchMaker_execGetTeamCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.GetGameModeNum
// Flags: 
struct UwMatchMaker_execGetGameModeNum_Parms
{
	struct FString                                     szGameClassName;                                  		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      ReturnValue;                                      		// 0x000C ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetCurMatchState
// Flags: 
struct UwMatchMaker_execSetCurMatchState_Parms
{
	struct FMatchState                                 kState;                                           		// 0x0000 ( 0x0018[ CPF_Parm ]
};

// Function Engine.wMatchMaker.IsHost
// Flags: 
struct UwMatchMaker_execIsHost_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.SetNewHost
// Flags: 
struct UwMatchMaker_execSetNewHost_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.GetUserClanNameByUserName
// Flags: 
struct UwMatchMaker_execGetUserClanNameByUserName_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x0018 ( 0x0004
};

// Function Engine.wMatchMaker.GetUserLevelMarkIDByUserName
// Flags: 
struct UwMatchMaker_execGetUserLevelMarkIDByUserName_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.ReplaceUserName
// Flags: 
struct UwMatchMaker_execReplaceUserName_Parms
{
	struct FString                                     OldName;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     NewName;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x001C ( 0x0004
};

// Function Engine.wMatchMaker.GetUserGradeByUserName
// Flags: 
struct UwMatchMaker_execGetUserGradeByUserName_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.GetUIDByUserName
// Flags: 
struct UwMatchMaker_execGetUIDByUserName_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwMatchUserInfo*                             User;                                             		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.GetUserInfoByUserName
// Flags: 
struct UwMatchMaker_execGetUserInfoByUserName_Parms
{
	struct FString                                     UserName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UwMatchUserInfo*                             ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.GetUserInfoByUID
// Flags: 
struct UwMatchMaker_execGetUserInfoByUID_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwMatchUserInfo*                             ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function Engine.wMatchMaker.SetMyTeam
// Flags: 
struct UwMatchMaker_execSetMyTeam_Parms
{
	int                                                iTeam;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.GetMyNetworkCheckFailedMsg
// Flags: 
struct UwMatchMaker_execGetMyNetworkCheckFailedMsg_Parms
{
	int                                                LoadingStep;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.GetHostNetworkCheckFailedMsg
// Flags: 
struct UwMatchMaker_execGetHostNetworkCheckFailedMsg_Parms
{
	int                                                LoadingStep;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.FailedNetworkChecking
// Flags: 
struct UwMatchMaker_execFailedNetworkChecking_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.StartNetworkChecking
// Flags: 
struct UwMatchMaker_execStartNetworkChecking_Parms
{
	int                                                ClientsCount;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bConnectGame:1;                                   		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SendPingToChannelServer
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventSendPingToChannelServer_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SendPingToOtherUser
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventSendPingToOtherUser_Parms
{
	struct FString                                     toAddr;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SendText
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventSendText_Parms
{
	struct FString                                     d_ip;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                d_port;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     dText;                                            		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SendErrorReportC
// Flags: 
struct UwMatchMaker_execSendErrorReportC_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                windowtype;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     ct;                                               		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.SendErrorReportS
// Flags: 
struct UwMatchMaker_execSendErrorReportS_Parms
{
	int                                                Code;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ct;                                               		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.CreatePingChecker
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventCreatePingChecker_Parms
{
	class UBTPingCheckerLinker*                        ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.GetHostBlocking
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventGetHostBlocking_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetHostBlocking
// Flags: [ FUNC_Event ]
struct UwMatchMaker_eventSetHostBlocking_Parms
{
	unsigned long                                      Blocking:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.wMatchMaker.MakeHSResponseData
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execMakeHSResponseData_Parms
{
	class TArray< unsigned char >                      Data;                                             		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class TArray< unsigned char >                      Result;                                           		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.TenProtectRelease
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectRelease_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectCreate
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectCreate_Parms
{
	int                                                QQUserID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectDProtoEncrypt
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectDProtoEncrypt_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectDProtoDecrypt
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectDProtoDecrypt_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectUpdate_AntiBot
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectUpdate_AntiBot_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectStopLocalCheck
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectStopLocalCheck_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectStartLocalOnceCheck
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectStartLocalOnceCheck_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectSendInitData
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectSendInitData_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.TenProtectSetInitData
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execTenProtectSetInitData_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.GetClientVersion
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execGetClientVersion_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ConsoleCmd_DS
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execConsoleCmd_DS_Parms
{
	struct FString                                     strCmd;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ForceSetLoadingStep
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execForceSetLoadingStep_Parms
{
	int                                                LoadingStep;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.StartHolePunchingClient
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execStartHolePunchingClient_Parms
{
	int                                                GameType;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReqStartUserID;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.StartHolePunchingHost
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execStartHolePunchingHost_Parms
{
	int                                                GameType;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReqStartUserID;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetTcpTimeOutInTempReset
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execSetTcpTimeOutInTempReset_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetTcpTimeOutInGame
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execSetTcpTimeOutInGame_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetTcpTimeOutInUI
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execSetTcpTimeOutInUI_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ForceDisconnectGameWithErrMessage
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execForceDisconnectGameWithErrMessage_Parms
{
	struct FString                                     strErrMsg;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetUDPConnectionTimeLimit
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execSetUDPConnectionTimeLimit_Parms
{
	float                                              fLimitSec;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.IsCompletedLoading
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execIsCompletedLoading_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.CheckHolePunchingResult
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execCheckHolePunchingResult_Parms
{
	int                                                Result;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Phrase;                                           		// 0x0004 ( 0x0001[ CPF_Parm ]
	int                                                InterventionUserID;                               		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Intervention;                                     		// 0x000C ( 0x0001[ CPF_Parm ]
	class TArray< int >                                FailedUserIDs;                                    		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.GetStrLoadingState
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execGetStrLoadingState_Parms
{
	unsigned char                                      bState;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.PrintLoadingMsg
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execPrintLoadingMsg_Parms
{
	struct FLoadingMessageItem                         Item;                                             		// 0x0000 ( 0x001C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x001C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.MakeMD5
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execMakeMD5_Parms
{
	struct FString                                     strsrc;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.DestoryLoadingStater
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execDestoryLoadingStater_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.CreateLoadingStater
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execCreateLoadingStater_Parms
{
	struct FString                                     LoginName;                                        		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.LowRelayServerOff
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execLowRelayServerOff_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.LowRelayServerOn
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execLowRelayServerOn_Parms
{
	struct FString                                     RelayServerIP;                                    		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                RelayServerPortNum;                               		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.LowChangeClient
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execLowChangeClient_Parms
{
	struct FString                                     HostAddr;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.LowChangeServer
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execLowChangeServer_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ForceDisconnectUDPConnectionClientSide
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execForceDisconnectUDPConnectionClientSide_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ForceDisconnectUDPConnectionHostSide
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execForceDisconnectUDPConnectionHostSide_Parms
{
	int                                                UserID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.StartTickCheck
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execStartTickCheck_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetNatTypeToEngine
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execSetNatTypeToEngine_Parms
{
	int                                                NatType;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.ClientInitNatChecker
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execClientInitNatChecker_Parms
{
	int                                                HostUserID;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     HostIP;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                hostPortNum;                                      		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned char                                      NatType;                                          		// 0x0014 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Intervention;                                     		// 0x0015 ( 0x0001[ CPF_Parm ]
	struct FString                                     HostInnerIP;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                HostInnerPort;                                    		// 0x0024 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0028 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.HostInitNatChecker
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execHostInitNatChecker_Parms
{
	int                                                ClientUserID;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ClientIP;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                clientPortNum;                                    		// 0x0010 ( 0x0004[ CPF_Parm ]
	unsigned char                                      NatType;                                          		// 0x0014 ( 0x0001[ CPF_Parm ]
	unsigned char                                      Intervention_Own;                                 		// 0x0015 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.NatServerAddrStoreToEngine
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execNatServerAddrStoreToEngine_Parms
{
	struct FString                                     natServerIP1;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                natServerPortNum1;                                		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FString                                     natServerIP2;                                     		// 0x0010 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                natServerPortNum2;                                		// 0x001C ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.StartMatch
// Flags: [ FUNC_Native ]
struct UwMatchMaker_execStartMatch_Parms
{
	int                                                GameRoomNum;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bHost:1;                                          		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FString                                     szHostAddr;                                       		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	int                                                hostPortNum;                                      		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.UpdateQuest_WinnerInBotMode
// Flags: 
struct UwMatchMaker_execUpdateQuest_WinnerInBotMode_Parms
{
	int                                                Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RecodeType;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_RoundCompletedInBotMode
// Flags: 
struct UwMatchMaker_execUpdateQuest_RoundCompletedInBotMode_Parms
{
	int                                                Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                CompletedRound;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_MatchCompletedInBotMode
// Flags: 
struct UwMatchMaker_execUpdateQuest_MatchCompletedInBotMode_Parms
{
	int                                                Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_SprintTime
// Flags: 
struct UwMatchMaker_execUpdateQuest_SprintTime_Parms
{
	int                                                sec;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_AcquireTrophy
// Flags: 
struct UwMatchMaker_execUpdateQuest_AcquireTrophy_Parms
{
	int                                                ItemID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_MatchEndInBotMode
// Flags: 
struct UwMatchMaker_execUpdateQuest_MatchEndInBotMode_Parms
{
	int                                                difficult;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Map;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_KillInBotMode
// Flags: 
struct UwMatchMaker_execUpdateQuest_KillInBotMode_Parms
{
	int                                                difficult;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Map;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_MatchEnd
// Flags: 
struct UwMatchMaker_execUpdateQuest_MatchEnd_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Map;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_CombatTime
// Flags: 
struct UwMatchMaker_execUpdateQuest_CombatTime_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Map;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Min;                                              		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_ExecTime
// Flags: 
struct UwMatchMaker_execUpdateQuest_ExecTime_Parms
{
	int                                                Mode;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Map;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Min;                                              		// 0x0008 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_Death
// Flags: 
struct UwMatchMaker_execUpdateQuest_Death_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_Assist
// Flags: 
struct UwMatchMaker_execUpdateQuest_Assist_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_15Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_15Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_10Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_10Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_9Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_9Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_8Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_8Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_7Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_7Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_6Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_6Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_5Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_5Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_4Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_4Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_3Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_3Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_2Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_2Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_MeeleAttackKill
// Flags: 
struct UwMatchMaker_execUpdateQuest_MeeleAttackKill_Parms
{
};

// Function Engine.wMatchMaker.UpdateQuest_HeadshotKill
// Flags: 
struct UwMatchMaker_execUpdateQuest_HeadshotKill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_AimedKill
// Flags: 
struct UwMatchMaker_execUpdateQuest_AimedKill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateQuest_Kill
// Flags: 
struct UwMatchMaker_execUpdateQuest_Kill_Parms
{
	int                                                WeaponType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                weaponID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.QuestLog
// Flags: 
struct UwMatchMaker_execQuestLog_Parms
{
	struct FString                                     Msg;                                              		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.GetNextQuestID
// Flags: 
struct UwMatchMaker_execGetNextQuestID_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function Engine.wMatchMaker.UpdateTutorial
// Flags: 
struct UwMatchMaker_execUpdateTutorial_Parms
{
	int                                                QuestID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                AddCount;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function Engine.wMatchMaker.UpdateQuest
// Flags: 
struct UwMatchMaker_execUpdateQuest_Parms
{
	int                                                MissionType;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                MissionOption1;                                   		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                MissionOption2;                                   		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                AddCount;                                         		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.CheckMissionProgress
// Flags: 
struct UwMatchMaker_execCheckMissionProgress_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                AddCount;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              prevperc;                                         		// 0x0008 ( 0x0004
	float                                              currperc;                                         		// 0x000C ( 0x0004
	int                                                SaveCurrentProgress;                              		// 0x0010 ( 0x0004
};

// Function Engine.wMatchMaker.AccomplishMission100Percent
// Flags: 
struct UwMatchMaker_execAccomplishMission100Percent_Parms
{
	struct FString                                     MissionDesc;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                cur;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Max;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.AccomplishMission75Percent
// Flags: 
struct UwMatchMaker_execAccomplishMission75Percent_Parms
{
	struct FString                                     MissionDesc;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                cur;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Max;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.AccomplishMission50Percent
// Flags: 
struct UwMatchMaker_execAccomplishMission50Percent_Parms
{
	struct FString                                     MissionDesc;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                cur;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Max;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.AccomplishMission25Percent
// Flags: 
struct UwMatchMaker_execAccomplishMission25Percent_Parms
{
	struct FString                                     MissionDesc;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                cur;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                Max;                                              		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.GenerateMissionList
// Flags: 
struct UwMatchMaker_execGenerateMissionList_Parms
{
	class UwGameManager*                               GameMgr;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	class UwQuestParam*                                q;                                                		// 0x0008 ( 0x0004
	struct FBtrDouble                                  CurrentTime;                                      		// 0x000C ( 0x0008
};

// Function Engine.wMatchMaker.SortQuestList
// Flags: 
struct UwMatchMaker_execSortQuestList_Parms
{
	class UwGameManager*                               GameMgr;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
	int                                                j;                                                		// 0x0008 ( 0x0004
	int                                                nTemp;                                            		// 0x000C ( 0x0004
	class UwQuestParam*                                QuestParam;                                       		// 0x0010 ( 0x0004
	struct FQuestItem                                  QuestItemTemp;                                    		// 0x0014 ( 0x0008
	class TArray< int >                                DisplayOderList;                                  		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.FindQuest
// Flags: 
struct UwMatchMaker_execFindQuest_Parms
{
	int                                                nQuestID;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function Engine.wMatchMaker.RemoveDailyQuestArray
// Flags: 
struct UwMatchMaker_execRemoveDailyQuestArray_Parms
{
	class TArray< int >                                QuestID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.AddDailyQuestArray
// Flags: 
struct UwMatchMaker_execAddDailyQuestArray_Parms
{
	class TArray< int >                                QuestID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.RemoveDailyQuest
// Flags: 
struct UwMatchMaker_execRemoveDailyQuest_Parms
{
	int                                                QuestID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function Engine.wMatchMaker.AddDailyQuest
// Flags: 
struct UwMatchMaker_execAddDailyQuest_Parms
{
	int                                                QuestID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.RemoveQuestArray
// Flags: 
struct UwMatchMaker_execRemoveQuestArray_Parms
{
	class TArray< int >                                QuestID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.AddQuestArray
// Flags: 
struct UwMatchMaker_execAddQuestArray_Parms
{
	class TArray< int >                                QuestID;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x000C ( 0x0004
};

// Function Engine.wMatchMaker.RemoveQuest
// Flags: 
struct UwMatchMaker_execRemoveQuest_Parms
{
	int                                                QuestID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function Engine.wMatchMaker.AddQuest
// Flags: 
struct UwMatchMaker_execAddQuest_Parms
{
	int                                                QuestID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.IsEnableAltTab
// Flags: 
struct UwMatchMaker_execIsEnableAltTab_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.SetCurSubPos
// Flags: 
struct UwMatchMaker_execSetCurSubPos_Parms
{
	int                                                CurSubPos;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.SetCurpos
// Flags: 
struct UwMatchMaker_execSetCurpos_Parms
{
	int                                                CurPos;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                CurSubPos;                                        		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.wMatchMaker.IsClanGrade
// Flags: 
struct UwMatchMaker_execIsClanGrade_Parms
{
	int                                                Grade;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.IsClanMember
// Flags: 
struct UwMatchMaker_execIsClanMember_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wMatchMaker.RI_Clear
// Flags: 
struct UwMatchMaker_execRI_Clear_Parms
{
};

// Function Engine.wMatchMaker.PI_LeavelRoom
// Flags: 
struct UwMatchMaker_execPI_LeavelRoom_Parms
{
};

// Function Engine.wMatchMaker.RemoveGMList
// Flags: 
struct UwMatchMaker_execRemoveGMList_Parms
{
	int                                                GMUID;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function Engine.wMatchMaker.AddGMList
// Flags: 
struct UwMatchMaker_execAddGMList_Parms
{
	int                                                GMUID;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.ClearGMList
// Flags: 
struct UwMatchMaker_execClearGMList_Parms
{
};

// Function Engine.wMatchMaker.PI_EnterRoom
// Flags: 
struct UwMatchMaker_execPI_EnterRoom_Parms
{
	int                                                RoomID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                TeamID;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.PI_LeaveChannel
// Flags: 
struct UwMatchMaker_execPI_LeaveChannel_Parms
{
};

// Function Engine.wMatchMaker.PI_EnterChannel
// Flags: 
struct UwMatchMaker_execPI_EnterChannel_Parms
{
	int                                                ServerGroupID;                                    		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ServerGroupName;                                  		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ServerID;                                         		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     ServerName;                                       		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ChannelID;                                        		// 0x0020 ( 0x0004[ CPF_Parm ]
	struct FString                                     ChannelName;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      bClanWarChannel:1;                                		// 0x0030 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                ChannelTypeValue;                                 		// 0x0034 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      IsDedicatedServer:1;                              		// 0x0038 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateCharInfoAndReqClanUserList
// Flags: 
struct UwMatchMaker_execUpdateCharInfoAndReqClanUserList_Parms
{
};

// Function Engine.wMatchMaker.UpdateQuestList
// Flags: 
struct UwMatchMaker_execUpdateQuestList_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateRecv_CharInfo
// Flags: 
struct UwMatchMaker_execUpdateRecv_CharInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdatePositionInfo
// Flags: 
struct UwMatchMaker_execUpdatePositionInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateClanInfo
// Flags: 
struct UwMatchMaker_execUpdateClanInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateMoneyInfo
// Flags: 
struct UwMatchMaker_execUpdateMoneyInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateEquipItemInfo
// Flags: 
struct UwMatchMaker_execUpdateEquipItemInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateRankingInfo
// Flags: 
struct UwMatchMaker_execUpdateRankingInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateCharInfo
// Flags: 
struct UwMatchMaker_execUpdateCharInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdateGameRoomInfo
// Flags: 
struct UwMatchMaker_execUpdateGameRoomInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.UpdatePCBangInfo
// Flags: 
struct UwMatchMaker_execUpdatePCBangInfo_Parms
{
	class UwMatchMaker*                                MM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wMatchMaker.CMDHK
// Flags: 
struct UwMatchMaker_execCMDHK_Parms
{
	int                                                Index;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Param1;                                           		// 0x0004 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Param2;                                           		// 0x0010 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     param3;                                           		// 0x001C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function Engine.wMatchMaker.IsChannelRestrictionMaps
// Flags: 
struct UwMatchMaker_execIsChannelRestrictionMaps_Parms
{
	int                                                MapNum;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function Engine.wMatchMaker.IsChannelRestrictionModes
// Flags: 
struct UwMatchMaker_execIsChannelRestrictionModes_Parms
{
	int                                                ModeNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function Engine.wInstantFire.MakeFireNoise
// Flags: 
struct UwInstantFire_execMakeFireNoise_Parms
{
	class AwGun*                                       G;                                                		// 0x0000 ( 0x0004
};

// Function Engine.wInstantFire.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct UwInstantFire_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.wInstantFire.CalcSpread
// Flags: 
struct UwInstantFire_execCalcSpread_Parms
{
	float                                              fSpreadMin;                                       		// 0x0000 ( 0x0004
	float                                              fSpreadMax;                                       		// 0x0004 ( 0x0004
};

// Function Engine.wInstantFire.SetSpreadStance
// Flags: 
struct UwInstantFire_execSetSpreadStance_Parms
{
	unsigned char                                      ss;                                               		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function Engine.wInstantFire.StartMuzzleSmoke
// Flags: 
struct UwInstantFire_execStartMuzzleSmoke_Parms
{
	class AwGun*                                       G;                                                		// 0x0000 ( 0x0004
};

// Function Engine.wInstantFire.DrawMuzzleFlash
// Flags: 
struct UwInstantFire_execDrawMuzzleFlash_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wInstantFire.DestroyEffects
// Flags: [ FUNC_Simulated ]
struct UwInstantFire_execDestroyEffects_Parms
{
};

// Function Engine.wInstantFire.InitEffects
// Flags: [ FUNC_Simulated ]
struct UwInstantFire_execInitEffects_Parms
{
};

// Function Engine.wInstantFire.wLoadOut
// Flags: [ FUNC_Simulated ]
struct UwInstantFire_execwLoadOut_Parms
{
};

// Function Engine.wInstantFire.FlashMuzzleFlash
// Flags: 
struct UwInstantFire_execFlashMuzzleFlash_Parms
{
	class AwGun*                                       G;                                                		// 0x0000 ( 0x0004
};

// Function Engine.wInstantFire.DoTrace
// Flags: 
struct UwInstantFire_execDoTrace_Parms
{
	struct FVector                                     Start;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    Dir;                                              		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     X;                                                		// 0x0018 ( 0x000C
	struct FVector                                     End;                                              		// 0x0024 ( 0x000C
	float                                              DamageCurr;                                       		// 0x0030 ( 0x0004
	float                                              fDamageAmp;                                       		// 0x0034 ( 0x0004
	int                                                i;                                                		// 0x0038 ( 0x0004
	int                                                j;                                                		// 0x003C ( 0x0004
	class UBtrTraceResult*                             TrResult;                                         		// 0x0040 ( 0x0004
	struct FResultData                                 TrData;                                           		// 0x0044 ( 0x0024
	class TArray< float >                              arrResultDist;                                    		// 0x0068 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< struct FResultData >                 arrVictim;                                        		// 0x0074 ( 0x000C[ CPF_NeedCtorLink ]
	struct FResultData                                 SortTempResult;                                   		// 0x0080 ( 0x0024
	float                                              SortTempResultDist;                               		// 0x00A4 ( 0x0004
	struct FResultData                                 Victim;                                           		// 0x00A8 ( 0x0024
	unsigned long                                      bHeadRound:1;                                     		// 0x00CC ( 0x0004 [0x00000001]
	float                                              frange;                                           		// 0x00D0 ( 0x0004
	float                                              fRangeLerp;                                       		// 0x00D4 ( 0x0004
	int                                                iTutorialZoomCheckID;                             		// 0x00D8 ( 0x0004
};

// Function Engine.wInstantFire.DoTraceForClient
// Flags: 
struct UwInstantFire_execDoTraceForClient_Parms
{
	struct FVector                                     Start;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    Dir;                                              		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     X;                                                		// 0x0018 ( 0x000C
	struct FVector                                     End;                                              		// 0x0024 ( 0x000C
	float                                              DamageCurr;                                       		// 0x0030 ( 0x0004
	float                                              fDamageAmp;                                       		// 0x0034 ( 0x0004
	int                                                i;                                                		// 0x0038 ( 0x0004
	int                                                j;                                                		// 0x003C ( 0x0004
	class UBtrTraceResult*                             TrResult;                                         		// 0x0040 ( 0x0004
	struct FResultData                                 TrData;                                           		// 0x0044 ( 0x0024
	class TArray< float >                              arrResultDist;                                    		// 0x0068 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< struct FResultData >                 arrVictim;                                        		// 0x0074 ( 0x000C[ CPF_NeedCtorLink ]
	struct FResultData                                 SortTempResult;                                   		// 0x0080 ( 0x0024
	float                                              SortTempResultDist;                               		// 0x00A4 ( 0x0004
	struct FResultData                                 Victim;                                           		// 0x00A8 ( 0x0024
	unsigned long                                      bHeadRound:1;                                     		// 0x00CC ( 0x0004 [0x00000001]
	float                                              frange;                                           		// 0x00D0 ( 0x0004
	float                                              fRangeLerp;                                       		// 0x00D4 ( 0x0004
	int                                                iTutorialZoomCheckID;                             		// 0x00D8 ( 0x0004
	class UBtrTraceResult*                             ReverseTrResult;                                  		// 0x00DC ( 0x0004
	class TArray< unsigned long >                      arrIsWallShot;                                    		// 0x00E0 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              DamageEff;                                        		// 0x00EC ( 0x0004
	float                                              DamageOuter;                                      		// 0x00F0 ( 0x0004
	int                                                EffCnt;                                           		// 0x00F4 ( 0x0004
	struct FVector                                     LastHitTrace;                                     		// 0x00F8 ( 0x000C
};

// Function Engine.wInstantFire.DoFireEffectForClient
// Flags: 
struct UwInstantFire_execDoFireEffectForClient_Parms
{
	struct FVector                                     StartTrace;                                       		// 0x0000 ( 0x000C
	struct FRotator                                    R;                                                		// 0x000C ( 0x000C
	struct FRotator                                    Aim;                                              		// 0x0018 ( 0x000C
};

// Function Engine.wInstantFire.DoTraceNative
// Flags: [ FUNC_Native ]
struct UwInstantFire_execDoTraceNative_Parms
{
	struct FVector                                     Start;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    Dir;                                              		// 0x000C ( 0x000C[ CPF_Parm ]
};

// Function Engine.wInstantFire.DoFireEffect
// Flags: 
struct UwInstantFire_execDoFireEffect_Parms
{
	struct FVector                                     StartTrace;                                       		// 0x0000 ( 0x000C
	struct FRotator                                    R;                                                		// 0x000C ( 0x000C
	struct FRotator                                    Aim;                                              		// 0x0018 ( 0x000C
	int                                                i;                                                		// 0x0024 ( 0x0004
};

// Function Engine.wInstantFire.ModeTick
// Flags: [ FUNC_Event ]
struct UwInstantFire_eventModeTick_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wInstantFire.MaxRange
// Flags: 
struct UwInstantFire_execMaxRange_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wInstantFire.ServerPlayFiring
// Flags: 
struct UwInstantFire_execServerPlayFiring_Parms
{
	class AwGun*                                       G;                                                		// 0x0000 ( 0x0004
	float                                              fFireSoundRad;                                    		// 0x0004 ( 0x0004
};

// Function Engine.wInstantFire.PlayFiring
// Flags: 
struct UwInstantFire_execPlayFiring_Parms
{
	struct FName                                       locFireAnim;                                      		// 0x0000 ( 0x0004
	struct FName                                       locFireLoopAnim;                                  		// 0x0004 ( 0x0004
	float                                              locFireAnimRate;                                  		// 0x0008 ( 0x0004
	float                                              locFireLoopAnimRate;                              		// 0x000C ( 0x0004
	class AwGun*                                       G;                                                		// 0x0010 ( 0x0004
	unsigned long                                      bSkipAnim:1;                                      		// 0x0014 ( 0x0004 [0x00000001]
	float                                              fFireSoundRad;                                    		// 0x0018 ( 0x0004
};

// Function Engine.wInstantFire.AllowFire
// Flags: [ FUNC_Simulated ]
struct UwInstantFire_execAllowFire_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004
};

// Function Engine.wInstantFire.ModeDoFire
// Flags: [ FUNC_Event ]
struct UwInstantFire_eventModeDoFire_Parms
{
};

// Function Engine.wWeaponFire.DamageLog
// Flags: [ FUNC_Event ]
struct UwWeaponFire_eventDamageLog_Parms
{
	class APawn*                                       Victim;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              fDam;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	float                                              fDist;                                            		// 0x0008 ( 0x0004[ CPF_Parm ]
	unsigned char                                      CParts;                                           		// 0x000C ( 0x0001[ CPF_Parm ]
	struct FString                                     szType;                                           		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     szName;                                           		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     szParts;                                          		// 0x0028 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wWeaponFire.MakeFireNoise
// Flags: 
struct UwWeaponFire_execMakeFireNoise_Parms
{
};

// Function Engine.wWeaponFire.SetSpreadStance
// Flags: 
struct UwWeaponFire_execSetSpreadStance_Parms
{
	unsigned char                                      ss;                                               		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function Engine.wWeaponFire.wLoadOut
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execwLoadOut_Parms
{
};

// Function Engine.wWeaponFire.Trace
// Flags: 
struct UwWeaponFire_execTrace_Parms
{
	struct FVector                                     HitLocation;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     HitNormal;                                        		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     TraceEnd;                                         		// 0x0018 ( 0x000C[ CPF_Parm ]
	struct FVector                                     TraceStart;                                       		// 0x0024 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bTraceActors:1;                                   		// 0x0030 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     Extent;                                           		// 0x0034 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	class UMaterial*                                   Material;                                         		// 0x0040 ( 0x0004[ CPF_OptionalParm | CPF_Parm | CPF_OutParm ]
	class AActor*                                      ReturnValue;                                      		// 0x0044 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponFire.Spawn
// Flags: 
struct UwWeaponFire_execSpawn_Parms
{
	class UClass*                                      SpawnClass;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      SpawnOwner;                                       		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FName                                       SpawnTag;                                         		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FVector                                     SpawnLocation;                                    		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	struct FRotator                                    SpawnRotation;                                    		// 0x0018 ( 0x000C[ CPF_OptionalParm | CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponFire.MaxRange
// Flags: 
struct UwWeaponFire_execMaxRange_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponFire.DisplayDebug
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execDisplayDebug_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              YL;                                               		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	float                                              YPos;                                             		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
};

// Function Engine.wWeaponFire.GetFireStart
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execGetFireStart_Parms
{
	struct FVector                                     X;                                                		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     Y;                                                		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Z;                                                		// 0x0018 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0024 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponFire.AdjustAim
// Flags: 
struct UwWeaponFire_execAdjustAim_Parms
{
	struct FVector                                     Start;                                            		// 0x0000 ( 0x000C[ CPF_Parm ]
	float                                              InAimError;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	struct FRotator                                    ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponFire.PlayFireEnd
// Flags: 
struct UwWeaponFire_execPlayFireEnd_Parms
{
};

// Function Engine.wWeaponFire.PlayFiring
// Flags: 
struct UwWeaponFire_execPlayFiring_Parms
{
};

// Function Engine.wWeaponFire.PlayStartHold
// Flags: 
struct UwWeaponFire_execPlayStartHold_Parms
{
};

// Function Engine.wWeaponFire.PlayPreFire
// Flags: 
struct UwWeaponFire_execPlayPreFire_Parms
{
};

// Function Engine.wWeaponFire.PlaySoundTeam
// Flags: 
struct UwWeaponFire_execPlaySoundTeam_Parms
{
	struct FString                                     strSound;                                         		// 0x0000 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                iCodeID;                                          		// 0x000C ( 0x0004
	float                                              fRadius;                                          		// 0x0010 ( 0x0004
	float                                              fMessageRange;                                    		// 0x0014 ( 0x0004
	struct FVector                                     vLocation;                                        		// 0x0018 ( 0x000C
};

// Function Engine.wWeaponFire.ServerPlayFiring
// Flags: 
struct UwWeaponFire_execServerPlayFiring_Parms
{
};

// Function Engine.wWeaponFire.AllowFire
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execAllowFire_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponFire.ModeHoldFire
// Flags: [ FUNC_Event ]
struct UwWeaponFire_eventModeHoldFire_Parms
{
};

// Function Engine.wWeaponFire.ModeDoFire
// Flags: [ FUNC_Event ]
struct UwWeaponFire_eventModeDoFire_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function Engine.wWeaponFire.SyncRandSeed
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execSyncRandSeed_Parms
{
	int                                                RandSeed;                                         		// 0x0000 ( 0x0004
	int                                                DeathCount;                                       		// 0x0004 ( 0x0004
};

// Function Engine.wWeaponFire.ModeTick
// Flags: [ FUNC_Event ]
struct UwWeaponFire_eventModeTick_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wWeaponFire.IsFiring
// Flags: 
struct UwWeaponFire_execIsFiring_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wWeaponFire.StopFiring
// Flags: 
struct UwWeaponFire_execStopFiring_Parms
{
};

// Function Engine.wWeaponFire.StartFiring
// Flags: 
struct UwWeaponFire_execStartFiring_Parms
{
};

// Function Engine.wWeaponFire.Update
// Flags: 
struct UwWeaponFire_execUpdate_Parms
{
	float                                              dt;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wWeaponFire.StopForceFeedback
// Flags: 
struct UwWeaponFire_execStopForceFeedback_Parms
{
	struct FString                                     EffectName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerController*                           PC;                                               		// 0x000C ( 0x0004
};

// Function Engine.wWeaponFire.ClientPlayForceFeedback
// Flags: 
struct UwWeaponFire_execClientPlayForceFeedback_Parms
{
	struct FString                                     EffectName;                                       		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerController*                           PC;                                               		// 0x000C ( 0x0004
};

// Function Engine.wWeaponFire.ShakeView
// Flags: 
struct UwWeaponFire_execShakeView_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004
	struct FRotator                                    rMin;                                             		// 0x0004 ( 0x000C
	struct FRotator                                    rMax;                                             		// 0x0010 ( 0x000C
	int                                                iPitch;                                           		// 0x001C ( 0x0004
	int                                                iYaw;                                             		// 0x0020 ( 0x0004
	float                                              fDecayFastBeginTime;                              		// 0x0024 ( 0x0004
	struct FRotator                                    Range;                                            		// 0x0028 ( 0x000C
	float                                              frange;                                           		// 0x0034 ( 0x0004
	float                                              frangeY;                                          		// 0x0038 ( 0x0004
	unsigned long                                      bUseWT:1;                                         		// 0x003C ( 0x0004 [0x00000001]
};

// Function Engine.wWeaponFire.StartMuzzleSmoke
// Flags: 
struct UwWeaponFire_execStartMuzzleSmoke_Parms
{
};

// Function Engine.wWeaponFire.FlashMuzzleFlash
// Flags: 
struct UwWeaponFire_execFlashMuzzleFlash_Parms
{
	class AActor*                                      ac;                                               		// 0x0000 ( 0x0004
};

// Function Engine.wWeaponFire.DrawMuzzleFlash
// Flags: 
struct UwWeaponFire_execDrawMuzzleFlash_Parms
{
	class UCanvas*                                     Canvas;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wWeaponFire.DoFireEffectForClient
// Flags: 
struct UwWeaponFire_execDoFireEffectForClient_Parms
{
};

// Function Engine.wWeaponFire.DoFireEffect
// Flags: 
struct UwWeaponFire_execDoFireEffect_Parms
{
};

// Function Engine.wWeaponFire.InitEffects
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execInitEffects_Parms
{
};

// Function Engine.wWeaponFire.DestroyEffects
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execDestroyEffects_Parms
{
};

// Function Engine.wWeaponFire.PostBeginPlay
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execPostBeginPlay_Parms
{
};

// Function Engine.wWeaponFire.SetInitialState
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct UwWeaponFire_eventSetInitialState_Parms
{
};

// Function Engine.wWeaponFire.PostNetBeginPlay
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execPostNetBeginPlay_Parms
{
};

// Function Engine.wWeaponFire.BeginPlay
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execBeginPlay_Parms
{
};

// Function Engine.wWeaponFire.PreBeginPlay
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execPreBeginPlay_Parms
{
};

// Function Engine.wWeaponFire.Timer
// Flags: [ FUNC_Event ]
struct UwWeaponFire_eventTimer_Parms
{
};

// Function Engine.wWeaponFire.SetTimer
// Flags: [ FUNC_Simulated ]
struct UwWeaponFire_execSetTimer_Parms
{
	float                                              NewTimerRate;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bLoop:1;                                          		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function Engine.wMapInfo.CopyTo
// Flags: 
struct UwMapInfo_execCopyTo_Parms
{
	class UwMapInfo*                                   Dest;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function Engine.wQuestParam.IsEnabledEventQuest
// Flags: 
struct UwQuestParam_execIsEnabledEventQuest_Parms
{
	struct FBtrDouble                                  CurrentTime;                                      		// 0x0000 ( 0x0008[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wQuestParam.IsEventQuest
// Flags: 
struct UwQuestParam_execIsEventQuest_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckSpCharItem
// Flags: 
struct UwGameManager_execCheckSpCharItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckAccessoryItem
// Flags: 
struct UwGameManager_execCheckAccessoryItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckFaceItem
// Flags: 
struct UwGameManager_execCheckFaceItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckHeadItem
// Flags: 
struct UwGameManager_execCheckHeadItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckThrowingWeapon
// Flags: 
struct UwGameManager_execCheckThrowingWeapon_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckLvMark
// Flags: 
struct UwGameManager_execCheckLvMark_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckRandBoxItem
// Flags: 
struct UwGameManager_execCheckRandBoxItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckUseItem
// Flags: 
struct UwGameManager_execCheckUseItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckItemBox
// Flags: 
struct UwGameManager_execCheckItemBox_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckSkillItem
// Flags: 
struct UwGameManager_execCheckSkillItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckPistolItem
// Flags: 
struct UwGameManager_execCheckPistolItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckMGItem
// Flags: 
struct UwGameManager_execCheckMGItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckSGItem
// Flags: 
struct UwGameManager_execCheckSGItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckSRItem
// Flags: 
struct UwGameManager_execCheckSRItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckSMGItem
// Flags: 
struct UwGameManager_execCheckSMGItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckARItem
// Flags: 
struct UwGameManager_execCheckARItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.CheckEquipQuickSlotItem
// Flags: 
struct UwGameManager_execCheckEquipQuickSlotItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      eType;                                            		// 0x0008 ( 0x0001
};

// Function Engine.wGameManager.CheckMainQuickSlotItem
// Flags: 
struct UwGameManager_execCheckMainQuickSlotItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      eType;                                            		// 0x0008 ( 0x0001
};

// Function Engine.wGameManager.CheckQuickSlotItem
// Flags: 
struct UwGameManager_execCheckQuickSlotItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      eType;                                            		// 0x0008 ( 0x0001
};

// Function Engine.wGameManager.CheckSubWeaponItem
// Flags: 
struct UwGameManager_execCheckSubWeaponItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      eType;                                            		// 0x0008 ( 0x0001
};

// Function Engine.wGameManager.CheckMainWeaponItem
// Flags: 
struct UwGameManager_execCheckMainWeaponItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      eType;                                            		// 0x0008 ( 0x0001
};

// Function Engine.wGameManager.CheckWeaponItem
// Flags: 
struct UwGameManager_execCheckWeaponItem_Parms
{
	int                                                iItemType;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      eType;                                            		// 0x0008 ( 0x0001
};

// Function Engine.wGameManager.GetEAXEffect
// Flags: [ FUNC_Simulated ]
struct UwGameManager_execGetEAXEffect_Parms
{
	struct FString                                     strEffectClassName;                               		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class UI3DL2Listener*                              ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
//	struct FSEAXEffect                                 sEffect;                                          		// 0x0014 ( 0x0010[ CPF_NeedCtorLink ]
//	class UClass*                                      EffectClass;                                      		// 0x0024 ( 0x0004
};

// Function Engine.wGameManager.GetLevelImageString
// Flags: 
struct UwGameManager_execGetLevelImageString_Parms
{
	int                                                Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                idx;                                              		// 0x0014 ( 0x0004
};

// Function Engine.wGameManager.GetLevelImageCoordi
// Flags: 
struct UwGameManager_execGetLevelImageCoordi_Parms
{
	int                                                Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                LevelMarkID;                                      		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FFloatBox                                   ReturnValue;                                      		// 0x0008 ( 0x0010[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FFloatBox                                   Coordi;                                           		// 0x0018 ( 0x0010
//	int                                                imgX;                                             		// 0x0028 ( 0x0004
//	int                                                imgY;                                             		// 0x002C ( 0x0004
};

// Function Engine.wGameManager.GetClanLevelImages
// Flags: 
struct UwGameManager_execGetClanLevelImages_Parms
{
	int                                                Level;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function Engine.wGameManager.GetLevelByLevelMarkID
// Flags: 
struct UwGameManager_execGetLevelByLevelMarkID_Parms
{
	int                                                LevelMarkID;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Level;                                            		// 0x0008 ( 0x0004
//	class UwItemBaseParam*                             ItemParam;                                        		// 0x000C ( 0x0004
};

// Function Engine.wGameManager.GetLevel
// Flags: 
struct UwGameManager_execGetLevel_Parms
{
	int                                                Exp;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function Engine.wGameManager.LoadSupplyRandomTable
// Flags: 
struct UwGameManager_execLoadSupplyRandomTable_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
	int                                                iIndex;                                           		// 0x0008 ( 0x0004
	float                                              fValue;                                           		// 0x000C ( 0x0004
};

// Function Engine.wGameManager.LoadMapInfos
// Flags: 
struct UwGameManager_execLoadMapInfos_Parms
{
	class UBTNetMapData*                               mapData;                                          		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
	float                                              fValue;                                           		// 0x0008 ( 0x0004
	int                                                iIndex;                                           		// 0x000C ( 0x0004
	class UwMapInfo*                                   Info;                                             		// 0x0010 ( 0x0004
};

// Function Engine.wGameManager.GetPaintingItemIDbyPaintingID
// Flags: 
struct UwGameManager_execGetPaintingItemIDbyPaintingID_Parms
{
	int                                                PaintingID;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                idx;                                              		// 0x0008 ( 0x0004
};

// Function Engine.wGameManager.GetPaintGroupParamsIndex
// Flags: 
struct UwGameManager_execGetPaintGroupParamsIndex_Parms
{
	int                                                PaintingID;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function Engine.wGameManager.GetPaintGroupParam
// Flags: 
struct UwGameManager_execGetPaintGroupParam_Parms
{
	int                                                iPaintingID;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwPaintGroupParam*                           ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwPaintGroupParam*                           PaintParam;                                       		// 0x0008 ( 0x0004
//	int                                                PaintingIdx;                                      		// 0x000C ( 0x0004
};

// Function Engine.wGameManager.GetPaintingUIIcon
// Flags: 
struct UwGameManager_execGetPaintingUIIcon_Parms
{
	int                                                iItemID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function Engine.wGameManager.AddPaintGroupParam_NullData
// Flags: 
struct UwGameManager_execAddPaintGroupParam_NullData_Parms
{
	class UwPaintGroupParam*                           cParam;                                           		// 0x0000 ( 0x0004
};

// Function Engine.wGameManager.AddPaintGroupParams
// Flags: 
struct UwGameManager_execAddPaintGroupParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwPaintGroupParam*                           cParam;                                           		// 0x0004 ( 0x0004
	int                                                iIndex;                                           		// 0x0008 ( 0x0004
	struct FString                                     strTemp;                                          		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wGameManager.LoadPaintGroupParameters
// Flags: 
struct UwGameManager_execLoadPaintGroupParameters_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function Engine.wGameManager.GetPartsGroupPainting
// Flags: 
struct UwGameManager_execGetPartsGroupPainting_Parms
{
	int                                                iItemID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iPartsID;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bThird:1;                                         		// 0x0008 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                iPainting_Item_ID;                                		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UMaterial*                                   ReturnValue;                                      		// 0x0010 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwWeaponCustomInfoParam*                     wcip;                                             		// 0x0014 ( 0x0004
//	class UwItemResourceParam*                         resParam;                                         		// 0x0018 ( 0x0004
//	struct FString                                     strName;                                          		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
//	class UMaterial*                                   matResult;                                        		// 0x0028 ( 0x0004
};

// Function Engine.wGameManager.GetDefaultAddPartsGroupParam
// Flags: 
struct UwGameManager_execGetDefaultAddPartsGroupParam_Parms
{
	int                                                iItemID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwPartsGroupParam*                           ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwItemBaseParam*                             baseParam;                                        		// 0x0008 ( 0x0004
//	int                                                iTemp;                                            		// 0x000C ( 0x0004
};

// Function Engine.wGameManager.GetAddPartsGroupParam
// Flags: 
struct UwGameManager_execGetAddPartsGroupParam_Parms
{
	int                                                iPartsGrouplID;                                   		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwPartsGroupParam*                           ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.AddAddPartsGroupParam_NullData
// Flags: 
struct UwGameManager_execAddAddPartsGroupParam_NullData_Parms
{
	class UwPartsGroupParam*                           cParam;                                           		// 0x0000 ( 0x0004
};

// Function Engine.wGameManager.AddAddPartsGroupParams
// Flags: 
struct UwGameManager_execAddAddPartsGroupParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwPartsGroupParam*                           cParam;                                           		// 0x0004 ( 0x0004
	int                                                iIndex;                                           		// 0x0008 ( 0x0004
	struct FString                                     strTemp;                                          		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wGameManager.LoadAddPartsGroupParameters
// Flags: 
struct UwGameManager_execLoadAddPartsGroupParameters_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function Engine.wGameManager.AddItemBoxParams
// Flags: 
struct UwGameManager_execAddItemBoxParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwItemBoxParam*                              cParam;                                           		// 0x0004 ( 0x0004
	int                                                iIndex;                                           		// 0x0008 ( 0x0004
	struct FString                                     strTemp;                                          		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	int                                                i;                                                		// 0x0018 ( 0x0004
	struct FString                                     ItemID;                                           		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     PartID;                                           		// 0x0028 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wGameManager.AddItemBoxParam_NullData
// Flags: 
struct UwGameManager_execAddItemBoxParam_NullData_Parms
{
	class UwItemBoxParam*                              cParam;                                           		// 0x0000 ( 0x0004
};

// Function Engine.wGameManager.LoadItemBoxParameters
// Flags: 
struct UwGameManager_execLoadItemBoxParameters_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function Engine.wGameManager.GetClanMark128
// Flags: 
struct UwGameManager_execGetClanMark128_Parms
{
	int                                                clanmarkid;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FImage                                      ReturnValue;                                      		// 0x0004 ( 0x0020[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Index;                                            		// 0x0024 ( 0x0004
};

// Function Engine.wGameManager.GetClanMark32
// Flags: 
struct UwGameManager_execGetClanMark32_Parms
{
	int                                                clanmarkid;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FImage                                      ReturnValue;                                      		// 0x0004 ( 0x0020[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                Index;                                            		// 0x0024 ( 0x0004
};

// Function Engine.wGameManager.GetMyClanBL
// Flags: 
struct UwGameManager_execGetMyClanBL_Parms
{
	struct FImage                                      ReturnValue;                                      		// 0x0000 ( 0x0020[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.GetMyClanBG
// Flags: 
struct UwGameManager_execGetMyClanBG_Parms
{
	struct FImage                                      ReturnValue;                                      		// 0x0000 ( 0x0020[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.GetMyClanPattern
// Flags: 
struct UwGameManager_execGetMyClanPattern_Parms
{
	struct FImage                                      ReturnValue;                                      		// 0x0000 ( 0x0020[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function Engine.wGameManager.FindClanMarkIndex
// Flags: 
struct UwGameManager_execFindClanMarkIndex_Parms
{
	int                                                clanmarkid;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function Engine.wGameManager.FindClanMarkParams
// Flags: 
struct UwGameManager_execFindClanMarkParams_Parms
{
	int                                                clanmarkid;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwClanMarkParam*                             ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function Engine.wGameManager.AddClanMarkParams
// Flags: 
struct UwGameManager_execAddClanMarkParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwClanMarkParam*                             cParam;                                           		// 0x0004 ( 0x0004
	int                                                iIndex;                                           		// 0x0008 ( 0x0004
	struct FString                                     strTemp;                                          		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wGameManager.AddClanMarkParam_NullData
// Flags: 
struct UwGameManager_execAddClanMarkParam_NullData_Parms
{
	class UwClanMarkParam*                             cParam;                                           		// 0x0000 ( 0x0004
};

// Function Engine.wGameManager.LoadModeDOAParameters
// Flags: 
struct UwGameManager_execLoadModeDOAParameters_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
	class UwModeDOAParam*                              Param;                                            		// 0x0008 ( 0x0004
	int                                                iIndex;                                           		// 0x000C ( 0x0004
	int                                                i;                                                		// 0x0010 ( 0x0004
	int                                                tmpVal;                                           		// 0x0014 ( 0x0004
	struct FString                                     strTemp;                                          		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wGameManager.GetRandBoxItems
// Flags: 
struct UwGameManager_execGetRandBoxItems_Parms
{
	int                                                ItemID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RandNum;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	class TArray< int >                                ItemIDs;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class TArray< int >                                PartIDs;                                          		// 0x0014 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0024 ( 0x0004
//	int                                                j;                                                		// 0x0028 ( 0x0004
};

// Function Engine.wGameManager.GetRandBoxItemsCount
// Flags: 
struct UwGameManager_execGetRandBoxItemsCount_Parms
{
	int                                                ItemID;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0008 ( 0x0004
//	int                                                MaxIndex;                                         		// 0x000C ( 0x0004
};

// Function Engine.wGameManager.AddRandBoxParams
// Flags: 
struct UwGameManager_execAddRandBoxParams_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwRandBoxParam*                              cParam;                                           		// 0x0004 ( 0x0004
	int                                                iIndex;                                           		// 0x0008 ( 0x0004
	int                                                i;                                                		// 0x000C ( 0x0004
	struct FString                                     strTemp;                                          		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function Engine.wGameManager.AddRandBoxParam_NullData
// Flags: 
struct UwGameManager_execAddRandBoxParam_NullData_Parms
{
	class UwRandBoxParam*                              cParam;                                           		// 0x0000 ( 0x0004
};

// Function Engine.wGameManager.LoadRandBoxParameters
// Flags: 
struct UwGameManager_execLoadRandBoxParameters_Parms
{
	class UBTNetGameData*                              GameData;                                         		// 0x0000 ( 0x0004
	unsigned long                                      bResult:1;                                        		// 0x0004 ( 0x0004 [0x00000001]
};

// Function Engine.wGameManager.GetLastDailyQuestID
// Flags: 
struct UwGameManager_execGetLastDailyQuestID_Parms
{
	int                                                QuestID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwQuestParam*                                q;                                                		// 0x0008 ( 0x0004
//	int                                                DailyQuestType;                                   		// 0x000C ( 0x0004
//	int                                                Step;                                             		// 0x0010 ( 0x0004
//	int                                                ServerTime;                                       		// 0x0014 ( 0x0004
};

// Function Engine.wGameManager.GetPrevDailyQuestID
// Flags: 
struct UwGameManager_execGetPrevDailyQuestID_Parms
{
	int                                                QuestID;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UwQuestParam*                                q;                                                		// 0x0008 ( 0x0004
