#pragma once

// Artic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GUIWarfareControls.BTWindowHK
// 0x00BC (0x04C0 - 0x0404)
class UBTWindowHK : public UFloatingWindow
{
public:
	float                                              TimeOut;                                                  // 0x0404(0x0004)
	bool                                               bSetTimeOut;                                              // 0x0408(0x0004)
	class UBTOwnerDrawImageHK*                         BackgroundImage;                                          // 0x040C(0x0004) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         TopLine;                                                  // 0x0410(0x0004) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         BottomLine;                                               // 0x0414(0x0004) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         BottomLine2;                                              // 0x0418(0x0004) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawCaptionButtonHK*                 ButtonOK;                                                 // 0x041C(0x0004) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawCaptionButtonHK*                 ButtonCancel;                                             // 0x0420(0x0004) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	struct FFloatBox                                   fbBackgroundImage;                                        // 0x0424(0x0010)
	struct FFloatBox                                   fbTopLine;                                                // 0x0434(0x0010)
	struct FFloatBox                                   fbBottomLine;                                             // 0x0444(0x0010)
	struct FFloatBox                                   fbButtonOK;                                               // 0x0454(0x0010)
	struct FFloatBox                                   fbButtonCancel;                                           // 0x0464(0x0010)
	bool                                               UseOpenSound;                                             // 0x0474(0x0004)
	bool                                               UseCloseSound;                                            // 0x0474(0x0004)
	bool                                               CloseWeb;                                                 // 0x0474(0x0004)
	string                                             strTitle;                                                 // 0x0478(0x000C) (Localized, NeedCtorLink)
	string                                             strOK;                                                    // 0x0484(0x000C) (Localized, NeedCtorLink)
	string                                             strCancel;                                                // 0x0490(0x000C) (Localized, NeedCtorLink)
	bool                                               bHandleEsc;                                               // 0x049C(0x0004)
	struct FScriptDelegate                             __OnOK__Delegate;                                         // 0x04A0(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnCancel__Delegate;                                     // 0x04A8(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnTimeTick__Delegate;                                   // 0x04B0(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnTimeOut__Delegate;                                    // 0x04B8(0x0090) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfareControls.BTWindowHK");
		return ptr;
	}


	void STATIC_CloseWindowAllByName(class UGUIController* Controller, class UClass* WindowName);
	bool TimeOutPreDraw(class UCanvas* C);
	void StopTimeOut(float SetTime);
	void StartTimeOut(float SetTime);
	void DefaultCloseWindow_OnTimeOut(class UGUIComponent* Sender);
	void OnTimeOut(class UGUIComponent* Sender);
	void OnTimeTick(float leftime);
	bool InternalOnKeyEvent(float Delta, byte* key, byte* State);
	class UBTOwnerDrawCaptionButtonHK* NewButtonComponent(const struct FFloatBox& fbNewCompo, float RenderWeight);
	class UBTOwnerDrawImageHK* NewLabelComponent(const struct FFloatBox& fbNewCompo, const struct FImage& bgImg, float RenderWeight);
	bool ButtonCancel_OnClick(class UGUIComponent* Sender);
	bool ButtonOK_OnClick(class UGUIComponent* Sender);
	void Closed(class UGUIComponent* Sender, bool bCancelled);
	void Opened(class UGUIComponent* Sender);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void SetTitleCaption(const string& S);
	void SetContentOffset(int nOffsetX, int nOffsetY);
	void UpdateDefaultWindow();
	bool DefaultCloseWindow_OnOK(class UGUIComponent* Sender);
	bool OnCancel(class UGUIComponent* Sender);
	bool OnOK(class UGUIComponent* Sender);
};


// Class GUIWarfareControls.BTWindowAutoResizeHK
// 0x0114 (0x05D4 - 0x04C0)
class UBTWindowAutoResizeHK : public UBTWindowHK
{
public:
	struct FBtrDouble                                  ExtraData_btrdouble;                                      // 0x04C0(0x0008)
	string                                             ExtraData_string;                                         // 0x04C8(0x000C) (NeedCtorLink)
	int                                                ExtraData_int;                                            // 0x04D4(0x0004)
	int                                                ExtraData_int2;                                           // 0x04D8(0x0004)
	int                                                ExtraData_int3;                                           // 0x04DC(0x0004)
	bool                                               bStableText;                                              // 0x04E0(0x0004)
	string                                             Caption;                                                  // 0x04E4(0x000C) (NeedCtorLink)
	string                                             Warning;                                                  // 0x04F0(0x000C) (NeedCtorLink)
	int                                                FontSize;                                                 // 0x04FC(0x0004)
	int                                                LabelSpace;                                               // 0x0500(0x0004)
	int                                                LabelSpaceWarning;                                        // 0x0504(0x0004)
	int                                                LabelSpaceDivider;                                        // 0x0508(0x0004)
	int                                                LabelSpaceEdit;                                           // 0x050C(0x0004)
	int                                                LabelSpaceMultiLineEditMsg;                               // 0x0510(0x0004)
	int                                                VisibleLabelCount;                                        // 0x0514(0x0004)
	struct FFloatBox                                   fbLabelInfo;                                              // 0x0518(0x0010)
	struct FFloatBox                                   fbLabelWarning;                                           // 0x0528(0x0010)
	struct FFloatBox                                   fbLabelDivider;                                           // 0x0538(0x0010)
	struct FFloatBox                                   fbEditName;                                               // 0x0548(0x0010)
	struct FFloatBox                                   fbMultiLineEditMsg;                                       // 0x0558(0x0010)
	struct FFloatBox                                   fbMultiLineEditMsg2;                                      // 0x0568(0x0010)
	struct FFloatBox                                   fbButtonOK2;                                              // 0x0578(0x0010)
	struct FFloatBox                                   fbButtonCancel2;                                          // 0x0588(0x0010)
	class UBTOwnerDrawImageHK*                         LabelInfo[0xA];                                           // 0x0598(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTEditBoxHK*                                EditName;                                                 // 0x05C0(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTMultiLineEditBoxHK*                       MultiLineEditMsg;                                         // 0x05C4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTMultiLineEditBoxHK*                       MultiLineEditMsg2;                                        // 0x05C8(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTOwnerDrawImageHK*                         LabelWarning;                                             // 0x05CC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTOwnerDrawImageHK*                         LabelDivider;                                             // 0x05D0(0x0004) (ExportObject, NeedCtorLink, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfareControls.BTWindowAutoResizeHK");
		return ptr;
	}


	void ResizeWidth(int W);
	bool STATIC_ShowWindow(class UGUIController* con, const string& Title, const string& Msg, const string& Warn, const string& btnOk, const string& btnCancel);
	void RemoveSizeY(int halfsize, int halfy);
	void InsertSizeY(int halfsize, int halfy);
	bool Internal_OnPreDraw(class UCanvas* C);
	void SetButtonCaption(const string& strOK, const string& strCancel);
	void SetData(const string& Title, const string& Caption, const string& Warning);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
};


// Class GUIWarfareControls.BTWindowDefineARHK
// 0x078C (0x0D60 - 0x05D4)
class UBTWindowDefineARHK : public UBTWindowAutoResizeHK
{
public:
	string                                             strClientDefaultTitle;                                    // 0x05D4(0x000C) (Localized, NeedCtorLink)
	string                                             strClientTitle[0x50];                                     // 0x05E0(0x000C) (Localized, NeedCtorLink)
	string                                             strClientDefine[0x50];                                    // 0x09A0(0x000C) (Localized, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfareControls.BTWindowDefineARHK");
		return ptr;
	}


	void STATIC_CloseWindowAll(class UGUIController* Controller);
	bool STATIC_ShowInfo(class UGUIController* con, int Code, const string& arg0, const string& arg1, const string& arg2, const string& arg3);
	bool STATIC_SetContentText(class UGUIController* con, int Code, const string& arg0, const string& arg1, const string& arg2, const string& arg3);
	bool SetContentText_Instance(int Code, const string& arg0, const string& arg1, const string& arg2, const string& arg3);
};


// Class GUIWarfareControls.BTWindowInfoHK
// 0x0018 (0x04D8 - 0x04C0)
class UBTWindowInfoHK : public UBTWindowHK
{
public:
	bool                                               bChangeText;                                              // 0x04C0(0x0004)
	struct FFloatBox                                   fbLabelInfo;                                              // 0x04C4(0x0010)
	class UBTOwnerDrawImageHK*                         LabelInfo;                                                // 0x04D4(0x0004) (ExportObject, NeedCtorLink, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfareControls.BTWindowInfoHK");
		return ptr;
	}


	bool Internal_OnKeyEvent(float Delta, byte* key, byte* Action);
	bool Internal_OnPreDraw(class UCanvas* C);
	bool STATIC_ShowWindow(class UGUIController* con, const string& Title, const string& Msg, const string& btnOk);
	void SetData(const string& Title, int titlepadding, const string& Msg, const string& btnOk);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
};


// Class GUIWarfareControls.BTWindowDefineInfoHK
// 0x1C30 (0x2108 - 0x04D8)
class UBTWindowDefineInfoHK : public UBTWindowInfoHK
{
public:
	string                                             strClientDefaultTitle;                                    // 0x04D8(0x000C) (Localized, NeedCtorLink)
	string                                             strClientDefine[0x12C];                                   // 0x04E4(0x000C) (Localized, NeedCtorLink)
	string                                             strClientTitle[0x12C];                                    // 0x12F4(0x000C) (Localized, NeedCtorLink)
	int                                                DefineCode;                                               // 0x2104(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfareControls.BTWindowDefineInfoHK");
		return ptr;
	}


	bool STATIC_ShowInfo(class UGUIController* con, int Code, const string& arg0, const string& arg1, const string& arg2);
	string STATIC_GetClientString(int Code);
	string STATIC_GetFormatString(int Code, const string& arg0, const string& arg1, const string& arg2, const string& arg3, const string& arg4, const string& arg5, const string& arg6, const string& arg7, const string& arg8);
	void SetContentText_Instance(int Code, const string& arg0, const string& arg1, const string& arg2, const string& arg3);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
};


// Class GUIWarfareControls.BTEditBoxHK
// 0x0128 (0x0490 - 0x0368)
class UBTEditBoxHK : public UGUIEditBox
{
public:
	bool                                               bHudMode;                                                 // 0x0368(0x0004)
	bool                                               bLimitDrawSize;                                           // 0x0368(0x0004)
	float                                              LimitDrawWidth;                                           // 0x036C(0x0004)
	int                                                LimitDrawTextSize;                                        // 0x0370(0x0004)
	int                                                FontSize[0x5];                                            // 0x0374(0x0004)
	struct FColor                                      FontColor[0x5];                                           // 0x0388(0x0004)
	struct FColor                                      FontShadowColor[0x5];                                     // 0x039C(0x0004)
	struct FImage                                      bgImg;                                                    // 0x03B0(0x0020)
	int                                                ButtonID;                                                 // 0x03D0(0x0004)
	bool                                               bActiveCursor;                                            // 0x03D4(0x0004)
	class UCanvas*                                     saveC;                                                    // 0x03D8(0x0004)
	struct FColor                                      SelectionColor;                                           // 0x03DC(0x0004) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	struct FColor                                      CursorColor;                                              // 0x03E0(0x0004) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	struct FImage                                      selectionImg;                                             // 0x03E4(0x0020)
	struct FImage                                      cursorImg;                                                // 0x0404(0x0020)
	float[]                                            CacheTextWidth;                                           // 0x0424(0x000C) (NeedCtorLink)
	float                                              CacheTextHeight;                                          // 0x0430(0x0004)
	string                                             textStrVis;                                               // 0x0434(0x000C) (NeedCtorLink)
	string                                             BackupTextStr;                                            // 0x0440(0x000C) (NeedCtorLink)
	int                                                EndVis;                                                   // 0x044C(0x0004)
	bool                                               bClickAllSelect;                                          // 0x0450(0x0004)
	bool                                               bSelectionMode;                                           // 0x0450(0x0004)
	bool                                               bMouseFirstPress;                                         // 0x0450(0x0004)
	bool                                               bMousePressed;                                            // 0x0450(0x0004)
	bool                                               bCursorBlink;                                             // 0x0450(0x0004)
	float                                              BlinkTimer;                                               // 0x0454(0x0004)
	float                                              OldBlinkTimer;                                            // 0x0458(0x0004)
	bool                                               useCaps;                                                  // 0x045C(0x0004)
	struct UBTEditBoxHK_FSelectionArea                 SelArea;                                                  // 0x0460(0x0008)
	struct FScriptDelegate                             __OnChat__Delegate;                                       // 0x0468(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnInputTab__Delegate;                                   // 0x0470(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnInputSpace__Delegate;                                 // 0x0478(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnFunctionKey__Delegate;                                // 0x0480(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnMaxTextStrNum__Delegate;                              // 0x0488(0x0090) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfareControls.BTEditBoxHK");
		return ptr;
	}


	void InternalDeactivate();
	void InternalActivate();
	bool InternalOnKeyEvent(float Delta, byte* key, byte* State);
	bool InternalOnKeyType(const string& Unicode, byte* key);
	bool CheckPastedTextCondition(const string& Text);
	bool CheckKeyInputCondition(const string& st);
	string ConvertIllegal(const string& inputstr);
	int CaretBinarySearch(int lCursor, int rCursor, float mx, int Parent);
	int MousePosToCaretPos(float mx, float my);
	void OnMousePressed(class UGUIComponent* Sender, bool bRepeat);
	void OnMouseRelease(class UGUIComponent* Sender);
	void Internal_OnChange(class UGUIComponent* Sender);
	void ResetCache();
	void CaculateVisibleText(bool bHoldFirst, int pos);
	void SetFontColorAll(const struct FColor& Col);
	void DrawIMEInfo(class UCanvas* C, float CursorWidth);
	bool OwnerDraw(class UCanvas* C);
	void Clear();
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void SetTextSelect(const string& Text, bool bAllSelect);
	void SetText(const string& Text);
	void InputSelectionPos(int pos);
	void ResetSelectionPos(int pos);
	string GetSelectionText();
	void RemoveSelectionText();
	void SetFontSizeAll(int Size);
	void SetDefaultFontColor();
	void OnMaxTextStrNum(class UGUIComponent* Sender);
	bool OnFunctionKey(class UGUIComponent* Sender, byte FunctionKey, const string& Text);
	void OnInputSpace(class UGUIComponent* Sender, const string& Text);
	void OnInputTab(class UGUIComponent* Sender, const string& Text);
	bool OnChat(class UGUIComponent* Sender, const string& Text);
};


// Class GUIWarfareControls.BTUIColorPoolHK
// 0x0000 (0x002C - 0x002C)
class UBTUIColorPoolHK : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfareControls.BTUIColorPoolHK");
		return ptr;
	}


	struct FColor STATIC_FriendlyUserNameDisable();
	struct FColor STATIC_FriendlyUserNameSelected();
	struct FColor STATIC_FriendlyUserNamePressed();
	struct FColor STATIC_FriendlyUserNameOn();
	struct FColor STATIC_FriendlyUserNameN();
	struct FColor STATIC_NewQuest_Reward();
	struct FColor STATIC_NewQuest_Content();
	struct FColor STATIC_NewQuest_Title();
	struct FColor STATIC_CompletedQuest_Reward();
	struct FColor STATIC_CompletedQuest_Content();
	struct FColor STATIC_CompletedQuest_Title();
	struct FColor STATIC_ListItem_Disable();
	struct FColor STATIC_ListItem_Select();
	struct FColor STATIC_ListItem_On();
	struct FColor STATIC_ListItem_Normal();
	struct FColor STATIC_ItemUIStatus_Minus();
	struct FColor STATIC_ItemUIStatus_Plus();
	struct FColor STATIC_ItemUIStatus_Normal();
	struct FColor STATIC_DefaultRed();
	struct FColor STATIC_DefaultGrayMoreWhite();
	struct FColor STATIC_DefaultGray();
	struct FColor STATIC_DefaultShadow();
	struct FColor STATIC_DefaultWhite();
	struct FColor STATIC_InverseLabelWarning();
	struct FColor STATIC_LabelWarning();
	struct FColor STATIC_Damage4();
	struct FColor STATIC_Damage3();
	struct FColor STATIC_Damage2();
	struct FColor STATIC_Damage1();
	struct FColor STATIC_Damage0();
	struct FColor STATIC_SmallPerc();
	struct FColor STATIC_Coupon();
	struct FColor STATIC_Point();
	struct FColor STATIC_Cash();
	struct FColor STATIC_QuestReward();
	struct FColor STATIC_ListTopButtonDisable();
	struct FColor STATIC_ListTopButtonPressed();
	struct FColor STATIC_ListTopButtonWatched();
	struct FColor STATIC_ListTopButtonOn();
	struct FColor STATIC_ListTopButtonN();
	struct FColor STATIC_SubTabButtonDisable();
	struct FColor STATIC_SubTabButtonPressed();
	struct FColor STATIC_SubTabButtonWatched();
	struct FColor STATIC_SubTabButtonOn();
	struct FColor STATIC_SubTabButtonN();
	struct FColor STATIC_TabButtonDisable_PaidItem();
	struct FColor STATIC_TabButtonPressed_PaidItem();
	struct FColor STATIC_TabButtonWatched_PaidItem();
	struct FColor STATIC_TabButtonOn_PaidItem();
	struct FColor STATIC_TabButtonN_PaidItem();
	struct FColor STATIC_TabButtonDisable();
	struct FColor STATIC_TabButtonPressed();
	struct FColor STATIC_TabButtonWatched();
	struct FColor STATIC_TabButtonOn();
	struct FColor STATIC_TabButtonN();
	struct FColor STATIC_ButtonPageListDisable();
	struct FColor STATIC_ButtonPageListPressed();
	struct FColor STATIC_ButtonPageListWatched();
	struct FColor STATIC_ButtonPageListOn();
	struct FColor STATIC_ButtonPageListN();
	struct FColor STATIC_RadioButtonSelect();
	struct FColor STATIC_RadioButtonDisable();
	struct FColor STATIC_RadioButtonPressed();
	struct FColor STATIC_RadioButtonWatched();
	struct FColor STATIC_RadioButtonOn();
	struct FColor STATIC_RadioButtonNBold();
	struct FColor STATIC_RadioButtonN();
	struct FColor STATIC_BigButtonPressedShadow();
	struct FColor STATIC_BigButtonOnShadow();
	struct FColor STATIC_BigButtonDisable();
	struct FColor STATIC_BigButtonPressed();
	struct FColor STATIC_BigButtonWatched();
	struct FColor STATIC_BigButtonOn();
	struct FColor STATIC_BigButtonN();
	struct FColor STATIC_ButtonPressedShadow();
	struct FColor STATIC_ButtonOnShadow();
	struct FColor STATIC_newButtonDisable();
	struct FColor STATIC_newButtonPressed();
	struct FColor STATIC_newButtonWatched();
	struct FColor STATIC_newButtonOn();
	struct FColor STATIC_newButtonN();
	struct FColor STATIC_ButtonDisable();
	struct FColor STATIC_ButtonPressed();
	struct FColor STATIC_ButtonWatched();
	struct FColor STATIC_ButtonOn();
	struct FColor STATIC_ButtonN();
	struct FColor STATIC_AASLevel7();
	struct FColor STATIC_AASLevel3();
	struct FColor STATIC_ChatTeam();
	struct FColor STATIC_ChatTeamGhost();
	struct FColor STATIC_ChatGhost();
	struct FColor STATIC_ChatBroadCastItem();
	struct FColor STATIC_ChatSystem();
	struct FColor STATIC_ChatClan();
	struct FColor STATIC_ChatWhisper();
	struct FColor STATIC_ChatSelf();
	struct FColor STATIC_ChatNormal();
	struct FColor STATIC_GradePCBang();
	struct FColor STATIC_GradeLegend();
	struct FColor STATIC_GradeRare();
	struct FColor STATIC_GradeHigh();
	struct FColor STATIC_GradeNormal();
	struct FColor STATIC_GradeCommon();
	struct FColor STATIC_GradeShop();
	struct FColor STATIC_GradeShop_DurabilityX();
	struct FColor STATIC_GradeBase();
	struct FColor STATIC_myName();
	struct FColor STATIC_ClanName();
};


// Class GUIWarfareControls.BTUIResourcePoolHK
// 0x74C8 (0x74F4 - 0x002C)
class UBTUIResourcePoolHK : public UObject
{
public:
	struct FColor                                      DefaultDrawColor;                                         // 0x002C(0x0004)
	struct FColor                                      DefaultShadowColor;                                       // 0x0030(0x0004)
	struct FImage                                      ex_clanmark;                                              // 0x0034(0x0020)
	struct FImage                                      cm_00;                                                    // 0x0054(0x0020)
	struct FImage                                      item_item_CF_blank_n;                                     // 0x0074(0x0020)
	struct FImage                                      img_panel_small;                                          // 0x0094(0x0020)
	struct FImage                                      img_panel_small_stretch;                                  // 0x00B4(0x0020)
	struct FImage                                      icon_knife;                                               // 0x00D4(0x0020)
	struct FImage                                      icon_pisgun;                                              // 0x00F4(0x0020)
	struct FImage                                      icon_snipr;                                               // 0x0114(0x0020)
	struct FImage                                      icon_roket;                                               // 0x0134(0x0020)
	struct FImage                                      icon_password;                                            // 0x0154(0x0020)
	struct FImage                                      icon_snipr_non;                                           // 0x0174(0x0020)
	struct FImage                                      help_page;                                                // 0x0194(0x0020)
	struct FImage                                      hud_back_3;                                               // 0x01B4(0x0020)
	struct FImage                                      img_HUD_back_1;                                           // 0x01D4(0x0020)
	struct FImage                                      img_slot_hlmt;                                            // 0x01F4(0x0020)
	struct FImage                                      img_slot_grnd;                                            // 0x0214(0x0020)
	struct FImage                                      img_slot_gogl;                                            // 0x0234(0x0020)
	struct FImage                                      img_slot_face;                                            // 0x0254(0x0020)
	struct FImage                                      img_slot_clth;                                            // 0x0274(0x0020)
	struct FImage                                      img_slot_class;                                           // 0x0294(0x0020)
	struct FImage                                      img_logo_CI;                                              // 0x02B4(0x0020)
	struct FImage                                      img_logo_BTRtga;                                          // 0x02D4(0x0020)
	struct FImage                                      img_15;                                                   // 0x02F4(0x0020)
	struct FImage                                      img_18;                                                   // 0x0314(0x0020)
	struct FImage                                      img_login_test;                                           // 0x0334(0x0020)
	struct FImage                                      slider_back;                                              // 0x0354(0x0020)
	struct FImage                                      slider_grip_n;                                            // 0x0374(0x0020)
	struct FImage                                      slider_grip_on;                                           // 0x0394(0x0020)
	struct FImage                                      img_result_indimat_ma;                                    // 0x03B4(0x0020)
	struct FImage                                      img_trophy;                                               // 0x03D4(0x0020)
	struct FImage                                      img_trophy_scale;                                         // 0x03F4(0x0020)
	struct FImage                                      img_promot;                                               // 0x0414(0x0020)
	struct FImage                                      img_HUD_back_3;                                           // 0x0434(0x0020)
	struct FImage                                      icon_LVup;                                                // 0x0454(0x0020)
	struct FImage                                      icon_MVP;                                                 // 0x0474(0x0020)
	struct FImage                                      img_bonus;                                                // 0x0494(0x0020)
	struct FImage                                      img_result_AF;                                            // 0x04B4(0x0020)
	struct FImage                                      img_result_RSA;                                           // 0x04D4(0x0020)
	struct FImage                                      img_win_1;                                                // 0x04F4(0x0020)
	struct FImage                                      img_lose_1;                                               // 0x0514(0x0020)
	struct FImage                                      img_win_2;                                                // 0x0534(0x0020)
	struct FImage                                      img_lose_2;                                               // 0x0554(0x0020)
	struct FImage                                      img_win_3;                                                // 0x0574(0x0020)
	struct FImage                                      img_lose_3;                                               // 0x0594(0x0020)
	struct FImage                                      img_result_AF_ma;                                         // 0x05B4(0x0020)
	struct FImage                                      img_result_RSA_ma;                                        // 0x05D4(0x0020)
	struct FImage                                      sgau_weap_back;                                           // 0x05F4(0x0020)
	struct FImage                                      sgau_weap_gauge;                                          // 0x0614(0x0020)
	struct FImage                                      sgau_weap_incre;                                          // 0x0634(0x0020)
	struct FImage                                      sgau_weap_decre;                                          // 0x0654(0x0020)
	struct FImage                                      img_chat;                                                 // 0x0674(0x0020)
	struct FImage                                      gau_exp_back;                                             // 0x0694(0x0020)
	struct FImage                                      gau_exp_gauge;                                            // 0x06B4(0x0020)
	struct FImage                                      sgau_ping_1;                                              // 0x06D4(0x0020)
	struct FImage                                      sgau_ping_2;                                              // 0x06F4(0x0020)
	struct FImage                                      sgau_ping_3;                                              // 0x0714(0x0020)
	struct FImage                                      sgau_ping_4;                                              // 0x0734(0x0020)
	struct FImage                                      sgau_ping_back;                                           // 0x0754(0x0020)
	struct FImage                                      img_pup_sau;                                              // 0x0774(0x0020)
	struct FImage                                      img_ptitl_back;                                           // 0x0794(0x0020)
	struct FImage                                      butt_left_n;                                              // 0x07B4(0x0020)
	struct FImage                                      butt_left_on;                                             // 0x07D4(0x0020)
	struct FImage                                      butt_left_cli;                                            // 0x07F4(0x0020)
	struct FImage                                      butt_left_dis;                                            // 0x0814(0x0020)
	struct FImage                                      butt_right_n;                                             // 0x0834(0x0020)
	struct FImage                                      butt_right_on;                                            // 0x0854(0x0020)
	struct FImage                                      butt_right_cli;                                           // 0x0874(0x0020)
	struct FImage                                      butt_right_dis;                                           // 0x0894(0x0020)
	struct FImage                                      empty;                                                    // 0x08B4(0x0020)
	struct FImage                                      img_ser_listop;                                           // 0x08D4(0x0020)
	struct FImage                                      img_ser_listop_STRETCHED_ALL;                             // 0x08F4(0x0020)
	struct FImage                                      radi_dis;                                                 // 0x0914(0x0020)
	struct FImage                                      radi_back;                                                // 0x0934(0x0020)
	struct FImage                                      radi_ok;                                                  // 0x0954(0x0020)
	struct FImage                                      chek_dis;                                                 // 0x0974(0x0020)
	struct FImage                                      chek_back;                                                // 0x0994(0x0020)
	struct FImage                                      chek_ok;                                                  // 0x09B4(0x0020)
	struct FImage                                      list_commu_n;                                             // 0x09D4(0x0020)
	struct FImage                                      tap_n;                                                    // 0x09F4(0x0020)
	struct FImage                                      tap_on;                                                   // 0x0A14(0x0020)
	struct FImage                                      tap_foc;                                                  // 0x0A34(0x0020)
	struct FImage                                      tap_cli;                                                  // 0x0A54(0x0020)
	struct FImage                                      tap_dis;                                                  // 0x0A74(0x0020)
	struct FImage                                      tap_n_tro;                                                // 0x0A94(0x0020)
	struct FImage                                      tap_on_tro;                                               // 0x0AB4(0x0020)
	struct FImage                                      tap_foc_tro;                                              // 0x0AD4(0x0020)
	struct FImage                                      tap_cli_tro;                                              // 0x0AF4(0x0020)
	struct FImage                                      tap_dis_tro;                                              // 0x0B14(0x0020)
	struct FImage                                      tap_n_default;                                            // 0x0B34(0x0020)
	struct FImage                                      tap_on_default;                                           // 0x0B54(0x0020)
	struct FImage                                      tap_cli_default;                                          // 0x0B74(0x0020)
	struct FImage                                      tap_dis_default;                                          // 0x0B94(0x0020)
	struct FImage                                      butt_big_n;                                               // 0x0BB4(0x0020)
	struct FImage                                      butt_big_on;                                              // 0x0BD4(0x0020)
	struct FImage                                      butt_big_cli;                                             // 0x0BF4(0x0020)
	struct FImage                                      butt_big_dis;                                             // 0x0C14(0x0020)
	struct FImage                                      list_item_n;                                              // 0x0C34(0x0020)
	struct FImage                                      list_item_new;                                            // 0x0C54(0x0020)
	struct FImage                                      list_item_on;                                             // 0x0C74(0x0020)
	struct FImage                                      img_item_info;                                            // 0x0C94(0x0020)
	struct FImage                                      list_item_non;                                            // 0x0CB4(0x0020)
	struct FImage                                      icon_rem_cmor;                                            // 0x0CD4(0x0020)
	struct FImage                                      icon_rem_cobr;                                            // 0x0CF4(0x0020)
	struct FImage                                      icon_rem_dotd;                                            // 0x0D14(0x0020)
	struct FImage                                      icon_rem_eotc;                                            // 0x0D34(0x0020)
	struct FImage                                      icon_rem_mrds;                                            // 0x0D54(0x0020)
	struct FImage                                      icon_rem_sco3;                                            // 0x0D74(0x0020)
	struct FImage                                      icon_rem_sco5;                                            // 0x0D94(0x0020)
	struct FImage                                      icon_rem_sco7;                                            // 0x0DB4(0x0020)
	struct FImage                                      icon_rem_siln;                                            // 0x0DD4(0x0020)
	struct FImage                                      icon_rem_skil;                                            // 0x0DF4(0x0020)
	struct FImage                                      icon_rem_barrel;                                          // 0x0E14(0x0020)
	struct FImage                                      icon_rem_gunstock;                                        // 0x0E34(0x0020)
	struct FImage                                      img_divid_line;                                           // 0x0E54(0x0020)
	struct FImage                                      img_divid_line_c;                                         // 0x0E74(0x0020)
	struct FImage                                      img_edge_line;                                            // 0x0E94(0x0020)
	struct FImage                                      img_AF_cha;                                               // 0x0EB4(0x0020)
	struct FImage                                      img_RSA_cha;                                              // 0x0ED4(0x0020)
	struct FImage                                      butt_m_n;                                                 // 0x0EF4(0x0020)
	struct FImage                                      butt_m_on;                                                // 0x0F14(0x0020)
	struct FImage                                      butt_m_cli;                                               // 0x0F34(0x0020)
	struct FImage                                      butt_m_dis;                                               // 0x0F54(0x0020)
	struct FImage                                      butt_n;                                                   // 0x0F74(0x0020)
	struct FImage                                      butt_on;                                                  // 0x0F94(0x0020)
	struct FImage                                      butt_cli;                                                 // 0x0FB4(0x0020)
	struct FImage                                      butt_dis;                                                 // 0x0FD4(0x0020)
	struct FImage                                      img_cash_non;                                             // 0x0FF4(0x0020)
	struct FImage                                      img_point_b;                                              // 0x1014(0x0020)
	struct FImage                                      img_point_non;                                            // 0x1034(0x0020)
	struct FImage                                      img_cash;                                                 // 0x1054(0x0020)
	struct FImage                                      img_point;                                                // 0x1074(0x0020)
	struct FImage                                      img_point_LC;                                             // 0x1094(0x0020)
	struct FImage                                      img_repair_non;                                           // 0x10B4(0x0020)
	struct FImage                                      img_class_non;                                            // 0x10D4(0x0020)
	struct FImage                                      panel_1;                                                  // 0x10F4(0x0020)
	struct FImage                                      panel_1_half_alpha;                                       // 0x1114(0x0020)
	struct FImage                                      panel_1_1;                                                // 0x1134(0x0020)
	struct FImage                                      panel_2;                                                  // 0x1154(0x0020)
	struct FImage                                      panel_3;                                                  // 0x1174(0x0020)
	struct FImage                                      panel_4;                                                  // 0x1194(0x0020)
	struct FImage                                      panel_5;                                                  // 0x11B4(0x0020)
	struct FImage                                      panel_6;                                                  // 0x11D4(0x0020)
	struct FImage                                      panel_7;                                                  // 0x11F4(0x0020)
	struct FImage                                      img_hold;                                                 // 0x1214(0x0020)
	struct FImage                                      img_new;                                                  // 0x1234(0x0020)
	struct FImage                                      img_popul;                                                // 0x1254(0x0020)
	struct FImage                                      img_recom;                                                // 0x1274(0x0020)
	struct FImage                                      list_lobby_on;                                            // 0x1294(0x0020)
	struct FImage                                      list_lobby_cli;                                           // 0x12B4(0x0020)
	struct FImage                                      list_lobby_n;                                             // 0x12D4(0x0020)
	struct FImage                                      butt_list_n;                                              // 0x12F4(0x0020)
	struct FImage                                      butt_list_on;                                             // 0x1314(0x0020)
	struct FImage                                      butt_list_cli;                                            // 0x1334(0x0020)
	struct FImage                                      butt_list_dis;                                            // 0x1354(0x0020)
	struct FImage                                      img_list_divid;                                           // 0x1374(0x0020)
	struct FImage                                      img_bak_aro;                                              // 0x1394(0x0020)
	struct FImage                                      img_fir_aro;                                              // 0x13B4(0x0020)
	struct FImage                                      img_nex_aro;                                              // 0x13D4(0x0020)
	struct FImage                                      img_back1;                                                // 0x13F4(0x0020)
	struct FImage                                      img_upper;                                                // 0x1414(0x0020)
	struct FImage                                      butt_af_n;                                                // 0x1434(0x0020)
	struct FImage                                      butt_af_on;                                               // 0x1454(0x0020)
	struct FImage                                      butt_af_cli;                                              // 0x1474(0x0020)
	struct FImage                                      butt_rsa_n;                                               // 0x1494(0x0020)
	struct FImage                                      butt_rsa_on;                                              // 0x14B4(0x0020)
	struct FImage                                      butt_rsa_cli;                                             // 0x14D4(0x0020)
	struct FImage                                      img_input_x;                                              // 0x14F4(0x0020)
	struct FImage                                      img_input_s;                                              // 0x1514(0x0020)
	struct FImage                                      icon_mstr;                                                // 0x1534(0x0020)
	struct FImage                                      img_top_default;                                          // 0x1554(0x0020)
	struct FImage                                      img_page_thema;                                           // 0x1574(0x0020)
	struct FImage                                      img_page_thema_trophy;                                    // 0x1594(0x0020)
	struct FImage                                      butt_quik_n;                                              // 0x15B4(0x0020)
	struct FImage                                      butt_quik_on;                                             // 0x15D4(0x0020)
	struct FImage                                      butt_quik_click;                                          // 0x15F4(0x0020)
	struct FImage                                      butt_quik_empty;                                          // 0x1614(0x0020)
	struct FImage                                      butt_quik_input;                                          // 0x1634(0x0020)
	struct FImage                                      butt_quik_chang;                                          // 0x1654(0x0020)
	struct FImage                                      gauge_loading;                                            // 0x1674(0x0020)
	struct FImage                                      gauge_loading_back;                                       // 0x1694(0x0020)
	struct FImage                                      radi_on;                                                  // 0x16B4(0x0020)
	struct FImage                                      img_promot_Scale;                                         // 0x16D4(0x0020)
	struct FImage                                      Item_Item_WP_ETC_RifleBox;                                // 0x16F4(0x0020)
	struct FImage                                      img_up1;                                                  // 0x1714(0x0020)
	struct FImage                                      img_up2;                                                  // 0x1734(0x0020)
	struct FImage                                      img_up3;                                                  // 0x1754(0x0020)
	struct FImage                                      img_down1;                                                // 0x1774(0x0020)
	struct FImage                                      img_down2;                                                // 0x1794(0x0020)
	struct FImage                                      img_staff_back;                                           // 0x17B4(0x0020)
	struct FImage                                      img_staff_text;                                           // 0x17D4(0x0020)
	struct FImage                                      img_3ditem_back_0;                                        // 0x17F4(0x0020)
	struct FImage                                      img_3ditem_back_0_WeaponBack;                             // 0x1814(0x0020)
	struct FImage                                      img_3ditem_back_0_TrophyBack;                             // 0x1834(0x0020)
	struct FImage                                      img_3ditem_back_0_EditBack;                               // 0x1854(0x0020)
	struct FImage                                      img_3ditem_back_1;                                        // 0x1874(0x0020)
	struct FImage                                      img_gauge_arow;                                           // 0x1894(0x0020)
	struct FImage                                      img_edge_icon;                                            // 0x18B4(0x0020)
	struct FImage                                      Lv_Mark[0x4C];                                            // 0x18D4(0x0020)
	struct FImage                                      ClanLevel[0x1F];                                          // 0x2254(0x0020)
	struct FImage                                      list_serv_n;                                              // 0x2634(0x0020)
	struct FImage                                      Item_Item_FT_point;                                       // 0x2654(0x0020)
	struct FImage                                      Item_Item_FT_epgain;                                      // 0x2674(0x0020)
	struct FImage                                      Item_Item_FT_ptgain;                                      // 0x2694(0x0020)
	struct FImage                                      Item_Item_FT_pt_bns;                                      // 0x26B4(0x0020)
	struct FImage                                      img_panel_1;                                              // 0x26D4(0x0020)
	struct FImage                                      img_panel_2;                                              // 0x26F4(0x0020)
	struct FImage                                      img_panel_3;                                              // 0x2714(0x0020)
	struct FImage                                      panel_inven_in;                                           // 0x2734(0x0020)
	struct FImage                                      panel_inven_out;                                          // 0x2754(0x0020)
	struct FImage                                      panel_store_in;                                           // 0x2774(0x0020)
	struct FImage                                      panel_store_out;                                          // 0x2794(0x0020)
	struct FImage                                      img_inven;                                                // 0x27B4(0x0020)
	struct FImage                                      list_item_inven_n;                                        // 0x27D4(0x0020)
	struct FImage                                      list_item_inven_on;                                       // 0x27F4(0x0020)
	struct FImage                                      list_item_inven_cli;                                      // 0x2814(0x0020)
	struct FImage                                      list_item_inven_foc;                                      // 0x2834(0x0020)
	struct FImage                                      list_item_store_n;                                        // 0x2854(0x0020)
	struct FImage                                      list_item_store_on;                                       // 0x2874(0x0020)
	struct FImage                                      list_item_store_cli;                                      // 0x2894(0x0020)
	struct FImage                                      list_item_store_foc;                                      // 0x28B4(0x0020)
	struct FImage                                      butt_inven_n;                                             // 0x28D4(0x0020)
	struct FImage                                      butt_inven_on;                                            // 0x28F4(0x0020)
	struct FImage                                      butt_inven_cli;                                           // 0x2914(0x0020)
	struct FImage                                      butt_inven_dis;                                           // 0x2934(0x0020)
	struct FImage                                      tap_n_inven;                                              // 0x2954(0x0020)
	struct FImage                                      tap_on_inven;                                             // 0x2974(0x0020)
	struct FImage                                      tap_cli_inven;                                            // 0x2994(0x0020)
	struct FImage                                      tap_dis_inven;                                            // 0x29B4(0x0020)
	struct FImage                                      tap_n_store;                                              // 0x29D4(0x0020)
	struct FImage                                      tap_on_store;                                             // 0x29F4(0x0020)
	struct FImage                                      tap_cli_store;                                            // 0x2A14(0x0020)
	struct FImage                                      tap_dis_store;                                            // 0x2A34(0x0020)
	struct FImage                                      icon_clan_free;                                           // 0x2A54(0x0020)
	struct FImage                                      img_make_clan;                                            // 0x2A74(0x0020)
	struct FImage                                      list_serv_cli;                                            // 0x2A94(0x0020)
	struct FImage                                      list_commu_on;                                            // 0x2AB4(0x0020)
	struct FImage                                      list_commu_cli;                                           // 0x2AD4(0x0020)
	struct FImage                                      icon_leader;                                              // 0x2AF4(0x0020)
	struct FImage                                      icon_cl_a1;                                               // 0x2B14(0x0020)
	struct FImage                                      icon_cl_a2;                                               // 0x2B34(0x0020)
	struct FImage                                      icon_cl_a3;                                               // 0x2B54(0x0020)
	struct FImage                                      icon_cl_a4;                                               // 0x2B74(0x0020)
	struct FImage                                      icon_cl_a5;                                               // 0x2B94(0x0020)
	struct FImage                                      img_cm_128_ds_sku_03;                                     // 0x2BB4(0x0020)
	struct FImage                                      img_cm_128_ds_sku_04;                                     // 0x2BD4(0x0020)
	struct FImage                                      img_cm_128_ds_sku_06;                                     // 0x2BF4(0x0020)
	struct FImage                                      img_cm_128_ds_sku_07;                                     // 0x2C14(0x0020)
	struct FImage                                      scrol_back;                                               // 0x2C34(0x0020)
	struct FImage                                      scrol_up_n;                                               // 0x2C54(0x0020)
	struct FImage                                      scrol_up_on;                                              // 0x2C74(0x0020)
	struct FImage                                      scrol_dn_n;                                               // 0x2C94(0x0020)
	struct FImage                                      scrol_dn_on;                                              // 0x2CB4(0x0020)
	struct FImage                                      scrol_grip_n;                                             // 0x2CD4(0x0020)
	struct FImage                                      scrol_grip_on;                                            // 0x2CF4(0x0020)
	struct FImage                                      gau_ser_back;                                             // 0x2D14(0x0020)
	struct FImage                                      gau_ser_gauge;                                            // 0x2D34(0x0020)
	struct FImage                                      icon_fixroom;                                             // 0x2D54(0x0020)
	struct FImage                                      icon_quest_day;                                           // 0x2D74(0x0020)
