#pragma once

// Artic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GUIWarfare.BTNetGUIPage
// 0x0154 (0x04B8 - 0x0364)
class UBTNetGUIPage : public UGUIPage
{
public:
	class UBTNetMainMenu*                              page_Main;                                                // 0x0364(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTTcpLink_Channel*                          TcpChannel;                                               // 0x0368(0x0004)
	class UBTTcpLink_Login*                            TcpLogin;                                                 // 0x036C(0x0004)
	string[]                                           BGMList;                                                  // 0x0370(0x000C) (NeedCtorLink)
	class UBTNetGameData*                              NetGameData;                                              // 0x037C(0x0004)
	class UBTDataTransferClientLink*                   DataTransferLink;                                         // 0x0380(0x0004)
	string                                             strSystem;                                                // 0x0384(0x000C) (Localized, NeedCtorLink)
	string                                             strClanGrade[0x5];                                        // 0x0390(0x000C) (Localized, NeedCtorLink)
	string                                             strSlashW;                                                // 0x03CC(0x000C) (Localized, NeedCtorLink)
	string                                             strSlashN;                                                // 0x03D8(0x000C) (Localized, NeedCtorLink)
	string                                             strSlashC;                                                // 0x03E4(0x000C) (Localized, NeedCtorLink)
	string                                             strSlashT;                                                // 0x03F0(0x000C) (Localized, NeedCtorLink)
	string                                             strTo;                                                    // 0x03FC(0x000C) (Localized, NeedCtorLink)
	string                                             strFrom;                                                  // 0x0408(0x000C) (Localized, NeedCtorLink)
	string                                             strLink;                                                  // 0x0414(0x000C) (Localized, NeedCtorLink)
	string                                             strExit;                                                  // 0x0420(0x000C) (Localized, NeedCtorLink)
	struct FFloatBox                                   fbAdvertise[0x5];                                         // 0x042C(0x0010)
	string                                             AdvertiseURL[0x5];                                        // 0x047C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTNetGUIPage");
		return ptr;
	}


	void Internal_LostFocus(class UGUIPage* NewMenu);
	void Internal_GetFocus();
	void OnCompleteOpened();
	void OnBackToLastPage();
	void ProcessNat();
	bool InternalOnPreDraw(class UCanvas* C);
	bool MyCanClose(bool bCanceled);
	void Opened(class UGUIComponent* Sender);
	class UBTTcpLink_Login* GetTcpLogin();
	class UBTTcpLink_Channel* GetTcpChannel();
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	struct FChatInfo TextToChatInfo(const string& Text);
	void RefreshPage();
};


// Class GUIWarfare.BTConsole
// 0x022C (0x0BC0 - 0x0994)
class UBTConsole : public UExtendedConsole
{
public:
	string                                             strRecordRetCode[0x4];                                    // 0x0994(0x000C) (Localized, NeedCtorLink)
	string                                             lsNotEnableRecordOption;                                  // 0x09C4(0x000C) (Localized, NeedCtorLink)
	bool                                               bStopOutofSeat;                                           // 0x09D0(0x0004)
	int                                                OutofSeatTime;                                            // 0x09D4(0x0004)
	int                                                OwnerOutofSeatTime;                                       // 0x09D8(0x0004)
	int                                                UserReadyTime;                                            // 0x09DC(0x0004)
	int                                                UserReadyTimeCount;                                       // 0x09E0(0x0004)
	int                                                preLevelTime;                                             // 0x09E4(0x0004)
	int                                                LevelTime;                                                // 0x09E8(0x0004)
	float                                              LastKeySleepTime;                                         // 0x09EC(0x0004)
	bool                                               bReqFontReset;                                            // 0x09F0(0x0004)
	string                                             strChangeQS;                                              // 0x09F4(0x000C) (Localized, NeedCtorLink)
	string                                             strCloseQSWindow;                                         // 0x0A00(0x000C) (Localized, NeedCtorLink)
	string                                             strChatMode[0x7];                                         // 0x0A0C(0x000C) (Localized, NeedCtorLink)
	string                                             strChattingHelpGFS;                                       // 0x0A60(0x000C) (Localized, NeedCtorLink)
	string                                             strChattingHelp;                                          // 0x0A6C(0x000C) (Localized, NeedCtorLink)
	string                                             strRegulateShot;                                          // 0x0A78(0x000C) (Localized, NeedCtorLink)
	string                                             strSaveShot;                                              // 0x0A84(0x000C) (Localized, NeedCtorLink)
	struct FFloatBox                                   fbChatHistory[0x2];                                       // 0x0A90(0x0010)
	struct FFloatBox                                   fbButtonChatMode;                                         // 0x0AB0(0x0010)
	struct FFloatBox                                   fbChatEditBox;                                            // 0x0AC0(0x0010)
	struct FFloatBox                                   fbLabelEditBox;                                           // 0x0AD0(0x0010)
	string                                             strGhostChatModeTeam;                                     // 0x0AE0(0x000C) (Localized, NeedCtorLink)
	string                                             strGhostChatModeAll;                                      // 0x0AEC(0x000C) (Localized, NeedCtorLink)
	string[]                                           MessageType_PostString;                                   // 0x0AF8(0x000C) (NeedCtorLink)
	struct FColor[]                                    MessageType_Color;                                        // 0x0B04(0x000C) (NeedCtorLink)
	bool                                               bChatEnabled;                                             // 0x0B10(0x0004)
	class UBTChatEditBoxHK*                            ChatEditBox;                                              // 0x0B14(0x0004) (ExportObject, NeedCtorLink, EditInline)
	float                                              CharEditBoxCursorHeightRatio;                             // 0x0B18(0x0004)
	EMessageType                                       ChatMessageType;                                          // 0x0B1C(0x0001)
	byte                                               Padding00[0x3];                                           // 0x0B1D(0x0003) MISSED OFFSET
	bool                                               bChatInGhostMode;                                         // 0x0B20(0x0004)
	class UMaterial*                                   ChatSelectImg;                                            // 0x0B24(0x0004)
	struct FMessageItem[]                              MessageItems;                                             // 0x0B28(0x000C) (NeedCtorLink)
	float                                              MessageItemsX;                                            // 0x0B34(0x0004)
	float                                              MessageItemsYFromBottom;                                  // 0x0B38(0x0004)
	float                                              MessageItemsLineSpacing;                                  // 0x0B3C(0x0004)
	int                                                MaxMessageItems;                                          // 0x0B40(0x0004)
	byte                                               byPressed_Shift;                                          // 0x0B44(0x0001)
	byte                                               Padding01[0x3];                                           // 0x0B45(0x0003) MISSED OFFSET
	bool                                               ToggleIme;                                                // 0x0B48(0x0004)
	bool                                               ImeNative;                                                // 0x0B48(0x0004)
	class UBTTcpLink_Channel*                          TcpHandler;                                               // 0x0B4C(0x0004)
	float                                              AccumDelta;                                               // 0x0B50(0x0004)
	float                                              EventTimerDelta;                                          // 0x0B54(0x0004)
	float                                              EventTimerNextStep;                                       // 0x0B58(0x0004)
	class UBTNetMainMenu*                              MainMenu;                                                 // 0x0B5C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FColor                                      ShadowColor;                                              // 0x0B60(0x0004)
	int                                                ResetImeCount;                                            // 0x0B64(0x0004)
	bool                                               bAltPressed;                                              // 0x0B68(0x0004)
	int                                                currentBGM;                                               // 0x0B6C(0x0004)
	int                                                CurrentBGMHandle;                                         // 0x0B70(0x0004)
	bool                                               HasBGMDuration;                                           // 0x0B74(0x0004)
	int                                                BGMStartTime;                                             // 0x0B78(0x0004)
	int                                                BGMDuration;                                              // 0x0B7C(0x0004)
	float                                              BGMFadeInTime;                                            // 0x0B80(0x0004)
	float                                              BGMFadeOutTime;                                           // 0x0B84(0x0004)
	int                                                BGMTermBetween;                                           // 0x0B88(0x0004)
	int                                                Term;                                                     // 0x0B8C(0x0004)
	string[]                                           BGMs;                                                     // 0x0B90(0x000C) (NeedCtorLink)
	int[]                                              BGMDurations;                                             // 0x0B9C(0x000C) (NeedCtorLink)
	struct FIntArray[]                                 BGMPartialPlayInitialSeeks;                               // 0x0BA8(0x000C) (NeedCtorLink)
	bool                                               BGMPartialPlay;                                           // 0x0BB4(0x0004)
	int                                                BGMPartialPlayDuration;                                   // 0x0BB8(0x0004)
	bool                                               bGmPause;                                                 // 0x0BBC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTConsole");
		return ptr;
	}


	void ConsoleCMD(const string& Line);
	void SendQuestUpdate();
	void ShowTutorialEndWindow();
	bool CheckTurorial_OnOK(class UGUIComponent* Sender);
	void SetAdminSpec(int B);
	void GetBot();
	void SetBot(int withBot, int num0, int num1, int Grade);
	void LogBot();
	void UpdateAAS();
	void UpdateGameNotice();
	void UpdateConnection(float Delta);
	void ProcessChatBan(float Delta);
	void ProcessOutOfSleep_InRoomLobby();
	void ProcessOutOfDoing_InRoomLobby();
	void ProcessOutOfCounting(int MaxTime, int CountTime, int CountingMsgCode, int OutMsgCode);
	void ProcessOutOfSeat(float Delta);
	bool IsExceptionOutOfSeat();
	void Tick(float Delta);
	void SetTermBetweenBGM(float val);
	void UpdateBGM(float dt);
	bool IsBGMPlaying();
	void StopBGM();
	void NextBGM();
	void SetBGMAdvanced(string[] List, bool partialPlay, int partialDuration, struct FIntArray[] initialSeeks);
	void SetBGM(string[] List);
	void SetOneBGM(const string& List);
	string GetCurrentBGM();
	void SwitchChatMessageType(EInputKey key);
	void CallChatWhisper();
	void CallChatClan();
	void CallChatTeam();
	void CallChatAll();
	void CallChatMode();
	void SetChatHelpString();
	bool OnIME_Notify(int Type, int LangID, const string& strText, int StartPos, int Size);
	bool NeedToOffIME();
	void DownloadWebzenShop();
	void CompletedQuest();
	void SendMessage(const struct FMessageItem& msgItem);
	void ClearMessageItems();
	void AddMessageItem(const struct FMessageItem& Item);
	struct FMessageItem ConstructMessageItem(const string& Text, EMessageType MessageType);
	void ProhibitAltTab();
	void AddSystemMessageSaveShot(const string& Text);
	void AddSystemMessageRegulateShot();
	void DrawMessageItems(class UCanvas* C);
	void DrawTextChattingHelp(class UCanvas* C);
	void DrawChatEditBox(class UCanvas* C);
	void PostRender(class UCanvas* C);
	void PreRender(class UCanvas* Canvas);
	void FontReset();
	bool CallSelectAlienType(EInputKey key);
	void CallBattleHelp();
	void CallSelectItemBuy(int iIndex);
	void CallSelectRadioMessage(int iIndex);
	void CallSelectQuickSlot(int iIndex);
	void CallToggleQuickSlot();
	void SetLoadingTime(int L, int P);
	void StopQuestLog();
	void CloseWindow(int Count);
	void RecordOn_Exception(int retCode);
	void RecordOn_FnRun(int Index);
	bool RecordOn_OnOK(class UGUIComponent* Sender);
	void RecordOn();
	void ShowWindow(const string& windowclassname);
	void StartAutoMove(int Server, int Channel, int gameroom);
	void endTutorial();
	void tutorial(const string& Map);
	void stopoos();
	bool BlockChangeWeapon(int nIndex);
	bool IsHaveMainWeapon(int nIndex);
	bool KeyEvent(EInputKey key, EInputAction Action, float Delta);
	bool KeyType(EInputKey key, const string& Unicode);
	bool GetChatEnabled();
	void SetChatEnabled(bool Value);
	void ChatEditBox_OnInputSpace(class UGUIComponent* Sender, const string& Text);
	void ChatEditBox_OnInputTab(class UGUIComponent* Sender, const string& Text);
};


// Class GUIWarfare.BTNetMainMenu
// 0x087C (0x0D34 - 0x04B8)
class UBTNetMainMenu : public UBTNetGUIPage
{
public:
	class UBTTPChatHK*                                 TPChat;                                                   // 0x04B8(0x0004) (ExportObject, NeedCtorLink, EditInline)
	int                                                CheckOneHour;                                             // 0x04BC(0x0004)
	EPage                                              eCurrPage;                                                // 0x04C0(0x0001)
	byte                                               Padding00[0x3];                                           // 0x04C1(0x0003) MISSED OFFSET
	bool                                               kClanWarUserCountIgnore;                                  // 0x04C4(0x0004)
	class UPageOnWindowManager*                        pwm;                                                      // 0x04C8(0x0004)
	class UwMatchMaker*                                rMM;                                                      // 0x04CC(0x0004) (Transient)
	class UwMyPlayerStatus*                            rMyStatus;                                                // 0x04D0(0x0004) (Transient)
	class UwGameManager*                               rGameMgr;                                                 // 0x04D4(0x0004) (Transient)
	struct FClanInfo                                   MyClanInfo;                                               // 0x04D8(0x00B0) (NeedCtorLink)
	struct FClanInfo                                   kRecvClanInfo;                                            // 0x0588(0x00B0) (NeedCtorLink)
	struct FCharInfo                                   MyCharInfo;                                               // 0x0638(0x00C0)
	string                                             MyClanName;                                               // 0x06F8(0x000C) (NeedCtorLink)
	string                                             SaveClanName;                                             // 0x0704(0x000C) (NeedCtorLink)
	bool                                               InTutorial;                                               // 0x0710(0x0004)
	bool                                               EnterBotMode;                                             // 0x0710(0x0004)
	bool                                               CreateBotMode;                                            // 0x0710(0x0004)
	bool                                               bRequestItemList;                                         // 0x0710(0x0004)
	struct FWZInvenListProcess                         WZILP;                                                    // 0x0714(0x001C) (NeedCtorLink)
	int                                                CommandType;                                              // 0x0730(0x0004)
	int                                                CommandParameter_int;                                     // 0x0734(0x0004)
	string                                             CommandParameter_string;                                  // 0x0738(0x000C) (NeedCtorLink)
	bool                                               bIsInPCBang;                                              // 0x0744(0x0004)
	bool                                               bFirstLogin;                                              // 0x0744(0x0004)
	bool                                               bAutoMove;                                                // 0x0744(0x0004)
	byte                                               AutoMoveState;                                            // 0x0748(0x0001)
	byte                                               Padding01[0x3];                                           // 0x0749(0x0003) MISSED OFFSET
	bool                                               AutoMoveDirectionOut;                                     // 0x074C(0x0004)
	int                                                AutoMoveClanWar;                                          // 0x0750(0x0004)
	int                                                AutoMoveServerID;                                         // 0x0754(0x0004)
	int                                                AutoMoveChannelID;                                        // 0x0758(0x0004)
	int                                                AutoMoveGameRoomNum;                                      // 0x075C(0x0004)
	string                                             AutoMoveGameRoomPassword;                                 // 0x0760(0x000C) (NeedCtorLink)
	bool                                               bPostBoxFull;                                             // 0x076C(0x0004)
	bool                                               bNewMailArrived;                                          // 0x076C(0x0004)
	int                                                NewMailCount;                                             // 0x0770(0x0004)
	struct FServerConnectionInfo[]                     SCIList;                                                  // 0x0774(0x000C) (NeedCtorLink)
	int[]                                              NoviceChannelIndex;                                       // 0x0780(0x000C) (NeedCtorLink)
	struct FMapNameInfo[]                              MapNameList;                                              // 0x078C(0x000C) (NeedCtorLink)
	string                                             AuthLogin_ClientIP;                                       // 0x0798(0x000C) (NeedCtorLink)
	byte                                               AuthLogin_ChannelType;                                    // 0x07A4(0x0001)
	byte                                               AuthLogin_ConnectAlpha;                                   // 0x07A5(0x0001)
	byte                                               AuthLogin_AccountType;                                    // 0x07A6(0x0001)
	byte                                               Padding02[0x1];                                           // 0x07A7(0x0001) MISSED OFFSET
	string                                             AuthLogin_GUID;                                           // 0x07A8(0x000C) (NeedCtorLink)
	string                                             AuthLogin_AccountID;                                      // 0x07B4(0x000C) (NeedCtorLink)
	int                                                AuthLogin_ChannelingType;                                 // 0x07C0(0x0004)
	string                                             AuthLogin_AuthKey;                                        // 0x07C4(0x000C) (NeedCtorLink)
	string                                             AuthLogin_RegionKey;                                      // 0x07D0(0x000C) (NeedCtorLink)
	string                                             BirthDay;                                                 // 0x07DC(0x000C) (NeedCtorLink)
	byte                                               Sex;                                                      // 0x07E8(0x0001)
	byte                                               Padding03[0x3];                                           // 0x07E9(0x0003) MISSED OFFSET
	string                                             szLoginPassword;                                          // 0x07EC(0x000C) (NeedCtorLink)
	int                                                LoginTimeStamp;                                           // 0x07F8(0x0004)
	int                                                LoginHash1;                                               // 0x07FC(0x0004)
	int                                                LoginHash2;                                               // 0x0800(0x0004)
	int                                                LoginHash3;                                               // 0x0804(0x0004)
	int                                                LoginHash4;                                               // 0x0808(0x0004)
	int                                                LoginHash5;                                               // 0x080C(0x0004)
	bool                                               bWarningDurabilityAndExpired;                             // 0x0810(0x0004)
	string                                             strGMList;                                                // 0x0814(0x000C) (Localized, NeedCtorLink)
	bool                                               bChatBan;                                                 // 0x0820(0x0004)
	bool                                               bSystemChatBlock;                                         // 0x0820(0x0004)
	float                                              ChatAccumTime[0x4];                                       // 0x0824(0x0004)
	int                                                ChatLogTop;                                               // 0x0834(0x0004)
	struct FChatHistory[]                              ChatLog;                                                  // 0x0838(0x000C) (NeedCtorLink)
	string                                             LastRecvWhispherName;                                     // 0x0844(0x000C) (NeedCtorLink)
	struct FChatInfo                                   PrevChatMode;                                             // 0x0850(0x001C) (NeedCtorLink)
	string                                             strNotice_All;                                            // 0x086C(0x000C) (Localized, NeedCtorLink)
	string                                             strNotice_Server;                                         // 0x0878(0x000C) (Localized, NeedCtorLink)
	string                                             strNotice_Channel;                                        // 0x0884(0x000C) (Localized, NeedCtorLink)
	string                                             strNotice_Room;                                           // 0x0890(0x000C) (Localized, NeedCtorLink)
	string                                             strKick;                                                  // 0x089C(0x000C) (Localized, NeedCtorLink)
	string                                             strChangeRoomTitle;                                       // 0x08A8(0x000C) (Localized, NeedCtorLink)
	float                                              NoticeUITimeSeconds;                                      // 0x08B4(0x0004)
	float                                              NoticeUIPos;                                              // 0x08B8(0x0004)
	int                                                NoticeIndex;                                              // 0x08BC(0x0004)
	string[]                                           BatteryNotice;                                            // 0x08C0(0x000C) (NeedCtorLink)
	float                                              AASUITimeSeconds;                                         // 0x08CC(0x0004)
	float                                              AASUIPos;                                                 // 0x08D0(0x0004)
	struct FAAS_Struct[]                               BatteryAAS;                                               // 0x08D4(0x000C) (NeedCtorLink)
	struct FAAS_Struct                                 AASTemp[0x2];                                             // 0x08E0(0x0024) (NeedCtorLink)
	string                                             strAASMessage[0x6];                                       // 0x0928(0x000C) (Localized, NeedCtorLink)
	bool                                               bNewAvailableQuest;                                       // 0x0970(0x0004)
	bool                                               bNewAvailableEventQuest;                                  // 0x0970(0x0004)
	struct FLevelUpInfoStruct                          LevelUpInfo;                                              // 0x0974(0x0024) (NeedCtorLink)
	class UBTExpiredItem*[]                            ExpiredItems;                                             // 0x0998(0x000C) (NeedCtorLink)
	struct FDurabilityWarningItemsStruct               DurWarningItems;                                          // 0x09A4(0x0010) (NeedCtorLink)
	string[]                                           DestroyedDurabilityXItems;                                // 0x09B4(0x000C) (NeedCtorLink)
	struct FUpdateQuickSlotInfo[]                      UpdateQuickSlotItemList;                                  // 0x09C0(0x000C) (NeedCtorLink)
	class UBTPageLogo*                                 page_Logo;                                                // 0x09CC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Logo;                                            // 0x09D0(0x000C) (NeedCtorLink)
	class UBTPageLogin*                                page_Login;                                               // 0x09DC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Login;                                           // 0x09E0(0x000C) (NeedCtorLink)
	class UBTPageLobby*                                page_Lobby2;                                              // 0x09EC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Lobby2;                                          // 0x09F0(0x000C) (NeedCtorLink)
	class UBTPageCharacterCreation*                    page_CharacterCreation;                                   // 0x09FC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_CharacterCreation;                               // 0x0A00(0x000C) (NeedCtorLink)
	class UBTPageServerSelection*                      page_ServerSelection;                                     // 0x0A0C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_ServerSelection;                                 // 0x0A10(0x000C) (NeedCtorLink)
	class UBTPageRoomLobby*                            page_RoomLobby;                                           // 0x0A1C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageRoomLobby*                            RoomLobby;                                                // 0x0A20(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageRoomLobby*                            RoomLobbyDefence;                                         // 0x0A24(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageMatchResult*                          page_MatchResult2;                                        // 0x0A28(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageMatchResult*                          MatchResult2;                                             // 0x0A2C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTPageMatchResult*                          MatchResult2_Defence;                                     // 0x0A30(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_RoomLobby;                                       // 0x0A34(0x000C) (NeedCtorLink)
	string                                             pagename_RoomLobby_Defence;                               // 0x0A40(0x000C) (NeedCtorLink)
	string                                             pagename_MatchResult2;                                    // 0x0A4C(0x000C) (NeedCtorLink)
	string                                             pagename_MatchResult2_Defence;                            // 0x0A58(0x000C) (NeedCtorLink)
	class UBTPageAuction*                              page_Auction;                                             // 0x0A64(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Auction;                                         // 0x0A68(0x000C) (NeedCtorLink)
	class UBTPageHelp*                                 page_Help;                                                // 0x0A74(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Help;                                            // 0x0A78(0x000C) (NeedCtorLink)
	class UBTPageMail*                                 page_Mail;                                                // 0x0A84(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Mail;                                            // 0x0A88(0x000C) (NeedCtorLink)
	class UBTPageStore*                                page_Store;                                               // 0x0A94(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Store;                                           // 0x0A98(0x000C) (NeedCtorLink)
	class UBTPageInventory*                            page_Inventory;                                           // 0x0AA4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Inventory;                                       // 0x0AA8(0x000C) (NeedCtorLink)
	class UBTPageMyInfo*                               page_MyInfo;                                              // 0x0AB4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_MyInfo;                                          // 0x0AB8(0x000C) (NeedCtorLink)
	class UBTPageClan*                                 page_Clan;                                                // 0x0AC4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Clan;                                            // 0x0AC8(0x000C) (NeedCtorLink)
	class UBTPageCredit*                               page_Credit;                                              // 0x0AD4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Credit;                                          // 0x0AD8(0x000C) (NeedCtorLink)
	class UBTPageClanWar*                              page_ClanWar;                                             // 0x0AE4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_ClanWar;                                         // 0x0AE8(0x000C) (NeedCtorLink)
	class UBTPageLucky*                                page_Lucky;                                               // 0x0AF4(0x0004) (ExportObject, NeedCtorLink, EditInline)
	string                                             pagename_Lucky;                                           // 0x0AF8(0x000C) (NeedCtorLink)
	EPage                                              PageOnOpen;                                               // 0x0B04(0x0001)
	byte                                               Padding04[0x3];                                           // 0x0B05(0x0003) MISSED OFFSET
	class UBTNetGUIPage*                               page_curr;                                                // 0x0B08(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTNetGUIPage*[]                             Pages;                                                    // 0x0B0C(0x000C) (NeedCtorLink)
	string                                             szAccountName;                                            // 0x0B18(0x000C) (NeedCtorLink)
	string                                             szLoginServerIP;                                          // 0x0B24(0x000C) (NeedCtorLink)
	int                                                szLoginServerPort;                                        // 0x0B30(0x0004)
	int                                                GameRunningCount;                                         // 0x0B34(0x0004)
	struct FLoginServerStruct[]                        LoginServers;                                             // 0x0B38(0x000C) (NeedCtorLink)
	byte                                               iTryLoginCount;                                           // 0x0B44(0x0001)
	byte                                               iMaxTryLoginCount;                                        // 0x0B45(0x0001)
	byte                                               Padding05[0x2];                                           // 0x0B46(0x0002) MISSED OFFSET
	bool                                               bConnectedLoginServer;                                    // 0x0B48(0x0004)
	bool                                               bConnectedChannelServer;                                  // 0x0B48(0x0004)
	bool                                               bAuthKeySuccess;                                          // 0x0B48(0x0004)
	string                                             DefaultLobbyBGM;                                          // 0x0B4C(0x000C) (NeedCtorLink)
	string                                             LastMainPageBGM;                                          // 0x0B58(0x000C) (NeedCtorLink)
	int                                                iUid;                                                     // 0x0B64(0x0004) (Transient)
	int                                                iChannel;                                                 // 0x0B68(0x0004) (Transient)
	string                                             ServerName;                                               // 0x0B6C(0x000C) (NeedCtorLink)
	string                                             ServerShortName;                                          // 0x0B78(0x000C) (NeedCtorLink)
	int                                                ServerGroupID;                                            // 0x0B84(0x0004)
	int                                                ServerID;                                                 // 0x0B88(0x0004)
	int                                                GameRoomID;                                               // 0x0B8C(0x0004)
	string                                             ServerGroupName;                                          // 0x0B90(0x000C) (NeedCtorLink)
	string                                             ChannelName;                                              // 0x0B9C(0x000C) (NeedCtorLink)
	int                                                iRoomNum;                                                 // 0x0BA8(0x0004) (Transient)
	int                                                NatType;                                                  // 0x0BAC(0x0004)
	string[]                                           NatAddrs;                                                 // 0x0BB0(0x000C) (NeedCtorLink)
	int[]                                              NatPorts;                                                 // 0x0BBC(0x000C) (NeedCtorLink)
	class UBTNatDiag*                                  NatDiag;                                                  // 0x0BC8(0x0004)
	float                                              TimeNatDiagStarted;                                       // 0x0BCC(0x0004)
	int                                                NatCheckLoop;                                             // 0x0BD0(0x0004)
	float                                              NatDiagInterval;                                          // 0x0BD4(0x0004)
	string                                             LocalLogStr[0x9];                                         // 0x0BD8(0x000C) (Localized, NeedCtorLink)
	string                                             strNatType[0x4];                                          // 0x0C44(0x000C) (Localized, NeedCtorLink)
	string                                             strCashCharge;                                            // 0x0C74(0x000C) (Localized, NeedCtorLink)
	byte                                               UserInfoWindowShowTab;                                    // 0x0C80(0x0001)
	byte                                               Padding06[0x3];                                           // 0x0C81(0x0003) MISSED OFFSET
	struct FScriptDelegate                             __delegateCheckNat__Delegate;                             // 0x0C84(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateRecv_ClanInfo__Delegate;                          // 0x0C8C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateExpiredItemList__Delegate;                        // 0x0C94(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateDurabilityWarningItemList__Delegate;              // 0x0C9C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateWebzenInvenList__Delegate;                        // 0x0CA4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __UpdateWebzenInvenListEnd__Delegate;                     // 0x0CAC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __ClearChatLog__Delegate;                                 // 0x0CB4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __NormalChatLog__Delegate;                                // 0x0CBC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __ClanChatLog__Delegate;                                  // 0x0CC4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __WhisperChatLog__Delegate;                               // 0x0CCC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __SelfChatLog__Delegate;                                  // 0x0CD4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __SystemChatLog__Delegate;                                // 0x0CDC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __TeamChatLog__Delegate;                                  // 0x0CE4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __BroadCastItemChatLog__Delegate;                         // 0x0CEC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __ClearChatLog_Extra__Delegate;                           // 0x0CF4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __NormalChatLog_Extra__Delegate;                          // 0x0CFC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __ClanChatLog_Extra__Delegate;                            // 0x0D04(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __WhisperChatLog_Extra__Delegate;                         // 0x0D0C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __SelfChatLog_Extra__Delegate;                            // 0x0D14(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __SystemChatLog_Extra__Delegate;                          // 0x0D1C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __TeamChatLog_Extra__Delegate;                            // 0x0D24(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __BroadCastItemChatLog_Extra__Delegate;                   // 0x0D2C(0x0090) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTNetMainMenu");
		return ptr;
	}


	void SendCharDetailInfoWithClan(const string& CharName, byte ShowTab);
	void SendLogin();
	bool OnAppExit(class UGUIComponent* Sender);
	bool TcpLogin_rfAckLoginWithIndonesia_Live(int Result);
	bool TcpLogin_rfAckLoginWithIndonesia_Test(int Result);
	bool TcpLogin_rfAckLoginWithGlobal_Test(int Result);
	bool TcpLogin_rfAckLoginWithGlobal_Live(int Result);
	bool TcpLogin_rfAckLoginWithThailand_Test(int Result);
	bool TcpLogin_rfAckLoginWithThailand_Live(int Result);
	bool TcpLogin_rfAckLoginWithWZAuth_Test(int Result, byte wzp_AccountType, byte wzp_IsBlock, byte wzp_AuthKeySuccess, byte ChannelType);
	bool TcpLogin_rfAckLoginWithWZAuth_Live(int Result, byte wzp_AccountType, byte wzp_IsBlock, byte wzp_AuthKeySuccess, byte ChannelType);
	bool TcpLogin_rfAckLoginWithTencentAuth_Test(int Result, byte tc_AccountType, byte tc_IsBlock);
	bool TcpLogin_rfAckLoginWithTencentAuth_Live(int Result, byte tc_AccountType, byte tc_IsBlock);
	void RequestUpdateQuickSlot(int iQuickSlotIdx);
	void UpdateAckQuickSlot_2(byte[] iQuickSlotIdxes, int[] iItemIDs, struct FBtrDouble[] dwUniqueIDs, byte[] bySlotPoses, byte[] bySlotValues);
	void CalcQuickSlotItemCount(int* iStartIndex, int* iUpdateCount);
	void UpdateReqQuickSlot();
	bool UnequipItemSlot(int iItemID, ESLOT_POS eSlotPos, const struct FBtrDouble& dwUniqueID);
	bool EquipItemSlot(int iItemID, ESLOT_POS eSlotPos, const struct FBtrDouble& dwUniqueID);
	bool UnequipOnlyModeItem_QS(int iItemID, ESLOT_POS eSlotPos, const struct FBtrDouble& dwUniqueID, bool bIsSkill);
	bool EquipOnlyModeItem_QS(int iItemID, ESLOT_POS eSlotPos, const struct FBtrDouble& dwUniqueID, bool bIsSkill);
	bool AddEquippedItemInfo(int iQuickSlotIdx, int iItemID, ESLOT_POS eSlotPos, const struct FBtrDouble& dwUniqueID, bool bEquipped, bool bIsSkill);
	bool UnEquipQuickSlot(int iQuickSlotIdx, ESLOT_POS eSlotPos, bool bIsSkill);
	bool EquipQuickSlot(int iQuickSlotIdx, ESLOT_POS eSlotPos, int iItemID, const struct FBtrDouble& dwUniqueID, bool bIsSkill);
	bool CheckMoveToChannel(int iServerIndex);
	void CheckWebzenShopItemList();
	void UpdateWebzenShopItemList(int Year, int YearId, int SalesZoneCode);
	bool ShowHelpWindow_OnOK(class UGUIComponent* Sender);
	void ShowHelpWindow();
	bool ShowReqCashWindow_OnOK(class UGUIComponent* Sender);
	bool ShowCashChargeWindow_OnOK(class UGUIComponent* Sender);
	void ShowCashChargeWindow();
	void UpdateBestLoginServer();
	void SortLoginServerList2(int fromIdx);
	void SortLoginServerList();
	bool Internal_OnFunctionKey(class UGUIComponent* Sender, byte FunctionKey, const string& Text);
	void TPChat_ChangeTab_OnClickTemp(int TabIndex);
	void TPChat_ChangeTab_OnClick(int TabIndex);
	void TPChat_OnChageChatMode(int ChatMode);
	void TPChat_OnInputTab(class UGUIComponent* Sender, const string& Text);
	void TPChat_OnInputSpace(class UGUIComponent* Sender, const string& Text);
	bool Internal_OnChat(class UGUIComponent* Sender, const string& Text);
	void ChatBanEnd_OnTimer(int Index);
	bool CheckChatBan();
	bool UpdateChatBan();
	int IsInClanChannel(const string& ServerIP, int serverPort, int ChannelID);
	bool IsInPageLobby();
	bool IsInPageServerSelection();
	bool IsGameReadyOrPlaying();
	bool IsInRangeDate(const struct FBtrDouble& ServerTime, int syear, int smonth, int sday, int shour, int smin, int eyear, int emonth, int eday, int ehour, int emin);
	bool Is18YearsOld(const struct FBtrDouble& ServerTime, const string& BirthDay);
	void UpdateTimeBatteryAAS();
	void PopAASQueue();
	float GetAASFirstTime();
	string GetAASFirst();
	void PushAASQueue(const string& Text, float Time, byte AASLevel);
	float GetAASBeginTime(byte byLevel);
	byte GetAASLevel();
	void SetAASMessage(byte byType, int AccumTime);
	void ResetBatteryAAS();
	void UpdateTimeBatteryNotice();
	void PopNoticeQueue();
	string GetNoticeFirst();
	void PushNoticeQueue(const string& Notice);
	void ResetBatteryNotice();
	bool TextToGMCommand(const string& Text);
	bool TextToCommand(const string& Text);
	void UpdateChatLog();
	void ResetChatLog();
	bool SelectChatLog(int ChatType, const string& chatText);
	void BroadCastItemChatLog_Extra(const string& cL);
	void TeamChatLog_Extra(const string& cL);
	void SystemChatLog_Extra(const string& cL);
	void SelfChatLog_Extra(const string& cL);
	void WhisperChatLog_Extra(const string& cL);
	void ClanChatLog_Extra(const string& cL);
	void NormalChatLog_Extra(const string& cL);
	void ClearChatLog_Extra();
	void BroadCastItemChatLog(const string& cL);
	void TeamChatLog(const string& cL);
	void SystemChatLog(const string& cL);
	void SelfChatLog(const string& cL);
	void WhisperChatLog(const string& cL);
	void ClanChatLog(const string& cL);
	void NormalChatLog(const string& cL);
	void ClearChatLog();
	int GetChatLogTopIndex();
	void AddChatLog(const string& chatText, int ChatType, bool bForceUpdateLast);
	bool Exit_OnOK(class UGUIComponent* Sender);
	bool TcpLogin_rfAckHash(int Result, const string& Error);
	void Exit_LoginServer(int ErrCode);
	void TryConnect_Login();
	void TcpLogin_OnError(int ErrCode);
	void TcpLogin_OnClose(int ErrCode);
	void TcpLogin_OnConnect(int ErrCode);
	void SetPage(EPage PageType, bool CloseLastMenu);
	void HaltNetwork();
	bool rfReqForceNatTypeSetting(int NatType);
	void CheckNatPhrase2HK();
	void CheckNatPhrase1HK();
	void CheckNatPhrase0HK();
	void StartNatCheck();
	void rfReqStartNatDiag(const string& Server1Addr, int Server1Port, const string& Server2Addr, int Server2Port);
	void deleOnClose(bool bCancelled);
	bool deleOnKeyEvent(float Delta, byte* key, byte* State);
	void deleOnOpen();
	class UBTTcpLink_Login* GetTcpLogin();
	void InitializeTcpLogin(const string& IP, int Port);
	void InitializeTcpChannel(const string& IP, int Port, int DataPort);
	void ShowPlayTimePerHour_OnEventTimer(int Index);
	bool LoadLoginServerList_Ini();
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void KeepMoving();
	void EndAutoMove();
	void StartAutoMove(int Server, int Channel, int gameroom, const string& Password, int ClanMatch_EnterState);
	bool TutorialChannelAutoMove();
	string FindChannelNickName(int ServerID, int ChannelID);
	string FindServerShortName(int ServerID, int ChannelID);
	string FindServerName(int ServerID);
	int FindServerConnectionInfoIndex(int ServerID, int ChannelID);
	int FindServerChannelInfoIndexByServerIP(const string& ServerIP, int serverPort, int ChannelID);
	void AddServerChannelList(int ServerID, int ChannelID, const string& ServerIP, int serverPort, int ServerDataPort, const string& ServerName, const string& ServerShortName, const string& ChannelName, int ServerGroupID, const string& ServerGroupName, int IsClanChannel, const string& ChannelNickName, bool IsDedicatedServer, float ChannelOption, int nCurUser, int nMaxUser);
	void ClearServerChannelList();
	void CheckItemWarning();
	bool CheckDestroyedDurabilityXItemList();
	bool CheckDestroyedDurabilityXItemList_OnOK(class UGUIComponent* Sender);
	bool CompleteDestroyedDurabilityXItemList();
	bool CheckDurabilityWarningItemList();
	bool CheckExpiredItemList();
	void CompleteExpiredItem();
	void AddExpiredItem(bool bSkill, byte DisplayOrder, byte SlotPos, int ItemTID, const struct FBtrDouble& ItemUID);
	void CompleteDurabilityWarningItem();
	void AddDurabilityWarningItemRepairCost(const struct FBtrDouble& UniqueID, int RepairCost);
	void AddDurabilityWarningItem(const struct FBtrDouble& UniqueID, int ItemID, int SlotPos, int PartID, int Durability);
	void LoginToChannel(const string& IP, int Port, int DataPort);
	void ChannelToLogin2(const string& IP, int Port);
	void ChannelToLogin(const string& IP, int Port);
	void ChannelToLogin_OnEventTimer(int Index);
	void UpdateWebzenInvenListEnd(class UBTNetMainMenu* MainMenu);
	void UpdateWebzenInvenList(class UBTNetMainMenu* MainMenu);
	void StopWebzenInvenList();
	bool sfReqWebzenInvenList(const string& StorageType);
	void SetNewMailArrived(bool B);
	void UpdateDurabilityWarningItemList(class UBTNetMainMenu* MainMenu);
	void UpdateExpiredItemList(class UBTNetMainMenu* MainMenu);
	void UpdateRecv_ClanInfo(class UBTNetMainMenu* MainMenu);
	void delegateCheckNat();
};


// Class GUIWarfare.BTNetGUIPageHK
// 0x01B4 (0x066C - 0x04B8)
class UBTNetGUIPageHK : public UBTNetGUIPage
{
public:
	class UwMatchMaker*                                MM;                                                       // 0x04B8(0x0004)
	class UwGameManager*                               GameMgr;                                                  // 0x04BC(0x0004)
	string                                             currentBGM;                                               // 0x04C0(0x000C) (NeedCtorLink)
	struct FFloatBox                                   fbTPTopMenu;                                              // 0x04CC(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTTPTopMenuHK*                              TPTopMenu;                                                // 0x04DC(0x0004) (ExportObject, NeedCtorLink, EditInline)
	int                                                SkipTopMenuIndex;                                         // 0x04E0(0x0004)
	bool                                               CloseLastMenu;                                            // 0x04E4(0x0004)
	struct FFloatBox                                   fbLabelRoomName;                                          // 0x04E8(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawSourceClipImageHK*               LabelRoomName;                                            // 0x04F8(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelTitle;                                             // 0x04FC(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         LabelTitle;                                               // 0x050C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelLeftTopRoll;                                       // 0x0510(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	struct FFloatBox                                   fbLabelLeftTopRollSource;                                 // 0x0520(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawSourceClipImageHK*               LabelLeftTopRoll;                                         // 0x0530(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelTopLine;                                           // 0x0534(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         LabelTopLine;                                             // 0x0544(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelBottomLine;                                        // 0x0548(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTLabelNoticeHK*                            LabelBottomLine;                                          // 0x0558(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbLabelAAS;                                               // 0x055C(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTTPAASHK*                                  LabelAAS;                                                 // 0x056C(0x0004) (ExportObject, NeedCtorLink, EditInline)
	bool                                               bSkipInitializeDefaultPage;                               // 0x0570(0x0004)
	bool                                               bFadeTimeTranslate;                                       // 0x0570(0x0004)
	bool                                               bUseTranslate;                                            // 0x0570(0x0004)
	bool                                               bCallFadeIn;                                              // 0x0570(0x0004)
	bool                                               bFading;                                                  // 0x0570(0x0004)
	bool                                               bClosing;                                                 // 0x0570(0x0004)
	float                                              FadeTime;                                                 // 0x0574(0x0004)
	float                                              CurFadeTime;                                              // 0x0578(0x0004)
	byte                                               CurFade;                                                  // 0x057C(0x0001)
	byte                                               DesiredFade;                                              // 0x057D(0x0001)
	byte                                               StartFade;                                                // 0x057E(0x0001)
	byte                                               Padding00[0x1];                                           // 0x057F(0x0001) MISSED OFFSET
	struct FFloatBox                                   fbNewBackground;                                          // 0x0580(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	class UBTOwnerDrawImageHK*                         NewBackground;                                            // 0x0590(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UBTOwnerDrawImageHK*                         WeaponListBg;                                             // 0x0594(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbWeaponListBg;                                           // 0x0598(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	string                                             strWeaponList[0x6];                                       // 0x05A8(0x000C) (Localized, NeedCtorLink)
	class UBTOwnerDrawCaptionButtonHK*[]               WeaponeTypeBtnList;                                       // 0x05F0(0x000C) (NeedCtorLink)
	bool                                               bShowWeaponeTypeList;                                     // 0x05FC(0x0004)
	class UBTOwnerDrawImageHK*                         SkillListBg;                                              // 0x0600(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FFloatBox                                   fbSkillListBg;                                            // 0x0604(0x0010) (Edit, EditInline, DataBinding, SerializeText, RepNotify, Interp, NonTransactional, EditorOnly, NotForConsole, RepRetry, PrivateWrite, ProtectedWrite, ArchetypeProperty, EditHide, EditTextBox, CrossLevelPassive, CrossLevelActive)
	string                                             strSkillList[0x6];                                        // 0x0614(0x000C) (Localized, NeedCtorLink)
	class UBTOwnerDrawCaptionButtonHK*[]               SkillTypeBtnList;                                         // 0x065C(0x000C) (NeedCtorLink)
	bool                                               bShowSkillTypeList;                                       // 0x0668(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GUIWarfare.BTNetGUIPageHK");
		return ptr;
	}


