#pragma once

// Artic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class UnrealGame.UnrealPawn
// 0x01D8 (0x1254 - 0x107C)
class AUnrealPawn : public APawn
{
public:
	bool                                               bNoDefaultInventory;                                      // 0x107C(0x0004) (Edit)
	bool                                               bAcceptAllInventory;                                      // 0x107C(0x0004)
	bool                                               bIsSquadLeader;                                           // 0x107C(0x0004) (Edit)
	bool                                               bSoakDebug;                                               // 0x107C(0x0004)
	bool                                               bKeepTaunting;                                            // 0x107C(0x0004)
	bool                                               bPlayOwnFootsteps;                                        // 0x107C(0x0004)
	byte                                               LoadOut;                                                  // 0x1080(0x0001)
	byte                                               SelectedEquipment[0x10];                                  // 0x1081(0x0001)
	byte                                               Padding00[0x3];                                           // 0x1091(0x0003) MISSED OFFSET
	string                                             RequiredEquipment[0x10];                                  // 0x1094(0x000C) (Edit, NeedCtorLink)
	string                                             OptionalEquipment[0x10];                                  // 0x1154(0x000C) (NeedCtorLink)
	float                                              AttackSuitability;                                        // 0x1214(0x0004)
	float                                              LastFootStepTime;                                         // 0x1218(0x0004)
	EDoubleClickDir                                    CurrentDir;                                               // 0x121C(0x0001)
	byte                                               Padding01[0x3];                                           // 0x121D(0x0003) MISSED OFFSET
	struct FVector                                     GameObjOffset;                                            // 0x1220(0x000C)
	struct FRotator                                    GameObjRot;                                               // 0x122C(0x000C)
	FName                                              SquadName;                                                // 0x1238(0x0004) (Edit)
	string                                             VoiceType;                                                // 0x123C(0x000C) (NeedCtorLink)
	bool                                               bPlayerShadows;                                           // 0x1248(0x0004)
	bool                                               bBlobShadow;                                              // 0x1248(0x0004)
	int                                                Spree;                                                    // 0x124C(0x0004)
	int                                                iCheckBreath;                                             // 0x1250(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.UnrealPawn");
		return ptr;
	}


	void SpawnGibs(const struct FRotator& HitRotation, float ChunkPerterbation);
	void ChunkUp(const struct FRotator& HitRotation, float ChunkPerterbation);
	void PlayFootStep(int side);
	void IncrementSpree();
	int GetSpree();
	void TakeDrowningDamage();
	void SetMovementPhysics();
	class URosterEntry* GetPlacedRoster();
	void PostNetBeginPlay();
	void PostBeginPlay();
	bool Dodge(EDoubleClickDir DoubleClickMove);
	bool PerformDodge(EDoubleClickDir DoubleClickMove, const struct FVector& Dir, const struct FVector& Cross);
	class AInventory* CreateInventory(const string& InventoryClassName);
	class AInventory* CustomCreateInventory(const string& WeaponClassName);
	void AddDefaultInventory(bool bQuickslotChange);
	void AddDefaultInventoryDOA(bool bQuickslotChange);
	bool IsInLoadout(class UClass* InventoryClass);
	void CheckBob(float DeltaTime, const struct FVector& Y);
	FName GetWeaponBoneFor(class AInventory* i);
	string GetDebugName();
	void SetAnimAction(const FName& NewAction, bool bNoBlendAnim);
	void ShouldUnCrouch();
	void EndJump();
	void HoldGameObject(class AGameObject* gameObj, const FName& GameObjBone);
	void HoldFlag(class AActor* FlagActor);
	struct FVector BotDodge(const struct FVector& Dir);
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	void gibbedBy(class AActor* Other);
	bool FindValidTaunt(FName* Sequence);
	void DropFlag(const string& sReason);
};


// Class UnrealGame.RosterEntry
// 0x0060 (0x008C - 0x002C)
class URosterEntry : public UObject
{
public:
	class UClass*                                      PawnClass;                                                // 0x002C(0x0004) (Edit)
	string                                             PawnClassName;                                            // 0x0030(0x000C) (Edit, NeedCtorLink)
	string                                             PlayerName;                                               // 0x003C(0x000C) (Edit, NeedCtorLink)
	string                                             ModifiedPlayerName;                                       // 0x0048(0x000C) (Edit, NeedCtorLink)
	string                                             VoiceTypeName;                                            // 0x0054(0x000C) (Edit, NeedCtorLink)
	EOrders                                            Orders;                                                   // 0x0060(0x0001) (Edit)
	byte                                               Padding00[0x3];                                           // 0x0061(0x0003) MISSED OFFSET
	bool                                               bTaken;                                                   // 0x0064(0x0004) (Edit)
	class UClass*                                      FavoriteWeapon;                                           // 0x0068(0x0004) (Edit)
	float                                              Aggressiveness;                                           // 0x006C(0x0004) (Edit)
	float                                              Accuracy;                                                 // 0x0070(0x0004) (Edit)
	float                                              CombatStyle;                                              // 0x0074(0x0004) (Edit)
	float                                              StrafingAbility;                                          // 0x0078(0x0004) (Edit)
	float                                              Tactics;                                                  // 0x007C(0x0004) (Edit)
	float                                              ReactionTime;                                             // 0x0080(0x0004) (Edit)
	float                                              Jumpiness;                                                // 0x0084(0x0004) (Edit)
	bool                                               bJumpy;                                                   // 0x0088(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.RosterEntry");
		return ptr;
	}


	void InitBot(class ABot* B);
	bool RecommendAttack();
	bool RecommendFreelance();
	bool RecommendDefense();
	bool NoRecommendation();
	bool RecommendSupport();
	void SetOrders(EPlayerPos Position);
	void PrecacheRosterFor(class AUnrealTeamInfo* t);
	void Init();
};


// Class UnrealGame.UnrealMPGameInfo
// 0x0110 (0x0AC0 - 0x09B0)
class AUnrealMPGameInfo : public AGameInfo
{
public:
	byte                                               BotMode;                                                  // 0x09B0(0x0001)
	byte                                               Padding00[0x3];                                           // 0x09B1(0x0003) MISSED OFFSET
	int                                                MinPlayers;                                               // 0x09B4(0x0004)
	float                                              EndTimeDelay;                                             // 0x09B8(0x0004)
	float                                              BotRatio;                                                 // 0x09BC(0x0004)
	bool                                               bPreloadAllSkins;                                         // 0x09C0(0x0004)
	string                                             DefaultVoiceChannel;                                      // 0x09C4(0x000C) (NeedCtorLink)
	bool                                               bAllowPrivateChat;                                        // 0x09D0(0x0004)
	bool                                               bTeamScoreRounds;                                         // 0x09D0(0x0004)
	bool                                               bSoaking;                                                 // 0x09D0(0x0004)
	bool                                               bPlayersVsBots;                                           // 0x09D0(0x0004)
	float                                              EndTime;                                                  // 0x09D4(0x0004)
	class ASpecialVehicleObjective*                    SpecialVehicleObjectives;                                 // 0x09D8(0x0004)
	class UClass*                                      LocalStatsScreenClass;                                    // 0x09DC(0x0004)
	string                                             VoiceReplicationInfoType;                                 // 0x09E0(0x000C) (Edit, NeedCtorLink)
	string                                             MPGIPropsDisplayText[0x4];                                // 0x09EC(0x000C) (Localized, NeedCtorLink)
	string                                             MPGIPropDescText[0x4];                                    // 0x0A1C(0x000C) (Localized, NeedCtorLink)
	string                                             BotModeText;                                              // 0x0A4C(0x000C) (Localized, NeedCtorLink)
	string                                             SPBotText;                                                // 0x0A58(0x000C) (Localized, NeedCtorLink)
	string                                             MPBotText;                                                // 0x0A64(0x000C) (Localized, NeedCtorLink)
	string                                             SPBotDesc;                                                // 0x0A70(0x000C) (Localized, NeedCtorLink)
	string                                             MPBotDesc;                                                // 0x0A7C(0x000C) (Localized, NeedCtorLink)
	string                                             BotOptions[0x4];                                          // 0x0A88(0x000C) (Localized, NeedCtorLink)
	class AMasterServerUplink*                         MSUplink;                                                 // 0x0AB8(0x0004)
	bool                                               bMSUplinkSet;                                             // 0x0ABC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.UnrealMPGameInfo");
		return ptr;
	}


	int MultiMinPlayers();
	string STATIC_GetDescriptionText(const string& PropName);
	void STATIC_FillPlayInfo(class UPlayInfo* PlayInfo);
	string STATIC_GenerateBotOptions(bool bSinglePlayer);
	void STATIC_AdjustBotInterface(bool bSinglePlayer);
	void GetServerDetails(struct FServerResponseLine* ServerState);
	void InitPlacedBot(class AController* C, class URosterEntry* R);
	bool PickupQuery(class APawn* Other, class APickup* Item);
	bool CanDisableObjective(class AGameObjective* Go);
	int AdjustDestroyObjectiveDamage(int Damage, class AController* instigatedBy, class AGameObjective* Go);
	void ShowPathTo(class APlayerController* P, int TeamNum);
	bool CanShowPathTo(class APlayerController* P, int TeamNum);
	void ForceAddBot();
	void ChangeLoadOut(class APlayerController* P, const string& LoadoutName);
	void ScoreGameObject(class AController* C, class AGameObject* Go);
	class AGameObject* GetGameObject(const FName& GameObjectName);
	void FindNewObjectives(class AGameObjective* DisabledObjective);
	void ObjectiveDisabled(class AGameObjective* DisabledObjective);
	class UTexture* STATIC_GetRandomTeamSymbol(int Base);
	void RestartGame();
	bool TooManyBots(class AController* botToRemove);
	float SpawnWait(class AAIController* B);
	bool ShouldRespawn(class APickup* Other);
	int GetNumPlayers();
	void TeamScoreEvent(int Team, float Points, const string& Desc);
	void ScoreEvent(class APlayerReplicationInfo* Who, float Points, const string& Desc);
	void GameEvent(const string& GEvent, const string& Desc, class APlayerReplicationInfo* Who);
	void KillEvent(const string& KillType, class APlayerReplicationInfo* Killer, class APlayerReplicationInfo* Victim, class UClass* Damage);
	void SpecialEvent(class APlayerReplicationInfo* Who, const string& Desc);
	void ChangeVoiceChannel(class APlayerReplicationInfo* PRI, int NewChannelIndex, int OldChannelIndex);
	void InitMaplistHandler();
	void InitVoiceReplicationInfo();
	class APlayerController* Login(const string& Portal, const string& Options, string* Error);
	void PreLogin(const string& Options, const string& Address, const string& PlayerID, string* Error, string* FailCode);
};


// Class UnrealGame.Bot
// 0x0190 (0x07E4 - 0x0654)
class ABot : public AScriptedController
{
public:
	bool                                               bTacticalDoubleJump;                                      // 0x0654(0x0004)
	bool                                               bJustLanded;                                              // 0x0654(0x0004)
	bool                                               bSingleTestSection;                                       // 0x0654(0x0004)
	bool                                               bRecommendFastMove;                                       // 0x0654(0x0004)
	bool                                               bDodgingForward;                                          // 0x0654(0x0004)
	bool                                               bHasImpactHammer;                                         // 0x0654(0x0004)
	bool                                               bInstantAck;                                              // 0x0654(0x0004)
	bool                                               bShieldSelf;                                              // 0x0654(0x0004)
	bool                                               bJumpy;                                                   // 0x0654(0x0004)
	bool                                               bHasTranslocator;                                         // 0x0654(0x0004)
	bool                                               bIgnoreEnemyChange;                                       // 0x0654(0x0004)
	bool                                               bPursuingFlag;                                            // 0x0654(0x0004)
	bool                                               bWasNearObjective;                                        // 0x0654(0x0004)
	bool                                               bPlannedShot;                                             // 0x0654(0x0004)
	bool                                               bHasFired;                                                // 0x0654(0x0004)
	bool                                               bForcedDirection;                                         // 0x0654(0x0004)
	bool                                               bFireSuccess;                                             // 0x0654(0x0004)
	bool                                               bStoppedFiring;                                           // 0x0654(0x0004)
	bool                                               bEnemyIsVisible;                                          // 0x0654(0x0004)
	bool                                               bTranslocatorHop;                                         // 0x0654(0x0004)
	bool                                               bEnemyEngaged;                                            // 0x0654(0x0004)
	bool                                               bMustCharge;                                              // 0x0654(0x0004)
	bool                                               bHasSuperWeapon;                                          // 0x0654(0x0004)
	bool                                               bCanFire;                                                 // 0x0654(0x0004)
	bool                                               bStrafeDir;                                               // 0x0654(0x0004)
	bool                                               bLeadTarget;                                              // 0x0654(0x0004)
	bool                                               bChangeDir;                                               // 0x0654(0x0004)
	bool                                               bFrustrated;                                              // 0x0654(0x0004)
	bool                                               bInitLifeMessage;                                         // 0x0654(0x0004)
	bool                                               bReachedGatherPoint;                                      // 0x0654(0x0004)
	bool                                               bFinalStretch;                                            // 0x0654(0x0004)
	class AActor*                                      TranslocationTarget;                                      // 0x0658(0x0004)
	class AActor*                                      RealTranslocationTarget;                                  // 0x065C(0x0004)
	class AActor*                                      ImpactTarget;                                             // 0x0660(0x0004)
	float                                              TranslocFreq;                                             // 0x0664(0x0004)
	float                                              NextTranslocTime;                                         // 0x0668(0x0004)
	FName                                              OldMessageType;                                           // 0x066C(0x0004)
	int                                                OldMessageID;                                             // 0x0670(0x0004)
	struct FVector                                     HidingSpot;                                               // 0x0674(0x000C)
	float                                              Aggressiveness;                                           // 0x0680(0x0004)
	float                                              LastAttractCheck;                                         // 0x0684(0x0004)
	class ANavigationPoint*                            BlockedPath;                                              // 0x0688(0x0004)
	float                                              AcquireTime;                                              // 0x068C(0x0004)
	float                                              Aggression;                                               // 0x0690(0x0004)
	float                                              LoseEnemyCheckTime;                                       // 0x0694(0x0004)
	class AActor*                                      StartleActor;                                             // 0x0698(0x0004)
	float                                              StartTacticalTime;                                        // 0x069C(0x0004)
	float                                              LastUnderFire;                                            // 0x06A0(0x0004)
	float                                              BaseAlertness;                                            // 0x06A4(0x0004)
	float                                              Accuracy;                                                 // 0x06A8(0x0004)
	float                                              BaseAggressiveness;                                       // 0x06AC(0x0004)
	float                                              StrafingAbility;                                          // 0x06B0(0x0004)
	float                                              CombatStyle;                                              // 0x06B4(0x0004)
	float                                              Tactics;                                                  // 0x06B8(0x0004)
	float                                              TranslocUse;                                              // 0x06BC(0x0004)
	float                                              ReactionTime;                                             // 0x06C0(0x0004)
	float                                              Jumpiness;                                                // 0x06C4(0x0004)
	class UClass*                                      FavoriteWeapon;                                           // 0x06C8(0x0004)
	string                                             GoalString;                                               // 0x06CC(0x000C) (NeedCtorLink)
	string                                             SoakString;                                               // 0x06D8(0x000C) (NeedCtorLink)
	class ASquadAI*                                    Squad;                                                    // 0x06E4(0x0004)
	class ABot*                                        NextSquadMember;                                          // 0x06E8(0x0004)
	float                                              ReTaskTime;                                               // 0x06EC(0x0004)
	class AUnrealScriptedSequence*                     GoalScript;                                               // 0x06F0(0x0004)
	class AUnrealScriptedSequence*                     EnemyAcquisitionScript;                                   // 0x06F4(0x0004)
	class AVehicle*                                    FormerVehicle;                                            // 0x06F8(0x0004)
	EScriptFollow                                      ScriptedCombat;                                           // 0x06FC(0x0001)
	byte                                               Padding00[0x3];                                           // 0x06FD(0x0003) MISSED OFFSET
	int                                                FormationPosition;                                        // 0x0700(0x0004)
	int                                                ChoosingAttackLevel;                                      // 0x0704(0x0004)
	float                                              ChooseAttackTime;                                         // 0x0708(0x0004)
	int                                                ChooseAttackCounter;                                      // 0x070C(0x0004)
	float                                              EnemyVisibilityTime;                                      // 0x0710(0x0004)
	class APawn*                                       VisibleEnemy;                                             // 0x0714(0x0004)
	class APawn*                                       OldEnemy;                                                 // 0x0718(0x0004)
	float                                              StopStartTime;                                            // 0x071C(0x0004)
	float                                              LastRespawnTime;                                          // 0x0720(0x0004)
	float                                              FailedHuntTime;                                           // 0x0724(0x0004)
	class APawn*                                       FailedHuntEnemy;                                          // 0x0728(0x0004)
	float                                              LastSearchTime;                                           // 0x072C(0x0004)
	float                                              LastSearchWeight;                                         // 0x0730(0x0004)
	float                                              CampTime;                                                 // 0x0734(0x0004)
	int                                                LastTaunt;                                                // 0x0738(0x0004)
	int                                                NumRandomJumps;                                           // 0x073C(0x0004)
	string                                             ComboNames[0x4];                                          // 0x0740(0x000C) (NeedCtorLink)
	float                                              LastFireAttempt;                                          // 0x0770(0x0004)
	float                                              GatherTime;                                               // 0x0774(0x0004)
	FName                                              OrderNames[0x10];                                         // 0x0778(0x0004) (Edit)
	FName                                              OldOrders;                                                // 0x07B8(0x0004)
	class AController*                                 OldOrderGiver;                                            // 0x07BC(0x0004)
	struct FVector                                     LastKnownPosition;                                        // 0x07C0(0x000C)
	struct FVector                                     LastKillerPosition;                                       // 0x07CC(0x000C)
	class ANavigationPoint*                            TestStart;                                                // 0x07D8(0x0004)
	int                                                TestPath;                                                 // 0x07DC(0x0004)
	FName                                              TestLabel;                                                // 0x07E0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.Bot");
		return ptr;
	}


	bool ShouldPerformScript();
	bool ScriptingOverridesAI();
	void SetNewScript(class AScriptedSequence* NewScript);
	void SetEnemyReaction(int AlertnessLevel);
	bool IsShootingObjective();
	bool Stopped();
	bool FindViewSpot();
	bool IsHunting();
	bool IsStrafing();
	bool DefendMelee(float dist);
	void DoRetreat();
	void DoTacticalMove();
	void DoCharge();
	void DoStakeOut();
	bool LoseEnemy();
	bool LostContact(float MaxTime);
	float GetDesiredOffset();
	void ForceCelebrate();
	void ForceGiveWeapon();
	void Celebrate();
	void RecoverFromBadStateCode();
	bool Formation();
	bool IsRetreating();
	void damageAttitudeTo(class APawn* Other, float Damage);
	bool SuperPickupNotSpokenFor(class APickup* P);
	float SuperDesireability(class APickup* P);
	float Desireability(class APickup* P);
	bool NeedWeapon();
	void WanderOrCamp(bool bMayCrouch);
	class AActor* FaceActor(float StrafingModifier);
	class AActor* AlternateTranslocDest();
	bool ShouldStrafeTo(class AActor* WayPoint);
	class AActor* FaceMoveTarget();
	void NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn);
	bool TryToDuck(const struct FVector& duckDir, bool bReversed);
	void ChangeStrafe();
	bool TryWallDodge(const struct FVector& HitNormal, class AActor* HitActor);
	void MissedDodge();
	void NotifyFallingHitWall(const struct FVector& HitNormal, class AActor* HitActor);
	void ReceiveWarning(class APawn* shooter, float projSpeed, const struct FVector& FireDir);
	void NotifyTakeHit(class APawn* instigatedBy, const struct FVector& HitLocation, int Damage, class UClass* DamageType, const struct FVector& Momentum, int CollisionPart);
	void ReceiveProjectileWarning(class AProjectile* proj);
	void DelayedWarning();
	struct FRotator AdjustAim(const struct FFireProperties& FiredAmmunition, const struct FVector& projStart, int AimError);
	float AdjustAimError(float AimError, float TargetDist, bool bDefendMelee, bool bInstantProj, bool bLeadTargetNow);
	bool CheckFutureSight(float DeltaTime);
	bool NearWall(float walldist);
	bool NeedToTurn(const struct FVector& targ);
	bool FindBestPathToward(class AActor* A, bool bCheckedReach, bool bAllowDetour);
	bool AllowDetourTo(class ANavigationPoint* N);
	bool SetRouteToGoal(class AActor* A);
	bool StartMoveToward(class AActor* o);
	void NotifyPostLanded();
	bool NotifyLanded(const struct FVector& HitNormal);
	void SetFall();
	bool PriorityObjective();
	bool NotifyBump(class AActor* Other);
	void DirectedWander(const struct FVector& WanderDir);
	bool AdjustAround(class APawn* Other);
	void ClearPathFor(class AController* C);
	void CancelCampFor(class AController* C);
	bool CheckPathToGoalAround(class APawn* P);
	void Restart();
	bool TestDirection(const struct FVector& Dir, struct FVector* pick);
	bool FindRoamDest();
	void SoakStop(const string& problem);
	bool PickRetreatDestination();
	bool FindInventoryGoal(float BestWeight);
	bool FindSuperPickup(float MaxDist);
	void ChooseAttackMode();
	void DoRangedAttackOn(class AActor* A);
	void FightEnemy(bool bCanCharge, float EnemyStrength);
	void VehicleFightEnemy(bool bCanCharge, float EnemyStrength);
	bool EnemyVisible();
	bool DoWaitForLanding();
	void ExecuteWhatToDoNext();
	string GetEnemyName();
	string GetOldEnemyName();
	void WhatToDoNext(byte CallingByte);
	void WasKilledBy(class AController* Other);
	void SetAlertness(float NewAlertness);
	void SetPeripheralVision();
	void SetMaxDesiredSpeed();
	void ResetSkill();
	void InitializeSkill(float InSkill);
	void Possess(class APawn* aPawn);
	void Reset();
	void NotifyMissedJump();
	void NotifyJumpApex();
	void MayDodgeToMoveTarget();
	bool NotifyPhysicsVolumeChange(class APhysicsVolume* NewVolume);
	bool StrafeFromDamage(float Damage, class UClass* DamageType, bool bFindDest);
	void BotVoiceMessage(const FName& MessageType, byte MessageID, class AController* Sender);
	void EnemyChanged(bool bNewEnemyVisible);
	void SetEnemyInfo(bool bNewEnemyVisible);
	void Trigger(class AActor* Other, class APawn* EventInstigator);
	float RelativeStrength(class APawn* Other);
	bool AssignSquadResponsibility();
	void FreeScript();
	bool IsSniping();
	void CheckIfShouldCrouch(const struct FVector& StartPosition, const struct FVector& TargetPosition, float Probability);
	bool CanStakeOut();
	bool ClearShot(const struct FVector& TargetLoc, bool bImmediateFire);
	void SetAttractionState();
	void SeePlayer(class APawn* SeenPlayer);
	void HearNoise(float Loudness, class AActor* NoiseMaker);
	void ClearTemporaryOrders();
	void SetTemporaryOrders(const FName& NewOrders, class AController* OrderGiver);
	void SetOrders(const FName& NewOrders, class AController* OrderGiver);
	void SendMessage(class APlayerReplicationInfo* Recipient, const FName& MessageType, byte MessageID, float wait, const FName& BroadcastType);
	byte GetMessageIndex(const FName& PhraseName);
	void YellAt(class APawn* Moron);
	class AActor* GetOrderObject();
	FName GetOrders();
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	bool CanCombo();
	bool CanComboMoving();
	bool ProficientWithWeapon();
	float WeaponPreference(class AwWeapon* W);
	void ChangedWeapon();
	void StopFiring();
	bool CanAttack(class AActor* Other);
	bool FireWeaponAt(class AActor* A);
	void TimedFireWeaponAtEnemy();
	bool ShouldFireAgain(float RefireRate);
	bool WeaponFireAgain(float RefireRate, bool bFinishedFire);
	void WaitForMover(class AMover* M);
	void ImpactJump();
	bool CanUseTranslocator();
	bool CanImpactJump();
	float RateWeapon(class AwWeapon* W);
	void UpdatePawnViewPitch();
	class APawn* GetMyPlayer();
	void InitPlayerReplicationInfo();
	bool DontReuseTaunt(int t);
	bool AutoTaunt();
	void SetCombatTimer();
	void Startle(class AActor* Feared);
	void FearThisSpot(class AAvoidMarker* aSpot);
	void TryCombo(const string& ComboName);
	bool CanDoubleJump(class APawn* Other);
	void GetOutOfVehicle();
	bool NotifyHitWall(const struct FVector& HitNormal, class AActor* Wall);
	void SetupSpecialPathAbilities();
	bool ShouldKeepShielding();
	void NotifyAddInventory(class AInventory* NewItem);
	class AwWeapon* HasSuperWeapon();
	void PostBeginPlay();
	void Destroyed();
};


// Class UnrealGame.SquadAI
// 0x00A8 (0x04D4 - 0x042C)
class ASquadAI : public AReplicationInfo
{
public:
	class AUnrealTeamInfo*                             Team;                                                     // 0x042C(0x0004)
	class AController*                                 SquadLeader;                                              // 0x0430(0x0004)
	class ATeamPlayerReplicationInfo*                  LeaderPRI;                                                // 0x0434(0x0004) (Net)
	class ASquadAI*                                    NextSquad;                                                // 0x0438(0x0004)
	class AGameObjective*                              SquadObjective;                                           // 0x043C(0x0004) (Net)
	int                                                Size;                                                     // 0x0440(0x0004)
	class AAssaultPath*                                AlternatePath;                                            // 0x0444(0x0004)
	FName                                              AlternatePathTag;                                         // 0x0448(0x0004)
	class ABot*                                        SquadMembers;                                             // 0x044C(0x0004)
	float                                              GatherThreshold;                                          // 0x0450(0x0004)
	string                                             SupportString;                                            // 0x0454(0x000C) (Localized, NeedCtorLink)
	string                                             DefendString;                                             // 0x0460(0x000C) (Localized, NeedCtorLink)
	string                                             AttackString;                                             // 0x046C(0x000C) (Localized, NeedCtorLink)
	string                                             HoldString;                                               // 0x0478(0x000C) (Localized, NeedCtorLink)
	string                                             FreelanceString;                                          // 0x0484(0x000C) (Localized, NeedCtorLink)
	string                                             SupportStringTrailer;                                     // 0x0490(0x000C) (Localized, NeedCtorLink)
	FName                                              CurrentOrders;                                            // 0x049C(0x0004) (Net)
	class APawn*                                       enemies[0x8];                                             // 0x04A0(0x0004)
	int                                                MaxSquadSize;                                             // 0x04C0(0x0004)
	bool                                               bFreelance;                                               // 0x04C4(0x0004) (Net)
	bool                                               bFreelanceAttack;                                         // 0x04C4(0x0004)
	bool                                               bFreelanceDefend;                                         // 0x04C4(0x0004)
	bool                                               bRoamingSquad;                                            // 0x04C4(0x0004)
	bool                                               bAddTransientCosts;                                       // 0x04C4(0x0004)
	class AUnrealScriptedSequence*                     FreelanceScripts;                                         // 0x04C8(0x0004)
	class ARestingFormation*                           RestingFormation;                                         // 0x04CC(0x0004)
	class UClass*                                      RestingFormationClass;                                    // 0x04D0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.SquadAI");
		return ptr;
	}


	bool FriendlyToward(class APawn* Other);
	bool CautiousAdvance(class ABot* B);
	bool IsDefending(class ABot* B);
	bool ClearPathFor(class AController* C);
	bool PickRetreatDestination(class ABot* B);
	bool BeDevious();
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	class ABot* PickBotToReassign();
	float BotSuitability(class ABot* B);
	bool ShouldDestroyTranslocator(class ABot* B);
	bool CheckSquadObjectives(class ABot* B);
	bool OverrideFollowPlayer(class ABot* B);
	bool CheckSpecialVehicleObjectives(class ABot* B);
	float VehicleDesireability(class AVehicle* V, class ABot* B);
	bool CheckVehicle(class ABot* B);
	void BotEnteredVehicle(class ABot* B);
	bool NeverBail(class APawn* P);
	float MaxVehicleDist(class APawn* P);
	bool AssignSquadResponsibility(class ABot* B);
	void AddTransientCosts(class ABot* B, float f);
	bool AllowTaunt(class ABot* B);
	bool TellBotToFollow(class ABot* B, class AController* C);
	void PickNewLeader();
	int GetSize();
	string GetShortOrderStringFor(class ATeamPlayerReplicationInfo* PRI);
	string GetOrderStringFor(class ATeamPlayerReplicationInfo* PRI);
	FName GetOrders();
	void Retask(class ABot* B);
	void SetObjective(class AGameObjective* o, bool bForceUpdate);
	void SetFreelanceScriptFor(class ABot* B);
	void SetDefenseScriptFor(class ABot* B);
	void SwitchBots(class ABot* MyBot, class ABot* OtherBot);
	void AddBot(class ABot* B);
	void RemoveBot(class ABot* B);
	void RemovePlayer(class APlayerController* P);
	void SetLeader(class AController* C);
	void SetFinalStretch(bool bValue);
	bool FindPathToObjective(class ABot* B, class AActor* o);
	bool TryToIntercept(class ABot* B, class APawn* P, class AActor* RouteGoal);
	void SetAlternatePath(bool bResetSquad);
	void Initialize(class AUnrealTeamInfo* t, class AGameObjective* o, class AController* C);
	void MergeWith(class ASquadAI* S);
	bool CloseToLeader(class APawn* P);
	bool NearFormationCenter(class APawn* P);
	bool WanderNearLeader(class ABot* B);
	bool WaitAtThisPosition(class APawn* P);
	bool ShouldDeferTo(class AController* C);
	float AssessThreat(class ABot* B, class APawn* NewThreat, bool bThreatVisible);
	bool UnderFire(class APawn* NewThreat, class ABot* Ignored);
	float ModifyThreat(float current, class APawn* NewThreat, bool bThreatVisible, class ABot* B);
	bool FindNewEnemyFor(class ABot* B, bool bSeeEnemy);
	void NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn);
	void RemoveEnemy(class APawn* E);
	bool IsOnSquad(class AController* C);
	byte PriorityObjective(class ABot* B);
	bool SetEnemy(class ABot* B, class APawn* NewEnemy);
	bool ValidEnemy(class APawn* NewEnemy);
	bool AddEnemy(class APawn* NewEnemy);
	bool MustKeepEnemy(class APawn* E);
	bool LostEnemy(class ABot* B);
	bool MergeEnemiesFrom(class ASquadAI* S);
	class AActor* FormationCenter();
	struct FRotator GetFacingRotation();
	class AVehicle* GetLinkVehicle(class ABot* B);
	class AVehicle* GetKeyVehicle(class ABot* B);
	class AActor* SetFacingActor(class ABot* B);
	bool AllowImpactJumpBy(class ABot* B);
	bool AllowTranslocationBy(class ABot* B);
	void Destroyed();
	class ARestingFormation* GetRestingFormation();
	bool AllowDetourTo(class ABot* B, class ANavigationPoint* N);
	bool ShouldSuppressEnemy(class ABot* B);
	void CriticalObjectiveWarning(class APawn* NewEnemy);
	void AssignCombo(class ABot* B);
	void Reset();
};


// Class UnrealGame.GameObject
// 0x0048 (0x046C - 0x0424)
class AGameObject : public ADecoration
{
public:
	bool                                               bHome;                                                    // 0x0424(0x0004) (Net)
	bool                                               bHeld;                                                    // 0x0424(0x0004) (Net)
	bool                                               bDisabled;                                                // 0x0424(0x0004)
	bool                                               bLastSecondSave;                                          // 0x0424(0x0004)
	class AUnrealPawn*                                 Holder;                                                   // 0x0428(0x0004)
	class ATeamPlayerReplicationInfo*                  HolderPRI;                                                // 0x042C(0x0004) (Net)
	class AGameObjective*                              HomeBase;                                                 // 0x0430(0x0004)
	float                                              TakenTime;                                                // 0x0434(0x0004)
	float                                              MaxDropTime;                                              // 0x0438(0x0004)
	class AController*                                 FirstTouch;                                               // 0x043C(0x0004)
	class AController*[]                               Assists;                                                  // 0x0440(0x000C) (NeedCtorLink)
	FName                                              GameObjBone;                                              // 0x044C(0x0004)
	struct FVector                                     GameObjOffset;                                            // 0x0450(0x000C)
	struct FRotator                                    GameObjRot;                                               // 0x045C(0x000C)
	class ATeamInfo*                                   OldTeam;                                                  // 0x0468(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.GameObject");
		return ptr;
	}


	void LogReturned();
	void LogDropped();
	void LogTaken(class AController* C);
	void BaseChange();
	void Landed(const struct FVector& HitNormall);
	void NotReachableBy(class APawn* P);
	void FellOutOfWorld(EeKillZType KillType);
	void Touch(class AActor* Other);
	bool ValidHolder(class AActor* Other);
	bool IsHome();
	class AActor* Position();
	void SetDisable(bool Disable);
	void ClearHolder();
	void CalcSetHome();
	void SendHomeDisabled(float TimeOut);
	void SendHome();
	void Drop(const struct FVector& NewVel, const string& sReason);
	void Score();
	void SetHolder(class AController* C);
	bool CanBePickedUpBy(class APawn* P);
	bool CanBeThrownBy(class APawn* P);
	void ForceBegin();
	void PostBeginPlay();
};


// Class UnrealGame.DeathMatch
// 0x0778 (0x1238 - 0x0AC0)
class ADeathMatch : public AUnrealMPGameInfo
{
public:
	struct FAddBotInfo[]                               AddBotQueue;                                              // 0x0AC0(0x000C) (NeedCtorLink)
	int                                                NetWait;                                                  // 0x0ACC(0x0004) (Config)
	int                                                NetWaitClan;                                              // 0x0AD0(0x0004) (Config)
	int                                                MinNetPlayers;                                            // 0x0AD4(0x0004)
	int                                                RestartWait;                                              // 0x0AD8(0x0004)
	bool                                               bForceNoPlayerLights;                                     // 0x0ADC(0x0004)
	bool                                               GiveBotsFakeUID;                                          // 0x0ADC(0x0004)
	bool                                               bAlwaysShowLoginMenu;                                     // 0x0ADC(0x0004) (Edit)
	bool                                               bAllowPlayerLights;                                       // 0x0ADC(0x0004)
	bool                                               bReviewingJumpSpots;                                      // 0x0ADC(0x0004)
	bool                                               bCustomBots;                                              // 0x0ADC(0x0004)
	bool                                               bEpicNames;                                               // 0x0ADC(0x0004)
	bool                                               bKillBots;                                                // 0x0ADC(0x0004)
	bool                                               bDefaultTranslocator;                                     // 0x0ADC(0x0004)
	bool                                               bOverrideTranslocator;                                    // 0x0ADC(0x0004)
	bool                                               bWaitForNetPlayers;                                       // 0x0ADC(0x0004)
	bool                                               bFirstBlood;                                              // 0x0ADC(0x0004)
	bool                                               bQuickStart;                                              // 0x0ADC(0x0004)
	bool                                               bSkipPlaySound;                                           // 0x0ADC(0x0004)
	bool                                               bStartedCountDown;                                        // 0x0ADC(0x0004)
	bool                                               bFinalStartup;                                            // 0x0ADC(0x0004)
	bool                                               bOverTimeBroadcast;                                       // 0x0ADC(0x0004)
	bool                                               bTournament;                                              // 0x0ADC(0x0004)
	bool                                               bAutoNumBots;                                             // 0x0ADC(0x0004)
	bool                                               bColoredDMSkins;                                          // 0x0ADC(0x0004)
	bool                                               bPlayersMustBeReady;                                      // 0x0ADC(0x0004)
	bool                                               bForceRespawn;                                            // 0x0ADC(0x0004)
	bool                                               bAdjustSkill;                                             // 0x0ADC(0x0004)
	bool                                               bAllowTaunts;                                             // 0x0ADC(0x0004)
	bool                                               bAllowTrans;                                              // 0x0ADC(0x0004)
	class AVehicle*[]                                  Vehicles;                                                 // 0x0AE0(0x000C) (NeedCtorLink)
	bool                                               bForceDefaultCharacter;                                   // 0x0AEC(0x0004)
	bool                                               bPlayerBecameActive;                                      // 0x0AEC(0x0004)
	bool                                               bMustHaveMultiplePlayers;                                 // 0x0AEC(0x0004)
	byte                                               StartupStage;                                             // 0x0AF0(0x0001)
	byte                                               Padding00[0x3];                                           // 0x0AF1(0x0003) MISSED OFFSET
	int                                                NumRounds;                                                // 0x0AF4(0x0004)
	float                                              SpawnProtectionTime;                                      // 0x0AF8(0x0004)
	int                                                DefaultMaxLives;                                          // 0x0AFC(0x0004)
	int                                                LateEntryLives;                                           // 0x0B00(0x0004)
	int                                                RemainingTime;                                            // 0x0B04(0x0004)
	int                                                ElapsedTime;                                              // 0x0B08(0x0004)
	int                                                CountDown;                                                // 0x0B0C(0x0004)
	float                                              AdjustedDifficulty;                                       // 0x0B10(0x0004)
	int                                                PlayerKills;                                              // 0x0B14(0x0004)
	int                                                PlayerDeaths;                                             // 0x0B18(0x0004)
	class UClass*                                      DMSquadClass;                                             // 0x0B1C(0x0004)
	class UClass*                                      LevelRulesClass;                                          // 0x0B20(0x0004)
	class ALevelGameRules*                             LevelRules;                                               // 0x0B24(0x0004)
	class AUnrealTeamInfo*                             EnemyRoster;                                              // 0x0B28(0x0004)
	string                                             EnemyRosterName;                                          // 0x0B2C(0x000C) (NeedCtorLink)
	string                                             DefaultEnemyRosterClass;                                  // 0x0B38(0x000C) (NeedCtorLink)
	int                                                RemainingBots;                                            // 0x0B44(0x0004)
	int                                                InitialBots;                                              // 0x0B48(0x0004)
	class ANavigationPoint*                            LastPlayerStartSpot;                                      // 0x0B4C(0x0004)
	class ANavigationPoint*                            LastStartSpot;                                            // 0x0B50(0x0004)
	int                                                NameNumber;                                               // 0x0B54(0x0004)
	int                                                EndMessageWait;                                           // 0x0B58(0x0004)
	int                                                EndMessageCounter;                                        // 0x0B5C(0x0004) (Transient)
	FName                                              AltEndGameSoundName[0x2];                                 // 0x0B60(0x0004)
	int                                                SinglePlayerWait;                                         // 0x0B68(0x0004)
	string                                             NamePrefixes[0xA];                                        // 0x0B6C(0x000C) (NeedCtorLink)
	string                                             NameSuffixes[0xA];                                        // 0x0BE4(0x000C) (NeedCtorLink)
	class AActor*                                      EndGameFocus;                                             // 0x0C5C(0x0004)
	class APlayerController*                           StandalonePlayer;                                         // 0x0C60(0x0004)
	string                                             DMPropsDisplayText[0xE];                                  // 0x0C64(0x000C) (Localized, NeedCtorLink)
	string                                             DMPropDescText[0xE];                                      // 0x0D0C(0x000C) (Localized, NeedCtorLink)
	string                                             YouDestroyed;                                             // 0x0DB4(0x000C) (Localized, NeedCtorLink)
	string                                             YouDestroyedTrailer;                                      // 0x0DC0(0x000C) (Localized, NeedCtorLink)
	float                                              ADR_Kill;                                                 // 0x0DCC(0x0004) (Edit)
	float                                              ADR_MajorKill;                                            // 0x0DD0(0x0004) (Edit)
	float                                              ADR_MinorError;                                           // 0x0DD4(0x0004) (Edit)
	float                                              ADR_MinorBonus;                                           // 0x0DD8(0x0004) (Edit)
	float                                              ADR_KillTeamMate;                                         // 0x0DDC(0x0004) (Edit)
	string                                             EpicNames[0x15];                                          // 0x0DE0(0x000C) (NeedCtorLink)
	string                                             MaleBackupNames[0x20];                                    // 0x0EDC(0x000C) (NeedCtorLink)
	string                                             FemaleBackupNames[0x20];                                  // 0x105C(0x000C) (NeedCtorLink)
	int                                                EpicOffset;                                               // 0x11DC(0x0004)
	int                                                TotalEpic;                                                // 0x11E0(0x0004)
	int                                                MaleBackupNameOffset;                                     // 0x11E4(0x0004)
	int                                                FemaleBackupNameOffset;                                   // 0x11E8(0x0004)
	string                                             LoginMenuClass;                                           // 0x11EC(0x000C) (Edit, Config, NeedCtorLink)
	string[]                                           DMHints;                                                  // 0x11F8(0x000C) (Edit, Localized, NeedCtorLink)
	float                                              InventoryListLastTime;                                    // 0x1204(0x0004)
	int                                                StartPlayerNum;                                           // 0x1208(0x0004)
	FName                                              VoiceTimesUp;                                             // 0x120C(0x0004)
	string                                             sndModeName;                                              // 0x1210(0x000C) (NeedCtorLink)
	string                                             sndModeExplain;                                           // 0x121C(0x000C) (NeedCtorLink)
	class APawn*[]                                     InventoryList;                                            // 0x1228(0x000C) (NeedCtorLink)
	bool                                               SendMatchOverEndState;                                    // 0x1234(0x0004)
	bool                                               SendMatchOverState;                                       // 0x1234(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealGame.DeathMatch");
		return ptr;
	}


	void PermitWeaponChangeInSpecialMode();
	void AnnounceSentryGun_Destory(int iTeamIndex);
	void AnnounceSentryGun_Spawn(class AController* Caller);
	void AnnounceUAV(class AController* Caller);
	void AnnounceHelicopter(class AController* Caller);
	void AnnounceArtillery(class AController* Caller);
	string[] STATIC_GetAllLoadHints(bool bThisClassOnly);
	string STATIC_GetNextLoadHint(const string& MapName);
	void SetGrammar();
	void STATIC_PrecacheGameAnnouncements(class AAnnouncerVoice* V, bool bRewardSounds);
	bool WantsPickups(class ABot* B);
	void EndSpree(class AController* Killer, class AController* Other);
	void NotifySpree(class AController* Other, int Num);
	string STATIC_GetDescriptionText(const string& PropName);
	string STATIC_GetDisplayText(const string& PropName);
	void STATIC_FillPlayInfo(class UPlayInfo* PlayInfo);
	bool STATIC_AcceptPlayInfoProperty(const string& PropertyName);
	void ReviewJumpSpots(const FName& TestLabel);
	void addaistrike(int Num);
	void addaifire(const string& Num, const string& Team);
	void addai(const string& Num, const string& Team);
	void addaibot(const string& Num, const string& Team, const string& Grade, const string& NPCID);
	void AddwAIBot(const string& strNum, const string& strTeam, const string& aiClass, const string& strGrade, const string& strNPCID, const string& strRegenLocationIndex, class AController* callerController, bool bUseDynamicRegenLocation, const struct FVector& v3DynamicRegenLocation, float fDynamicRegenPitch, bool bUseFakeID);
	bool rfAckGetBotID(int Result, byte RequestedAFCount, byte RequestedRSACount, int[] AFBotID, int[] RSABotID);
	void HandleGetBotID(int Team, int[] BotID);
	void EnqueueAddBot(class UClass* BotClass, class AController* callerController, int Team, int Grade, int NPCID, int iRegenLocationIndex, bool bUseDynamicRegenLocation, const struct FVector& v3DynamicRegenLocation, float fDynamicRegenPitch);
	void Killaibots(int Num);
	void Kill(class AController* C);
	void KillBots(int Num);
	void AddBots(int Num);
	void AddNamedBot(const string& botname);
	void dobalancebots();
	void setFakeUID();
	int ReduceDamage(int Damage, class APawn* injured, class APawn* instigatedBy, const struct FVector& HitLocation, class UClass* DamageType, int iWeaponType, struct FVector* Momentum);
	void AdjustSkill(class AAIController* B, class APlayerController* P, bool bWinner);
	void ScoreKill(class AController* Killer, class AController* Other);
	void ScoreObjective(class APlayerReplicationInfo* Scorer, float Score);
	void CheckScore(class APlayerReplicationInfo* Scorer);
	bool CheckMaxLives(class APlayerReplicationInfo* Scorer);
	float RatePlayerStart(class ANavigationPoint* N, byte Team, class AController* Player);
	bool CheckLives(class APlayerReplicationInfo* Scorer);
	void ChangeHostExtraWork();
	void GetUserBackToVehicle();
	void ContinueMatch();
	void RecoverHelicopter(class APawn* P);
	void OnKillingDropOut(class APawn* P);
	void CalcItemUsedTimeAll();
	void ForcedStartMatch();
	void UpdateVehicles();
	void ProcessDefaultInv();
	void GameAddDefaultInventory(class APawn* P);
	void AnnounceTimesUp();
	int GetNetWait();
	void PlayStartupMessage();
	void PlayEndOfMatchMessage();
	class ANavigationPoint* FindPlayerStart_TU(class AController* Player, byte inTeam, const string& incomingName);
	class ANavigationPoint* FindPlayerStart(class AController* Player, byte inTeam, const string& incomingName);
	void SetGameEndType(const string& Reason);
	void EndGame(class APlayerReplicationInfo* Winner, const string& Reason);
	void AnnounceMatchInfo();
	void BalanceBots();
	void StartMatch();
	class AUnrealTeamInfo* FindTeamFor(class AController* C);
	void InitPlacedBot(class AController* C, class URosterEntry* R);
	void InitializeBot(class ABot* NewBot, class AUnrealTeamInfo* BotTeam, class URosterEntry* Chosen);
	class ABot* SpawnBot(const string& botname);
	void PreLoadBot();
	void PreLoadNamedBot(const string& botname);
	class AUnrealTeamInfo* GetBotTeam2(bool forceTeam, int Team);
	class AUnrealTeamInfo* GetBotTeam(int TeamBots);
	void InitTeamSymbols();
	void InitGameReplicationInfo();
	void GetServerDetails(struct FServerResponseLine* ServerState);
	bool NeedPlayers();
	void Logout(class AController* Exiting);
	bool AllowBecomeActivePlayer(class APlayerController* P);
	bool BecomeSpectator(class APlayerController* P);
	void ChangeName(class AController* Other, const string& S, bool bNameChange);
	bool ShouldRespawn(class APickup* Other);
	bool CanSpectate(class APlayerController* Viewer, bool bOnlySpectator, class AActor* ViewTarget);
	void Proccess_AddDefaultInventory(class APawn* PlayerPawn);
	void AddDefaultInventory(class APawn* PlayerPawn);
	bool AddBot(const string& botname);
	void ForceAddBot();
	bool TooManyBots(class AController* botToRemove);
	void RestartPlayer(class AController* aPlayer);
	void ChangeLoadOut(class APlayerController* P, const string& LoadoutName);
	void PostLogin(class APlayerController* NewPlayer);
	class APlayerController* Login(const string& Portal, const string& Options, string* Error);
	bool AtCapacity(bool bSpectator);
	void PlayWinMessage(class APlayerController* Player, bool bWinner);
