#pragma once

// Artic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class WGame.wAILevel
// 0x0088 (0x0460 - 0x03D8)
class AwAILevel : public AwAILevelBase
{
public:
	class UwMatchMaker*                                MM;                                                       // 0x03D8(0x0004)
	class ANavigationPoint*[]                          FrontLineTeam0;                                           // 0x03DC(0x000C) (NeedCtorLink)
	class ANavigationPoint*[]                          FrontLineTeam1;                                           // 0x03E8(0x000C) (NeedCtorLink)
	int                                                Influence0Length;                                         // 0x03F4(0x0004)
	int                                                Influence1Length;                                         // 0x03F8(0x0004)
	int                                                InfluenceNLength;                                         // 0x03FC(0x0004)
	int                                                AllNavsLength;                                            // 0x0400(0x0004)
	class ANavigationPoint*[]                          Influence0;                                               // 0x0404(0x000C) (NeedCtorLink)
	class ANavigationPoint*[]                          Influence1;                                               // 0x0410(0x000C) (NeedCtorLink)
	class ANavigationPoint*[]                          InfluenceN;                                               // 0x041C(0x000C) (NeedCtorLink)
	class ANavigationPoint*[]                          AllNavs;                                                  // 0x0428(0x000C) (NeedCtorLink)
	int                                                NumTypeAR;                                                // 0x0434(0x0004)
	int                                                NumTypeSMG;                                               // 0x0438(0x0004)
	class AwAIBotBase*[]                               Bots;                                                     // 0x043C(0x000C) (NeedCtorLink)
	class UObjectPool*                                 PoolAction;                                               // 0x0448(0x0004)
	class UObjectPool*                                 PoolActionContainer;                                      // 0x044C(0x0004)
	class UObjectPool*                                 PoolActionLayer;                                          // 0x0450(0x0004)
	class UObjectPool*                                 PoolGoal;                                                 // 0x0454(0x0004)
	class UwPlanMaster*                                PlanMaster;                                               // 0x0458(0x0004)
	bool                                               bInitialized;                                             // 0x045C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wAILevel");
		return ptr;
	}


	void ClearReferences();
	void BotsLovePeace();
	void ResetNames();
	class UwNPCItemGroupParam* GetItemParamByGroupID(int GroupID);
	string GetName(int NameGroupID);
	void KillBot(class AAIController* Bot);
	void KillBots(int Num);
	void KillBotsTeam(int Num, int inTeam);
	void RegisterBot(class AwAIBotBase* Bot);
	class UwNPCActions* GetNPCAction(int ActionGroupID);
	bool ActionExists(int ActionGroupID, const string& Action);
	class UwNPCParam* GetNPCParam(int Grade);
	class UwNPCParam* GetNPCParamByNPCID(int NPCID);
	void UpdateInfluenceListScript();
	void UpdateInfluenceList();
	void UpdateInfluenceListNative();
	void UpdateAllNavs();
	class ANavigationPoint* GetRandomDestFromInfluence(byte inTeam);
	class ANavigationPoint* GetRandomDestFromFrontLine(byte inTeam);
	void InitFrontLine();
	void Tick(float dt);
	void InitInfluenceList();
	void Initialize();
	void PreBeginPlay();
};


// Class WGame.wStateData
// 0x007C (0x00A8 - 0x002C)
class UwStateData : public UObject
{
public:
	class AwAIBotBase*                                 Owner;                                                    // 0x002C(0x0004)
	int                                                Ammo;                                                     // 0x0030(0x0004)
	int                                                MaxAmmo;                                                  // 0x0034(0x0004)
	int                                                Magazine;                                                 // 0x0038(0x0004)
	int                                                NumFragGrenade;                                           // 0x003C(0x0004)
	int                                                NumStunGrenade;                                           // 0x0040(0x0004)
	int                                                NumSmokeGrenade;                                          // 0x0044(0x0004)
	class UwWeaponBaseParams*                          CurrentWeapon;                                            // 0x0048(0x0004)
	class UwWeaponBaseParams*[]                        Weapons;                                                  // 0x004C(0x000C) (NeedCtorLink)
	int                                                SwitchWeaponCount;                                        // 0x0058(0x0004)
	bool                                               FreeHead;                                                 // 0x005C(0x0004)
	bool                                               FreeHands;                                                // 0x005C(0x0004)
	bool                                               FreeLegs;                                                 // 0x005C(0x0004)
	bool                                               CannotFindPath;                                           // 0x005C(0x0004)
	bool                                               IsFlashed;                                                // 0x005C(0x0004)
	bool                                               IsStopAction;                                             // 0x005C(0x0004)
	bool                                               IsStopTargeting;                                          // 0x005C(0x0004)
	bool                                               IsStopGotoFlag1;                                          // 0x005C(0x0004)
	bool                                               IsStopGotoFlag2;                                          // 0x005C(0x0004)
	bool                                               IsCrouch;                                                 // 0x005C(0x0004)
	bool                                               IsStand;                                                  // 0x005C(0x0004)
	bool                                               IsProne;                                                  // 0x005C(0x0004)
	int                                                Health;                                                   // 0x0060(0x0004)
	int                                                PropsectDealtDamage;                                      // 0x0064(0x0004)
	int                                                ProspectTakenDamage;                                      // 0x0068(0x0004)
	bool                                               HasSupplyHelicopter;                                      // 0x006C(0x0004)
	bool                                               HasSupplyUAV;                                             // 0x006C(0x0004)
	bool                                               HasSupplyAirstrike;                                       // 0x006C(0x0004)
	struct FVector                                     Location;                                                 // 0x0070(0x000C)
	class UMemoryItem*                                 Target;                                                   // 0x007C(0x0004)
	bool                                               TargetVisible;                                            // 0x0080(0x0004)
	bool                                               TargetReachable;                                          // 0x0080(0x0004)
	int                                                TargetChangeCount;                                        // 0x0084(0x0004)
	bool                                               CanMeleeTarget;                                           // 0x0088(0x0004)
	bool                                               bUseAiming;                                               // 0x0088(0x0004)
	bool                                               bAimingTarget;                                            // 0x0088(0x0004)
	float                                              MeetNewEnemyProbabilty;                                   // 0x008C(0x0004)
	float                                              Time;                                                     // 0x0090(0x0004)
	int                                                NumCapturedFlags;                                         // 0x0094(0x0004)
	class AwFlagObjectiveBase*                         FlagIamOn;                                                // 0x0098(0x0004)
	int                                                World_NumAllies;                                          // 0x009C(0x0004)
	int                                                World_NumEnemies;                                         // 0x00A0(0x0004)
	bool                                               World_IsSDRespawnTime;                                    // 0x00A4(0x0004)
	bool                                               World_TeamGame;                                           // 0x00A4(0x0004)
	bool                                               World_Helicopter;                                         // 0x00A4(0x0004)
	bool                                               World_Airstrike;                                          // 0x00A4(0x0004)
	bool                                               bFireNotInflueceAmmo;                                     // 0x00A4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wStateData");
		return ptr;
	}


	class UwStateData* STATIC_Create();
};


// Class WGame.ShortMemory
// 0x0040 (0x006C - 0x002C)
class UShortMemory : public UObject
{
public:
	class AwAIBotBase*                                 Owner;                                                    // 0x002C(0x0004)
	class ALevelInfo*                                  Level;                                                    // 0x0030(0x0004)
	class UMemoryItem*[]                               Memories;                                                 // 0x0034(0x000C) (NeedCtorLink)
	int                                                NumVisibleMemories;                                       // 0x0040(0x0004)
	float                                              RetentionTIme;                                            // 0x0044(0x0004)
	float                                              ResponseTime;                                             // 0x0048(0x0004)
	float                                              MemoryItemUpdateInterval;                                 // 0x004C(0x0004)
	int                                                ResponseQueueHead;                                        // 0x0050(0x0004)
	float[]                                            ResponseQueueTime;                                        // 0x0054(0x000C) (NeedCtorLink)
	class APawn*[]                                     ResponseQueuePawn;                                        // 0x0060(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.ShortMemory");
		return ptr;
	}


	void DisplayDebug(class UCanvas* C, float* YL, float* YPos);
	void SetOffsetCrouchHeight(float fHeight);
	void SetOffsetStandHeight(float fHeight);
	class UMemoryItem* GetByPawn(class APawn* P, bool createIfNotFound);
	class UMemoryItem* GetByPawn2(class APawn* P);
	void RemoveByPawn(class APawn* P);
	void RemoveAll();
	void ClearReferences();
	void RemoveMemoriesOverRetentionTime();
	bool RememberByVision(class APawn* P);
	bool RememberBySound(class APawn* P, float Loudness);
	void NotifyDestroyed(class AActor* A);
	void Update(float dt);
	class UShortMemory* STATIC_Create(class AwAIBotBase* inOwner, float inResponseTime);
};


// Class WGame.MemoryItem
// 0x0040 (0x006C - 0x002C)
class UMemoryItem : public UObject
{
public:
	class AwAIBotBase*                                 Owner;                                                    // 0x002C(0x0004)
	float                                              LastTime;                                                 // 0x0030(0x0004)
	struct FVector                                     LastPosition;                                             // 0x0034(0x000C)
	float                                              LastTargetedTime;                                         // 0x0040(0x0004)
	class APawn*                                       Pawn;                                                     // 0x0044(0x0004)
	class APlayerReplicationInfo*                      PRI;                                                      // 0x0048(0x0004)
	int                                                MaxPositions;                                             // 0x004C(0x0004)
	bool                                               IsVisible;                                                // 0x0050(0x0004)
	bool                                               IsVisibleOld;                                             // 0x0050(0x0004)
	bool                                               InSight;                                                  // 0x0050(0x0004)
	bool                                               InSightOld;                                               // 0x0050(0x0004)
	struct FVector                                     OffsetStandHeight;                                        // 0x0054(0x000C)
	struct FVector                                     OffsetCrouchHeight;                                       // 0x0060(0x000C)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.MemoryItem");
		return ptr;
	}


	void SetOffsetCrouchHeight(float fHeight);
	void SetOffsetStandHeight(float fHeight);
	void ClearReferences();
	void Update();
	void AddKnownPosition(const struct FVector& V, float t);
	void NotifyDestroyed(class AActor* A);
	class UMemoryItem* STATIC_Create(class AwAIBotBase* inOwner, class APawn* P);
};


// Class WGame.wAIBotBase
// 0x0074 (0x0694 - 0x0620)
class AwAIBotBase : public AAIController
{
public:
	class UGoal*                                       Goal;                                                     // 0x0620(0x0004)
	class UwFutureState*                               FutureState;                                              // 0x0624(0x0004)
	class UShortMemory*                                Memory;                                                   // 0x0628(0x0004)
	class UTargetingSystem*                            TargetSystem;                                             // 0x062C(0x0004)
	class UwActionPlanner*                             Planner;                                                  // 0x0630(0x0004)
	class UwPlanMaster*                                PlanMaster;                                               // 0x0634(0x0004)
	class AwAILevel*                                   AILevel;                                                  // 0x0638(0x0004)
	class UwNPCActions*                                npcActions;                                               // 0x063C(0x0004)
	float                                              UpdateElapsed;                                            // 0x0640(0x0004)
	float                                              UpdateInterval;                                           // 0x0644(0x0004)
	bool                                               TrySprint;                                                // 0x0648(0x0004)
	float                                              DeadTime;                                                 // 0x064C(0x0004)
	float                                              LastRestartRequestTime;                                   // 0x0650(0x0004)
	bool                                               bDrawPath;                                                // 0x0654(0x0004)
	float[]                                            NavExtraCosts;                                            // 0x0658(0x000C) (NeedCtorLink)
	float[]                                            NavDetourExtraCosts;                                      // 0x0664(0x000C) (NeedCtorLink)
	float                                              NavExtraCostFactor_VisCount;                              // 0x0670(0x0004)
	float                                              NavExtraCostFactor_DetourScore;                           // 0x0674(0x0004)
	float                                              NavExtraCostFactor_DetourMaxDistFactor;                   // 0x0678(0x0004)
	class AwFlagObjectiveBase*                         LastTargetFlag;                                           // 0x067C(0x0004)
	FName                                              StateOnPossess;                                           // 0x0680(0x0004)
	struct FVector                                     UpVector;                                                 // 0x0684(0x000C)
	bool                                               IsStopAction;                                             // 0x0690(0x0004)
	bool                                               IsStopTargeting;                                          // 0x0690(0x0004)
	bool                                               IsStopGotoFlag1;                                          // 0x0690(0x0004)
	bool                                               IsStopGotoFlag2;                                          // 0x0690(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wAIBotBase");
		return ptr;
	}


	void DisplayDebug_Path(class UCanvas* C, float* YL, float* YPos);
	void DisplayDebug(class UCanvas* C, float* YL, float* YPos);
	int SetFireYaw(int FireYaw);
	struct FRotator AdjustAim(const struct FFireProperties& FiredAmmunition, const struct FVector& projStart, int AimError);
	void NotifyKilled(class AController* Killer, class AController* Killed, class APawn* KilledPawn);
	void HearNoise(float Loudness, class AActor* NoiseMaker);
	void SeeMonster(class APawn* SeenPlayer);
	void SeePlayer(class APawn* SeenPlayer);
	void NotifyVehicle(class AVehicle* V);
	void OnMemoryVisibleChanged();
	void HandleMessage(const string& Msg);
	void wClientFlash(float fTime);
	bool IsProning();
	void TryProne();
	bool IsCrouching();
	void TryCrouch();
	bool IsStandingUp();
	void TryStandUp();
	bool IsSprinting();
	void SetSprint(bool Value);
	void PawnDied(class APawn* P);
	void ClientOnEndWaitingForStart();
	void ZeroExtraCost();
	void CopyNavExtraCost();
	void UpdateNavDetourExtraCostScript(const struct FVector& S, const struct FVector& E);
	void UpdateNavDetourExtraCost(const struct FVector& S, const struct FVector& E);
	void UpdateNavDetourExtraCostNative(const struct FVector& S, const struct FVector& E);
	void InitNavExtraCost();
	void Cmd(const string& P1, const string& P2, const string& p3, const string& p4, const string& p5);
	float EvaluateState(class UwStateData* S);
	void SetupWStateNative(class UwStateData** S);
	void NotifyAddDefaultInventory();
	void NotifyAddInventory(class AInventory* NewItem);
	void SetupWeapons(class APawn* aPawn);
	void SetPawnClass(const string& inClass, const string& InCharacter);
	void SetName(class UwNPCParam* Param);
	void InitBot(int Grade);
	void ClearReferences();
	bool WeaponFireAgain(float RefireRate, bool bFinishedFire);
	bool ReadyToMeleeAttack();
};


// Class WGame.wUtil
// 0x0064 (0x0090 - 0x002C)
class UwUtil : public UObject
{
public:
	string                                             SectionName;                                              // 0x002C(0x000C) (Edit, Const, NeedCtorLink)
	string                                             FileExtension;                                            // 0x0038(0x000C) (Edit, Const, NeedCtorLink)
	class UCachePlayers*                               CachedPlayerList;                                         // 0x0044(0x0004) (Edit, Const, Transient)
	string                                             NoPreference;                                             // 0x0048(0x000C) (Localized, NeedCtorLink)
	string                                             FavoriteWeapon;                                           // 0x0054(0x000C) (Localized, NeedCtorLink)
	string                                             AgilityString;                                            // 0x0060(0x000C) (Localized, NeedCtorLink)
	string                                             TacticsString;                                            // 0x006C(0x000C) (Localized, NeedCtorLink)
	string                                             AccuracyString;                                           // 0x0078(0x000C) (Localized, NeedCtorLink)
	string                                             AggressivenessString;                                     // 0x0084(0x000C) (Localized, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wUtil");
		return ptr;
	}


	class UClass*[] STATIC_GetMutatorClasses(string[] MutClassNames);
	int STATIC_GetTeamInfoSalaryFor(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_GetTeamSalaryFor(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayTacticsRating(string[] Players);
	int STATIC_TeamInfoTacticsRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamTacticsRating(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayAgilityRating(string[] Players);
	int STATIC_TeamInfoAgilityRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamAgilityRating(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayAggressivenessRating(string[] Players);
	int STATIC_TeamInfoAggressivenessRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamAggressivenessRating(class UGameProfile* GP, int lineupsize);
	int STATIC_TeamArrayAccuracyRating(string[] Players);
	int STATIC_TeamInfoAccuracyRating(class AUnrealTeamInfo* UT, int lineupsize);
	int STATIC_TeamAccuracyRating(class UGameProfile* GP, int lineupsize);
	int STATIC_AggressivenessRating(const struct FPlayerRecord& PRE);
	int STATIC_TacticsRating(const struct FPlayerRecord& PRE);
	int STATIC_AgilityRating(const struct FPlayerRecord& PRE);
	int STATIC_AccuracyRating(const struct FPlayerRecord& PRE);
	int STATIC_RatingModifier(const string& CharacterName);
	string STATIC_GetFavoriteWeaponFor(const struct FPlayerRecord& PRE);
	int STATIC_GetSalaryFor(const struct FPlayerRecord& PRE);
	struct FPlayerRecord STATIC_FindPlayerRecord(const string& CharName);
	void STATIC_GetMutatorList(struct UwUtil_FMutatorRecord[] MutatorRecords);
	class UDecoText* STATIC_LoadDecoText(const string& PackageName, const string& DecoTextName, int ColumnCount);
	struct FPlayerRecord STATIC_FindUPLPlayerRecord(const string& CharName);
	struct FPlayerRecord STATIC_GetPlayerRecord(int Index);
	void STATIC_GetPlayerList(struct FPlayerRecord[]* PlayerRecords);
};


// Class WGame.wPlayerInfo
// 0x0000 (0x002C - 0x002C)
class UwPlayerInfo : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wPlayerInfo");
		return ptr;
	}


	bool STATIC_Setup(class AwPawn* P, const struct FPlayerRecord& Rec);
	bool STATIC_SetupPawn(class AwPawn* P, int iBodyItemID, int iHelmetItemID, int iAcceItemID, int iBackPackID, int iPouchID, int iCamouflageID, int iTeamIndex);
};


// Class WGame.SpeciesType
// 0x01B0 (0x01DC - 0x002C)
class USpeciesType : public UObject
{
public:
	string                                             MaleVoice;                                                // 0x002C(0x000C) (NeedCtorLink)
	string                                             FemaleVoice;                                              // 0x0038(0x000C) (NeedCtorLink)
	string                                             GibGroup;                                                 // 0x0044(0x000C) (NeedCtorLink)
	string                                             MaleRagSkelName;                                          // 0x0050(0x000C) (NeedCtorLink)
	string                                             FemaleRagSkelName;                                        // 0x005C(0x000C) (NeedCtorLink)
	string                                             FemaleSkeleton;                                           // 0x0068(0x000C) (NeedCtorLink)
	string                                             MaleSkeleton;                                             // 0x0074(0x000C) (NeedCtorLink)
	string                                             MaleSoundGroup;                                           // 0x0080(0x000C) (NeedCtorLink)
	string                                             FemaleSoundGroup;                                         // 0x008C(0x000C) (NeedCtorLink)
	string                                             PawnClassName;                                            // 0x0098(0x000C) (NeedCtorLink)
	string                                             SpeciesName;                                              // 0x00A4(0x000C) (Localized, NeedCtorLink)
	int                                                RaceNum;                                                  // 0x00B0(0x0004)
	int                                                DMTeam;                                                   // 0x00B4(0x0004)
	FName                                              TauntAnims[0x10];                                         // 0x00B8(0x0004)
	string                                             TauntAnimNames[0x10];                                     // 0x00F8(0x000C) (Localized, NeedCtorLink)
	float                                              AirControl;                                               // 0x01B8(0x0004)
	float                                              GroundSpeed;                                              // 0x01BC(0x0004)
	float                                              WaterSpeed;                                               // 0x01C0(0x0004)
	float                                              JumpZ;                                                    // 0x01C4(0x0004)
	float                                              ReceivedDamageScaling;                                    // 0x01C8(0x0004)
	float                                              DamageScaling;                                            // 0x01CC(0x0004)
	float                                              AccelRate;                                                // 0x01D0(0x0004)
	float                                              DodgeSpeedFactor;                                         // 0x01D4(0x0004)
	float                                              DodgeSpeedZ;                                              // 0x01D8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.SpeciesType");
		return ptr;
	}


	int STATIC_GetOffsetForSequence(const FName& Sequence);
	bool STATIC_Setup(class AwPawn* P, const struct FPlayerRecord& Rec);
	void STATIC_SetTeamSkin(class AwPawn* P, const struct FPlayerRecord& Rec, int TeamNum);
	string STATIC_GetRagSkelName(const string& MeshName);
	void STATIC_ModifyPawn(class APawn* P);
	int STATIC_ModifyImpartedDamage(int Damage, class APawn* injured, class APawn* instigatedBy, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType);
	int STATIC_ModifyReceivedDamage(int Damage, class APawn* injured, class APawn* instigatedBy, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType);
	void STATIC_LoadResources(const struct FPlayerRecord& Rec, class ALevelInfo* Level, class APlayerReplicationInfo* PRI, int TeamNum);
	string STATIC_GetVoiceType(bool bIsFemale, class ALevelInfo* Level);
};


// Class WGame.AimedAttachment
// 0x001C (0x03F4 - 0x03D8)
class AAimedAttachment : public AActor
{
public:
	byte                                               Padding00[0x1C];                                          // 0x03D8(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.AimedAttachment");
		return ptr;
	}

};


// Class WGame.CachePlayers
// 0x000C (0x009C - 0x0090)
class UCachePlayers : public UwUtil
{
public:
	struct FPlayerRecord[]                             Records;                                                  // 0x0090(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.CachePlayers");
		return ptr;
	}

};


// Class WGame.DecoText
// 0x0018 (0x0044 - 0x002C)
class UDecoText : public UObject
{
public:
	string                                             TextName;                                                 // 0x002C(0x000C) (Edit, NeedCtorLink)
	string[]                                           Rows;                                                     // 0x0038(0x000C) (Edit, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.DecoText");
		return ptr;
	}

};


// Class WGame.AnimNotify_Nemesis_BeamPrepare
// 0x0000 (0x0030 - 0x0030)
class UAnimNotify_Nemesis_BeamPrepare : public UAnimNotify_Scripted
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.AnimNotify_Nemesis_BeamPrepare");
		return ptr;
	}


	void Notify(class AActor* Owner);
};


// Class WGame.wPawn
// 0x0678 (0x18CC - 0x1254)
class AwPawn : public AUnrealPawn
{
public:
	int                                                RepeaterDeathCount;                                       // 0x1254(0x0004)
	class ACombo*                                      CurrentCombo;                                             // 0x1258(0x0004)
	bool                                               bSpawnDone;                                               // 0x125C(0x0004)
	bool                                               bFrozenBody;                                              // 0x125C(0x0004)
	bool                                               bFlaming;                                                 // 0x125C(0x0004)
	bool                                               bRubbery;                                                 // 0x125C(0x0004)
	bool                                               bClearWeaponOffsets;                                      // 0x125C(0x0004)
	bool                                               bBerserk;                                                 // 0x125C(0x0004)
	bool                                               bInvis;                                                   // 0x125C(0x0004)
	bool                                               bOldInvis;                                                // 0x125C(0x0004)
	bool                                               bGibbed;                                                  // 0x125C(0x0004)
	bool                                               bCanDodgeDoubleJump;                                      // 0x125C(0x0004)
	bool                                               bCanBoostDodge;                                           // 0x125C(0x0004)
	bool                                               bAlreadySetup;                                            // 0x125C(0x0004)
	bool                                               bSpawnIn;                                                 // 0x125C(0x0004)
	float                                              ShieldStrengthMax;                                        // 0x1260(0x0004) (Edit)
	float                                              SmallShieldStrength;                                      // 0x1264(0x0004)
	class UClass*                                      Species;                                                  // 0x1268(0x0004)
	float                                              GruntVolume;                                              // 0x126C(0x0004) (Edit)
	float                                              FootstepVolume;                                           // 0x1270(0x0004) (Edit)
	int                                                SimHitFxTicker;                                           // 0x1274(0x0004) (Transient)
	class UClass*                                      GibGroupClass;                                            // 0x1278(0x0004) (Edit)
	int                                                GibCountCalf;                                             // 0x127C(0x0004) (Edit)
	int                                                GibCountForearm;                                          // 0x1280(0x0004) (Edit)
	int                                                GibCountHead;                                             // 0x1284(0x0004) (Edit)
	int                                                GibCountTorso;                                            // 0x1288(0x0004) (Edit)
	int                                                GibCountUpperArm;                                         // 0x128C(0x0004) (Edit)
	float                                              MinTimeBetweenPainSounds;                                 // 0x1290(0x0004)
	string                                             HeadShotMessage;                                          // 0x1294(0x000C) (Localized, NeedCtorLink)
	string                                             SoundFootsteps[0x1E];                                     // 0x12A0(0x000C) (NeedCtorLink)
	string                                             SoundFootsteps_3rd[0x1E];                                 // 0x1408(0x000C) (NeedCtorLink)
	class UClass*                                      SoundGroupClass;                                          // 0x1570(0x0004) (Edit)
	string                                             sndScream;                                                // 0x1574(0x000C) (NeedCtorLink)
	string                                             sndDie;                                                   // 0x1580(0x000C) (NeedCtorLink)
	class AwWeaponAttachment*                          WeaponAttachment;                                         // 0x158C(0x0004)
	class AwFPWeaponAttachment*                        FPWeaponAttachment;                                       // 0x1590(0x0004)
	class AShadowProjector*                            PlayerShadow;                                             // 0x1594(0x0004)
	class AEffect_ShadowController*                    RealtimeShadow;                                           // 0x1598(0x0004)
	bool                                               bRealtimeShadows;                                         // 0x159C(0x0004)
	int                                                iShadowType;                                              // 0x15A0(0x0004)
	int                                                MultiJumpRemaining;                                       // 0x15A4(0x0004)
	int                                                MaxMultiJump;                                             // 0x15A8(0x0004)
	int                                                MultiJumpBoost;                                           // 0x15AC(0x0004)
	FName                                              WallDodgeAnims[0x4];                                      // 0x15B0(0x0004)
	FName                                              IdleHeavyAnim;                                            // 0x15C0(0x0004)
	FName                                              FireHeavyRapidAnim;                                       // 0x15C4(0x0004)
	FName                                              FireHeavyBurstAnim;                                       // 0x15C8(0x0004)
	FName                                              FireRootBone;                                             // 0x15CC(0x0004)
	FName                                              Pistol_FireRifleRapidAnim;                                // 0x15D0(0x0004)
	FName                                              TelegraphPack_PutdownAnim;                                // 0x15D4(0x0004)
	FName                                              TelegraphPack_SelectAnim;                                 // 0x15D8(0x0004)
	FName                                              Pistol_FireAimCrouchRifleRapidAnim;                       // 0x15DC(0x0004)
	EFireAnimState                                     FireState;                                                // 0x15E0(0x0001)
	byte                                               Padding00[0x3];                                           // 0x15E1(0x0003) MISSED OFFSET
	class UMesh*                                       SkeletonMesh;                                             // 0x15E4(0x0004)
	bool                                               bSkeletized;                                              // 0x15E8(0x0004)
	bool                                               bDeRes;                                                   // 0x15E8(0x0004)
	float                                              DeResTime;                                                // 0x15EC(0x0004)
	class AEmitter*                                    DeResFX;                                                  // 0x15F0(0x0004)
	struct FInterpCurve                                DeResLiftVel;                                             // 0x15F4(0x000C) (Edit, NeedCtorLink)
	struct FInterpCurve                                DeResLiftSoftness;                                        // 0x1600(0x000C) (Edit, NeedCtorLink)
	float                                              DeResGravScale;                                           // 0x160C(0x0004) (Edit)
	float                                              DeResLateralFriction;                                     // 0x1610(0x0004) (Edit)
	float                                              RagdollLifeSpan;                                          // 0x1614(0x0004) (Edit)
	float                                              RagInvInertia;                                            // 0x1618(0x0004) (Edit)
	float                                              RagDeathVel;                                              // 0x161C(0x0004) (Edit)
	float                                              RagShootStrength;                                         // 0x1620(0x0004) (Edit)
	float                                              RagSpinScale;                                             // 0x1624(0x0004) (Edit)
	float                                              RagDeathUpKick;                                           // 0x1628(0x0004) (Edit)
	float                                              RagGravScale;                                             // 0x162C(0x0004) (Edit)
	class UMaterial*                                   RagConvulseMaterial;                                      // 0x1630(0x0004) (Edit)
	class USound*[]                                    RagImpactSounds;                                          // 0x1634(0x000C) (Edit, NeedCtorLink)
	float                                              RagImpactSoundInterval;                                   // 0x1640(0x0004) (Edit)
	float                                              RagImpactVolume;                                          // 0x1644(0x0004) (Edit)
	float                                              RagLastSoundTime;                                         // 0x1648(0x0004) (Transient)
	string                                             RagdollOverride;                                          // 0x164C(0x000C) (NeedCtorLink)
	class AController*                                 OldController;                                            // 0x1658(0x0004)
	class UMaterial*                                   RealSkins[0x4];                                           // 0x165C(0x0004)
	string                                             PlacedCharacterName;                                      // 0x166C(0x000C) (Edit, NeedCtorLink)
	string                                             PlacedFemaleCharacterName;                                // 0x1678(0x000C) (NeedCtorLink)
	byte                                               TeamSkin;                                                 // 0x1684(0x0001)
	byte                                               Padding01[0x3];                                           // 0x1685(0x0003) MISSED OFFSET
	class AwSkinShell*                                 wParts[0x4];                                              // 0x1688(0x0004)
	int                                                MyCamouFlageID;                                           // 0x1698(0x0004)
	int                                                MyTeamIdx;                                                // 0x169C(0x0004)
	class AwSkinShell*                                 wGoreParts[0x5];                                          // 0x16A0(0x0004)
	int                                                iDiedCollisionPart;                                       // 0x16B4(0x0004)
	int                                                iBackupTeamNum;                                           // 0x16B8(0x0004)
	int                                                iWarpCount;                                               // 0x16BC(0x0004)
	string                                             strGoreMeshName;                                          // 0x16C0(0x000C) (NeedCtorLink)
	string                                             strGoreStaticMeshName;                                    // 0x16CC(0x000C) (NeedCtorLink)
	int                                                AddedSkillList[0x16];                                     // 0x16D8(0x0004)
	int                                                iStartQSlotIndex;                                         // 0x1730(0x0004)
	bool                                               bBurning;                                                 // 0x1734(0x0004)
	float                                              fLastBurningTime;                                         // 0x1738(0x0004)
	class AwProjectile*                                BurningProj;                                              // 0x173C(0x0004)
	bool                                               bProximityFuze;                                           // 0x1740(0x0004)
	float                                              fProximityFuzeTime;                                       // 0x1744(0x0004)
	class AwPawn*                                      ProximityBot;                                             // 0x1748(0x0004)
	class AEmitter*                                    allyEffect;                                               // 0x174C(0x0004)
	FName                                              Hit_Stun;                                                 // 0x1750(0x0004)
	FName                                              Hit_Stun_Cr;                                              // 0x1754(0x0004)
	FName                                              Hit_Stun_Pr;                                              // 0x1758(0x0004)
	FName                                              Hit_PS[0x4];                                              // 0x175C(0x0004)
	FName                                              Hit_PS_Head;                                              // 0x176C(0x0004)
	FName                                              Hit_PS_Cr[0x4];                                           // 0x1770(0x0004)
	FName                                              Hit_PS_Pr;                                                // 0x1780(0x0004)
	FName                                              Hit_PS_Stun;                                              // 0x1784(0x0004)
	FName                                              Hit_PS_Stun_Cr;                                           // 0x1788(0x0004)
	FName                                              Hit_PS_Stun_Pr;                                           // 0x178C(0x0004)
	FName                                              Hit_FR[0x4];                                              // 0x1790(0x0004)
	FName                                              Hit_FR_Head;                                              // 0x17A0(0x0004)
	FName                                              Hit_FR_Cr[0x4];                                           // 0x17A4(0x0004)
	FName                                              Hit_FR_Pr;                                                // 0x17B4(0x0004)
	FName                                              Hit_FR_Stun;                                              // 0x17B8(0x0004)
	FName                                              Hit_FR_Stun_Cr;                                           // 0x17BC(0x0004)
	FName                                              Hit_FR_Stun_Pr;                                           // 0x17C0(0x0004)
	FName                                              Hit_RPG[0x4];                                             // 0x17C4(0x0004)
	FName                                              Hit_RPG_Head;                                             // 0x17D4(0x0004)
	FName                                              Hit_RPG_Cr[0x4];                                          // 0x17D8(0x0004)
	FName                                              Hit_RPG_Pr;                                               // 0x17E8(0x0004)
	FName                                              Hit_RPG_Stun;                                             // 0x17EC(0x0004)
	FName                                              Hit_RPG_Stun_Cr;                                          // 0x17F0(0x0004)
	FName                                              Hit_RPG_Stun_Pr;                                          // 0x17F4(0x0004)
	FName                                              Meele_Rifle_Fail;                                         // 0x17F8(0x0004)
	FName                                              Meele_Rifle_Cr_Fail;                                      // 0x17FC(0x0004)
	FName                                              Meele_Rifle_Pr_Fail;                                      // 0x1800(0x0004)
	FName                                              Meele_Knife_Fail;                                         // 0x1804(0x0004)
	FName                                              Meele_Knife_Cr_Fail;                                      // 0x1808(0x0004)
	FName                                              Meele_Knife_Pr_Fail;                                      // 0x180C(0x0004)
	FName                                              Knife_Fire;                                               // 0x1810(0x0004)
	FName                                              Knife_Fire_Cr;                                            // 0x1814(0x0004)
	FName                                              Knife_Fire_Pr;                                            // 0x1818(0x0004)
	FName                                              Rifle_Crouch_BoltLeverAnim;                               // 0x181C(0x0004)
	FName                                              Reload_Rifle_2nd_Anim;                                    // 0x1820(0x0004)
	FName                                              Reload_Crouch_Rifle_Anim;                                 // 0x1824(0x0004)
	FName                                              Reload_Crouch_Rifle_2nd_Anim;                             // 0x1828(0x0004)
	FName                                              Reload_Prone_Rifle_2nd_Anim;                              // 0x182C(0x0004)
	FName                                              Pistol_Reload_Rifle_2nd_Anim;                             // 0x1830(0x0004)
	FName                                              Pistol_CrouchReload;                                      // 0x1834(0x0004)
	FName                                              Pistol_CrouchReload_2nd;                                  // 0x1838(0x0004)
	FName                                              Pistol_ProneReload_2nd;                                   // 0x183C(0x0004)
	FName                                              Rpg_Reload_2nd_Anim;                                      // 0x1840(0x0004)
	FName                                              Rpg_CrouchReload;                                         // 0x1844(0x0004)
	FName                                              Rpg_CrouchReload_2nd;                                     // 0x1848(0x0004)
	FName                                              Rpg_ProneReload_2nd;                                      // 0x184C(0x0004)
	FName                                              Putdown_Crouch_Rifle_Anim;                                // 0x1850(0x0004)
	FName                                              PutdownQuick_Crouch_Rifle_Anim;                           // 0x1854(0x0004)
	FName                                              Pistol_CrouchPutdown;                                     // 0x1858(0x0004)
	FName                                              Pistol_CrouchPutdownQuick;                                // 0x185C(0x0004)
	FName                                              Frag_CrouchPutdown;                                       // 0x1860(0x0004)
	FName                                              Frag_CrouchPutdownQuick;                                  // 0x1864(0x0004)
	FName                                              Rpg_CrouchPutdown;                                        // 0x1868(0x0004)
	FName                                              Rpg_CrouchPutdownQuick;                                   // 0x186C(0x0004)
	FName                                              Select_Crouch_Rifle_Anim;                                 // 0x1870(0x0004)
	FName                                              SelectNew_Crouch_Rifle_Anim;                              // 0x1874(0x0004)
	FName                                              Pistol_CrouchSelect;                                      // 0x1878(0x0004)
	FName                                              Frag_CrouchSelect;                                        // 0x187C(0x0004)
	FName                                              Rpg_CrouchSelect;                                         // 0x1880(0x0004)
	bool                                               bEndProned;                                               // 0x1884(0x0004)
	bool                                               bEndCrouched;                                             // 0x1884(0x0004)
	int[]                                              wRequiredEquipment;                                       // 0x1888(0x000C) (Edit, NeedCtorLink)
	int[]                                              wRequiredParts;                                           // 0x1894(0x000C) (NeedCtorLink)
	bool                                               bAimed;                                                   // 0x18A0(0x0004)
	bool                                               bIsMeleeAttacking;                                        // 0x18A0(0x0004)
	struct FVector                                     GrenadeFireLocation;                                      // 0x18A4(0x000C)
	struct FRotator                                    GrenadeFireRotation;                                      // 0x18B0(0x000C)
	struct FVector                                     GrenadeExplodeLocation;                                   // 0x18BC(0x000C)
	class UClass*                                      FPWeaponAttachmentClass;                                  // 0x18C8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class WGame.wPawn");
		return ptr;
	}


	void SpawnDSentry();
	void SpawnSentry(const string& strCheatTeamID);
	void SkillInit(bool bQuickslotChange);
	void ClientSkillDeadPlayer();
	void AddAllyEffect(int iSideIndex);
	void reset_weapon();
	void DisplayDebug(class UCanvas* Canvas, float* YL, float* YPos);
	void SetBurning(bool bBurn, class AwProjectile* proj);
	void GetWeaponAttachmentInfo(byte* byFlashCount, byte* byFiringMode);
	void SetWeaponQuickChange(bool bOn);
	void SetWeaponQuickReload(bool bOn);
	void SetWeaponQuickAimZoom(bool bOn);
	bool AddWeaponFillAmmoAndMagazine();
	bool AddWeaponMagazine();
	void SetRemoveWeaponSkill(class AwWeapon* W);
	void SetAddWeaponSkill(class AwWeapon* W, int iaWeaponID, int iPartsID);
	void RenderFPWeaponAttachment(class UCanvas* C);
	void MakeShellEffect_Rechamber();
	void MakeShellEffect();
	void ServerCallNoWeaponMessage(byte bySlot);
	void AddNoWeaponChangeMessage(byte bySlot);
	void HandlePickup(class APickup* pick);
	void PlayReload();
	void PlayRechamber();
	void PlayMelee(bool bMeleeKnifeOrButt);
	void PostRender2D(class UCanvas* C, float ScreenLocX, float ScreenLocY);
	int SpawnSupplyItem();
	int SpawnBlackbox();
	void SpawnMedals();
	void ClientSwitchToLastWeapon(byte defuseSwitch);
	void ServerQSlotChangeCheck();
	void ClientQSlotChangeCheck();
	void AddBaseInvenWeapon(class UwMatchUserInfo* kUser, int iPos);
	void SetSelectedQuickSlotInventory(class UwMatchUserInfo* kUser, bool bQuickslotChange);
	void AddWeaponByWeaponLimited(int iWeaponID, int iPartsID, const struct FBtrDouble& UniqueID);
	void SetInfiniteAmmoTutorial(bool bDeleteGranade, int iGranadeCount);
	void SetInfiniteAmmo(int ammoCount);
	bool CheckWeaponBySubGameMode(class UwMatchUserInfo* kUser);
	void AddDefaultInventoryDOA(bool bQuickslotChange);
	void SetGrenadlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetFlameThrowerlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetMGlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetShotGunlInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void SetPistolInvenByWeaponLimited(int i, class UwMatchMaker* kMM, class UwMatchUserInfo* kUser, bool IsQuick);
	void AddDefaultInventory(bool bQuickslotChange);
	void RemoveInventoryByDamageType(EeWeaponType removeWeaponType);
	void RemoveAllInventory();
	void ChangeInventoryByQSlot();
	int GetSlotPosbySkillID(class UwMatchUserInfo* kUser, int iSkillID);
	void AddBaseInvenSkill(class UwMatchUserInfo* kUser, int iPos);
	void SetSelectedQuickSlotSkills(class UwMatchUserInfo* kUser);
	void AddWeaponFromSkill(const struct FBtrDouble& iUniqueID, int iaWeaponID);
	void AddSkillByInventory(class UwMatchUserInfo* kUser);
	void AddDefaultSkills(bool bQuickslotChange);
	EGibType GetGibParts(int iCollisionPart);
	void SpawnGoreGiblet(int iIndex);
	void MakeGorePawn(int iPart);
	void EndCrouch(float HeightAdjust);
	void EndProne(float HeightAdjust);
	void SetParts(EePlayerParts iPartsIndex, class UMesh* resMesh, class UStaticMesh* resStaticMesh);
	class UMaterial* GetCamouflage(int iItemID, byte byTeam);
	void SetCamouflage(int iItemID, byte byTeam);
	void ResetAllParts();
	void Died(class AController* Killer, class UClass* DamageType, const struct FVector& HitLocation, int CollisionPart, int WeaponType, bool bWallShot);
	void DoDerezEffect();
	class UClass* GetGibClass(EGibType gibType);
	string GetSound(ESoundType soundType);
	void ClientResetPhysicsBasedAnim();
	void ResetPhysicsBasedAnim();
	void Setup(const struct FPlayerRecord& Rec, bool bLoadNow);
	string GetDefaultCharacter();
	bool ForceDefaultCharacter();
	bool CheckValidMaleDefault();
	bool CheckValidFemaleDefault();
	void ClientReStart();
	void PostNetReceive();
	void NotifyTeamChanged();
	bool DoJump(bool bUpdating);
	bool CanMultiJump();
	bool CanDoubleJump();
	void DoDoubleJump(bool bUpdating);
	bool PerformDodge(EDoubleClickDir DoubleClickMove, const struct FVector& Dir, const struct FVector& Cross);
	bool Dodge(EDoubleClickDir DoubleClickMove);
	struct FVector BotDodge(const struct FVector& Dir);
	void SetInvisibility(float Time);
	void ServerChangedWeapon(class AwWeapon* OldWeapon, class AwWeapon* newWeapon);
	void ChangedWeapon();
	void SetWeaponOverlay(class UMaterial* mat, float Time, bool override);
	void DisableUDamage();
	void EnableUDamage(float Amount);
	bool HasUDamage();
	void DoCombo(class UClass* ComboClass);
	void DoComboName(const string& ComboClassName);
	bool InCurrentCombo();
	bool AddShieldStrength(int ShieldAmount);
	int CanUseShield(int ShieldAmount);
	float GetShieldStrength();
	float GetShieldStrengthMax();
	void TakeDamageSound(int LeftHealth, int ActualDamage, const struct FVector& HitLocation, class UClass* DamageType, int CollisionPart, int WeaponType, class AController* Killer);
	void PlayFootStepRight();
	void PlayFootStepLeft();
	void FootStepping(int side);
	void PlayEquipHitSound();
	void PlayBreathSound();
	void PlayDirectionalHit(const struct FVector& HitLoc, bool bUseHitStun, bool bGoreChange);
	void PlayDirectionalDeath(const struct FVector& HitLoc);
	void KImpact(class AActor* Other, const struct FVector& pos, const struct FVector& impactVel, const struct FVector& impactNorm);
	void PlayTakeHit(const struct FVector& HitLocation, int Damage, class UClass* DamageType);
	void ClientDying(class UClass* DamageType, const struct FVector& HitLocation);
	void SpawnGibs(const struct FRotator& HitRotation, float ChunkPerterbation);
	void PlayDyingAnimation(class UClass* DamageType, const struct FVector& HitLoc);
	void PlayDying(class UClass* DamageType, const struct FVector& HitLoc, int CollisionPart);
	void RandSpin(float spinRate);
	void KSkelConvulse();
	void SetWeaponAttachment(class AwWeaponAttachment* NewAtt);
	void PlayVictoryAnimation();
	void CheckProneAni(bool bGoProne);
	void ServerThrowsWeaponAnim(bool bQuick);
	void ServerPlayPutdownWeaponAnim(bool bQuick);
	void PlayWeaponSwitch(class AwWeapon* newWeapon);
	void AnimEnd(int Channel);
	void ScriptPlayIdle(int Channel);
	void InitialPlayer();
	bool GetIsFiring();
	void StopFiring();
	void StartFiring(bool bHeavy, bool bRapid);
	void SetAnimAction(const FName& NewAction, bool bNoBlendAnim);
	bool FindValidTaunt(FName* Sequence);
	void PlayDoubleJump();
	FName GetAnimSequence();
	void Landed(const struct FVector& HitNormal);
	void PlayLandedSound(int SurfType);
	FName GetOffhandBoneFor(class AInventory* i);
	FName GetWeaponBoneFor(class AInventory* i);
	bool CheckReflect(const struct FVector& HitLocation, int Damage, struct FVector* RefNormal);
	void PlayHit(float Damage, class APawn* instigatedBy, const struct FVector& HitLocation, class UClass* DamageType, const struct FVector& Momentum, int CollisionPart);
	void PostNetBeginPlay();
	void InitMyParam();
	void PostBeginPlay();
	void WithinRadius();
	void SetProximityFuze(bool bProximity, class AwPawn* aiBot);
	void TickDamageWithinRadius(float DeltaTime);
	void Tick(float DeltaTime);
	void TestVersion_SetParameters();
	void TickDeRes(float DeltaTime);
	void SetOverlayMaterial(class UMaterial* mat, float Time, bool bOverride);
	void StartDeRes();
	void DoDamageFX(const FName& BoneName, int Damage, class UClass* DamageType, const struct FRotator& R, const struct FVector& HitLoc, int CollisionPart);
	void CalcHitLoc(const struct FVector& HitLoc, const struct FVector& hitRay, FName* BoneName, float* dist);
	void HideBone(const FName& BoneName);
