#pragma once

// Artic Combat (3369) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class XInterface.GUI
// 0x0028 (0x0054 - 0x002C)
class UGUI : public UObject
{
public:
	class UGUIController*                              Controller;                                               // 0x002C(0x0004) (NoExport)
	struct FPlane                                      SaveModulation;                                           // 0x0030(0x0010) (NoExport)
	float                                              SaveX;                                                    // 0x0040(0x0004) (NoExport)
	float                                              SaveY;                                                    // 0x0044(0x0004) (NoExport)
	struct FColor                                      SaveColor;                                                // 0x0048(0x0004) (NoExport)
	class UFont*                                       SaveFont;                                                 // 0x004C(0x0004) (NoExport)
	byte                                               SaveStyle;                                                // 0x0050(0x0001) (NoExport)
	byte                                               Padding00[0x3];                                           // 0x0051(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUI");
		return ptr;
	}


	class UMaterial* GetModLogo(const string& ModDir);
	string GetModValue(const string& ModDir, const string& ModKey);
	void GetModList(string[]* ModDirs, string[]* ModTitles);
	void Profile(const string& ProfileName);
	string STATIC_JoinArray(string[] StringArray, const string& Delim, bool bIgnoreBlanks);
	bool STATIC_IsDigit(const string& test, bool bAllowDecimal);
};


// Class XInterface.GUIComponent
// 0x0268 (0x02BC - 0x0054)
class UGUIComponent : public UGUI
{
public:
	struct FTimerData[]                                Timers;                                                   // 0x0054(0x000C) (Const, NeedCtorLink)
	class UGUIPage*                                    PageOwner;                                                // 0x0060(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, NoExport, EditInline)
	class UGUIComponent*                               MenuOwner;                                                // 0x0064(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, NoExport, EditInline)
	class UGUIComponent*                               FocusInstead;                                             // 0x0068(0x0004) (Edit, ExportObject, NeedCtorLink, NoExport, EditInline)
	EeMenuState                                        MenuState;                                                // 0x006C(0x0001) (Edit, NoExport)
	EeMenuState                                        LastMenuState;                                            // 0x006D(0x0001) (Edit, EditConst, NoExport)
	EeDropState                                        DropState;                                                // 0x006E(0x0001) (Edit, NoExport)
	EeFontScale                                        FontScale;                                                // 0x006F(0x0001) (Edit)
	class UCanvas*                                     CurrentCanvas;                                            // 0x0070(0x0004)
	string                                             IniOption;                                                // 0x0074(0x000C) (Edit, NeedCtorLink)
	string                                             IniDefault;                                               // 0x0080(0x000C) (Edit, NeedCtorLink)
	string                                             StyleName;                                                // 0x008C(0x000C) (Edit, NeedCtorLink)
	string                                             Hint;                                                     // 0x0098(0x000C) (Edit, Localized, NeedCtorLink)
	class UGUILabel*                                   FriendlyLabel;                                            // 0x00A4(0x0004) (Edit, ExportObject, NeedCtorLink, NoExport, EditInline)
	float                                              WinTop;                                                   // 0x00A8(0x0004) (Edit)
	float                                              WinLeft;                                                  // 0x00AC(0x0004) (Edit)
	float                                              WinWidth;                                                 // 0x00B0(0x0004) (Edit)
	float                                              WinHeight;                                                // 0x00B4(0x0004) (Edit)
	bool                                               bUseAWinPos;                                              // 0x00B8(0x0004) (Edit)
	struct FFloatBox                                   AWinPos;                                                  // 0x00BC(0x0010) (Edit)
	struct FFloatBox                                   RWinPos;                                                  // 0x00CC(0x0010) (Edit)
	struct FFloatBox                                   AWinFrame;                                                // 0x00DC(0x0010) (Edit)
	float                                              RenderWeight;                                             // 0x00EC(0x0004) (Edit)
	int                                                MouseCursorIndex;                                         // 0x00F0(0x0004) (Edit)
	int                                                TabOrder;                                                 // 0x00F4(0x0004) (Edit)
	int                                                Tag;                                                      // 0x00F8(0x0004) (Edit)
	bool                                               bTravelling;                                              // 0x00FC(0x0004) (Edit, Const, EditConst, NoExport)
	bool                                               bSizing;                                                  // 0x00FC(0x0004) (Edit, Const, EditConst, NoExport)
	bool                                               bCaptureMouse;                                            // 0x00FC(0x0004) (Edit)
	bool                                               bCaptureTabs;                                             // 0x00FC(0x0004) (Edit)
	bool                                               bNeverFocus;                                              // 0x00FC(0x0004) (Edit)
	bool                                               bRepeatClick;                                             // 0x00FC(0x0004) (Edit)
	bool                                               bRequireReleaseClick;                                     // 0x00FC(0x0004) (Edit)
	bool                                               bMouseOverSound;                                          // 0x00FC(0x0004) (Edit)
	bool                                               bDropSource;                                              // 0x00FC(0x0004) (Edit)
	bool                                               bDropTarget;                                              // 0x00FC(0x0004) (Edit)
	bool                                               bPendingFocus;                                            // 0x00FC(0x0004) (Edit, NoExport)
	bool                                               bInit;                                                    // 0x00FC(0x0004) (Edit)
	bool                                               bNeverScale;                                              // 0x00FC(0x0004) (Edit)
	bool                                               bRequiresStyle;                                           // 0x00FC(0x0004) (Const, NoExport)
	bool                                               bPositioned;                                              // 0x00FC(0x0004) (Edit, Const, EditConst, NoExport)
	bool                                               bAnimating;                                               // 0x00FC(0x0004) (Edit, EditConst, NoExport)
	bool                                               bDebugging;                                               // 0x00FC(0x0004) (Edit)
	bool                                               bTabStop;                                                 // 0x00FC(0x0004) (Edit)
	bool                                               bFocusOnWatch;                                            // 0x00FC(0x0004) (Edit)
	bool                                               bBoundToParent;                                           // 0x00FC(0x0004) (Edit)
	bool                                               bScaleToParent;                                           // 0x00FC(0x0004) (Edit)
	bool                                               bHasFocus;                                                // 0x00FC(0x0004) (Edit, NoExport)
	bool                                               bVisible;                                                 // 0x00FC(0x0004) (Edit)
	bool                                               bAcceptsInput;                                            // 0x00FC(0x0004) (Edit)
	struct FVector[]                                   MotionFrame;                                              // 0x0100(0x000C) (Edit, Const, EditConst, NeedCtorLink, NoExport)
	struct FVector[]                                   SizeFrame;                                                // 0x010C(0x000C) (Edit, Const, EditConst, NeedCtorLink, NoExport)
	float                                              Bounds[0x4];                                              // 0x0118(0x0004) (Edit, Const, EditConst, NoExport)
	float                                              ClientBounds[0x4];                                        // 0x0128(0x0004) (Edit, Const, EditConst, NoExport)
	bool                                               bTimerRepeat;                                             // 0x0138(0x0004) (Edit)
	int                                                TimerIndex;                                               // 0x013C(0x0004) (Edit, Const, EditConst, NoExport)
	float                                              TimerCountdown;                                           // 0x0140(0x0004) (Edit)
	float                                              TimerInterval;                                            // 0x0144(0x0004) (Edit)
	float                                              MouseOffset[0x4];                                         // 0x0148(0x0004) (Const, NoExport)
	class UGUIContextMenu*                             ContextMenu;                                              // 0x0158(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, EditInline)
	class UGUIToolTip*                                 ToolTip;                                                  // 0x015C(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, EditInline)
	struct FColor                                      WhiteColor;                                               // 0x0160(0x0004) (Const, NoExport)
	class UGUIStyles*                                  Style;                                                    // 0x0164(0x0004) (Edit, ExportObject, NeedCtorLink, NoExport, EditInline)
	EClickSound                                        OnClickSound;                                             // 0x0168(0x0001) (Edit)
	EParentScaleType                                   BoundingType;                                             // 0x0169(0x0001) (Edit)
	EParentScaleType                                   ScalingType;                                              // 0x016A(0x0001) (Edit)
	byte                                               Padding00[0x1];                                           // 0x016B(0x0001) MISSED OFFSET
	bool                                               bStandardized;                                            // 0x016C(0x0004) (Edit)
	float                                              StandardHeight;                                           // 0x0170(0x0004) (Edit)
	bool                                               bFlicker;                                                 // 0x0174(0x0004)
	int                                                PreDrawCount;                                             // 0x0178(0x0004) (Const, EditConst, NoExport)
	int                                                DrawCount;                                                // 0x017C(0x0004) (Const, EditConst, NoExport)
	int                                                OnRenderCount;                                            // 0x0180(0x0004) (EditConst, NoExport)
	int                                                OnRenderedCount;                                          // 0x0184(0x0004) (EditConst, NoExport)
	int                                                OnPreDrawCount;                                           // 0x0188(0x0004) (EditConst, NoExport)
	int                                                OnDrawCount;                                              // 0x018C(0x0004) (EditConst, NoExport)
	bool                                               bIsDisableHover;                                          // 0x0190(0x0004)
	bool                                               bAlwaysFocus;                                             // 0x0190(0x0004)
	struct FScriptDelegate                             __OnArrival__Delegate;                                    // 0x0194(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnEndAnimation__Delegate;                               // 0x019C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnPreDraw__Delegate;                                    // 0x01A4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDraw__Delegate;                                       // 0x01AC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnRender__Delegate;                                     // 0x01B4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnRendered__Delegate;                                   // 0x01BC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnActivate__Delegate;                                   // 0x01C4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDeActivate__Delegate;                                 // 0x01CC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnWatch__Delegate;                                      // 0x01D4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnHitTest__Delegate;                                    // 0x01DC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnMessage__Delegate;                                    // 0x01E4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnHide__Delegate;                                       // 0x01EC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnShow__Delegate;                                       // 0x01F4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnBeginTooltip__Delegate;                               // 0x01FC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnEndTooltip__Delegate;                                 // 0x0204(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnInvalidate__Delegate;                                 // 0x020C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnHover__Delegate;                                      // 0x0214(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnClick__Delegate;                                      // 0x021C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDblClick__Delegate;                                   // 0x0224(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnRightClick__Delegate;                                 // 0x022C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnMousePressed__Delegate;                               // 0x0234(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnMouseRelease__Delegate;                               // 0x023C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnTimer__Delegate;                                      // 0x0244(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnChange__Delegate;                                     // 0x024C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnKeyType__Delegate;                                    // 0x0254(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnKeyEvent__Delegate;                                   // 0x025C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDesignModeKeyEvent__Delegate;                         // 0x0264(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnCapturedMouseMove__Delegate;                          // 0x026C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnLoadINI__Delegate;                                    // 0x0274(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnSaveINI__Delegate;                                    // 0x027C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnMultiSelect__Delegate;                                // 0x0284(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnBeginDrag__Delegate;                                  // 0x028C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnEndDrag__Delegate;                                    // 0x0294(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragDrop__Delegate;                                   // 0x029C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragEnter__Delegate;                                  // 0x02A4(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragLeave__Delegate;                                  // 0x02AC(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnDragOver__Delegate;                                   // 0x02B4(0x0090) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIComponent");
		return ptr;
	}


	class UCanvas* GetCurrentCanvas();
	void DebugTabOrder();
	void LevelChanged();
	void SetEnabled(bool Value);
	void DisableMe();
	void EnableMe();
	void SetFlicker(bool Value);
	void DisableComponent(class UGUIComponent* Comp);
	void EnableComponent(class UGUIComponent* Comp);
	void KillAnimation();
	void DAnimate(float NewLeft, float NewTop, float NewWidth, float NewHeight, float PositionTime, float DimensionTime);
	void Resize(float NewWidth, float NewHeight, float Time);
	void Animate(float NewLeft, float NewTop, float Time);
	void EndAnimation(class UGUIComponent* Animating, EAnimationType Type);
	void BeginAnimation(class UGUIComponent* Animating);
	class UGUIPage* OwnerPage();
	void DebugFocusPosition(class UGUIComponent* Who, bool Last);
	void DebugFocus(class UGUIComponent* Who, bool bLose);
	void SetTooltip(class UGUIToolTip* InTooltip);
	void SetToolTipText(const string& NewToolTipText);
	void SetHint(const string& NewHint);
	void SetFriendlyLabel(class UGUILabel* NewLabel);
	void SetFocusInstead(class UGUIComponent* InFocusComp);
	void Show();
	void Hide();
	void CenterMouse();
	void SetVisibility(bool bIsVisible);
	void FillOwner();
	bool PrevPage();
	bool NextPage();
	bool PrevControl(class UGUIComponent* Sender);
	bool NextControl(class UGUIComponent* Sender);
	bool FocusLast(class UGUIComponent* Sender);
	bool FocusFirst(class UGUIComponent* Sender);
	void LoseFocus(class UGUIComponent* Sender);
	void SetFocus(class UGUIComponent* Who);
	bool CanAcceptFocus();
	bool IsInClientBounds();
	bool IsInBounds();
	void TraversalApplyAWinPos();
	void ApplyAWinPos();
	class UGUIComponent* GetTopMenuOwner();
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void DropStateChange(EeDropState NewState);
	bool IsMultiSelect();
	void MenuStateChange(EeMenuState NewState);
	string STATIC_MakeColorCode(const struct FColor& NewColor);
	string STATIC_StripColorCodes(const string& InString);
	void SaveINI(const string& Value);
	string LoadINI();
	void free();
	void Closed(class UGUIComponent* Sender, bool bCancelled);
	void Opened(class UGUIComponent* Sender);
	void Timer();
	string AdditionalDebugString();
	bool SpecialHit(bool bForce);
	string GetMenuPath();
	bool IsInIncompleteLetter(const string& strUserName);
	int IsCorrectUserName_THAILAND(const string& strUserName);
	int IsCorrectUserName_China(const string& strUserName);
	int IsCorrectUserName(const string& strUserName);
	void SetPosition(float NewLeft, float NewTop, float NewWidth, float NewHeight, bool bForceRelative);
	void ResolutionChanged(int ResX, int ResY);
	float RelativeHeight(float RealHeight, bool bForce);
	float RelativeWidth(float RealWidth, bool bForce);
	float RelativeTop(float RealTop, bool bForce);
	float RelativeLeft(float RealLeft, bool bForce);
	float ActualTop(float val, bool bForce);
	float ActualLeft(float val, bool bForce);
	float ActualHeight(float val, bool bForce);
	float ActualWidth(float val, bool bForce);
	void UpdateBounds();
	void UpdateOffset(float PosX, float PosY, float PosW, float PosH);
	void AutoPositionOn(class UGUIComponent*[] Components, class UGUIComponent* frame, float LeftPadPerc, float UpperPadPerc, float RightPadPerc, float LowerPadPerc, int NumberOfColumns, float ColumnPadding);
	void AutoPosition(class UGUIComponent*[] Components, float LeftBound, float UpperBound, float RightBound, float LowerBound, float LeftPad, float UpperPad, float RightPad, float LowerPad, int NumberOfColumns, float ColumnPadding);
	void KillTimer(const FName& TimerFunc);
	void SetTimer(float Interval, bool bRepeat, const FName& TimerFunc);
	class APlayerController* PlayerOwner();
	void OnDragOver(class UGUIComponent* Sender);
	void OnDragLeave(class UGUIComponent* Sender);
	void OnDragEnter(class UGUIComponent* Sender);
	bool OnDragDrop(class UGUIComponent* Sender);
	void OnEndDrag(class UGUIComponent* Sender, bool bAccepted);
	bool OnBeginDrag(class UGUIComponent* Sender);
	bool OnMultiSelect(class UGUIComponent* Sender);
	string OnSaveINI(class UGUIComponent* Sender);
	void OnLoadINI(class UGUIComponent* Sender, const string& S);
	bool OnCapturedMouseMove(float deltaX, float deltaY);
	bool OnDesignModeKeyEvent(EInputKey key, EInputAction State);
	bool OnKeyEvent(float Delta, byte* key, byte* State);
	bool OnKeyType(const string& Unicode, byte* key);
	void OnChange(class UGUIComponent* Sender);
	void OnTimer(class UGUIComponent* Sender);
	void OnMouseRelease(class UGUIComponent* Sender);
	void OnMousePressed(class UGUIComponent* Sender, bool bRepeat);
	bool OnRightClick(class UGUIComponent* Sender);
	bool OnDblClick(class UGUIComponent* Sender);
	bool OnClick(class UGUIComponent* Sender);
	bool OnHover(class UGUIComponent* Sender);
	void OnInvalidate(class UGUIComponent* Who);
	bool OnEndTooltip();
	class UGUIToolTip* OnBeginTooltip();
	void OnShow();
	void OnHide();
	void OnMessage(const string& Msg, float MsgLife);
	void OnHitTest(float MouseX, float MouseY);
	void OnWatch();
	void OnDeActivate();
	void OnActivate();
	void OnRendered(class UCanvas* Canvas);
	void OnRender(class UCanvas* Canvas);
	bool OnDraw(class UCanvas* Canvas);
	bool OnPreDraw(class UCanvas* Canvas);
	void OnEndAnimation(class UGUIComponent* Sender, EAnimationType Type);
	void OnArrival(class UGUIComponent* Sender, EAnimationType Type);
};


// Class XInterface.GUIMultiComponent
// 0x0044 (0x0300 - 0x02BC)
class UGUIMultiComponent : public UGUIComponent
{
public:
	class UGUIComponent*[]                             Controls;                                                 // 0x02BC(0x000C) (Edit, ExportObject, NeedCtorLink, EditInline, DataBinding)
	class UGUIComponent*                               FocusedControl;                                           // 0x02C8(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, NoExport, EditInline)
	class UGUIComponent*[]                             Components;                                               // 0x02CC(0x000C) (Edit, EditFixedSize, NeedCtorLink, NoExport)
	int                                                AnimationCount;                                           // 0x02D8(0x0004) (Edit, EditConst, NoExport)
	bool                                               PropagateVisibility;                                      // 0x02DC(0x0004) (Edit)
	bool                                               bOldStyleMenus;                                           // 0x02DC(0x0004) (Edit)
	bool                                               bDrawFocusedLast;                                         // 0x02DC(0x0004) (Edit)
	bool                                               bAlwaysAutomate;                                          // 0x02DC(0x0004) (Edit)
	struct FScriptDelegate                             __HandleContextMenuOpen__Delegate;                        // 0x02E0(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __HandleContextMenuClose__Delegate;                       // 0x02E8(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __NotifyContextSelect__Delegate;                          // 0x02F0(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnCreateComponent__Delegate;                            // 0x02F8(0x0090) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIMultiComponent");
		return ptr;
	}


	struct FFloatBox GetTooltipPosFinal(int tooltipWidth, int tooltipHeight, float CursorUSize, float CursorVSize, int nOffsetX, int nOffsetY);
	bool RecursiveActiveOwner(class UGUIComponent* checkComponent);
	void TraversalApplyAWinPos();
	class UGUIComponent* NewComponent(class UGUIComponent* newcompo, const struct FFloatBox& fbNewCompo, float RenderWeight, class UGUIMultiComponent* ParentComponent);
	void CheckDuplicateTabOrder();
	void CheckInvalidTabOrder();
	void DebugTabOrder();
	void CenterMouse();
	void LevelChanged();
	void EndAnimation(class UGUIComponent* Animating, EAnimationType Type);
	void BeginAnimation(class UGUIComponent* Animating);
	void free();
	void Closed(class UGUIComponent* Sender, bool bCancelled);
	void Opened(class UGUIComponent* Sender);
	void SetVisibility(bool bIsVisible);
	void DisableMe();
	void EnableMe();
	bool PrevControl(class UGUIComponent* Sender);
	bool NextControl(class UGUIComponent* Sender);
	bool FocusLast(class UGUIComponent* Sender);
	bool FocusFirst(class UGUIComponent* Sender);
	bool CanAcceptFocus();
	void LoseFocus(class UGUIComponent* Sender);
	void SetFocus(class UGUIComponent* Who);
	void SetFocusInstead(class UGUIComponent* InFocusComp);
	bool RemoveComponent(class UGUIComponent* Comp, bool SkipRemap);
	class UGUIComponent* AppendComponent(class UGUIComponent* NewComp, bool SkipRemap);
	class UGUIComponent* InsertComponent(class UGUIComponent* NewComp, int Index, bool SkipRemap);
	class UGUIComponent* AddComponent(const string& ComponentClass, bool SkipRemap);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void InternalOnShow();
	int FindComponentIndex(class UGUIComponent* Who);
	void RemapComponents();
	void InitializeControls();
	void OnCreateComponent(class UGUIComponent* NewComponent, class UGUIComponent* Sender);
	bool NotifyContextSelect(class UGUIContextMenu* Sender, int ClickIndex);
	bool HandleContextMenuClose(class UGUIContextMenu* Sender);
	bool HandleContextMenuOpen(class UGUIComponent* Sender, class UGUIContextMenu* Menu, class UGUIComponent* ContextMenuOwner);
};


// Class XInterface.GUIPage
// 0x0064 (0x0364 - 0x0300)
class UGUIPage : public UGUIMultiComponent
{
public:
	bool                                               bRestorable;                                              // 0x0300(0x0004) (Edit)
	bool                                               bUseMyInactiveFadeColor;                                  // 0x0300(0x0004) (Edit)
	bool                                               bRenderWorld;                                             // 0x0300(0x0004) (Edit)
	bool                                               bPauseIfPossible;                                         // 0x0300(0x0004) (Edit)
	bool                                               bCheckResolution;                                         // 0x0300(0x0004) (Edit)
	bool                                               bCaptureInput;                                            // 0x0300(0x0004) (Edit)
	bool                                               bRequire640x480;                                          // 0x0300(0x0004) (Edit)
	bool                                               bPersistent;                                              // 0x0300(0x0004) (Edit)
	bool                                               bDisconnectOnOpen;                                        // 0x0300(0x0004) (Edit)
	bool                                               bAllowedAsLast;                                           // 0x0300(0x0004) (Edit)
	class UGUIPage*                                    ParentPage;                                               // 0x0304(0x0004) (Edit, ExportObject, EditConst, NeedCtorLink, NoExport, EditInline)
	class UMaterial*                                   Background;                                               // 0x0308(0x0004) (Edit)
	struct FColor                                      BackgroundColor;                                          // 0x030C(0x0004) (Edit)
	struct FColor                                      InactiveFadeColor;                                        // 0x0310(0x0004) (Edit)
	struct FColor                                      ActiveFadeColor;                                          // 0x0314(0x0004) (Edit)
	class USound*                                      OpenSound;                                                // 0x0318(0x0004) (Edit)
	class USound*                                      CloseSound;                                               // 0x031C(0x0004) (Edit)
	EMenuRenderStyle                                   BackgroundRStyle;                                         // 0x0320(0x0001) (Edit)
	byte                                               Padding00[0x3];                                           // 0x0321(0x0003) MISSED OFFSET
	struct FScriptDelegate                             __OnOpen__Delegate;                                       // 0x0324(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnReOpen__Delegate;                                     // 0x032C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnClose__Delegate;                                      // 0x0334(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __OnCanClose__Delegate;                                   // 0x033C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __FadedIn__Delegate;                                      // 0x0344(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __FadedOut__Delegate;                                     // 0x034C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __GetFocus__Delegate;                                     // 0x0354(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __LostFocus__Delegate;                                    // 0x035C(0x0090) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIPage");
		return ptr;
	}


	void LostFocus(class UGUIPage* NewMenu);
	void GetFocus();
	void FadedOut();
	void FadedIn();
	void FadeOut(bool bTranslate, bool bChangeAlpha);
	void FadeIn(bool bTranslate, bool bChangeAlpha);
	bool AllowOpen(const string& MenuClass);
	bool IsOpen();
	void free();
	bool NotifyLevelChange();
	void SetDataString(const string& str);
	string GetDataString();
	void HandleObject(class UObject* obj, class UObject* OptionalObj_1, class UObject* OptionalObj_2);
	bool GetRestoreParams(string* Param1, string* Param2);
	void HandleParameters(const string& Param1, const string& Param2);
	void SetFocus(class UGUIComponent* Who);
	void ChangeHint(const string& NewHint);
	void CheckResolution(bool Closing, class UGUIController* InController);
	void InitComponent(class UGUIController* MyController, class UGUIComponent* myOwner);
	void Closed(class UGUIComponent* Sender, bool bCancelled);
	bool OnCanClose(bool bCancelled);
	void OnClose(bool bCancelled);
	void OnReOpen();
	void OnOpen();
};


// Class XInterface.GUIQuestionPage
// 0x0038 (0x039C - 0x0364)
class UGUIQuestionPage : public UGUIPage
{
public:
	class UGUILabel*                                   lMessage;                                                 // 0x0364(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UMaterial*                                   MessageIcon;                                              // 0x0368(0x0004)
	string[]                                           ButtonNames;                                              // 0x036C(0x000C) (Localized, NeedCtorLink)
	class UGUIButton*[]                                Buttons;                                                  // 0x0378(0x000C) (NeedCtorLink)
	class UGUIButton*                                  DefaultButton;                                            // 0x0384(0x0004) (ExportObject, NeedCtorLink, EditInline)
	class UGUIButton*                                  CancelButton;                                             // 0x0388(0x0004) (ExportObject, NeedCtorLink, EditInline)
	struct FScriptDelegate                             __OnButtonClick__Delegate;                                // 0x038C(0x0090) (NeedCtorLink)
	struct FScriptDelegate                             __NewOnButtonClick__Delegate;                             // 0x0394(0x0090) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.GUIQuestionPage");
		return ptr;
	}


	void RemoveButtons();
	string Replace(const string& Src, const string& Tag, const string& Value);
	bool ButtonClick(class UGUIComponent* Sender);
	void LayoutButtons(byte ActiveButton);
	class UGUIButton* AddButton(byte idesc);
	void SetupQuestion(const string& Question, byte bButtons, byte ActiveButton, bool bClearFirst);
	bool InternalOnPreDraw(class UCanvas* C);
	void InitComponent(class UGUIController* pMyController, class UGUIComponent* myOwner);
	bool NewOnButtonClick(byte bButton);
	void OnButtonClick(byte bButton);
};


// Class XInterface.HudBase
// 0x05F0 (0x0CB8 - 0x06C8)
class AHudBase : public AHUD
{
public:
	int                                                SpecPlayerLevel;                                          // 0x06C8(0x0004)
	int                                                SpecPlayerLevelMarkID;                                    // 0x06CC(0x0004)
	string                                             strSpectating;                                            // 0x06D0(0x000C) (Localized, NeedCtorLink)
	string                                             strSpectateHelp;                                          // 0x06DC(0x000C) (Localized, NeedCtorLink)
	struct FFloatBox                                   fbSpectateLevel;                                          // 0x06E8(0x0010)
	struct FFloatBox                                   fbSpectateUser;                                           // 0x06F8(0x0010)
	struct FFloatBox                                   fbSpectateHelp;                                           // 0x0708(0x0010)
	struct FFloatBox                                   fbSpectatingBack;                                         // 0x0718(0x0010)
	float                                              NametagFactorZ;                                           // 0x0728(0x0004) (Edit)
	float                                              NametagExtraZ;                                            // 0x072C(0x0004) (Edit)
	int                                                NametagFontSize;                                          // 0x0730(0x0004) (Edit)
	float                                              NametagRadius;                                            // 0x0734(0x0004) (Edit)
	int                                                NametagShadowX;                                           // 0x0738(0x0004) (Edit)
	int                                                NametagShadowY;                                           // 0x073C(0x0004) (Edit)
	struct FColor                                      NametagShadowColor;                                       // 0x0740(0x0004) (Edit)
	string                                             NameTagInvulnerablePost;                                  // 0x0744(0x000C) (Localized, NeedCtorLink)
	float                                              NameTagVisUpdateTime;                                     // 0x0750(0x0004)
	struct FSpriteWidget                               IconDefendBombHolder;                                     // 0x0754(0x0040) (Edit)
	struct FSpriteWidget                               IconInvulnerable;                                         // 0x0794(0x0040) (Edit)
	int                                                TeamIndex;                                                // 0x07D4(0x0004) (Edit, Transient)
	ERenderStyle                                       PassStyle;                                                // 0x07D8(0x0001) (Edit, Transient)
	byte                                               Padding00[0x3];                                           // 0x07D9(0x0003) MISSED OFFSET
	class AHudBase*[]                                  ChildHudParts;                                            // 0x07DC(0x000C) (NeedCtorLink)
	struct FHudLocalizedMessage                        LocalMessages[0x8];                                       // 0x07E8(0x0050) (Edit, Transient, NeedCtorLink)
	class UClass*                                      VoteMenuClass;                                            // 0x0A68(0x0004) (Edit)
	class UMaterial*                                   TargetMaterial;                                           // 0x0A6C(0x0004)
	bool                                               bShowTargeting;                                           // 0x0A70(0x0004) (Transient)
	struct FVector                                     TargetingLocation;                                        // 0x0A74(0x000C) (Transient)
	float                                              TargetingSize;                                            // 0x0A80(0x0004) (Transient)
	string                                             InstructionText;                                          // 0x0A84(0x000C) (Edit, NeedCtorLink)
	string                                             InstructionKeyText;                                       // 0x0A90(0x000C) (Edit, NeedCtorLink)
	float                                              InstructTextBorderX;                                      // 0x0A9C(0x0004) (Edit)
	float                                              InstructTextBorderY;                                      // 0x0AA0(0x0004) (Edit)
	float                                              InstrDelta;                                               // 0x0AA4(0x0004) (Edit)
	float                                              InstrRate;                                                // 0x0AA8(0x0004) (Edit)
	string                                             InstructionFontName;                                      // 0x0AAC(0x000C) (Edit, NeedCtorLink)
	class UFont*                                       InstructionFontFont;                                      // 0x0AB8(0x0004) (Edit)
	bool                                               bUsingCustomHUDColor;                                     // 0x0ABC(0x0004)
	bool                                               DoCropping;                                               // 0x0ABC(0x0004) (Edit)
	bool                                               bIsCinematic;                                             // 0x0ABC(0x0004)
	byte                                               FontsPrecached;                                           // 0x0AC0(0x0001)
	byte                                               Padding01[0x3];                                           // 0x0AC1(0x0003) MISSED OFFSET
	bool                                               bHideWeaponName;                                          // 0x0AC4(0x0004)
	float                                              CroppingAmount;                                           // 0x0AC8(0x0004) (Edit)
	class UMaterial*                                   CroppingMaterial;                                         // 0x0ACC(0x0004) (Edit)
	string                                             LastWeaponName;                                           // 0x0AD0(0x000C) (NeedCtorLink)
	float                                              WeaponDrawTimer;                                          // 0x0ADC(0x0004)
	struct FColor                                      WeaponDrawColor;                                          // 0x0AE0(0x0004)
	string                                             Text;                                                     // 0x0AE4(0x000C) (Edit, Localized, NeedCtorLink)
	string                                             LevelActionLoading;                                       // 0x0AF0(0x000C) (Edit, Localized, NeedCtorLink)
	string                                             LevelActionPaused;                                        // 0x0AFC(0x000C) (Edit, Localized, NeedCtorLink)
	string                                             LevelActionFontName;                                      // 0x0B08(0x000C) (Edit, NeedCtorLink)
	string                                             WonMatchPrefix;                                           // 0x0B14(0x000C) (Localized, NeedCtorLink)
	string                                             WonMatchPostFix;                                          // 0x0B20(0x000C) (Localized, NeedCtorLink)
	string                                             WaitingToSpawn;                                           // 0x0B2C(0x000C) (Localized, NeedCtorLink)
	string                                             AtMenus;                                                  // 0x0B38(0x000C) (Localized, NeedCtorLink)
	string                                             YouveWonTheMatch;                                         // 0x0B44(0x000C) (Localized, NeedCtorLink)
	string                                             YouveLostTheMatch;                                        // 0x0B50(0x000C) (Localized, NeedCtorLink)
	string                                             NowViewing;                                               // 0x0B5C(0x000C) (Localized, NeedCtorLink)
	string                                             ScoreText;                                                // 0x0B68(0x000C) (Localized, NeedCtorLink)
	string                                             InitialViewingString;                                     // 0x0B74(0x000C) (Localized, NeedCtorLink)
	class UMaterial*                                   LocationDot;                                              // 0x0B80(0x0004)
	class UMaterial*                                   DefaultCrosshair;                                         // 0x0B84(0x0004)
	class UMaterial*                                   TargetCrosshair;                                          // 0x0B88(0x0004)
	struct FColor                                      DamageFlash[0x4];                                         // 0x0B8C(0x0004)
	float                                              DamageTime[0x4];                                          // 0x0B9C(0x0004)
	byte                                               Emphasized[0x4];                                          // 0x0BAC(0x0001) (Edit)
	int                                                DamageGot;                                                // 0x0BB0(0x0004)
	float                                              fPainSoundLastPlayed;                                     // 0x0BB4(0x0004)
	float                                              fStartTime;                                               // 0x0BB8(0x0004)
	struct FSpriteWidget                               WAttackedBG;                                              // 0x0BBC(0x0040)
	bool                                               bAttacked;                                                // 0x0BFC(0x0004)
	struct FSpriteWidget[]                             Crosshairs;                                               // 0x0C00(0x000C) (Edit, NeedCtorLink)
	struct FColor                                      CustomHUDColor;                                           // 0x0C0C(0x0004)
	bool                                               bUseCustomWeaponCrosshairs;                               // 0x0C10(0x0004)
	float                                              ScreenRatioX;                                             // 0x0C14(0x0004)
	float                                              ScreenRatioY;                                             // 0x0C18(0x0004)
	float                                              ScreenRatioXEx;                                           // 0x0C1C(0x0004)
	float                                              ScreenRatioYEx;                                           // 0x0C20(0x0004)
	float                                              _rX;                                                      // 0x0C24(0x0004)
	float                                              _rY;                                                      // 0x0C28(0x0004)
	float                                              _reX;                                                     // 0x0C2C(0x0004)
	float                                              _reY;                                                     // 0x0C30(0x0004)
	bool                                               IsDrawModeMessage;                                        // 0x0C34(0x0004)
	bool                                               IsDrawSystemMessage;                                      // 0x0C34(0x0004)
	string[]                                           BaseTeamName;                                             // 0x0C38(0x000C) (NeedCtorLink)
	struct FColor                                      BaseTeamColorAlly;                                        // 0x0C44(0x0004) (Edit)
	struct FColor[]                                    BaseTeamColor;                                            // 0x0C48(0x000C) (Edit, NeedCtorLink)
	struct FColor                                      FriendlyColor;                                            // 0x0C54(0x0004) (Edit)
	struct FColor                                      MyselfColor;                                              // 0x0C58(0x0004) (Edit)
	int                                                TimeMinutes;                                              // 0x0C5C(0x0004)
	int                                                TimeSeconds;                                              // 0x0C60(0x0004)
	bool                                               AlreadyGotMessage17_PlayerCantStart;                      // 0x0C64(0x0004)
	string                                             KillerName;                                               // 0x0C68(0x000C) (NeedCtorLink)
	float                                              KillerMarkTimeToRemove;                                   // 0x0C74(0x0004)
	struct FSpriteWidget                               KillerSprite;                                             // 0x0C78(0x0040) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class XInterface.HudBase");
		return ptr;
	}


	int GetCurGameTime();
	void clearkilllog();
	void userzone(const string& szPath, const string& szCommand);
	void usermove(const string& szPath, const string& szCommand, int nCombatNum);
	void killlog(const string& szPath, const string& szCommand);
	void WorldSpaceOverlays();
	void STATIC_PlayHUDSound(class APlayerController* PC, EeHUDSOUND soundType);
	struct FVector CalcNametagPos(class APawn* curPawn);
	struct FVector CalcNametagPosNative(class APawn* curPawn);
	struct FColor GetNametagColor(class APlayerReplicationInfo* Info);
	void RefreshKillerName(const string& mKillerName);
	void DrawCustomNameTag(class UCanvas* C, const struct FVector& vNameTagPos, class AwPawn* curPawn, const string& strName, float fAdditionalX, float fAdditionalY);
	void DrawNameTag(class UCanvas* C, class AwPawn* curPawn);
	void DrawMissionIcon(class UCanvas* C, class AwPawn* curPawn);
	void DrawSpecialModeIcon(class UCanvas* C, class AwPawn* curPawn);
	void UpdateNameTagInfo(class UCanvas* C, class AwPawn* curPawn, const struct FVector& camLoc, const struct FRotator& camRot);
	void DrawNametagsScript(class UCanvas* C, bool bSpectateMode, bool drawAlways);
	void DrawNametags(class UCanvas* C, bool bSpectateMode, bool drawAlways);
	void DrawNametagsNative(class UCanvas* C, bool bSpectateMode, bool drawAlways);
	void DrawHudSpectating(class UCanvas* C);
	void DrawGMHudSpectating(class UCanvas* C);
	class APlayerReplicationInfo* FindPRI(class APawn* P);
	struct FColor GetBaseTeamColor(int viewerTeamIndex, int targetTeamIndex);
	string GetBaseTeamName(int TeamIndex);
	void DrawWarfareCrosshairExtNative(class UCanvas* C, int Spread);
	void CalculateCoordinateDigitEx(class UCanvas* C, const struct FDigitSet& W, const struct FNumericWidget& N, float fWidth, float fHeight, int Index, struct FCalCoordsW* coordsW);
	void CalculateCoordinateDigit(class UCanvas* C, const struct FDigitSet& W, const struct FNumericWidget& N, float fWidth, float fHeight, int Index, struct FCalCoordsW* coordsW);
	void CalculateCoordinateEx(class UCanvas* C, const struct FSpriteWidget& W, float fWidth, float fHeight, struct FCalCoordsW* coordsW);
	void CalculateCoordinate(class UCanvas* C, const struct FSpriteWidget& W, float fWidth, float fHeight, struct FCalCoordsW* coordsW);
	void DrawTileFromSpriteWidget2(class UCanvas* C, const struct FSpriteWidget& SW, float W, float H);
	void DrawTileFromSpriteWidget(class UCanvas* C, const struct FSpriteWidget& SW);
	void STATIC_ClipScreenCoords(class UCanvas* C, float XL, float YL, float* X, float* Y);
	bool STATIC_IsTargetInFrontOfPlayer2(class UCanvas* C, const struct FVector& TargetPos, const struct FVector& camLoc, const struct FRotator& camRot, struct FVector* ScreenPos);
	bool STATIC_IsTargetInFrontOfPlayer(class UCanvas* C, class AActor* Target, const struct FVector& camLoc, const struct FRotator& camRot, struct FVector* ScreenPos);
	void DrawIntroSubtitles(class UCanvas* C);
	void DrawCinematicHUD(class UCanvas* C);
	void DrawVehicleName(class UCanvas* C);
	void DrawWeaponName(class UCanvas* C);
	class UFont* LoadInstructionFont();
	void SetInstructionKeyText(const string& Text);
	void SetInstructionText(const string& Text);
	void DrawInstructionKeyText(class UCanvas* C);
	void DrawInstructionText(class UCanvas* C);
	void DrawInstructionGfx(class UCanvas* C);
	void SetCropping(bool Active);
	void DrawTargeting(class UCanvas* C);
	void SetTargeting(bool bShow, const struct FVector& TargetLocation, float Size);
	void Draw2DLocationDot(class UCanvas* C, const struct FVector& loc, float OffsetX, float OffsetY, float ScaleX, float ScaleY);
	void CreateKeyMenus();
	void DisplayLocalMessages(class UCanvas* C);
	void DrawMessageWithTexture(class UCanvas* C, int i, float PosX, float PosY, float* dx, float* dy);
	void DrawMessage(class UCanvas* C, int i, float PosX, float PosY, float* dx, float* dy);
	void GetScreenCoords(float PosX, float PosY, class UCanvas* C, float* ScreenX, float* ScreenY, struct FHudLocalizedMessage* Message);
	void LayoutMessage(class UCanvas* C, struct FHudLocalizedMessage* Message);
	void GetLocalStatsScreen();
	struct FColor STATIC_GetTeamColor(byte TeamNum);
	void RemoveLocalizedMessage(class UClass* Message, int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject, const string& CriticalString);
	void LocalizedMessage2(class UClass* Message, int Switch, bool bOption_Push, const string& CriticalString);
	void LocalizedMessageEx(class UClass* Message, int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject, const string& CriticalString, int iReserve);
	void LocalizedMessage(class UClass* Message, int Switch, class APlayerReplicationInfo* RelatedPRI_1, class APlayerReplicationInfo* RelatedPRI_2, class UObject* OptionalObject, const string& CriticalString);
	void Message(class APlayerReplicationInfo* PRI, const string& Msg, const FName& MsgType);
	void ClearMessage(struct FHudLocalizedMessage* M);
	void AddChildHudPart(class AHudBase* Child);
	void DrawDigitSet(class UCanvas* C, float X, float Y, float OffsetX, float XL, float YL, int Value, const struct FDigitSet& dSet, int totalDigits, const string& paddingChar);
	void DrawCSReviw(class UCanvas* C);
	void DrawNumericWidget(class UCanvas* C, struct FNumericWidget* W, struct FDigitSet* D);
	void DrawSpriteWidget(class UCanvas* C, struct FSpriteWidget* W);
	void DrawHUD(class UCanvas* C);
	void UpdateScreenRatios(class UCanvas* C);
	void DrawAttacked(class UCanvas* C);
	void DrawHeadShotSphere();
	void Tick(float DeltaTime);
	void PlayPainSound(class UCanvas* C);
	void DrawDamageIndicators(class UCanvas* C);
	void DisplayHit(const struct FVector& HitDir, int Damage, class UClass* DamageType);
	void DrawMiniMap(class AwHudPart_MinimapBase* Minimap, class UCanvas* C);
	void SetCustomHUDColor();
	bool CustomHUDColorAllowed();
	void PostBeginPlay();
	void PrecacheFonts(class UCanvas* C);
	void DrawHudPassD(class UCanvas* C);
	void DrawHudPassC(class UCanvas* C);
	void DrawHudPassB(class UCanvas* C);
	void DrawHudPassA(class UCanvas* C);
	void UpdateHUD();
	void DoUpdateTime();
};


// Class XInterface.wHudPart_KillMessage
// 0x059C (0x1254 - 0x0CB8)
class AwHudPart_KillMessage : public AHudBase
{
public:
	class AHudBase*                                    HudOwner;                                                 // 0x0CB8(0x0004)
	class ALevelInfo*                                  LevelOwner;                                               // 0x0CBC(0x0004)
	struct FKillMessageItem[]                          KillMessages;                                             // 0x0CC0(0x000C) (NeedCtorLink)
	class UMaterial*                                   RelatedBG;                                                // 0x0CCC(0x0004) (Edit)
	struct FSpriteWidget                               SpriteWeaponAirStrike;                                    // 0x0CD0(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponAR;                                           // 0x0D10(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponFlameThrower;                                 // 0x0D50(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponGR;                                           // 0x0D90(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponHeadshot;                                     // 0x0DD0(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponMG;                                           // 0x0E10(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponPistol;                                       // 0x0E50(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponRPG;                                          // 0x0E90(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponSMG;                                          // 0x0ED0(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponSR;                                           // 0x0F10(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponMelee;                                        // 0x0F50(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponHelicopter;                                   // 0x0F90(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponUnknown;                                      // 0x0FD0(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponHelicopterKill;                               // 0x1010(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponFell;                                         // 0x1050(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponStepOn;                                       // 0x1090(0x0040) (Edit)
	struct FSpriteWidget                               SpriteWeaponAlienHands;                                   // 0x10D0(0x0040) (Edit)
	int                                                CacheClipX;                                               // 0x1110(0x0004)
	int                                                CacheClipY;                                               // 0x1114(0x0004)
	float                                              MessageDuration;                                          // 0x1118(0x0004)
	int                                                MaxMessages;                                              // 0x111C(0x0004)
	int                                                FontSize;                                                 // 0x1120(0x0004)
	float                                              KillMessageWordSpacing;                                   // 0x1124(0x0004)
	float                                              KillMessageLineSpacing;                                   // 0x1128(0x0004)
	float                                              MarginXFromRight;                                         // 0x112C(0x0004)
	float                                              MarginYFromTop;                                           // 0x1130(0x0004)
	int                                                ShadowX;                                                  // 0x1134(0x0004)
	int                                                ShadowY;                                                  // 0x1138(0x0004)
	struct FColor                                      ShadowColor;                                              // 0x113C(0x0004)
	struct FIntBoxWH                                   Icon_KillSuccession[0xF];                                 // 0x1140(0x0010)
	struct FIntBoxWH                                   Icon_HeadShot;                                            // 0x1230(0x0010)
	struct FIntBoxWH                                   Icon_AimShot;                                             // 0x1240(0x0010)
