#pragma once
/*
# ======================================================================================== #
# > ArcticCombat SDK
# > Generated By HJSdkGen v1.06b
# ---------------------------------------------------------------------------------------- #
# > Package : WMission
# >    File : ParamStructs.h
# ======================================================================================== #
*/

#ifdef _MSC_VER
#pragma pack ( push, 4 )
#endif

// Function WMission.wMSCinematic_Camera.Reset
// Flags: 
struct AwMSCinematic_Camera_execReset_Parms
{
};

// Function WMission.wMSCinematic_Camera.Trigger
// Flags: 
struct AwMSCinematic_Camera_execTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSCinematic_Camera.Timer
// Flags: 
struct AwMSCinematic_Camera_execTimer_Parms
{
};

// Function WMission.wMSCinematic_Camera.SetView
// Flags: 
struct AwMSCinematic_Camera_execSetView_Parms
{
	class AwMSCinematic_SceneManager*                  SM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class AController*                                 NextC;                                            		// 0x0008 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x000C ( 0x0004
};

// Function WMission.wMSCinematic_Camera.ViewFixedObjective
// Flags: 
struct AwMSCinematic_Camera_execViewFixedObjective_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameObjective*                              Go;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSCinematic_Camera.PostBeginPlay
// Flags: 
struct AwMSCinematic_Camera_execPostBeginPlay_Parms
{
};

// Function WMission.wMSCinematic_SceneManager.SceneEnded
// Flags: [ FUNC_Event ]
struct AwMSCinematic_SceneManager_eventSceneEnded_Parms
{
};

// Function WMission.wMSCinematic_SceneManager.ShotEnded
// Flags: [ FUNC_Event ]
struct AwMSCinematic_SceneManager_eventShotEnded_Parms
{
	class AwMSCinematic_Camera*                        cam;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSCinematic_SceneManager.PlayScene
// Flags: 
struct AwMSCinematic_SceneManager_execPlayScene_Parms
{
};

// Function WMission.wMSCinematic_SceneManager.Trigger
// Flags: 
struct AwMSCinematic_SceneManager_execTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSCinematic_SceneManager.PostBeginPlay
// Flags: 
struct AwMSCinematic_SceneManager_execPostBeginPlay_Parms
{
};

// Function WMission.wSetObjective.SetActive
// Flags: 
struct AwSetObjective_execSetActive_Parms
{
	unsigned long                                      bActiveStatus:1;                                  		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wSetObjective.Reset
// Flags: 
struct AwSetObjective_execReset_Parms
{
};

// Function WMission.wSetObjective.RefreshState
// Flags: 
struct AwSetObjective_execRefreshState_Parms
{
};

// Function WMission.wSetObjective.GetObjectiveProgress
// Flags: [ FUNC_Simulated ]
struct AwSetObjective_execGetObjectiveProgress_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              DecTime;                                          		// 0x0004 ( 0x0004
};

// Function WMission.wSetObjective.PlayerToucherDied
// Flags: 
struct AwSetObjective_execPlayerToucherDied_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSetObjective.IsRelevant
// Flags: 
struct AwSetObjective_execIsRelevant_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bAliveCheck:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerReplicationInfo*                      PRI;                                              		// 0x000C ( 0x0004
};

// Function WMission.wSetObjective.UnTouch
// Flags: 
struct AwSetObjective_execUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSetObjective.Touch
// Flags: 
struct AwSetObjective_execTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSetObjective.CanPlant
// Flags: [ FUNC_Simulated ]
struct AwSetObjective_execCanPlant_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       touchingP;                                        		// 0x0008 ( 0x0004
//	unsigned long                                      hasBomb:1;                                        		// 0x000C ( 0x0004 [0x00000001]
};

// Function WMission.wSetObjective.IsPlanting
// Flags: [ FUNC_Simulated ]
struct AwSetObjective_execIsPlanting_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSetObjective.Tick
// Flags: [ FUNC_Event ]
struct AwSetObjective_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     pawnLoc;                                          		// 0x0004 ( 0x000C
	class APawn*                                       P;                                                		// 0x0010 ( 0x0004
	struct FName                                       stateName;                                        		// 0x0014 ( 0x0004
	struct FString                                     OldPlayerName;                                    		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              DecTime;                                          		// 0x0024 ( 0x0004
};

// Function WMission.wSetObjective.SetDefuseLocation
// Flags: 
struct AwSetObjective_execSetDefuseLocation_Parms
{
	struct FVector                                     loc;                                              		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FName                                       Tag;                                              		// 0x000C ( 0x0004[ CPF_Parm ]
	class AwDiffuseObjective*                          Go;                                               		// 0x0010 ( 0x0004
	class AwGameObject_Bomb*                           Bomb;                                             		// 0x0014 ( 0x0004
};

// Function WMission.wSetObjective.UsedBy
// Flags: [ FUNC_Event ]
struct AwSetObjective_eventUsedBy_Parms
{
	class APawn*                                       User;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSetObjective.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwSetObjective_eventPreBeginPlay_Parms
{
	class UwMatchMaker*                                rMM;                                              		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameReplicationInfo.IsGhostChatting
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execIsGhostChatting_Parms
{
	class AActor*                                      Sender;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerReplicationInfo*                      PRI;                                              		// 0x0008 ( 0x0004
//	unsigned long                                      bGhostChatting:1;                                 		// 0x000C ( 0x0004 [0x00000001]
};

// Function WMission.wMSGameReplicationInfo.GetRoundWinnerString
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execGetRoundWinnerString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameReplicationInfo.SetMaxLives
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execSetMaxLives_Parms
{
	int                                                iMaxLives;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameReplicationInfo.GetMaxLives
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execGetMaxLives_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameReplicationInfo.IsDefender
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execIsDefender_Parms
{
	unsigned char                                      Team;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameReplicationInfo.IsPracticeRound
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execIsPracticeRound_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameReplicationInfo.GetRemainingTime
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execGetRemainingTime_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameReplicationInfo.Timer
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execTimer_Parms
{
};

// Function WMission.wMSGameReplicationInfo.SetupAssaultObjectivePriority
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execSetupAssaultObjectivePriority_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004
	class AGameObjective*                              BestGO;                                           		// 0x0004 ( 0x0004
	class AGameObjective*                              NextBestGO;                                       		// 0x0008 ( 0x0004
	unsigned char                                      CurrentPriority;                                  		// 0x000C ( 0x0001
};

// Function WMission.wMSGameReplicationInfo.PostNetBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execPostNetBeginPlay_Parms
{
};

// Function WMission.wMSGameReplicationInfo.PreBeginPlay
// Flags: [ FUNC_Simulated ]
struct AwMSGameReplicationInfo_execPreBeginPlay_Parms
{
};

// Function WMission.wMSGameInfo.AddGameSpecificActions
// Flags: 
struct AwMSGameInfo_execAddGameSpecificActions_Parms
{
	class TArray< class UwAction* >                    Actions;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.DoProcessKillMessage
// Flags: 
struct AwMSGameInfo_execDoProcessKillMessage_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.GetTotalPlayedTime
// Flags: 
struct AwMSGameInfo_execGetTotalPlayedTime_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.GetBootySeedValue
// Flags: 
struct AwMSGameInfo_execGetBootySeedValue_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.CheckScore
// Flags: 
struct AwMSGameInfo_execCheckScore_Parms
{
	class APlayerReplicationInfo*                      Scorer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.CheckLastMan
// Flags: 
struct AwMSGameInfo_execCheckLastMan_Parms
{
	int                                                TeamIndex;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class AController*                                 survivorC;                                        		// 0x0008 ( 0x0004
	int                                                survivorCount;                                    		// 0x000C ( 0x0004
};

// Function WMission.wMSGameInfo.CheckMaxLives
// Flags: 
struct AwMSGameInfo_execCheckMaxLives_Parms
{
	class APlayerReplicationInfo*                      Scorer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerReplicationInfo*                      Living;                                           		// 0x0008 ( 0x0004
//	unsigned char                                      bOtherTeamNoneLeft;                               		// 0x000C ( 0x0001
};

// Function WMission.wMSGameInfo.EndGameByTeamNoneLeft
// Flags: 
struct AwMSGameInfo_execEndGameByTeamNoneLeft_Parms
{
	class APlayerReplicationInfo*                      Living;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.LeaveLogOtherTeamNoneLeft
// Flags: 
struct AwMSGameInfo_execLeaveLogOtherTeamNoneLeft_Parms
{
	class APlayerReplicationInfo*                      Living;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wMSGameInfo.lll
// Flags: [ FUNC_Exec ]
struct AwMSGameInfo_execlll_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.FindLiving
// Flags: 
struct AwMSGameInfo_execFindLiving_Parms
{
	class APlayerReplicationInfo*                      Living;                                           		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	unsigned char                                      bOtherTeamNoneLeft;                               		// 0x0004 ( 0x0001[ CPF_Parm | CPF_OutParm ]
	class AController*                                 C;                                                		// 0x0008 ( 0x0004
};

// Function WMission.wMSGameInfo.AllowBecomeActivePlayer
// Flags: 
struct AwMSGameInfo_execAllowBecomeActivePlayer_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.IsRightTimeForRespawn
// Flags: 
struct AwMSGameInfo_execIsRightTimeForRespawn_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                elapsed;                                          		// 0x0008 ( 0x0004
//	class AwMSGameReplicationInfo*                     MSGRI;                                            		// 0x000C ( 0x0004
};

// Function WMission.wMSGameInfo.IsRespawnRestrictionTime
// Flags: [ FUNC_Simulated ]
struct AwMSGameInfo_execIsRespawnRestrictionTime_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                elapsed;                                          		// 0x0004 ( 0x0004
};

// Function WMission.wMSGameInfo.AllowMutator
// Flags: 
struct AwMSGameInfo_execAllowMutator_Parms
{
	struct FString                                     MutatorClassName;                                 		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.GetDescriptionText
// Flags: [ FUNC_Event ]
struct AwMSGameInfo_eventGetDescriptionText_Parms
{
	struct FString                                     PropName;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.FillPlayInfo
// Flags: 
struct AwMSGameInfo_execFillPlayInfo_Parms
{
	class UPlayInfo*                                   PlayInfo;                                         		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.AcceptPlayInfoProperty
// Flags: [ FUNC_Event ]
struct AwMSGameInfo_eventAcceptPlayInfoProperty_Parms
{
	struct FString                                     PropertyName;                                     		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x000C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.GetServerDetails
// Flags: 
struct AwMSGameInfo_execGetServerDetails_Parms
{
	struct FServerResponseLine                         ServerState;                                      		// 0x0000 ( 0x0070[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.UpdateAnnouncements
// Flags: [ FUNC_Simulated ]
struct AwMSGameInfo_execUpdateAnnouncements_Parms
{
};

// Function WMission.wMSGameInfo.PrecacheGameAnnouncements
// Flags: 
struct AwMSGameInfo_execPrecacheGameAnnouncements_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wMSGameInfo.QueueAnnouncerSound
// Flags: 
struct AwMSGameInfo_execQueueAnnouncerSound_Parms
{
	struct FString                                     ASound;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      AnnouncementLevel;                                		// 0x000C ( 0x0001[ CPF_Parm ]
	unsigned char                                      Team;                                             		// 0x000D ( 0x0001[ CPF_Parm ]
	unsigned char                                      Priority;                                         		// 0x000E ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	unsigned char                                      Switch;                                           		// 0x000F ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	class AController*                                 C;                                                		// 0x0010 ( 0x0004
};

// Function WMission.wMSGameInfo.AdjustDestroyObjectiveDamage
// Flags: 
struct AwMSGameInfo_execAdjustDestroyObjectiveDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 instigatedBy;                                     		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AGameObjective*                              Go;                                               		// 0x0008 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           LocalPlayer;                                      		// 0x0010 ( 0x0004
};

// Function WMission.wMSGameInfo.ReduceDamage
// Flags: 
struct AwMSGameInfo_execReduceDamage_Parms
{
	int                                                Damage;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       injured;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       instigatedBy;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HitLocation;                                      		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     Momentum;                                         		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	class UClass*                                      DamageType;                                       		// 0x0024 ( 0x0004[ CPF_Parm ]
	int                                                iWeaponType;                                      		// 0x0028 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x002C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.SetObjectiveSetted
// Flags: 
struct AwMSGameInfo_execSetObjectiveSetted_Parms
{
	class APawn*                                       TP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       ObjectTag;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     FlagLocation;                                     		// 0x0008 ( 0x000C[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.GetRemainingTime
// Flags: 
struct AwMSGameInfo_execGetRemainingTime_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.SetRemainingTime
// Flags: 
struct AwMSGameInfo_execSetRemainingTime_Parms
{
	int                                                remain;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.FindPlayerStart
// Flags: 
struct AwMSGameInfo_execFindPlayerStart_Parms
{
	class AController*                                 Player;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      inTeam;                                           		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     incomingName;                                     		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      Team;                                             		// 0x0018 ( 0x0001
//	class AwMSGameReplicationInfo*                     MSGRI;                                            		// 0x001C ( 0x0004
};

// Function WMission.wMSGameInfo.GetPlayerStartTeam
// Flags: 
struct AwMSGameInfo_execGetPlayerStartTeam_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Team;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.PossessPawn
// Flags: 
struct AwMSGameInfo_execPossessPawn_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    V;                                                		// 0x0008 ( 0x0004
	class APawn*                                       OldPawn;                                          		// 0x000C ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0010 ( 0x0004
};

// Function WMission.wMSGameInfo.SpawnAndPossessPawn
// Flags: 
struct AwMSGameInfo_execSpawnAndPossessPawn_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     PawnClassName;                                    		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UClass*                                      PawnClass;                                        		// 0x0014 ( 0x0004
//	class APawn*                                       P;                                                		// 0x0018 ( 0x0004
};

// Function WMission.wMSGameInfo.GetDefaultPlayerClass
// Flags: 
struct AwMSGameInfo_execGetDefaultPlayerClass_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UClass*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FString                                     PawnClassName;                                    		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
//	class UClass*                                      PawnClass;                                        		// 0x0014 ( 0x0004
};

// Function WMission.wMSGameInfo.AddDefaultInventory
// Flags: 
struct AwMSGameInfo_execAddDefaultInventory_Parms
{
	class APawn*                                       PlayerPawn;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.RespawnPlayer
// Flags: 
struct AwMSGameInfo_execRespawnPlayer_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bClearSpecials:1;                                 		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     PawnOverrideClass;                                		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	class AVehicle*                                    DrivenVehicle;                                    		// 0x0014 ( 0x0004
};

// Function WMission.wMSGameInfo.RestartPlayer
// Flags: 
struct AwMSGameInfo_execRestartPlayer_Parms
{
	class AController*                                 aPlayer;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     PawnOverrideClass;                                		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	class AwMSGameReplicationInfo*                     MSGRI;                                            		// 0x0010 ( 0x0004
	class TArray< int >                                aPlayerIDs;                                       		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                iPlayerID;                                        		// 0x0020 ( 0x0004
	int                                                iCurrentRound;                                    		// 0x0024 ( 0x0004
};

// Function WMission.wMSGameInfo.ForceRestartPlayer
// Flags: 
struct AwMSGameInfo_execForceRestartPlayer_Parms
{
	class AController*                                 aPlayer;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     PawnOverrideClass;                                		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.TeamScoreEvent
// Flags: 
struct AwMSGameInfo_execTeamScoreEvent_Parms
{
	int                                                Team;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Points;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Desc;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.ScoreEvent
// Flags: 
struct AwMSGameInfo_execScoreEvent_Parms
{
	class APlayerReplicationInfo*                      Who;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Points;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Desc;                                             		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.KillEvent
// Flags: 
struct AwMSGameInfo_execKillEvent_Parms
{
	struct FString                                     KillType;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      Killer;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      Victim;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	class UClass*                                      Damage;                                           		// 0x0014 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.SpecialEvent
// Flags: 
struct AwMSGameInfo_execSpecialEvent_Parms
{
	class APlayerReplicationInfo*                      Who;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Desc;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.CriticalPlayer
// Flags: 
struct AwMSGameInfo_execCriticalPlayer_Parms
{
	class AController*                                 Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AGameObjective*                              Go;                                               		// 0x0008 ( 0x0004
};

// Function WMission.wMSGameInfo.VehicleScoreKill
// Flags: 
struct AwMSGameInfo_execVehicleScoreKill_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    DestroyedVehicle;                                 		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FString                                     KillInfo;                                         		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	int                                                ReturnValue;                                      		// 0x0018 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.Killed
// Flags: 
struct AwMSGameInfo_execKilled_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Killed;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	class APawn*                                       KilledPawn;                                       		// 0x0008 ( 0x0004[ CPF_Parm ]
	class UClass*                                      DamageType;                                       		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                CollisionPart;                                    		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                WeaponType;                                       		// 0x0014 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	unsigned long                                      bWallShot:1;                                      		// 0x0018 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WMission.wMSGameInfo.TeleportPlayerToSpawn
// Flags: 
struct AwMSGameInfo_execTeleportPlayerToSpawn_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     PrevLocation;                                     		// 0x0004 ( 0x000C
};

// Function WMission.wMSGameInfo.NoTranslocatorKeyPressed
// Flags: [ FUNC_Event ]
struct AwMSGameInfo_eventNoTranslocatorKeyPressed_Parms
{
	class APlayerController*                           PC;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwMSGameReplicationInfo*                     ASGRI;                                            		// 0x0004 ( 0x0004
	class AwMSPlayerReplicationInfo*                   ASPRI;                                            		// 0x0008 ( 0x0004
};

// Function WMission.wMSGameInfo.NewSpawnAreaEnabled
// Flags: [ FUNC_Event ]
struct AwMSGameInfo_eventNewSpawnAreaEnabled_Parms
{
	unsigned long                                      bDefenders:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x0008 ( 0x0004
};

// Function WMission.wMSGameInfo.CanDisableObjective
// Flags: 
struct AwMSGameInfo_execCanDisableObjective_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwMSGameReplicationInfo*                     ASGRI;                                            		// 0x0008 ( 0x0004
};

// Function WMission.wMSGameInfo.NeedToRespawnSD
// Flags: 
struct AwMSGameInfo_execNeedToRespawnSD_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.IsPlaying
// Flags: 
struct AwMSGameInfo_execIsPlaying_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.IsPracticeRound
// Flags: 
struct AwMSGameInfo_execIsPracticeRound_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.IsPlayingIntro
// Flags: 
struct AwMSGameInfo_execIsPlayingIntro_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.GetDefenderNum
// Flags: 
struct AwMSGameInfo_execGetDefenderNum_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.GetAttackingTeam
// Flags: 
struct AwMSGameInfo_execGetAttackingTeam_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.IsAttackingTeam
// Flags: 
struct AwMSGameInfo_execIsAttackingTeam_Parms
{
	int                                                TeamNumber;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.BeginNewPairOfRounds
// Flags: 
struct AwMSGameInfo_execBeginNewPairOfRounds_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.BeginRound
// Flags: 
struct AwMSGameInfo_execBeginRound_Parms
{
	unsigned long                                      bNoReset:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	unsigned long                                      bChangeTeam:1;                                    		// 0x0008 ( 0x0004 [0x00000001]
	class TArray< int >                                aPlayerIDs;                                       		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
	int                                                PlayerID;                                         		// 0x0018 ( 0x0004
};

// Function WMission.wMSGameInfo.DestoryPawns
// Flags: 
struct AwMSGameInfo_execDestoryPawns_Parms
{
	class AwPawn*                                      P;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.ProcessSwitchTeam
// Flags: 
struct AwMSGameInfo_execProcessSwitchTeam_Parms
{
	unsigned long                                      bNoReset:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      bupAttackingTeam;                                 		// 0x0008 ( 0x0001
};

// Function WMission.wMSGameInfo.SetRoundTimeLimit
// Flags: 
struct AwMSGameInfo_execSetRoundTimeLimit_Parms
{
};

// Function WMission.wMSGameInfo.InitializeGameInfo
// Flags: 
struct AwMSGameInfo_execInitializeGameInfo_Parms
{
	unsigned long                                      bNoReset:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bChangeTeam:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wMSGameInfo.AnnounceSwitchTeam
// Flags: 
struct AwMSGameInfo_execAnnounceSwitchTeam_Parms
{
};

// Function WMission.wMSGameInfo.NewRoundSwitchTeam
// Flags: 
struct AwMSGameInfo_execNewRoundSwitchTeam_Parms
{
	int                                                iChangeAttack;                                    		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.ResetLevel
// Flags: 
struct AwMSGameInfo_execResetLevel_Parms
{
	unsigned long                                      hiddenAll:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class AController*                                 NextC;                                            		// 0x0008 ( 0x0004
	class AActor*                                      A;                                                		// 0x000C ( 0x0004
};

// Function WMission.wMSGameInfo.StartNewRound
// Flags: 
struct AwMSGameInfo_execStartNewRound_Parms
{
};

// Function WMission.wMSGameInfo.NewRound
// Flags: [ FUNC_Exec ]
struct AwMSGameInfo_execNewRound_Parms
{
};

// Function WMission.wMSGameInfo.AnnounceScore
// Flags: 
struct AwMSGameInfo_execAnnounceScore_Parms
{
	int                                                ScoringTeam;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      byTempTeam;                                       		// 0x0004 ( 0x0001
};

// Function WMission.wMSGameInfo.SetRoundWinner
// Flags: 
struct AwMSGameInfo_execSetRoundWinner_Parms
{
	int                                                WinningTeam;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.PracticeRoundEnded
// Flags: 
struct AwMSGameInfo_execPracticeRoundEnded_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.IsRoundLimitReached
// Flags: 
struct AwMSGameInfo_execIsRoundLimitReached_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.EndRound
// Flags: 
struct AwMSGameInfo_execEndRound_Parms
{
	unsigned char                                      RoundEndReason;                                   		// 0x0000 ( 0x0001[ CPF_Parm ]
	class APawn*                                       Instigator;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                ScoringTeam;                                      		// 0x0014 ( 0x0004
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0018 ( 0x0004
	unsigned long                                      bSuccessfulAttack:1;                              		// 0x001C ( 0x0004 [0x00000001]
};

// Function WMission.wMSGameInfo.NotifyEndRound
// Flags: 
struct AwMSGameInfo_execNotifyEndRound_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.NotifyBeginRound
// Flags: 
struct AwMSGameInfo_execNotifyBeginRound_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.CalcRoundResultPoints
// Flags: 
struct AwMSGameInfo_execCalcRoundResultPoints_Parms
{
	int                                                ScoringTeam;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.ProcessEndGame
// Flags: 
struct AwMSGameInfo_execProcessEndGame_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class AController*                                 NextC;                                            		// 0x0004 ( 0x0004
};

// Function WMission.wMSGameInfo.PlayEndOfMatchMessage
// Flags: 
struct AwMSGameInfo_execPlayEndOfMatchMessage_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	int                                                oppTeam;                                          		// 0x0004 ( 0x0004
	int                                                myTeam;                                           		// 0x0008 ( 0x0004
	class APlayerController*                           PC;                                               		// 0x000C ( 0x0004
};

// Function WMission.wMSGameInfo.CheckEndGame
// Flags: 
struct AwMSGameInfo_execCheckEndGame_Parms
{
	class APlayerReplicationInfo*                      Winner;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0014 ( 0x0004
//	class AController*                                 C;                                                		// 0x0018 ( 0x0004
//	unsigned long                                      bLastMan:1;                                       		// 0x001C ( 0x0004 [0x00000001]
};

// Function WMission.wMSGameInfo.SceneStarted
// Flags: [ FUNC_Event ]
struct AwMSGameInfo_eventSceneStarted_Parms
{
	class ASceneManager*                               SM;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      Other;                                            		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.ProcessRespawn
// Flags: 
struct AwMSGameInfo_execProcessRespawn_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	struct FString                                     before;                                           		// 0x0004 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     after;                                            		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x001C ( 0x0004
};

// Function WMission.wMSGameInfo.ExplodeBomb
// Flags: 
struct AwMSGameInfo_execExplodeBomb_Parms
{
	class AwGameObject_Bomb*                           Bomb;                                             		// 0x0000 ( 0x0004
	class AActor*                                      A;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wMSGameInfo.ProcessEndRound
// Flags: 
struct AwMSGameInfo_execProcessEndRound_Parms
{
};

// Function WMission.wMSGameInfo.GetTimeSecondsLeft
// Flags: 
struct AwMSGameInfo_execGetTimeSecondsLeft_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.CheckEndGameAfterRoundTimeOver
// Flags: 
struct AwMSGameInfo_execCheckEndGameAfterRoundTimeOver_Parms
{
};

// Function WMission.wMSGameInfo.fEndRound
// Flags: [ FUNC_Exec ]
struct AwMSGameInfo_execfEndRound_Parms
{
	unsigned char                                      Team;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.OnRoundTimeOverWithoutObjectPlanted
// Flags: 
struct AwMSGameInfo_execOnRoundTimeOverWithoutObjectPlanted_Parms
{
};

// Function WMission.wMSGameInfo.BroadCast_AssaultRole_Message
// Flags: 
struct AwMSGameInfo_execBroadCast_AssaultRole_Message_Parms
{
	class APlayerController*                           C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.GameObjectDropped
// Flags: 
struct AwMSGameInfo_execGameObjectDropped_Parms
{
	class ADecoration*                                 D;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.DiscardInventory
// Flags: 
struct AwMSGameInfo_execDiscardInventory_Parms
{
	class APawn*                                       Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwGameObject_Bomb*                           Bomb;                                             		// 0x0004 ( 0x0004
	struct FName                                       stateName;                                        		// 0x0008 ( 0x0004
};

// Function WMission.wMSGameInfo.OnKillingDropOut
// Flags: 
struct AwMSGameInfo_execOnKillingDropOut_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.Logout
// Flags: 
struct AwMSGameInfo_execLogout_Parms
{
	class AController*                                 Exiting;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.InitGameReplicationInfo
// Flags: 
struct AwMSGameInfo_execInitGameReplicationInfo_Parms
{
};

// Function WMission.wMSGameInfo.StartMatch
// Flags: 
struct AwMSGameInfo_execStartMatch_Parms
{
};

// Function WMission.wMSGameInfo.StartMatchChangedHost
// Flags: 
struct AwMSGameInfo_execStartMatchChangedHost_Parms
{
	class AwGameObject_Bomb*                           Bomb;                                             		// 0x0000 ( 0x0004
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wMSGameInfo.InitGame
// Flags: [ FUNC_Event ]
struct AwMSGameInfo_eventInitGame_Parms
{
	struct FString                                     Options;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function WMission.wMSGameInfo.Login
// Flags: [ FUNC_Event ]
struct AwMSGameInfo_eventLogin_Parms
{
	struct FString                                     Portal;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Options;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class APlayerController*                           ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0028 ( 0x0004
//	unsigned long                                      bSpectator:1;                                     		// 0x002C ( 0x0004 [0x00000001]
};

// Function WMission.wMSGameInfo.PostBeginPlay
// Flags: 
struct AwMSGameInfo_execPostBeginPlay_Parms
{
};

// Function WMission.wMSGameInfo.ForceObjectiveDefenderTeamIndex
// Flags: 
struct AwMSGameInfo_execForceObjectiveDefenderTeamIndex_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004
};

// Function WMission.wMSGameInfo.TweakSkill
// Flags: 
struct AwMSGameInfo_execTweakSkill_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wMSGameInfo.NeverAllowTransloc
// Flags: 
struct AwMSGameInfo_execNeverAllowTransloc_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.AllowTransloc
// Flags: 
struct AwMSGameInfo_execAllowTransloc_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.DivertSpaceFighter
// Flags: 
struct AwMSGameInfo_execDivertSpaceFighter_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wMSGameInfo.CheckReady
// Flags: 
struct AwMSGameInfo_execCheckReady_Parms
{
};

// Function WMission.wMSGameInfo.Reset
// Flags: 
struct AwMSGameInfo_execReset_Parms
{
};

// Function WMission.wDiffuseObjective.Reset
// Flags: 
struct AwDiffuseObjective_execReset_Parms
{
};

// Function WMission.wDiffuseObjective.RefreshState
// Flags: 
struct AwDiffuseObjective_execRefreshState_Parms
{
};

// Function WMission.wDiffuseObjective.GetObjectiveProgress
// Flags: [ FUNC_Simulated ]
struct AwDiffuseObjective_execGetObjectiveProgress_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              DecTime;                                          		// 0x0004 ( 0x0004
};

// Function WMission.wDiffuseObjective.PlayerToucherDied
// Flags: 
struct AwDiffuseObjective_execPlayerToucherDied_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDiffuseObjective.IsRelevant
// Flags: 
struct AwDiffuseObjective_execIsRelevant_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bAliveCheck:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwMSGameReplicationInfo*                     MSGRI;                                            		// 0x000C ( 0x0004
};

// Function WMission.wDiffuseObjective.UnTouch
// Flags: 
struct AwDiffuseObjective_execUnTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDiffuseObjective.Touch
// Flags: 
struct AwDiffuseObjective_execTouch_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDiffuseObjective.CanDefuse
// Flags: [ FUNC_Simulated ]
struct AwDiffuseObjective_execCanDefuse_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APawn*                                       touchingP;                                        		// 0x0008 ( 0x0004
//	unsigned long                                      bCheck:1;                                         		// 0x000C ( 0x0004 [0x00000001]
};

// Function WMission.wDiffuseObjective.IsDefusing
// Flags: [ FUNC_Simulated ]
struct AwDiffuseObjective_execIsDefusing_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wDiffuseObjective.Tick
// Flags: [ FUNC_Event ]
struct AwDiffuseObjective_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004
	unsigned long                                      Set:1;                                            		// 0x0008 ( 0x0004 [0x00000001]
	float                                              DecTime;                                          		// 0x000C ( 0x0004
	struct FString                                     OldPlayerName;                                    		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wDiffuseObjective.PlayBombDefusedMessage
// Flags: 
struct AwDiffuseObjective_execPlayBombDefusedMessage_Parms
{
	class APawn*                                       TP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      TeamNum;                                          		// 0x0004 ( 0x0001
};

// Function WMission.wDiffuseObjective.OnBombDiffused
// Flags: 
struct AwDiffuseObjective_execOnBombDiffused_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwDiffuseObjective*                          dif;                                              		// 0x0004 ( 0x0004
};

// Function WMission.wDiffuseObjective.UpdateBombs
// Flags: 
struct AwDiffuseObjective_execUpdateBombs_Parms
{
	class AwGameObject_Bomb*                           Bomb;                                             		// 0x0000 ( 0x0004
};

// Function WMission.wDiffuseObjective.SetBombVisibility
// Flags: 
struct AwDiffuseObjective_execSetBombVisibility_Parms
{
	unsigned long                                      val:1;                                            		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	int                                                lp;                                               		// 0x0004 ( 0x0004
};

// Function WMission.wDiffuseObjective.UsedBy
// Flags: [ FUNC_Event ]
struct AwDiffuseObjective_eventUsedBy_Parms
{
	class APawn*                                       User;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDiffuseObjective.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwDiffuseObjective_eventPreBeginPlay_Parms
{
	class UwMatchMaker*                                rMM;                                              		// 0x0000 ( 0x0004
};

// Function WMission.wGameObject_Bomb.PrecacheAnnouncer
// Flags: [ FUNC_Simulated ]
struct AwGameObject_Bomb_execPrecacheAnnouncer_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wGameObject_Bomb.LogReturned
// Flags: 
struct AwGameObject_Bomb_execLogReturned_Parms
{
};

// Function WMission.wGameObject_Bomb.HolderDied
// Flags: 
struct AwGameObject_Bomb_execHolderDied_Parms
{
};

// Function WMission.wGameObject_Bomb.Landed
// Flags: 
struct AwGameObject_Bomb_execLanded_Parms
{
	struct FVector                                     HitNormal;                                        		// 0x0000 ( 0x000C[ CPF_Parm ]
};

// Function WMission.wGameObject_Bomb.Drop
// Flags: 
struct AwGameObject_Bomb_execDrop_Parms
{
	struct FVector                                     NewVel;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FString                                     sReason;                                          		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
};

// Function WMission.wGameObject_Bomb.ProcessThrowMessage
// Flags: 
struct AwGameObject_Bomb_execProcessThrowMessage_Parms
{
	unsigned long                                      allyLeft:1;                                       		// 0x0000 ( 0x0004 [0x00000001]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wGameObject_Bomb.ProcessDropMessage
// Flags: 
struct AwGameObject_Bomb_execProcessDropMessage_Parms
{
	unsigned long                                      allyLeft:1;                                       		// 0x0000 ( 0x0004 [0x00000001]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wGameObject_Bomb.ClearHolder
// Flags: 
struct AwGameObject_Bomb_execClearHolder_Parms
{
};

// Function WMission.wGameObject_Bomb.SetHolder
// Flags: 
struct AwGameObject_Bomb_execSetHolder_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wGameObject_Bomb.ProcessSetHolderMessage
// Flags: 
struct AwGameObject_Bomb_execProcessSetHolderMessage_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Ctrl;                                             		// 0x0004 ( 0x0004
};

// Function WMission.wGameObject_Bomb.OnSetHolder
// Flags: 
struct AwGameObject_Bomb_execOnSetHolder_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wGameObject_Bomb.ValidHolder
// Flags: 
struct AwGameObject_Bomb_execValidHolder_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wGameObject_Bomb.PostBeginPlay
// Flags: 
struct AwGameObject_Bomb_execPostBeginPlay_Parms
{
};

// Function WMission.wGameObject_Bomb.CanBePickedUpBy
// Flags: 
struct AwGameObject_Bomb_execCanBePickedUpBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSDGameInfo.EndGameByTeamNoneLeft
// Flags: 
struct AwSDGameInfo_execEndGameByTeamNoneLeft_Parms
{
	class APlayerReplicationInfo*                      Living;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSDGameInfo.AnnounceAlmostWinningTeam
// Flags: 
struct AwSDGameInfo_execAnnounceAlmostWinningTeam_Parms
{
};

// Function WMission.wSDGameInfo.AnnounceWinningTeam
// Flags: 
struct AwSDGameInfo_execAnnounceWinningTeam_Parms
{
};

// Function WMission.wSDGameInfo.GetResultPointRatio_Intervention
// Flags: 
struct AwSDGameInfo_execGetResultPointRatio_Intervention_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSDGameInfo.SetPRI4Intervention
// Flags: 
struct AwSDGameInfo_execSetPRI4Intervention_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSDGameInfo.CalcRoundResultPoints
// Flags: 
struct AwSDGameInfo_execCalcRoundResultPoints_Parms
{
	int                                                ScoringTeam;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0008 ( 0x0004
	int                                                PlayerCount;                                      		// 0x000C ( 0x0004
};

// Function WMission.wSDGameInfo.CalcResultPoints
// Flags: 
struct AwSDGameInfo_execCalcResultPoints_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0004 ( 0x0004
	float                                              numPlayersFactor;                                 		// 0x0008 ( 0x0004
};

// Function WMission.wSDGameInfo.AnnounceMatchInfo_SD
// Flags: 
struct AwSDGameInfo_execAnnounceMatchInfo_SD_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wSDGameInfo.AnnounceSwitchTeam
// Flags: 
struct AwSDGameInfo_execAnnounceSwitchTeam_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wSDGameInfo.PrecacheGameAnnouncements
// Flags: 
struct AwSDGameInfo_execPrecacheGameAnnouncements_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wSDGameInfo.InitializeSetObjectives
// Flags: 
struct AwSDGameInfo_execInitializeSetObjectives_Parms
{
	class AwSetObjective*                              Set;                                              		// 0x0000 ( 0x0004
};

// Function WMission.wSDGameInfo.EndRound
// Flags: 
struct AwSDGameInfo_execEndRound_Parms
{
	unsigned char                                      RoundEndReason;                                   		// 0x0000 ( 0x0001[ CPF_Parm ]
	class APawn*                                       Instigator;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WMission.wSDGameInfo.ServerLogEndRound
// Flags: 
struct AwSDGameInfo_execServerLogEndRound_Parms
{
	unsigned char                                      RoundEndReason;                                   		// 0x0000 ( 0x0001[ CPF_Parm ]
	class APawn*                                       Instigator;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	int                                                endType;                                          		// 0x0014 ( 0x0004
	int                                                winTeam;                                          		// 0x0018 ( 0x0004
	int                                                winTeamAD;                                        		// 0x001C ( 0x0004
	int                                                Players;                                          		// 0x0020 ( 0x0004
	int                                                fEndTime;                                         		// 0x0024 ( 0x0004
	int                                                iCurrentTime;                                     		// 0x0028 ( 0x0004
};

// Function WMission.wSDGameInfo.GetWinTeamAD
// Flags: 
struct AwSDGameInfo_execGetWinTeamAD_Parms
{
	int                                                winTeam;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSDGameInfo.GetWinTeam
// Flags: 
struct AwSDGameInfo_execGetWinTeam_Parms
{
	unsigned char                                      RoundEndReason;                                   		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSDGameInfo.GetRoundEndType
// Flags: 
struct AwSDGameInfo_execGetRoundEndType_Parms
{
	unsigned char                                      RoundEndReason;                                   		// 0x0000 ( 0x0001[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                attackerCount;                                    		// 0x0008 ( 0x0004
//	int                                                defenderCount;                                    		// 0x000C ( 0x0004
};

// Function WMission.wSDGameInfo.CountPlayersByTeam
// Flags: 
struct AwSDGameInfo_execCountPlayersByTeam_Parms
{
	int                                                Team;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0008 ( 0x0004
//	int                                                Count;                                            		// 0x000C ( 0x0004
};

// Function WMission.wSDGameInfo.AnnounceBeginRound
// Flags: 
struct AwSDGameInfo_execAnnounceBeginRound_Parms
{
};

// Function WMission.wSDGameInfo.BeginRound
// Flags: 
struct AwSDGameInfo_execBeginRound_Parms
{
	unsigned long                                      bNoReset:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WMission.wSDGameInfo.OnBombDiffused
// Flags: 
struct AwSDGameInfo_execOnBombDiffused_Parms
{
	class APawn*                                       TP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       Tag;                                              		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     FlagLocation;                                     		// 0x0008 ( 0x000C[ CPF_Parm ]
	int                                                PlayerID;                                         		// 0x0014 ( 0x0004
	unsigned char                                      byFlagIndex;                                      		// 0x0018 ( 0x0001
	float                                              fDefuserXCoord;                                   		// 0x001C ( 0x0004
	float                                              fDefuserYCoord;                                   		// 0x0020 ( 0x0004
	float                                              fDefuserZCoord;                                   		// 0x0024 ( 0x0004
	int                                                iDefuserPos;                                      		// 0x0028 ( 0x0004
	int                                                iDefuserWeapon;                                   		// 0x002C ( 0x0004
	int                                                iDefuserWeaponPart;                               		// 0x0030 ( 0x0004
	int                                                iDefuserRange;                                    		// 0x0034 ( 0x0004
};

// Function WMission.wSDGameInfo.SetObjectiveSetted
// Flags: 
struct AwSDGameInfo_execSetObjectiveSetted_Parms
{
	class APawn*                                       TP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       ObjectTag;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     FlagLocation;                                     		// 0x0008 ( 0x000C[ CPF_Parm ]
	int                                                PlayerID;                                         		// 0x0014 ( 0x0004
	unsigned char                                      byFlagIndex;                                      		// 0x0018 ( 0x0001
	float                                              fInstallerXCoord;                                 		// 0x001C ( 0x0004
	float                                              fInstallerYCoord;                                 		// 0x0020 ( 0x0004
	float                                              fInstallerZCoord;                                 		// 0x0024 ( 0x0004
	int                                                iInstallerPos;                                    		// 0x0028 ( 0x0004
	int                                                iInstallerWeapon;                                 		// 0x002C ( 0x0004
	int                                                iInstallerWeaponPart;                             		// 0x0030 ( 0x0004
	int                                                iInstallerRange;                                  		// 0x0034 ( 0x0004
};

// Function WMission.wSDGameInfo.PlayObjectiveSetVociceBGM
// Flags: 
struct AwSDGameInfo_execPlayObjectiveSetVociceBGM_Parms
{
	class APawn*                                       TP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSDGameInfo.GotoDefusePhase
// Flags: 
struct AwSDGameInfo_execGotoDefusePhase_Parms
{
	struct FName                                       ObjectTag;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwSetObjective*                              Set;                                              		// 0x0004 ( 0x0004
	class AwDiffuseObjective*                          dif;                                              		// 0x0008 ( 0x0004
};

// Function WMission.wSDGameInfo.InitGame
// Flags: [ FUNC_Event ]
struct AwSDGameInfo_eventInitGame_Parms
{
	struct FString                                     Options;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function WMission.wFlagObjective.GetObjectiveProgress
// Flags: [ FUNC_Simulated ]
struct AwFlagObjective_execGetObjectiveProgress_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wFlagObjective.Reset
// Flags: 
struct AwFlagObjective_execReset_Parms
{
};

// Function WMission.wFlagObjective.IsRelevant
// Flags: 
struct AwFlagObjective_execIsRelevant_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bAliveCheck:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerReplicationInfo*                      PRI;                                              		// 0x000C ( 0x0004
};

// Function WMission.wFlagObjective.RemoveTouchingPlayer
// Flags: 
struct AwFlagObjective_execRemoveTouchingPlayer_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wFlagObjective.AddNewTouchingPlayer
// Flags: 
struct AwFlagObjective_execAddNewTouchingPlayer_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wFlagObjective.Tick
// Flags: [ FUNC_Event ]
struct AwFlagObjective_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      TouchTeamCount;                                   		// 0x0004 ( 0x0001
	int                                                iCurCapturingTeam;                                		// 0x0008 ( 0x0004
	int                                                i;                                                		// 0x000C ( 0x0004
	int                                                iTemp;                                            		// 0x0010 ( 0x0004
	int                                                PlayerID;                                         		// 0x0014 ( 0x0004
	class TArray< class APawn* >                       ActiveTeam;                                       		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< int >                                TakerUID;                                         		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
	class UwMatchMaker*                                kMM;                                              		// 0x0030 ( 0x0004
};

// Function WMission.wFlagObjective.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwFlagObjective_eventPreBeginPlay_Parms
{
	class UwMatchMaker*                                rMM;                                              		// 0x0000 ( 0x0004
};

// Function WMission.wFlagObjective.UsedBy
// Flags: [ FUNC_Event ]
struct AwFlagObjective_eventUsedBy_Parms
{
	class APawn*                                       User;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.GetGameSpecificPurposes
// Flags: 
struct AwDOMGameInfo_execGetGameSpecificPurposes_Parms
{
	class AController*                                 Owner;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< class UObject* >                     purposes;                                         		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function WMission.wDOMGameInfo.PrecacheGameAnnouncements
// Flags: 
struct AwDOMGameInfo_execPrecacheGameAnnouncements_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.GetFlagsInfo
// Flags: 
struct AwDOMGameInfo_execGetFlagsInfo_Parms
{
	int                                                outNumFlags;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                outNumCapturedFlagsByTeam1;                       		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                outNumCapturedFlagsByTeam2;                       		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                lp1;                                              		// 0x000C ( 0x0004
};

// Function WMission.wDOMGameInfo.StartMatch
// Flags: 
struct AwDOMGameInfo_execStartMatch_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004
	class AwFlagObjective*                             f;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wDOMGameInfo.CheckLastMan
// Flags: 
struct AwDOMGameInfo_execCheckLastMan_Parms
{
	int                                                TeamIndex;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.GetBootySeedValue
// Flags: 
struct AwDOMGameInfo_execGetBootySeedValue_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wDOMGameInfo.GetTotalPlayedTime
// Flags: 
struct AwDOMGameInfo_execGetTotalPlayedTime_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wDOMGameInfo.CalcResultPoints
// Flags: 
struct AwDOMGameInfo_execCalcResultPoints_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0004 ( 0x0004
};

// Function WMission.wDOMGameInfo.PlayEndOfMatchMessage
// Flags: 
struct AwDOMGameInfo_execPlayEndOfMatchMessage_Parms
{
};

// Function WMission.wDOMGameInfo.ClearTakerInfo
// Flags: 
struct AwDOMGameInfo_execClearTakerInfo_Parms
{
};

// Function WMission.wDOMGameInfo.TakerInfo
// Flags: 
struct AwDOMGameInfo_execTakerInfo_Parms
{
	class APawn*                                       TakerPawn;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     FlagLocation;                                     		// 0x0004 ( 0x000C[ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.FlagState_UpdateDomScore
// Flags: 
struct AwDOMGameInfo_execFlagState_UpdateDomScore_Parms
{
	int                                                AFScore;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RSAScore;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.FlagState_TakePoint
// Flags: 
struct AwDOMGameInfo_execFlagState_TakePoint_Parms
{
	class TArray< int >                                TakerUID;                                         		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FName                                       FlagTag;                                          		// 0x000C ( 0x0004[ CPF_Parm ]
	unsigned char                                      byFlagIndex;                                      		// 0x0010 ( 0x0001
	int                                                i;                                                		// 0x0014 ( 0x0004
};

// Function WMission.wDOMGameInfo.AnnounceFlagState
// Flags: 
struct AwDOMGameInfo_execAnnounceFlagState_Parms
{
	unsigned char                                      byState;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      byTeam;                                           		// 0x0001 ( 0x0001[ CPF_Parm ]
	struct FName                                       FlagTag;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      byFlagIndex;                                      		// 0x0008 ( 0x0001
};

// Function WMission.wDOMGameInfo.AnnounceFlagCapture
// Flags: 
struct AwDOMGameInfo_execAnnounceFlagCapture_Parms
{
	unsigned char                                      byState;                                          		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned char                                      byTeam;                                           		// 0x0001 ( 0x0001[ CPF_Parm ]
	unsigned char                                      byFlagIndex;                                      		// 0x0002 ( 0x0001[ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.InitializeCodes
// Flags: 
struct AwDOMGameInfo_execInitializeCodes_Parms
{
};

// Function WMission.wDOMGameInfo.AnnounceAllFlagCaptured
// Flags: 
struct AwDOMGameInfo_execAnnounceAllFlagCaptured_Parms
{
	unsigned char                                      byTeam;                                           		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.IsAllFlagCaptured
// Flags: 
struct AwDOMGameInfo_execIsAllFlagCaptured_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwFlagObjective*                             f;                                                		// 0x0004 ( 0x0004
//	int                                                iTempTeam;                                        		// 0x0008 ( 0x0004
};

// Function WMission.wDOMGameInfo.RatePlayerStart
// Flags: 
struct AwDOMGameInfo_execRatePlayerStart_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Team;                                             		// 0x0004 ( 0x0001[ CPF_Parm ]
	class AController*                                 Player;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerStart_DOM*                            P;                                                		// 0x0010 ( 0x0004
//	float                                              Score;                                            		// 0x0014 ( 0x0004
//	float                                              NextDist;                                         		// 0x0018 ( 0x0004
//	class AController*                                 OtherPlayer;                                      		// 0x001C ( 0x0004
//	class AGameObjective*                              Go;                                               		// 0x0020 ( 0x0004
};

// Function WMission.wDOMGameInfo.FindPlayerStart
// Flags: 
struct AwDOMGameInfo_execFindPlayerStart_Parms
{
	class AController*                                 Player;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      inTeam;                                           		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     incomingName;                                     		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class ANavigationPoint*                            N;                                                		// 0x0018 ( 0x0004
//	class ANavigationPoint*                            BestStart;                                        		// 0x001C ( 0x0004
//	unsigned char                                      Team;                                             		// 0x0020 ( 0x0001
//	unsigned char                                      t;                                                		// 0x0021 ( 0x0001
//	float                                              BestRating;                                       		// 0x0024 ( 0x0004
//	float                                              NewRating;                                        		// 0x0028 ( 0x0004
//	class ATeleporter*                                 Tel;                                              		// 0x002C ( 0x0004
//	unsigned char                                      curFlagType;                                      		// 0x0030 ( 0x0001
//	class TArray< unsigned char >                      flagTypes;                                        		// 0x0034 ( 0x000C[ CPF_NeedCtorLink ]
//	class AwFlagObjective*                             flag;                                             		// 0x0040 ( 0x0004
//	int                                                lp1;                                              		// 0x0044 ( 0x0004
//	class ANavigationPoint*                            respawnPoint;                                     		// 0x0048 ( 0x0004
//	class TArray< class ANavigationPoint* >            candidates;                                       		// 0x004C ( 0x000C[ CPF_NeedCtorLink ]
//	class TArray< float >                              candidateDists;                                   		// 0x0058 ( 0x000C[ CPF_NeedCtorLink ]
//	class APawn*                                       pickedAlly;                                       		// 0x0064 ( 0x0004
};

// Function WMission.wDOMGameInfo.IsSDRespawnTime
// Flags: 
struct AwDOMGameInfo_execIsSDRespawnTime_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wDOMGameInfo.GetShuffledFlags
// Flags: 
struct AwDOMGameInfo_execGetShuffledFlags_Parms
{
	class TArray< unsigned char >                      ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                FLAGS_MIX_COUNT;                                  		// 0x000C ( 0x0004
//	class TArray< unsigned char >                      flagTypes;                                        		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x001C ( 0x0004
//	unsigned char                                      tempFlag;                                         		// 0x0020 ( 0x0001
//	int                                                A;                                                		// 0x0024 ( 0x0004
//	int                                                B;                                                		// 0x0028 ( 0x0004
};

// Function WMission.wDOMGameInfo.GetFlagObjectiveByType
// Flags: 
struct AwDOMGameInfo_execGetFlagObjectiveByType_Parms
{
	unsigned char                                      FlagType;                                         		// 0x0000 ( 0x0001[ CPF_Parm ]
	class AwFlagObjective*                             ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwFlagObjective*                             flag;                                             		// 0x0008 ( 0x0004
};

// Function WMission.wDOMGameInfo.GetRespawnPointsFlagNeutral
// Flags: 
struct AwDOMGameInfo_execGetRespawnPointsFlagNeutral_Parms
{
	unsigned long                                      checkFail:1;                                      		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class TArray< class ANavigationPoint* >            ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class TArray< class ANavigationPoint* >            candidates;                                       		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x001C ( 0x0004
//	class APlayerStart_DOM*                            S;                                                		// 0x0020 ( 0x0004
//	class AwFlagObjective*                             flag;                                             		// 0x0024 ( 0x0004
};

// Function WMission.wDOMGameInfo.GetRespawnPointsForFlag
// Flags: 
struct AwDOMGameInfo_execGetRespawnPointsForFlag_Parms
{
	class AwFlagObjective*                             flag;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	class TArray< class ANavigationPoint* >            ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	class TArray< class ANavigationPoint* >            candidates;                                       		// 0x0010 ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x001C ( 0x0004
//	class APlayerStart_DOM*                            S;                                                		// 0x0020 ( 0x0004
//	int                                                FlagType;                                         		// 0x0024 ( 0x0004
};

// Function WMission.wDOMGameInfo.IsAppropriateRespawnPoint
// Flags: 
struct AwDOMGameInfo_execIsAppropriateRespawnPoint_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Team;                                             		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wDOMGameInfo.RespawnPlayer
// Flags: 
struct AwDOMGameInfo_execRespawnPlayer_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bClearSpecials:1;                                 		// 0x0004 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     PawnOverrideClass;                                		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	class AVehicle*                                    DrivenVehicle;                                    		// 0x0014 ( 0x0004
};

// Function WMission.wDOMGameInfo.EndDOMGame
// Flags: 
struct AwDOMGameInfo_execEndDOMGame_Parms
{
	int                                                iWinningTeam;                                     		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       Instigator;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0014 ( 0x0004
};

// Function WMission.wDOMGameInfo.OnRoundTimeOverWithoutObjectPlanted
// Flags: 
struct AwDOMGameInfo_execOnRoundTimeOverWithoutObjectPlanted_Parms
{
};

// Function WMission.wDOMGameInfo.EndRound
// Flags: 
struct AwDOMGameInfo_execEndRound_Parms
{
	unsigned char                                      RoundEndReason;                                   		// 0x0000 ( 0x0001[ CPF_Parm ]
	class APawn*                                       Instigator;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FString                                     Reason;                                           		// 0x0008 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
};

// Function WMission.wDOMGameInfo.AddTeamScore
// Flags: 
struct AwDOMGameInfo_execAddTeamScore_Parms
{
	int                                                iTeamIndex;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wDOMGameInfo.CheckEndGameAfterRoundTimeOver
// Flags: 
struct AwDOMGameInfo_execCheckEndGameAfterRoundTimeOver_Parms
{
};

// Function WMission.wDOMGameInfo.ContinueMatch
// Flags: 
struct AwDOMGameInfo_execContinueMatch_Parms
{
};

// Function WMission.wDOMGameInfo.ChangeHostExtraWork
// Flags: 
struct AwDOMGameInfo_execChangeHostExtraWork_Parms
{
	class AwFlagObjective*                             f;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wDOMGameInfo.GetNearFlag
// Flags: 
struct AwDOMGameInfo_execGetNearFlag_Parms
{
	class AActor*                                      A;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                lp1;                                              		// 0x0008 ( 0x0004
};

// Function WMission.wDOMGameInfo.GetGameSpecificActions
// Flags: 
struct AwDOMGameInfo_execGetGameSpecificActions_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UwNPCActions*                                npcActions;                                       		// 0x0004 ( 0x0004[ CPF_Parm ]
	class TArray< class UObject* >                     Actions;                                          		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	int                                                lp1;                                              		// 0x0014 ( 0x0004
	int                                                lp2;                                              		// 0x0018 ( 0x0004
	int                                                ownerTeam;                                        		// 0x001C ( 0x0004
	int                                                bestScore;                                        		// 0x0020 ( 0x0004
	class AwAIBotBase*                                 lOwner;                                           		// 0x0024 ( 0x0004
	class AwAIBotBase*                                 Other;                                            		// 0x0028 ( 0x0004
	class AwAILevel*                                   AILevel;                                          		// 0x002C ( 0x0004
	class AwFlagObjectiveBase*                         curFlag;                                          		// 0x0030 ( 0x0004
	class AwFlagObjectiveBase*                         BestFlag;                                         		// 0x0034 ( 0x0004
	class TArray< float >                              distsToFlag;                                      		// 0x0038 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< int >                                distRanks;                                        		// 0x0044 ( 0x000C[ CPF_NeedCtorLink ]
	class TArray< int >                                Scores;                                           		// 0x0050 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wBombObjective.PrecacheAnnouncer
// Flags: [ FUNC_Simulated ]
struct AwBombObjective_execPrecacheAnnouncer_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FString                                     SoundPackageName;                                 		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wBombObjective.Reset
// Flags: 
struct AwBombObjective_execReset_Parms
{
};

// Function WMission.wBombObjective.BetterObjectiveThan
// Flags: 
struct AwBombObjective_execBetterObjectiveThan_Parms
{
	class AGameObjective*                              Best;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      DesiredTeamNum;                                   		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned char                                      RequesterTeamNum;                                 		// 0x0005 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wBombObjective.BotNearObjective
// Flags: 
struct AwBombObjective_execBotNearObjective_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wBombObjective.SetActive
// Flags: 
struct AwBombObjective_execSetActive_Parms
{
	unsigned long                                      bActiveStatus:1;                                  		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	class AActor*                                      aBomb;                                            		// 0x0004 ( 0x0004
};

// Function WMission.wBombObjective.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwBombObjective_eventPreBeginPlay_Parms
{
	class UwMatchMaker*                                rMM;                                              		// 0x0000 ( 0x0004
};

// Function WMission.wGameObject_SBTBomb.Drop
// Flags: 
struct AwGameObject_SBTBomb_execDrop_Parms
{
	struct FVector                                     NewVel;                                           		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FString                                     sReason;                                          		// 0x000C ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class AwSBTSetObjective*                           Set;                                              		// 0x0018 ( 0x0004
};

// Function WMission.wGameObject_SBTBomb.ProcessDropMessage
// Flags: 
struct AwGameObject_SBTBomb_execProcessDropMessage_Parms
{
	class AController*                                 Ctrl;                                             		// 0x0000 ( 0x0004
};

// Function WMission.wGameObject_SBTBomb.ProcessSetHolderMessage
// Flags: 
struct AwGameObject_SBTBomb_execProcessSetHolderMessage_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 Ctrl;                                             		// 0x0004 ( 0x0004
};

// Function WMission.wGameObject_SBTBomb.SetAttackingTeam
// Flags: 
struct AwGameObject_SBTBomb_execSetAttackingTeam_Parms
{
	int                                                Team;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wGameObject_SBTBomb.OnSetHolder
// Flags: 
struct AwGameObject_SBTBomb_execOnSetHolder_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwSBTSetObjective*                           Set;                                              		// 0x0004 ( 0x0004
	unsigned char                                      Team;                                             		// 0x0008 ( 0x0001
};

// Function WMission.wGameObject_SBTBomb.CanBePickedUpBy
// Flags: 
struct AwGameObject_SBTBomb_execCanBePickedUpBy_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSBTSetObjective.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwSBTSetObjective_eventPreBeginPlay_Parms
{
};

// Function WMission.wSBTDiffuseObjective.OnBombDiffused
// Flags: 
struct AwSBTDiffuseObjective_execOnBombDiffused_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwSBTDiffuseObjective*                       dif;                                              		// 0x0004 ( 0x0004
	unsigned char                                      TeamNum;                                          		// 0x0008 ( 0x0001
};

// Function WMission.wSBTDiffuseObjective.SetBombHolder
// Flags: 
struct AwSBTDiffuseObjective_execSetBombHolder_Parms
{
	class APawn*                                       P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwGameObject_SBTBomb*                        Bomb;                                             		// 0x0004 ( 0x0004
};

// Function WMission.wSBTDiffuseObjective.ResetGameInfoOnBombDiffused
// Flags: 
struct AwSBTDiffuseObjective_execResetGameInfoOnBombDiffused_Parms
{
	int                                                elapsedSinceObjectSet;                            		// 0x0000 ( 0x0004
	int                                                newRemainingTime;                                 		// 0x0004 ( 0x0004
	class AwSBTGameInfo*                               sbt;                                              		// 0x0008 ( 0x0004
};

// Function WMission.wSBTDiffuseObjective.SetActive
// Flags: 
struct AwSBTDiffuseObjective_execSetActive_Parms
{
	unsigned long                                      bActiveStatus:1;                                  		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wSBTDiffuseObjective.SetTeam
// Flags: 
struct AwSBTDiffuseObjective_execSetTeam_Parms
{
	unsigned char                                      TeamIndex;                                        		// 0x0000 ( 0x0001[ CPF_Parm ]
};

// Function WMission.wSBTDiffuseObjective.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwSBTDiffuseObjective_eventPreBeginPlay_Parms
{
};

// Function WMission.wSBTGameInfo.AnnounceAlmostWinningTeam
// Flags: 
struct AwSBTGameInfo_execAnnounceAlmostWinningTeam_Parms
{
};

// Function WMission.wSBTGameInfo.GetWinTeamAD
// Flags: 
struct AwSBTGameInfo_execGetWinTeamAD_Parms
{
	int                                                winTeam;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSBTGameInfo.ProcessSwitchTeam
// Flags: 
struct AwSBTGameInfo_execProcessSwitchTeam_Parms
{
	unsigned long                                      bNoReset:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSBTGameInfo.RatePlayerStart
// Flags: 
struct AwSBTGameInfo_execRatePlayerStart_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Team;                                             		// 0x0004 ( 0x0001[ CPF_Parm ]
	class AController*                                 Player;                                           		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x000C ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerStart_SBT*                            P;                                                		// 0x0010 ( 0x0004
//	float                                              Score;                                            		// 0x0014 ( 0x0004
//	float                                              NextDist;                                         		// 0x0018 ( 0x0004
//	class AController*                                 OtherPlayer;                                      		// 0x001C ( 0x0004
};

// Function WMission.wSBTGameInfo.FindPlayerStart
// Flags: 
struct AwSBTGameInfo_execFindPlayerStart_Parms
{
	class AController*                                 Player;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      inTeam;                                           		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     incomingName;                                     		// 0x0008 ( 0x000C[ CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink ]
	class ANavigationPoint*                            ReturnValue;                                      		// 0x0014 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      Team;                                             		// 0x0018 ( 0x0001
//	unsigned char                                      RespawnTeam;                                      		// 0x0019 ( 0x0001
//	class ANavigationPoint*                            respawnPoint;                                     		// 0x001C ( 0x0004
//	class AwMSGameReplicationInfo*                     MSGRI;                                            		// 0x0020 ( 0x0004
};

// Function WMission.wSBTGameInfo.IsSDRespawnTime
// Flags: 
struct AwSBTGameInfo_execIsSDRespawnTime_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AwMSGameReplicationInfo*                     MSGRI;                                            		// 0x0004 ( 0x0004
};

// Function WMission.wSBTGameInfo.GetRespawnCandidatesByTeamGG
// Flags: 
struct AwSBTGameInfo_execGetRespawnCandidatesByTeamGG_Parms
{
	unsigned char                                      Team;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	class TArray< class ANavigationPoint* >            ReturnValue;                                      		// 0x0004 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x0010 ( 0x0004
//	class TArray< class ANavigationPoint* >            candidates;                                       		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wSBTGameInfo.GetRespawnCandidatesByTeam
// Flags: 
struct AwSBTGameInfo_execGetRespawnCandidatesByTeam_Parms
{
	unsigned char                                      Team;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      checkFail:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	class TArray< class ANavigationPoint* >            ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	int                                                lp1;                                              		// 0x0014 ( 0x0004
//	class TArray< class ANavigationPoint* >            candidates;                                       		// 0x0018 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wSBTGameInfo.IsAppropriateRespawnPoint
// Flags: 
struct AwSBTGameInfo_execIsAppropriateRespawnPoint_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      Team;                                             		// 0x0004 ( 0x0001[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerStart_SBT*                            S;                                                		// 0x000C ( 0x0004
};

// Function WMission.wSBTGameInfo.AnnounceSwitchTeam
// Flags: 
struct AwSBTGameInfo_execAnnounceSwitchTeam_Parms
{
};

// Function WMission.wSBTGameInfo.GetPlayerStartTeam
// Flags: 
struct AwSBTGameInfo_execGetPlayerStartTeam_Parms
{
	class ANavigationPoint*                            N;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Team;                                             		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSBTGameInfo.ForceObjectiveDefenderTeamIndex
// Flags: 
struct AwSBTGameInfo_execForceObjectiveDefenderTeamIndex_Parms
{
};

// Function WMission.wSBTGameInfo.OnRoundTimeOverWithoutObjectPlanted
// Flags: 
struct AwSBTGameInfo_execOnRoundTimeOverWithoutObjectPlanted_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class AController*                                 NextC;                                            		// 0x0004 ( 0x0004
};

// Function WMission.wSBTGameInfo.SetObjectiveSetted
// Flags: 
struct AwSBTGameInfo_execSetObjectiveSetted_Parms
{
	class APawn*                                       TP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FName                                       ObjectTag;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     FlagLocation;                                     		// 0x0008 ( 0x000C[ CPF_Parm ]
};

// Function WMission.wSBTGameInfo.PlayObjectiveSetVociceBGM
// Flags: 
struct AwSBTGameInfo_execPlayObjectiveSetVociceBGM_Parms
{
	class APawn*                                       TP;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSBTGameInfo.GotoDefusePhase
// Flags: 
struct AwSBTGameInfo_execGotoDefusePhase_Parms
{
	struct FName                                       ObjectTag;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwSBTSetObjective*                           Set;                                              		// 0x0004 ( 0x0004
	class AwSBTDiffuseObjective*                       dif;                                              		// 0x0008 ( 0x0004
};

// Function WMission.wSBTGameInfo.AnnounceBeginRound
// Flags: 
struct AwSBTGameInfo_execAnnounceBeginRound_Parms
{
};

// Function WMission.wSBTGameInfo.BeginRound
// Flags: 
struct AwSBTGameInfo_execBeginRound_Parms
{
	unsigned long                                      bNoReset:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
};

// Function WMission.wSBTGameInfo.Login
// Flags: [ FUNC_Event ]
struct AwSBTGameInfo_eventLogin_Parms
{
	struct FString                                     Portal;                                           		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Options;                                          		// 0x000C ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
	class APlayerController*                           ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerController*                           PC;                                               		// 0x0028 ( 0x0004
};

// Function WMission.wSBTGameInfo.StartHumanPlayers
// Flags: 
struct AwSBTGameInfo_execStartHumanPlayers_Parms
{
};

// Function WMission.wSBTGameInfo.CheckLastMan
// Flags: 
struct AwSBTGameInfo_execCheckLastMan_Parms
{
	int                                                TeamIndex;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wSBTGameInfo.EndGameByTeamNoneLeft
// Flags: 
struct AwSBTGameInfo_execEndGameByTeamNoneLeft_Parms
{
	class APlayerReplicationInfo*                      Living;                                           		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSBTGameInfo.AllowBecomeActivePlayer
// Flags: 
struct AwSBTGameInfo_execAllowBecomeActivePlayer_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSBTGameInfo.CalcRoundResultPoints
// Flags: 
struct AwSBTGameInfo_execCalcRoundResultPoints_Parms
{
	int                                                ScoringTeam;                                      		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AController*                                 C;                                                		// 0x0004 ( 0x0004
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0008 ( 0x0004
};

// Function WMission.wSBTGameInfo.CalcResultPoints
// Flags: 
struct AwSBTGameInfo_execCalcResultPoints_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0004 ( 0x0004
};

// Function WMission.wSBTGameInfo.PrecacheGameAnnouncements
// Flags: 
struct AwSBTGameInfo_execPrecacheGameAnnouncements_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wSBTGameInfo.IsNewPlayerGotoSpectating
// Flags: 
struct AwSBTGameInfo_execIsNewPlayerGotoSpectating_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wSBTGameInfo.InitializeGameInfo
// Flags: 
struct AwSBTGameInfo_execInitializeGameInfo_Parms
{
	unsigned long                                      bNoReset:1;                                       		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bChangeTeam:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wSBTGameInfo.InitGame
// Flags: [ FUNC_Event ]
struct AwSBTGameInfo_eventInitGame_Parms
{
	struct FString                                     Options;                                          		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     Error;                                            		// 0x000C ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_NeedCtorLink ]
};

// Function WMission.wBombObjective_Delivery.TellBotHowToDisable
// Flags: 
struct AwBombObjective_Delivery_execTellBotHowToDisable_Parms
{
	class ABot*                                        B;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wBombObjective_Delivery.ForceDisableObjective
// Flags: 
struct AwBombObjective_Delivery_execForceDisableObjective_Parms
{
	class APawn*                                       Instigator;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0004 ( 0x0004
	class AwGameObject_Bomb*                           Bomb;                                             		// 0x0008 ( 0x0004
	class AController*                                 Ctrl;                                             		// 0x000C ( 0x0004
};

// Function WMission.wBombObjective_Delivery.DisableObjective
// Flags: 
struct AwBombObjective_Delivery_execDisableObjective_Parms
{
	class APawn*                                       Instigator;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wBombObjective_Delivery.CompleteObjective
// Flags: 
struct AwBombObjective_Delivery_execCompleteObjective_Parms
{
	class APawn*                                       Instigator;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wBombObjective_Delivery.IsRelevant
// Flags: 
struct AwBombObjective_Delivery_execIsRelevant_Parms
{
	class APawn*                                       Instigator;                                       		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bAliveCheck:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class APlayerReplicationInfo*                      PRI;                                              		// 0x000C ( 0x0004
};

// Function WMission.wBombObjective_Delivery.PreBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwBombObjective_Delivery_eventPreBeginPlay_Parms
{
	class UwMatchMaker*                                rMM;                                              		// 0x0000 ( 0x0004
};

// Function WMission.wMSPlayerReplicationInfo.Reset
// Flags: 
struct AwMSPlayerReplicationInfo_execReset_Parms
{
};

// Function WMission.wMSPlayerReplicationInfo.CanBotTeleport
// Flags: 
struct AwMSPlayerReplicationInfo_execCanBotTeleport_Parms
{
	class AController*                                 C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AVehicle*                                    V;                                                		// 0x0008 ( 0x0004
};

// Function WMission.wMSPlayerReplicationInfo.Timer
// Flags: 
struct AwMSPlayerReplicationInfo_execTimer_Parms
{
};

// Function WMission.wMessage_MSKillMessages.ClientReceive
// Flags: [ FUNC_Simulated ]
struct AwMessage_MSKillMessages_execClientReceive_Parms
{
	class APlayerController*                           P;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                Switch;                                           		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x0010 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WMission.wMessage_MSKillMessages.GetString
// Flags: 
struct AwMessage_MSKillMessages_execGetString_Parms
{
	int                                                Switch;                                           		// 0x0000 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_1;                                     		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class APlayerReplicationInfo*                      RelatedPRI_2;                                     		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	class UObject*                                     OptionalObject;                                   		// 0x000C ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WMission.wHUD_Mission.DrawMissionIcon
// Flags: 
struct AwHUD_Mission_execDrawMissionIcon_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwPawn*                                      curPawn;                                          		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawIntroTitle
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawIntroTitle_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                FontIndex;                                        		// 0x0004 ( 0x0004
	struct FString                                     LevelTitle;                                       		// 0x0008 ( 0x000C[ CPF_NeedCtorLink ]
	float                                              XL;                                               		// 0x0014 ( 0x0004
	float                                              YL;                                               		// 0x0018 ( 0x0004
};

// Function WMission.wHUD_Mission.DrawCinematicHUD
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawCinematicHUD_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.UpdatePrecacheMaterials
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execUpdatePrecacheMaterials_Parms
{
};

// Function WMission.wHUD_Mission.UpdatePrecacheStaticMeshes
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execUpdatePrecacheStaticMeshes_Parms
{
};

// Function WMission.wHUD_Mission.GetInfoString
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execGetInfoString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     InfoString;                                       		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wHUD_Mission.CheckCountdown
// Flags: 
struct AwHUD_Mission_execCheckCountdown_Parms
{
	class AGameReplicationInfo*                        GRI;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                RemainingRoundTime;                               		// 0x0004 ( 0x0004
};

// Function WMission.wHUD_Mission.DrawPracticeRoundInfo
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawPracticeRoundInfo_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class FColor                                       myColor;                                          		// 0x0004 ( 0x0004
	float                                              Seconds;                                          		// 0x0008 ( 0x0004
};

// Function WMission.wHUD_Mission.TeamChanged
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwHUD_Mission_eventTeamChanged_Parms
{
};

// Function WMission.wHUD_Mission.Tick
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawTextWithBackground
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawTextWithBackground_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Text;                                             		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	class FColor                                       TextColor;                                        		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              XO;                                               		// 0x0014 ( 0x0004[ CPF_Parm ]
	float                                              YO;                                               		// 0x0018 ( 0x0004[ CPF_Parm ]
	float                                              XL;                                               		// 0x001C ( 0x0004
	float                                              YL;                                               		// 0x0020 ( 0x0004
	float                                              XL2;                                              		// 0x0024 ( 0x0004
	float                                              YL2;                                              		// 0x0028 ( 0x0004
};

// Function WMission.wHUD_Mission.GetScreenCorner
// Flags: 
struct AwHUD_Mission_execGetScreenCorner_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      A;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     CornerVect;                                       		// 0x0008 ( 0x000C[ CPF_Parm ]
	struct FVector                                     IPScrO;                                           		// 0x0014 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    CameraRotation;                                   		// 0x0020 ( 0x000C[ CPF_Parm ]
	float                                              ColExpand;                                        		// 0x002C ( 0x0004[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0030 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     IPDir;                                            		// 0x003C ( 0x000C
//	struct FVector                                     IPCorner;                                         		// 0x0048 ( 0x000C
//	struct FVector                                     IPScreenCorner;                                   		// 0x0054 ( 0x000C
};

// Function WMission.wHUD_Mission.Draw_2DCollisionBox
// Flags: 
struct AwHUD_Mission_execDraw_2DCollisionBox_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      A;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ScrPos;                                           		// 0x0008 ( 0x000C[ CPF_Parm ]
	struct FString                                     Description;                                      		// 0x0014 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	float                                              ColExpand;                                        		// 0x0020 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSizeOverride:1;                                  		// 0x0024 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wHUD_Mission.GetGYRColorRamp
// Flags: 
struct AwHUD_Mission_execGetGYRColorRamp_Parms
{
	float                                              Pct;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class FColor                                       GYRColor;                                         		// 0x0008 ( 0x0004
};

// Function WMission.wHUD_Mission.GetObjectiveColor
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execGetObjectiveColor_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned char                                      bProgressPulsing;                                 		// 0x0004 ( 0x0001[ CPF_OptionalParm | CPF_Parm | CPF_OutParm ]
	class FColor                                       ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class FColor                                       ObjColor;                                         		// 0x000C ( 0x0004
};

// Function WMission.wHUD_Mission.GetTeamColor
// Flags: 
struct AwHUD_Mission_execGetTeamColor_Parms
{
	unsigned char                                      Team;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.CustomHUDColorAllowed
// Flags: 
struct AwHUD_Mission_execCustomHUDColorAllowed_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.DrawCustomHealthInfo
// Flags: 
struct AwHUD_Mission_execDrawCustomHealthInfo_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bSkaarj:1;                                        		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawInfoPods
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawInfoPods_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AwInfoPod*                                   IP;                                               		// 0x0004 ( 0x0004
	struct FVector                                     IPScreenPos;                                      		// 0x0008 ( 0x000C
	struct FVector                                     camLoc;                                           		// 0x0014 ( 0x000C
	int                                                i;                                                		// 0x0020 ( 0x0004
	struct FRotator                                    camRot;                                           		// 0x0024 ( 0x000C
};

// Function WMission.wHUD_Mission.CanSpawnNotify
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execCanSpawnNotify_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.GetCurrentObjective
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execGetCurrentObjective_Parms
{
	class AGameObjective*                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class AGameObjective*                              Go;                                               		// 0x0004 ( 0x0004
//	int                                                i;                                                		// 0x0008 ( 0x0004
};

// Function WMission.wHUD_Mission.NotifyUpdatedObjective
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execNotifyUpdatedObjective_Parms
{
	class AGameObjective*                              OldObjective;                                     		// 0x0000 ( 0x0004
};

// Function WMission.wHUD_Mission.HighlightCurrentObjective
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execHighlightCurrentObjective_Parms
{
	unsigned long                                      bShowWayPoint:1;                                  		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wHUD_Mission.AnnouncementPlayed
// Flags: [ FUNC_Event ]
struct AwHUD_Mission_eventAnnouncementPlayed_Parms
{
	struct FString                                     AnnouncerSound;                                   		// 0x0000 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	unsigned char                                      Switch;                                           		// 0x000C ( 0x0001[ CPF_Parm ]
	int                                                i;                                                		// 0x0010 ( 0x0004
};

// Function WMission.wHUD_Mission.IsObjectiveVisible
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct AwHUD_Mission_execIsObjectiveVisible_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameObjective*                              Target;                                           		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ScreenPos;                                        		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm ]
	struct FVector                                     camLoc;                                           		// 0x0014 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    camRot;                                           		// 0x0020 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x002C ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     TargetLocation;                                   		// 0x0030 ( 0x000C
//	struct FVector                                     TargetDir;                                        		// 0x003C ( 0x000C
//	float                                              dist;                                             		// 0x0048 ( 0x0004
};

// Function WMission.wHUD_Mission.DrawHealthBar
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawHealthBar_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     HBScreenPos;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	float                                              Health;                                           		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              MaxHealth;                                        		// 0x0014 ( 0x0004[ CPF_Parm ]
	class FColor                                       ObjColor;                                         		// 0x0018 ( 0x0004[ CPF_Parm ]
	float                                              HealthPct;                                        		// 0x001C ( 0x0004
};

// Function WMission.wHUD_Mission.Release_ObjectivePointingArrow
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execRelease_ObjectivePointingArrow_Parms
{
};

// Function WMission.wHUD_Mission.Draw3dObjectiveArrow
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDraw3dObjectiveArrow_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AActor*                                      TrackedActor;                                     		// 0x0004 ( 0x0004
};

// Function WMission.wHUD_Mission.Release_BehindObjectiveArrows
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execRelease_BehindObjectiveArrows_Parms
{
	int                                                i;                                                		// 0x0000 ( 0x0004
};

// Function WMission.wHUD_Mission.Get_BehindObjectiveArrow
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execGet_BehindObjectiveArrow_Parms
{
	class UTexRotator*                                 ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	class UTexRotator*                                 Arrow;                                            		// 0x0004 ( 0x0004
};

// Function WMission.wHUD_Mission.DrawObjectiveIcon
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawObjectiveIcon_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bOptionalObjective:1;                             		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              PosX;                                             		// 0x0008 ( 0x0004[ CPF_Parm ]
	float                                              PosY;                                             		// 0x000C ( 0x0004[ CPF_Parm ]
	float                                              tileX;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              tileY;                                            		// 0x0014 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawObjectiveStatusOverlay
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawObjectiveStatusOverlay_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              Progress;                                         		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bCriticalFlash:1;                                 		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FVector                                     ScreenPos;                                        		// 0x000C ( 0x000C[ CPF_Parm ]
	float                                              Scale;                                            		// 0x0018 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawCriticalObjectiveOverlay
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawCriticalObjectiveOverlay_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     ScreenPos;                                        		// 0x0004 ( 0x000C[ CPF_Parm ]
	float                                              Scale;                                            		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawMiniMap
// Flags: 
struct AwHUD_Mission_execDrawMiniMap_Parms
{
	class AwHudPart_MinimapBase*                       Minimap;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UCanvas*                                     C;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawBigmap_HUD
// Flags: 
struct AwHUD_Mission_execDrawBigmap_HUD_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawMinimap_HUD
// Flags: 
struct AwHUD_Mission_execDrawMinimap_HUD_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.CheckAndDrawProgress
// Flags: 
struct AwHUD_Mission_execCheckAndDrawProgress_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	class UCanvas*                                     C;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawProgressMessage
// Flags: 
struct AwHUD_Mission_execDrawProgressMessage_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ProgressPct;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.GetGameObjectIndexByTag
// Flags: 
struct AwHUD_Mission_execGetGameObjectIndexByTag_Parms
{
	struct FName                                       Tag;                                              		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.GetGameObjectIndex
// Flags: 
struct AwHUD_Mission_execGetGameObjectIndex_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.DrawObjectives
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawObjectives_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.MultiplyColor
// Flags: 
struct AwHUD_Mission_execMultiplyColor_Parms
{
	class FColor                                       c1;                                               		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	class FColor                                       c2;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
	class FColor                                       ReturnValue;                                      		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              A;                                                		// 0x000C ( 0x0004
//	float                                              R;                                                		// 0x0010 ( 0x0004
//	float                                              G;                                                		// 0x0014 ( 0x0004
//	float                                              B;                                                		// 0x0018 ( 0x0004
};

// Function WMission.wHUD_Mission.IsOnEdgeOfScreen
// Flags: 
struct AwHUD_Mission_execIsOnEdgeOfScreen_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     pos;                                              		// 0x0004 ( 0x000C[ CPF_Parm ]
	float                                              W;                                                		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              H;                                                		// 0x0014 ( 0x0004[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0018 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	float                                              Margin;                                           		// 0x001C ( 0x0004
};

// Function WMission.wHUD_Mission.GetRadarDotPosition
// Flags: 
struct AwHUD_Mission_execGetRadarDotPosition_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     dist;                                             		// 0x0004 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ViewX;                                            		// 0x0010 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ViewY;                                            		// 0x001C ( 0x000C[ CPF_Parm ]
	float                                              OffsetScale;                                      		// 0x0028 ( 0x0004[ CPF_Parm ]
	float                                              OffsetY;                                          		// 0x002C ( 0x0004[ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0030 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     ScreenPosition;                                   		// 0x003C ( 0x000C
//	struct FVector                                     DotProjected;                                     		// 0x0048 ( 0x000C
};

// Function WMission.wHUD_Mission.GetRadarDotDist
// Flags: 
struct AwHUD_Mission_execGetRadarDotDist_Parms
{
	struct FVector                                     dist;                                             		// 0x0000 ( 0x000C[ CPF_Parm ]
	struct FVector                                     ViewX;                                            		// 0x000C ( 0x000C[ CPF_Parm ]
	struct FVector                                     ViewY;                                            		// 0x0018 ( 0x000C[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0024 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     DotProjected;                                     		// 0x0028 ( 0x000C
};

// Function WMission.wHUD_Mission.ApplySmartRangeDist
// Flags: 
struct AwHUD_Mission_execApplySmartRangeDist_Parms
{
	float                                              dist;                                             		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              ReturnValue;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.DrawRadarPassB
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawRadarPassB_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AVehicle*                                    P;                                                		// 0x0004 ( 0x0004
	float                                              dist;                                             		// 0x0008 ( 0x0004
	float                                              RadarWidth;                                       		// 0x000C ( 0x0004
	float                                              DotSize;                                          		// 0x0010 ( 0x0004
	float                                              OffsetY;                                          		// 0x0014 ( 0x0004
	struct FVector                                     Start;                                            		// 0x0018 ( 0x000C
	struct FVector                                     ViewX;                                            		// 0x0024 ( 0x000C
	struct FVector                                     ViewY;                                            		// 0x0030 ( 0x000C
	struct FVector                                     Z;                                                		// 0x003C ( 0x000C
	float                                              MaxSmartRange;                                    		// 0x0048 ( 0x0004
	float                                              OffsetScale;                                      		// 0x004C ( 0x0004
	int                                                i;                                                		// 0x0050 ( 0x0004
};

// Function WMission.wHUD_Mission.DrawRadarPassA
// Flags: 
struct AwHUD_Mission_execDrawRadarPassA_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawDebug
// Flags: 
struct AwHUD_Mission_execDrawDebug_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                X;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                Y;                                                		// 0x0008 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                dy;                                               		// 0x000C ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawSpectatingHud
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawSpectatingHud_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      renderAssaultHudLayer:1;                          		// 0x0004 ( 0x0004 [0x00000001]
};

// Function WMission.wHUD_Mission.ShowTeamScorePassC
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execShowTeamScorePassC_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.IsVSRelevant
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execIsVSRelevant_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.DrawTeamVS
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawTeamVS_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bIsBehindOtherTeam:1;                             		// 0x0004 ( 0x0004 [0x00000001]
	int                                                RelativeTime;                                     		// 0x0008 ( 0x0004
	int                                                Hours;                                            		// 0x000C ( 0x0004
	int                                                Minutes;                                          		// 0x0010 ( 0x0004
	int                                                Seconds;                                          		// 0x0014 ( 0x0004
	int                                                PlayerTeam;                                       		// 0x0018 ( 0x0004
	struct FString                                     output;                                           		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
	float                                              ScreenX;                                          		// 0x0028 ( 0x0004
	float                                              ScreenY;                                          		// 0x002C ( 0x0004
	float                                              TotalScaleX;                                      		// 0x0030 ( 0x0004
	float                                              TotalScaleY;                                      		// 0x0034 ( 0x0004
	float                                              TextureDX;                                        		// 0x0038 ( 0x0004
	float                                              TextureDY;                                        		// 0x003C ( 0x0004
	float                                              XL;                                               		// 0x0040 ( 0x0004
	float                                              YL;                                               		// 0x0044 ( 0x0004
	float                                              Progress;                                         		// 0x0048 ( 0x0004
};

// Function WMission.wHUD_Mission.ShowTeamScorePassA
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execShowTeamScorePassA_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              PosY;                                             		// 0x0004 ( 0x0004
};

// Function WMission.wHUD_Mission.UpdateHUD
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execUpdateHUD_Parms
{
};

// Function WMission.wHUD_Mission.updateScore
// Flags: 
struct AwHUD_Mission_execupdateScore_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 ( 0x0004
};

// Function WMission.wHUD_Mission.UpdateTimer
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execUpdateTimer_Parms
{
	int                                                TimeMinutes;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                TimeSeconds;                                      		// 0x0004 ( 0x0004[ CPF_Parm | CPF_OutParm ]
	int                                                RoundTime;                                        		// 0x0008 ( 0x0004
	int                                                Minutes;                                          		// 0x000C ( 0x0004
	int                                                Seconds;                                          		// 0x0010 ( 0x0004
};

// Function WMission.wHUD_Mission.UpdateTeamHud
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execUpdateTeamHud_Parms
{
	int                                                RoundTime;                                        		// 0x0000 ( 0x0004
	int                                                Minutes;                                          		// 0x0004 ( 0x0004
	int                                                Seconds;                                          		// 0x0008 ( 0x0004
	int                                                TeleportCount;                                    		// 0x000C ( 0x0004
};

// Function WMission.wHUD_Mission.ShouldShowObjectiveBoard
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execShouldShowObjectiveBoard_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
};

// Function WMission.wHUD_Mission.DrawAssaultHUDLayer
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawAssaultHUDLayer_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.CanvasDrawActors
// Flags: 
struct AwHUD_Mission_execCanvasDrawActors_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bClearedZBuffer:1;                                		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawHudPassC
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawHudPassC_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bOldShowWeaponInfo:1;                             		// 0x0004 ( 0x0004 [0x00000001]
	unsigned long                                      bOldShowPersonalInfo:1;                           		// 0x0008 ( 0x0004 [0x00000001]
	class UClass*                                      AmmoClass;                                        		// 0x000C ( 0x0004
};

// Function WMission.wHUD_Mission.DrawHudPassB
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawHudPassB_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawDebugTime
// Flags: 
struct AwHUD_Mission_execDrawDebugTime_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameReplicationInfo*                        GRI;                                              		// 0x0004 ( 0x0004
	int                                                Minutes;                                          		// 0x0008 ( 0x0004
	int                                                Hours;                                            		// 0x000C ( 0x0004
	int                                                Seconds;                                          		// 0x0010 ( 0x0004
	int                                                Minutes2;                                         		// 0x0014 ( 0x0004
	int                                                Hours2;                                           		// 0x0018 ( 0x0004
	int                                                Seconds2;                                         		// 0x001C ( 0x0004
};

// Function WMission.wHUD_Mission.DrawDebugMission
// Flags: 
struct AwHUD_Mission_execDrawDebugMission_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameReplicationInfo*                        GRI;                                              		// 0x0004 ( 0x0004
	int                                                Y;                                                		// 0x0008 ( 0x0004
	class AwMSGameInfo*                                msgame;                                           		// 0x000C ( 0x0004
	class AwGameObject_Bomb*                           goBomb;                                           		// 0x0010 ( 0x0004
	class AwSetObjective*                              Set;                                              		// 0x0014 ( 0x0004
	class AwDiffuseObjective*                          Diffuse;                                          		// 0x0018 ( 0x0004
};

// Function WMission.wHUD_Mission.CallEvent
// Flags: 
struct AwHUD_Mission_execCallEvent_Parms
{
	unsigned long                                      InvenCheck:1;                                     		// 0x0000 ( 0x0004 [0x00000001][ CPF_OptionalParm | CPF_Parm ]
	int                                                iReservation1;                                    		// 0x0004 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
	int                                                iReservation2;                                    		// 0x0008 ( 0x0004[ CPF_OptionalParm | CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawHudPassA
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawHudPassA_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                iElapsedTime;                                     		// 0x0004 ( 0x0004
};

// Function WMission.wHUD_Mission.Destroyed
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwHUD_Mission_eventDestroyed_Parms
{
};

// Function WMission.wHUD_Mission.UpdateOBJ
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execUpdateOBJ_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004
};

// Function WMission.wHUD_Mission.PostBeginPlay
// Flags: [ FUNC_Simulated | FUNC_Event ]
struct AwHUD_Mission_eventPostBeginPlay_Parms
{
	class AwInfoPod*                                   IP;                                               		// 0x0000 ( 0x0004
	class AwTrigger_MSMessageTrigger*                  mT;                                               		// 0x0004 ( 0x0004
};

// Function WMission.wHUD_Mission.PrecacheFonts
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execPrecacheFonts_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.ShowObjectiveBoard
// Flags: [ FUNC_Exec ]
struct AwHUD_Mission_execShowObjectiveBoard_Parms
{
};

// Function WMission.wHUD_Mission.DrawAdrenaline
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawAdrenaline_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wHUD_Mission.DrawTimer
// Flags: [ FUNC_Simulated ]
struct AwHUD_Mission_execDrawTimer_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wScoreBoard_Mission.DrawTeam
// Flags: 
struct AwScoreBoard_Mission_execDrawTeam_Parms
{
	int                                                TeamNum;                                          		// 0x0000 ( 0x0004[ CPF_Parm ]
	int                                                PlayerCount;                                      		// 0x0004 ( 0x0004[ CPF_Parm ]
	int                                                OwnerOffset;                                      		// 0x0008 ( 0x0004[ CPF_Parm ]
	class UCanvas*                                     Canvas;                                           		// 0x000C ( 0x0004[ CPF_Parm ]
	int                                                FontReduction;                                    		// 0x0010 ( 0x0004[ CPF_Parm ]
	int                                                BoxSpaceY;                                        		// 0x0014 ( 0x0004[ CPF_Parm ]
	int                                                PlayerBoxSizeY;                                   		// 0x0018 ( 0x0004[ CPF_Parm ]
	int                                                HeaderOffsetY;                                    		// 0x001C ( 0x0004[ CPF_Parm ]
	int                                                i;                                                		// 0x0020 ( 0x0004
	int                                                OwnerPos;                                         		// 0x0024 ( 0x0004
	int                                                NetXPos;                                          		// 0x0028 ( 0x0004
	int                                                NameXPos;                                         		// 0x002C ( 0x0004
	int                                                BoxTextOffsetY;                                   		// 0x0030 ( 0x0004
	int                                                ScoreXPos;                                        		// 0x0034 ( 0x0004
	int                                                ScoreYPos;                                        		// 0x0038 ( 0x0004
	int                                                BoxXPos;                                          		// 0x003C ( 0x0004
	int                                                BoxWidth;                                         		// 0x0040 ( 0x0004
	int                                                LineCount;                                        		// 0x0044 ( 0x0004
	int                                                NameY;                                            		// 0x0048 ( 0x0004
	float                                              XL;                                               		// 0x004C ( 0x0004
	float                                              YL;                                               		// 0x0050 ( 0x0004
	float                                              IconScale;                                        		// 0x0054 ( 0x0004
	float                                              ScoreBackScale;                                   		// 0x0058 ( 0x0004
	float                                              ScoreYL;                                          		// 0x005C ( 0x0004
	float                                              MaxNamePos;                                       		// 0x0060 ( 0x0004
	float                                              LongestNameLength;                                		// 0x0064 ( 0x0004
	float                                              oXL;                                              		// 0x0068 ( 0x0004
	float                                              oYL;                                              		// 0x006C ( 0x0004
	float                                              TX;                                               		// 0x0070 ( 0x0004
	float                                              ty;                                               		// 0x0074 ( 0x0004
	struct FString                                     PlayerName[ 0x20 ];                               		// 0x0078 ( 0x0180[ CPF_NeedCtorLink ]
	struct FString                                     OrdersText;                                       		// 0x01F8 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     LongestName;                                      		// 0x0204 ( 0x000C[ CPF_NeedCtorLink ]
	struct FString                                     temp;                                             		// 0x0210 ( 0x000C[ CPF_NeedCtorLink ]
	class UFont*                                       MainFont;                                         		// 0x021C ( 0x0004
	class UFont*                                       ReducedFont;                                      		// 0x0220 ( 0x0004
	unsigned long                                      bHaveHalfFont:1;                                  		// 0x0224 ( 0x0004 [0x00000001]
	unsigned long                                      bNameFontReduction:1;                             		// 0x0228 ( 0x0004 [0x00000001]
	int                                                SymbolUSize;                                      		// 0x022C ( 0x0004
	int                                                SymbolVSize;                                      		// 0x0230 ( 0x0004
	int                                                OtherTeam;                                        		// 0x0234 ( 0x0004
	int                                                LastLine;                                         		// 0x0238 ( 0x0004
	class UFont*                                       BackupFont;                                       		// 0x023C ( 0x0004
	float                                              TrophiesXOffset;                                  		// 0x0240 ( 0x0004
};

// Function WMission.wScoreBoard_Mission.GetDefaultScoreInfoString
// Flags: 
struct AwScoreBoard_Mission_execGetDefaultScoreInfoString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     AssaultInfoString;                                		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	int                                                RemainingRoundTimeVal;                            		// 0x0018 ( 0x0004
//	class AwMSGameReplicationInfo*                     ASGRI;                                            		// 0x001C ( 0x0004
};

// Function WMission.wScoreBoard_Mission.GetRestartString
// Flags: 
struct AwScoreBoard_Mission_execGetRestartString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     RestartString;                                    		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	class AwMSGameReplicationInfo*                     ASGRI;                                            		// 0x0018 ( 0x0004
};

// Function WMission.wScoreBoard_Mission.GetTitleString
// Flags: 
struct AwScoreBoard_Mission_execGetTitleString_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	struct FString                                     InfoString;                                       		// 0x000C ( 0x000C[ CPF_NeedCtorLink ]
//	unsigned char                                      ownerTeam;                                        		// 0x0018 ( 0x0001
//	class AwMSGameReplicationInfo*                     ASGRI;                                            		// 0x001C ( 0x0004
};

// Function WMission.wInfoPod.DrawInfoPod_Texture
// Flags: [ FUNC_Simulated ]
struct AwInfoPod_execDrawInfoPod_Texture_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     IPScrO;                                           		// 0x0004 ( 0x000C[ CPF_Parm ]
	float                                              W;                                                		// 0x0010 ( 0x0004
	float                                              H;                                                		// 0x0014 ( 0x0004
};

// Function WMission.wInfoPod.DrawInfoPod_TextBrackets
// Flags: [ FUNC_Simulated ]
struct AwInfoPod_execDrawInfoPod_TextBrackets_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     IPScrO;                                           		// 0x0004 ( 0x000C[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0010 ( 0x0004[ CPF_Parm ]
	struct FString                                     Description;                                      		// 0x0014 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wInfoPod.DrawInfoPod_PlainText
// Flags: [ FUNC_Simulated ]
struct AwInfoPod_execDrawInfoPod_PlainText_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     IPScreenPos;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0010 ( 0x0004[ CPF_Parm ]
	float                                              XL;                                               		// 0x0014 ( 0x0004
	float                                              YL;                                               		// 0x0018 ( 0x0004
	struct FString                                     FinalString;                                      		// 0x001C ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wInfoPod.Render
// Flags: [ FUNC_Simulated ]
struct AwInfoPod_execRender_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     IPScreenPos;                                      		// 0x0004 ( 0x000C[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0010 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wInfoPod.IsInfoPodVisible
// Flags: [ FUNC_Final | FUNC_Simulated ]
struct AwInfoPod_execIsInfoPodVisible_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       P;                                                		// 0x0004 ( 0x0004[ CPF_Parm ]
	struct FVector                                     camLoc;                                           		// 0x0008 ( 0x000C[ CPF_Parm ]
	struct FRotator                                    camRot;                                           		// 0x0014 ( 0x000C[ CPF_Parm ]
	unsigned long                                      ReturnValue:1;                                    		// 0x0020 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	struct FVector                                     TargetLocation;                                   		// 0x0024 ( 0x000C
//	struct FVector                                     TargetDir;                                        		// 0x0030 ( 0x000C
//	float                                              dist;                                             		// 0x003C ( 0x0004
};

// Function WMission.wInfoPod.Reset
// Flags: 
struct AwInfoPod_execReset_Parms
{
};

// Function WMission.wInfoPod.Trigger
// Flags: [ FUNC_Event ]
struct AwInfoPod_eventTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wInfoPod.PostBeginPlay
// Flags: [ FUNC_Event ]
struct AwInfoPod_eventPostBeginPlay_Parms
{
};

// Function WMission.wTrigger_MSMessageTrigger.PrecacheAnnouncer
// Flags: [ FUNC_Simulated ]
struct AwTrigger_MSMessageTrigger_execPrecacheAnnouncer_Parms
{
	class AAnnouncerVoice*                             V;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bRewardSounds:1;                                  		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wTrigger_MSMessageTrigger.GetTeamNum
// Flags: 
struct AwTrigger_MSMessageTrigger_execGetTeamNum_Parms
{
	unsigned char                                      ReturnValue;                                      		// 0x0000 ( 0x0001[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	unsigned char                                      DefendingTeam;                                    		// 0x0001 ( 0x0001
};

// Function WMission.wTrigger_MSMessageTrigger.Trigger
// Flags: [ FUNC_Event ]
struct AwTrigger_MSMessageTrigger_eventTrigger_Parms
{
	class AActor*                                      Other;                                            		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APawn*                                       EventInstigator;                                  		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned char                                      RealTeam;                                         		// 0x0008 ( 0x0001
};

// Function WMission.wObjectivePointingArrow.Render
// Flags: [ FUNC_Simulated ]
struct AwObjectivePointingArrow_execRender_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class APlayerController*                           PC;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
	class AActor*                                      TrackedActor;                                     		// 0x0008 ( 0x0004[ CPF_Parm ]
	struct FRotator                                    ArrowRot;                                         		// 0x000C ( 0x000C
	struct FRotator                                    camRot;                                           		// 0x0018 ( 0x000C
	struct FVector                                     ArrowLoc;                                         		// 0x0024 ( 0x000C
	struct FVector                                     camLoc;                                           		// 0x0030 ( 0x000C
	struct FVector                                     X;                                                		// 0x003C ( 0x000C
	struct FVector                                     Y;                                                		// 0x0048 ( 0x000C
	struct FVector                                     Z;                                                		// 0x0054 ( 0x000C
	class AActor*                                      A;                                                		// 0x0060 ( 0x0004
	float                                              ScreenRatio;                                      		// 0x0064 ( 0x0004
};

// Function WMission.wObjectivePointingArrow.SetYellowColor
// Flags: [ FUNC_Simulated ]
struct AwObjectivePointingArrow_execSetYellowColor_Parms
{
	unsigned long                                      bPulse:1;                                         		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wObjectivePointingArrow.SetTeamSkin
// Flags: [ FUNC_Simulated ]
struct AwObjectivePointingArrow_execSetTeamSkin_Parms
{
	unsigned char                                      Team;                                             		// 0x0000 ( 0x0001[ CPF_Parm ]
	unsigned long                                      bPulse:1;                                         		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
};

// Function WMission.wObjectiveProgressDisplay.GetObjectiveDescription
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execGetObjectiveDescription_Parms
{
	class AGameObjective*                              Go;                                               		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bDefender:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FString                                     ReturnValue;                                      		// 0x0008 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
};

// Function WMission.wObjectiveProgressDisplay.SetObjectiveColor
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execSetObjectiveColor_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	class AGameObjective*                              Go;                                               		// 0x0004 ( 0x0004[ CPF_Parm ]
	class FColor                                       ObjColor;                                         		// 0x0008 ( 0x0004
};

// Function WMission.wObjectiveProgressDisplay.AnyOptionalObjectiveCritical
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execAnyOptionalObjectiveCritical_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wObjectiveProgressDisplay.AnyPrimaryObjectivesCritical
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execAnyPrimaryObjectivesCritical_Parms
{
	unsigned long                                      ReturnValue:1;                                    		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
};

// Function WMission.wObjectiveProgressDisplay.GetGlobalObjectiveProgress
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execGetGlobalObjectiveProgress_Parms
{
	float                                              ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	int                                                Count;                                            		// 0x0008 ( 0x0004
//	float                                              GlobalProgress;                                   		// 0x000C ( 0x0004
};

// Function WMission.wObjectiveProgressDisplay.GetPrimaryObjectiveCount
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execGetPrimaryObjectiveCount_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 ( 0x0004[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0004 ( 0x0004
//	int                                                Count;                                            		// 0x0008 ( 0x0004
};

// Function WMission.wObjectiveProgressDisplay.DrawBigCurrentObjective
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execDrawBigCurrentObjective_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bDefender:1;                                      		// 0x0004 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bCheckOverlap:1;                                  		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              XL;                                               		// 0x000C ( 0x0004
	float                                              YL;                                               		// 0x0010 ( 0x0004
	float                                              XL2;                                              		// 0x0014 ( 0x0004
	float                                              YL2;                                              		// 0x0018 ( 0x0004
	float                                              XO;                                               		// 0x001C ( 0x0004
	float                                              YO;                                               		// 0x0020 ( 0x0004
	struct FString                                     CurrentObjectiveString;                           		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
	struct FVector                                     ScreenPos;                                        		// 0x0030 ( 0x000C
	int                                                PrimaryObjectiveCount;                            		// 0x003C ( 0x0004
};

// Function WMission.wObjectiveProgressDisplay.CheckEntry
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execCheckEntry_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FString                                     Entry;                                            		// 0x0004 ( 0x000C[ CPF_Parm | CPF_NeedCtorLink ]
	struct FString                                     ReturnValue;                                      		// 0x0010 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink ]
//	float                                              XL;                                               		// 0x001C ( 0x0004
//	float                                              YL;                                               		// 0x0020 ( 0x0004
//	struct FString                                     Left;                                             		// 0x0024 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     Right;                                            		// 0x0030 ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     newentry;                                         		// 0x003C ( 0x000C[ CPF_NeedCtorLink ]
//	struct FString                                     previousentry;                                    		// 0x0048 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wObjectiveProgressDisplay.DrawObjectives
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execDrawObjectives_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	struct FVector                                     BoxPivot;                                         		// 0x0004 ( 0x000C[ CPF_Parm ]
	unsigned long                                      bDefender:1;                                      		// 0x0010 ( 0x0004 [0x00000001][ CPF_Parm ]
	unsigned long                                      bGetBoxSize:1;                                    		// 0x0014 ( 0x0004 [0x00000001][ CPF_Parm ]
	struct FVector                                     ReturnValue;                                      		// 0x0018 ( 0x000C[ CPF_Parm | CPF_OutParm | CPF_ReturnParm ]
//	int                                                i;                                                		// 0x0024 ( 0x0004
//	int                                                Priority;                                         		// 0x0028 ( 0x0004
//	int                                                startpriority;                                    		// 0x002C ( 0x0004
//	int                                                endpriority;                                      		// 0x0030 ( 0x0004
//	unsigned long                                      bDrawObjectiveNumber:1;                           		// 0x0034 ( 0x0004 [0x00000001]
//	float                                              XL;                                               		// 0x0038 ( 0x0004
//	float                                              YL;                                               		// 0x003C ( 0x0004
//	float                                              XUnit;                                            		// 0x0040 ( 0x0004
//	float                                              YOffset;                                          		// 0x0044 ( 0x0004
//	struct FVector                                     ScreenPos;                                        		// 0x0048 ( 0x000C
//	struct FVector                                     newBoxSize;                                       		// 0x0054 ( 0x000C
//	struct FString                                     Entry;                                            		// 0x0060 ( 0x000C[ CPF_NeedCtorLink ]
};

// Function WMission.wObjectiveProgressDisplay.PostRender
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execPostRender_Parms
{
	class UCanvas*                                     C;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
	float                                              DeltaTime;                                        		// 0x0004 ( 0x0004[ CPF_Parm ]
	unsigned long                                      bDefender:1;                                      		// 0x0008 ( 0x0004 [0x00000001][ CPF_Parm ]
	float                                              HeaderHeight;                                     		// 0x000C ( 0x0004
	float                                              XL;                                               		// 0x0010 ( 0x0004
	float                                              YL;                                               		// 0x0014 ( 0x0004
};

// Function WMission.wObjectiveProgressDisplay.Initialize
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execInitialize_Parms
{
	class AwHUD_Mission*                               H;                                                		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wObjectiveProgressDisplay.UpdateSlideScale
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execUpdateSlideScale_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 ( 0x0004[ CPF_Parm ]
};

// Function WMission.wObjectiveProgressDisplay.ShowStatus
// Flags: [ FUNC_Simulated ]
struct AwObjectiveProgressDisplay_execShowStatus_Parms
{
	unsigned long                                      bShow:1;                                          		// 0x0000 ( 0x0004 [0x00000001][ CPF_Parm ]
};

#ifdef _MSC_VER
#pragma pack ( pop )
#endif

